кі удари підкопали його
добробут, нужда зломила його свобідну, здорову вдачу, і нині тільки
неясні, давні спомини нагадують правнукам щасливіше життя предків. І
коли часом стара бабуся, сидячи в запічку та прядучи грубу вовну,
почне розповідати дрібним унукам про давню давнину, про напади
монголів-песиголовців і про тухольського ватажка Беркута,- діти
слухають тривожно, в їх сивих оченятах блискотять сльози. А коли
скінчиться дивовижна повість, то малі й старі, зітхаючи, шепчуть: «Ах,
яка ж то красна байка!»

- Так, так,говорить бабуся, похитуючи головою,так, так, дітоньки! Для
- нас то байка, а колись то правда була!

- А не знати, чи вернуться ще коли такі часи,закидає дехто старший.

- Говорять старі люди, що ще колись вернуться, але, мабуть, аж перед
- кінцем світу.

Сумно і непривітно тепер в вашій Тухольщині! Казкою видається повість
про давні часи і давніх людей. Вірити не хотяіь нинішні люди, що
виросли в нужді й притиску, в тисячолітніх путах і залежностях. Але
нехай собі! Думка поета летить у ті давні часи, оживляє давніх людей,
а в кого серце чисте і щиро- людське чуття, той і в них побачить своїх
братів, живих людей, а в життю їх, хоч і як неподібнім до нашого,
догляне не одно таке, що може бути пожадане і для наших «культурних»
часів.

Було се 1241 року. Весна стояла в тухольських горах.

Одної прегарної днини лунали лісисті пригірки Зеле-меня голосами
стрілецьких рогів і криками численних стрільців.

Се новий тухольський боярин, Тугар Вовк, справляв великі лови на грубу
звірину. Він святкував почин свого нового життя,- бо недавно князь
Данило дарував йому в Тухольщині величезні полонини і ціле одно
пригір'я Зе-леменя; недавно він появився в тих горах і побудував собі
гарну хату, і оце першу учту справляє, знайомиться з довколичними
боярами. По учті рушили на лови в ту- хольські ліси.

Лови на грубого звіра - то не забавка, то боротьба тяжка, не раз
кровава, не раз на життя і смерть. Тури, медведі дики - се небезпечні
противники; стрілами з луків рідко кому удасться повалити такого
звіра; навіть рогатиною, яку кидалось на противника при відповіднім
приближенню, нелегко дати йому раду. Тож остатньою і рішучою зброєю
було важке копіє, яким треба було влу чити противника зблизька.
власноручно, з цілою силою, відразу. Схиблений удар - і життю борця
грозила велика небезпека, коли йому не вдалось в остатній хвилі
сховатись у безпечну криївку і добути меча або тяжкого топора для
своєї оборони.

Не диво, отже, що Тугар зі своїми гістьми вибирався на лови, мов на
війну, з запасом стріл і рогатин, зі слугами й запасами живності,
навіть з досвідним знахарем, що вмів замовляти рани. Не диво також, що
Тугар і його гості були в повній рицарській зброї, окрім панцирів, бо
ті спиняли би їх у ході по ломах та гущавинах. Те тільки диво, що й
Тугарова донька Мирослава, не поки-даючись батька, посміла також
вирушити разом з гістьми на лови. Тухольські громадяни, видячи її, як
їхала на лови посеред гостей, гордо, сміло, мов стрімка тополя серед
коренастих дубів, з уподобою поводили за нею очима, поговорюючи:

- От дівчина! Тій не жаль би бути мужем. І, певно, ліпший з неї би був
- муж, ніж її батько!

А се, певно, була немала похвала, бо Тугар Вовк був мужчина, як дуб.

Плечистий, підсадкуватий, з грубими обрисами лиця і грубим чорним
волоссям, він і сам по-добав на одного з тих злющих тухольських
медведів, яких їхав воювати. Але ж бо й донька його Мирослава була
дівчина, якої пошукати. Не кажемо вже про її уроду й красу, ані про її
добре серце - в тім згляді багато її ровесниць могло стати з нею
нарівні, хоч і небагато могло перевищити її. Але в чім не мала вона
пари між своїми ровесницями, так се в природній свободі свого
поводження, в незвичайній силі мускулів, у смілості й рішучості,
властивій тільки мужчинам, що виросли в ненастанній боротьбі з
супротивними обставинами. Зараз з першого разу видно було, що
Мирослава виросла на свободі, що виховання її було мужеське і що в тім
прегарно розвиненім дівочім тілі живе сильний, великими здібностями
обдарований дух. Вона була в батька одиначка, а до того, ще зараз при
народженню втратила матір. Нянька її, стара мужичка, відмалку
направляла її до всякої ручної роботи, а коли підросла, то батько, щоб
розважити свою самоту, брав її всюди з собою і, щоб задовольнити її
палку натуру, привчив її владати рицарського зброєю, зносити всякі
невигоди і сміло стояти в небезпеках. І чим більші труднос�