ирослава ніколи не переставала бути жен-щиною: ніжною, доброю,
з живим чуттям і скромним, стидливим лицем, а все те лучилось в ній у
таку дивну, чаруючу гармонію, що хто раз бачив її, чув її мову,- той
довіку не міг забути її лиця, її ходу, її голосу,- тому вони
пригадувалися живо і виразно в найкращих хвилях його життя, так, як
весна навіть старому старцеві пригадує його молоду любов.

Вже третій день тривали лови. Багато оленів-рогачів і чорногривих
турів лягло головами від стріл і ратищ боярських. Над шумним гірським
потоком, на зеленій поляні серед лісу стояли шатра ловців, курілися
раз у раз величезні огнища, де висіли на гаках кітли, оберталися
рожна, де варилось і пеклось м'ясиво вбитої дичини для гостей.
Нинішній, остатній, день ловів мав бути посвячений самому головному,
та заразом і найбільше небезпечному ділу - ловам на медведів.

На стрімкім пригірку, відділенім від інших страшними дебрями, порослім
густо величезними буками та смереками, покритім ломами й обвалищами
дерев, було віддавна головне леговище медведів. Тут, як твердив
тухольський провідник, молодий гірняк Максим Беркут, гніздилася
медведяча матка. Відси дикі звірі розносили пострах на цілу околицю і
на всі полонини. І хоч не раз удавалось смілим вівчарям забити одного
або другого стрілами та топорами або завабити під сліп, де йому ламала
крижі важка колода, спадаючи вниз,- то все-таки число їх було надто
велике, щоб із того була значна полегша для околиці. То й не дивно, що
коли новоприбулий боярин Тугар Вовк оповістив тухольцям, що хотів би
зробити великі лови на медведів і просить дати йому провідника, вони
не тільки дали йому на провідника першого удальця на всю

Тухольську верховину Максима Беркута, сина тухольського бесідника
Захара, але, крім того, вирядили з власної волі цілий відділ пасем-ців
з луками й ратищами для помочі зібраним боярам. Ціла та громада мала
обступити медведяче леговище і очистити його доразу від поганого
звіра.

Від самого досвіта в ловецькім таборі великий рух і тривожне
дожидання.

Боярські слуги від півночі звивалися, приготовляючи для гостей їду на
цілий день, наповнюючи шипучим медом і яблучником "подорожні баклаги.

Тухольські пасемці й собі готовились, острячи ножі та тесаки, обуваючи
міцні жуброві постоли і складаючи в невеличкі дорожні бесаги печене
м'ясо, паляниці, сир і все, що могло понадобитися в цілоденній трудній
переправі.

Максим Беркут, який аж нині, супроти найважнішого і найтяжчого діла,
почув себе вповні самим собою, вповні начальником сеї невеличкої
армії, зарядясував з правдиво начальницькою вважливістю й повагою все,
що належало до діла, нічого не забуваючи, ні з чим не кваплячись, але
й ні з чим не опізню-ючись. Все у нього виходило в свій час і на своїм
місці, без сумішки й сутолоки; всюди він був, де його потрібно, всюди
вмів зробити лад і порядок. Чи то між своїми товаришами-тухольцями, чи
між боярами, чи між слугами, Максим Беркут усюди був однаковий -
спокійний, свобідний в рухах

і словах, мов рівний серед рівних. Товариші поводились з ним так само,
як він з ними, сво-бідно, несилувано, сміялись і жартували з ним, а
проте виповнювали його розкази точно, швидко і так весело та радо,
немов і самі без розказу були би в тій хвилі зробили те саме. Боярська
служба, хоч далеко не такої рівної вдачі, далеко не так свобідна в
поводженню, далеко похіпніша з одних гордо висміватися, а перед
другими низенько хилитися, все ж таки поважала Максима Беркута за його
звичайність і розсудливість і, хоч не без до-тинків та жартів, таки
робила те, що він казав. А й самі бояри, по більшій часті люди горді,
воєнні, що нерадо бачили «смерда» в своїм товаристві, та й то ще
смерда, що вважав їх чимось немов собі рівним,- і вони тепер не
показували надто виразно своєї неохоти і виповнювали розпорядження
молодого провідника, маючи на кож-дім кроці нагоду переконатися, що ті
розпорядження були зовсім розумні, такі, як треба.

Ще сонечко не зараз мало сходити, а вже ловецьке товариство вирушило з
табору. Глибока тиша стояла над горами; нічні сумерки дрімали під
темно- зеленими коронами смерек; на густім, чепіргатім листю папороті
висіли краплі роси; повзучі зелені поясники вилися попід ноги,
плуталися поміж корінням величезних вивертів, спліталися в непрохідні
клебуки з корчами гнучкої, колючої ожини та з сплетами дикого пнучого
хмелю. З пропадистих, чорних, мов горла безодні, дебрів піднімалася
сивими туманами пара - знак, що на дні тих дебрів плили невеличкі
лісові потоки. Повітря в лісі напоєне було тою парою й запахом живиці;
воно захоплювало дух, немовбито ширших грудей треба було, щоб дихати
ним свобідно.

Мовчки пробиралася ловецька дружина непрохідними нетрями, дебрями й
ломами без стежки, без ніяких провідних знаків у тьмавій гущавині.
Попереду йшов Максим Беркут, а за ним Тугар Вовк і інші бояри. Обік
Ту-гара йшла його донька Мирослава. Позаду йшли тухоль-ські пасемці.
Всі йшли озираючись і надслухували пильно.

Ліс починав оживати денним життям. Пестропера сойка хрипіла в вершках
смерек, зелена жовна, причепив-шися до пня тут же над головами
прохожих, довбала своїм залізним дзьобом кору; в далеких зворах чути
було рик турів і виття вовків. Медведі в ту пору, наївши-ся, дрімали
під ломами на моховій постелі. Стадо диків рохкало десь у дебрі,
холодячися в студенім намулі.

Може, годину йшло товариство тою трудною, нетоптаною дорогою. Всі
дихали важко, ледве можучи наловити грудьми повітря, всі отирали
краплистий піт із лиць. Максим частенько озирався позад себе. Він
зразу противний був тому, щоб і женщина йшла разом з мужами в той
небезпечний похід, але Мирослава уперлася. Вона ж перший раз була на
таких великих ловах і мала би для бог зна яких трудностей занехати
найкращу їх частину!

Ніякі Максимові докази про трудності дороги, про небезпеки на
становищі, про силу й лютість звіра не могли переконати її. «Тим
ліпше! Тим ліпше!» - говорила вона з таким смілим поглядом, з таким
солодким усміхом, що

Максим, мов очарований, не міг нічого більше сказати. І батько, що
зразу також радив Мирославі лишитися в таборі, вкінці мусив уступити
її просьбам.

З подивом глядів тепер Максим, як ота незвичайна женщина поровень з
найсильнішими мужами поборювала всякі трудності утяжливої дороги, як
легко перескакувала гнилі ломи і величезні грами, яким певним кроком
ішла понад урвища, горі стрімкими дебрями, просковзу-вала поміж
виверти, і при тім так безпечно, так невтоми-мо, що Максимові
здавалося, що вона хіба на яких чудових крилах уноситься. Він глядів
на се й не міг нагля-дітися.

«Дивна дівчина! - думалось йому раз по разу.- Такої я ще й не видав
«ніколи!»

Ось уже прийшли на місце. Медведяче леговище - то був високий, тільки
від південного боку з трудом доступний горб, покритий грубезними
буками й смереками, завалений вивертами й ломами. Від півночі, заходу
і сходу вхід 1 вихід замикали високі скалисті стіни, немов величезною
сокирою вирубані з тіла велетня Зелеменя і відсунені від нього на
кільканадцять сажнів; сподом попід ті стіни вузькою щілиною шумів і
пінився студе-ний гірський потік.

Таке положення улегшувало нашим ловцям роботу; вони потребували тільки
обсадити не надто широкий плай від південного боку і тим плаєм
доступати чимраз далі догори, а звір, не маючи іншого виходу, мусив
конечно попастися в їх руки і на їх ратища.

Опинившися на тім важнім, хоч дуже небезпечнім плаю, Максим Беркут
велів товариству на хвилю розло-житися і спочити, аби набрати сил до
трудного діла. Сонце сходило, але гілля смерек і сусідні горби
заслоню-вали його вид.

По короткім віддиху Максим почав розставляти ловців у два ряди так,
аби вповні обсадити плай. Доки плай ще вузький, кождому ловцеві
прийдеться стояти о п'ять кроків від другого; але дальше вгорі, де
плай розширяється в цілу споховасту площину, там прийдеться ловцям
ширше розступитися. Одно тільки клопотало його: що зробити з
Мирославом, яка конче хотіла й собі стояти на окремім становищі, а не
при боці свого батька.

- А що ж то я гірша отсих твоїх пасемців? говорила вона, рум'яніючись,
- мов рожа, до Максима.їх ти ставиш на становищі, а мене не хочеш… Ні,
- сього не буде! І для мого батька се був би стид, коли б нас двоз
- стояло на однім становищі! Правда, батеньку?

Тугар Вовк не міг їй супротивитися. Максим почав говорити їй про
небезпеку, про силу й лютість розжертого звіра, але вона зацитькала
його:

- А що ж то в мене нема сили? А що ж то я не владаю луком, ратищем і
- топором? Ану, нехай котрий-будь із твоїх ласемців спробує зо мною
- порівнятися,побачимо, хто дужчий!

Максим вкінці замовк і мусив учинити її волю. Та й чи міг спротивитися
тій дивній, чарівній дівчині? Він хотів хоч становище визначити їй
найменше небезпечне, але, на лихо, сього не можна було зробити, бо тут
усі становища були однаково небезпечні. Розстановивши ціле товариство,
Максим дав ось який розпорядок:

- Тепер помолімся, кому хто знає, а потім разом заграймо в роги. Се
- буде перший знак і сполошить звіра. Потім підемо горі плаєм і
- станемо аж там, де він розширюється. Там мої товариші лишаться
- пильнувати виходу, щоб ані один звір не уйшов, а ви, бояри, підете
- дальше, до самого матчиного леговища!

В добру хвилю по тім залунали ліси й полонини хрипливим ревом жубрових
рогів. Немов величезна хвиля, покотився голос по лісах і зворах,
розбиваючися, глухнучи, то знов подвоюючись. Пробуркалися ліси.

Заскиглила каня над верховіттям смереки; зляканий беркут, широко
розмахуючи крилами, піднявся на воздухи; захрустів звір поміж ломами,
шукаючи безпечної криївки. Нараз рик рогів утих і ловці пустилися в
дорогу горі плаєм. Усіх серця билися живіше ожиданням незвісних
небезпек, бою і побіди. Обережно пробирались вони рядами; передом ряд
боярський, за ним парубоцький ряд;

Максим ішов попереду, пильно надслухаючи та слідячи звірину. Цар
ломів, медвідь, ще не показувався.

Дійшли вже до самого найвужчого гирла, поза яким плай розширювався в
велику споховасту площину. Ловці знов тут зупинилися на розказ
Максима, і знов загриміли ще з більшою силою жуброві роги, розносячи
тривогу в сумрачні медведячі гаври. Раптом затріщав лім недалеко, за
величезною купою грубих перегнилих вивертів.

- Бачність! скрикнув Максим.Звір наближається!

Ледве сказав ті слова, коли втім крізь велику щілину між двома
переверненими пнями просунулася пелехата, величезна голова, і двоє
сірих очей напівпікаво, напів-тривожно вдивлялися в Тугара Вовка, що
стояв на своїм становищі, якраз о яких десять кроків перед щілиною.
Тугар був старий вояк і старий ловець,- він не знав, що то тривога.
Тож, не говорячи ані слова, не відзиваючись ні до ксго, він вихопив
важку залізну стрілу з сагайдака, положив на лук і намірявся до звіра.

- Міряй в око, боярине! шепнув з-позаду Максим. Хвилька тривожної
- мовчанки свиснула стріла і заревів звір мов скажений, кинувши собою
- взад.

І хоть через те щез він ловцям з очей, скрившися за купою вивертів, то
ревіт його не втихав і не втихало скажене ше-метання.

- Далі за ним! крикнув Тугар Вовк і кинувся до щілини, кудою щез
- медвідь.

Рівночасно два бояри вже видряпалися були на верх виверту, вже
попіднімали свої ратища і старались дати їм відповідний розмах, аби
доконати звіра. Тугар

Вовк, стоячи в щілині, пустив у нього другою стрілою. Звір заревів ще
дужче і кинувся втікати, але очі його заплили кров'ю, він не міг
знайти виходу і розщибав собою о дерева. Ратище одного боярина впилось
йому між ребра, але не завдало смертельної рани. Дикий рик раненого
медведя розлягався чимраз дужче. В розпуці він підводився на задні
лапи, обтирав собі кров з очей, рвав і кидав галуззям наперед себе,
але дарма; одно його око прошиблене було стрілою, а друге раз у раз
запливало кров'ю наново.

Шемечучись наосліп довкола, звір наблизився знов до Гугара Вовка. Той
відкинув лук і, причаївшися за виваленим коренем, ухопив обіруч свій
важкий топір і, коли медвідь, мацаючи, добирався до знайомої собі
щілини, він з усього розмаху цюкнув його згори в голову, аж череп
розколовся надвоє, мов розбита тиква. Бризнув кровавий мозок на
боярина, тихо, без рику повалився звір додолу. Радісно заревли труби
бояр на знак першої побіди.

Звіра витягнено з-поміж вивертів і обдерто зі шкури. Тоді бояри рушили
дальше, в гущавину. Сонце вже піднялось на небі і меркотіло крізь
гілляки, мов скісні золоті нитки та пасма. Ловці йшли тепер геть-геть
веселіше, перехвалюючися своєю відвагою й силою.

- Хоч я лише вовк, дрібна звірюка, то все ще дам раду тухольському
- медведеві! говорив Тугар Вовк, радіючи.

Максим Беркут слухав тих перехвалок і сам не знав, чому йому жаль
зробилося тухольського медведя.

- Що ж,сказав він,дурна звірюка той медвідь, самотою держиться. Якби
- вони зібралися докупи, то хто знає, чи й стадо вовків дало би їм
- раду.

Тугар позирнув на нього гнівно, але не сказав нічого. Ловці обережно
поступали дальше, дряпаючись по вивертах, перескакуючи з пня на пень,
западаючи не раз по пояс у порохно та ломи.

Посеред тих звалищ величної природи виднілися подекуди медведячі
стежки, протоптані від давніх-давен, вузькі, але добре втоптані, густо
засіяні вибіленими кістками баранів, оленів та всякої іншої звірини.
Максим держався тепер позаду бояр; він раз за разом обходив усі
становища, осмотрював сліди, щоб догадатися, чи вони свіжі, чи ні,
підпомагав, заохочував утомлених,- і тільки на нім однім не знати було
ніякої втоми. З подивом позирала на нього

Мирослава, коли він переходив коло неї, і хоч багато досі видала вона
молодців і сильних, і смілих, але такого, як Максим, що сполучав би в
собі всі прикмети сильного робітника, рицаря і начальника,- такого їй
досі не траплялося бачити.

Нараз захрустів лім і грізно-люто випав на ловців величезний медвідь.
Він біг зразу на чотирьох лапах, але, побачивши перед собою ворогів,
звівся на задні лапи, а в передні вхопив бурею відламаний буковий
конар, викручуючи ним довкола себе і видаючи час від часу з горла
уриваний, немов визиваючий рик.

На становищі супроти звіра були два підгірські бояри, з тих, що
найголосніше перехвалювалися і хотіли перед усіми показатися
мисливцями. Побачивши страшного ворога тут же перед собою, вони
зблідли й затремтіли. Але скритися, тікати не уходило,- треба було
ставити чоло, будь-що-будь. Дві стріли вилетіли рівночасно з двох
луків, але одна хибила, свиснувши медведеві понад вуха, а друга
влучила звіра в бік, не зранивши значно, а тільки роздразнивши
безмірно. Величезним скоком підплигнув медвідь і шпурнув на одного
ловця свою зброю - буковий копар, який зі страшною силою гепнувся о
дерево. Тоді, не зупиняючись ані на хвильку і не даючи ворогам часу до
намислу, медвідь кинувся на одного з них, що саме стояв па його
протоптаній стежці. Ратище блисло в тремтячій руці боярина,- він хотів
кинути ним на звіра.

- Не кидай! крикнув тривожно Максим, надбігаючи і ведучи з собою поміч
- загроженим боярам Тугара Вовка і ще одного боярина.Не кидай ратище,
- але настав поприбіч і боронися!

Але боярин не слухав і кинув ратище на звіра. Розмах був невеликий,
рука боярина тремтіла, медвідь був уже на яких п'ять кроків,- от і не
диво, що ратище слабо зранило звіра в передню лопатку. Вхопив медвідь
дрючину, розломив її і зі страшним риком кинувся на свого ворога. Той
держав уже в руках простого, на оба боки острого меча, що його називав
медвідником, і готовився віпхнути його вістря в груди звірові. Але
вістря поховз-лося по кості

і застряло в лопатці, і звір ухопив боярина в свої страшні, залізні
обійми.

Страшенно скрикнула нещаслива жертва; захрустіли кості під медведячими
губами. Ціла та страшна і дрожжю проймаюча подія скоїлася так раптово,
так несподівано, що, заким Максим міг надбігти з підмогою, вже боярин,
хриплячи в передсмертних судорогах, лежав на землі, а над ним стояв
кровавий медвідь, вискаливши свої страшенні зуби і ревучи на весь ліс
з болю від одержаних ран.

Дрож пройшла у всіх по тілі на той вид; бояри стали мов укопані.
Тільки

Максим спокійно наложив стрілу на свій роговий лук, підійшов два кроки
ближче до мед-ведя і, прицілившися одну хвилину, пустив йому стрілу
просто в серце. Мов ножем перетятий, урвався рик звіра, і він
повалився трупом на землю.

Не ревіли роги, не лунали веселі оклики по тій новій побіді. Бояри,
покинувши свої становища, збіглися на місце нещастя. Хоч і як вони
були загартовані в війнах, привикли бачити смерть біля себе, але вид
кровавого, потрощеного та пошарпаного трупа витиснув із усіх грудей
важкий зойк.

Мирослава вхопилась за груди і відвернула очі. Тухольські пасемці на
сплетені з галуззя мари положили трупа, а за ним потягли і медведя.
Понура мовчанка залягла над товариством. Велика калюжа крові
блискотіла до сонця і нагадувала всім, що тут іще перед хвилею стояв
живий чоловік, батько дітям, веселий, охочий і повний надії, а тепер з
нього лишилася лише безформна купа кровавого м'яса. У великої часті
бояр відійшла охота до ловів.

- Цур їм, тим проклятим медведям! говорили деякі.Нехай тут хоч жиють,
- хоч гинуть собі, чи ж нам для них наражувати своє життя?

Але Тугар Вовк, а особливо Мирослава й Максим, налягали конче, аби
кінчити розпочате діло. Бояри вкінці пристали, але якось дуже не раді
були вертати на свої становища.

- Позвольте мені, бояри, слово сказати,заговорив до них Максим.Мої
- товариші-тухольці замкнули вихід і не пустять ані одного звіра
- відси. Тим-то нам не потрібно розходитися віддалік одним від одних.
- Найліпше буде, думаю, розділитися нам на дві ровти і йти понад самі
- краї пропасті по обох боках. Так ми зможемо найліпше зігнати все до
- середини, а там разом з тухольськи-ми пасемцями обступимо густою
- лавою і вистріляємо до одного.

- Авжеж, авжеж, що так ліпшеї крикнули деякі бояри, не бачачи
- насмішливого усміху, що перелетів по устах Максима.

Тоді товариство розділилося. Одну ровту провадив Тугар Вовк, а другу

Максим. Мирослава з власної охоти прилучилася до другої ровти, хоч і
сама не могла собі вияснити, для чого. Мабуть, шукала небезпеки, бо
Максим виразно казав, що дорога другої ровти небезпечніша.

Знов заграли роги, і обі ровти розійшлися. Ловці йшли де парами, де
одинцем, то сходячись, то розходячись, щоб вишукувати дорогу. Купами
йти було зовсім неможливо. Зближались уже до самого верха; верх сам
був голий, але понижче був цілий вал каміння, звалищ і вивертів. Туди
пройти було найтрудніше і найнебезпечніше.

В однім місці стирчала купа звалищ, мов висока башта. Ломаччя, каміння
і навіяне від давніх-давен листя загороджувало, бачилось, усякий
приступ до природної твердині. Максим поповз понад самим краєм
глибочезної пропасті, чіпляючись де-де моху та скальних обривів, щоб
туди винайти прохід. Бояри ж, не навиклі до таких неприступних і
карколомних доріг, пішли здовж валу, надіючись найти далі перерву і
обійти його.

Мирослава зупинилася, немов щось держало її близ Максима; Гі бистрі
очі вдавлювалися пильно в настобур-чену перед нею стіну лому, шукаючи
хоч би й як трудного проходу. Недовго так і вдивлялася, але сміло
почала вдиратися на великі кам'яні брили та виверти, що завалювали
прохід. Стала на версі і гордо озирнулася довкола. Бояри відійшли вже
були досить далеко, Максима не видно, а перед нею безладна сутолока
скал та ломів, через яку, бачилось, прохід був неможливий. Але ні! Он
там, трохи віддалік, лежить величезна смерека кладкою понад те пекло,-
туди безпечно можна перейти до вершка!

Недовго думаючи, Мирослава пустилася на ту кладку. А вступаючи на неї,
ще раз озирнулася і, горда зі свого відкриття, приложила гарно точений
ріг до своїх коралових уст і затрубила на весь ліс. Луна покотилася
полонинами, розбиваючись у дебрях та зворах чимраз на більше часток,
аж поки не сконала десь у далеких, недоступних гущавинах. На голос
Мирославиного рога відізвався здалека ріг її батька, а там і роги
інших бояр. Ще хвильку завагувалася Мирослава, стоячи високо на
виверті. Смерека була дуже стара і наскрізь порохнява, а всподу, в
непроглядній гущавині ломів, здавалось їй, що чує легкий хрускіт і
муркотання. Прислухалася ліпше - не чути нічого. Тоді вона сміло
ступила на свою кладку. Але ледве уйшла з п'ять кроків, коли разом
затріщала перетрупішіла смерека, зламалася під ногами Мирослави, і
сміла дівчина враз із перегнилим грамом упала додолу, в ломи та
звалища.

Впала на ноги, не попускаючись своєї зброї. В руках стискала сильно
сріблом оковане ратище; через плечі у неї висіли міцний лук і сагайдак
зі стрілами, а за гарним шкіряним поясом, що мов вилитий обхапував її
стрункий дівочий стан, застромлений був топір і широкий мисливський
ніж з кістяними черенцями.

Звалившись несподівано в тьмаву пропасть, вона, проте, не почула ані
на хвилю страху, а тільки почала озиратися довкола, щоб догледіти який
вихід.

Зразу не могла нічого виразно добачити, але швидко її очі привикли до
півсумерку, і тоді побачила такий вид, котрий і найсмілішого міг
перейняти смертельною тривогою. Не далі як на п'ять кроків перед нею
лежала величезна медведиця в гнізді коло своїх молодих і гнівними,
зеленкуватими очима гляділа на несподіваного гостя. Мирослава
затремтіла. Чи вдаватися в боротьбу зі страшним звіром, чи шукати
виходу і спровадити поміч? Але нелегко було знайти вихід: довкола
їжилися ломи й обриви скал, і хоч перелізти через них з тяжким трудом
було би можна, то на очах дикого звіра була така робота крайнє
небезпечна. Недовго надумуючись, рішилася

Мирослава не зачіпати звіра, лиш боронитися в разі нападу, а тим часом
дати трубою тривожний знак і закликати поміч. Але скоро тільки вона
затрубила, медведиця схопилася з леговища і, виючи, кинулась до неї.
Не час було

Мирославі братися до лука,- звір був надто близько. Вона вхопила обома
руками ратище і, опершись плечима о кам'яний облаз, наставила його
насупротив медведиці. Звір, побачивши блискуче залізне вістря,
зупинився.

Обі неприятельки стояли так довгу хвилю, не зводячи ока одна з одної,
не схибляючи ані одним рухом зі свого становища. Мирослава не сміла
перша нападати на медведицю; медведиця знов шукала очима, куди би
напасти на ворога. Раптом медведиця вхопила в передні лапи великий
камінь і, зводячись на задні ноги, хотіла шпурнути ним на Мирославу.
Але в тій самій хвилі, коли зводилася на задні ноги, Мирослава одним
могучим рухом пхнула їй ратище між передні лопатки. Рикнула страшенно
медведиця і перевернулась горілиць, обіллявшися кров'ю. Але рана не
була смертельна, і медведиця швидко зірвалася на ноги. Кров текла з
неї, та, незважаючи на біль, вона знов кинулася на Мирославу.
Небезпека була страшна. Розжертий звір садив просто, грозячи вже тепер
своїми страшними зубами. Один рятунок для Мирослави був - видряпатися
на облаз, о котрий була оперта плечима. Хвилька, один рух - і вона
стояла на облазі. На серці в неї полегшало,- тепер її положення не
було таке небезпечне, бо в разі нападу могла вдарити звіра згори. Та
ледве

Мирослава могла дослідити, що робить медведиця, а вже звірюка стояла
близько неї на камені, ревучи грізно і рознявши закровавлену пащеку.
Зимний піт виступив на чолі Мирослави; вона бачила, що тепер настала
рішуча хвиля, що на тій вузькій кам'яній плиті мусить розігратися
боротьба на життя і смерть

і що того буде побіда, хто зможе вдержатися на іім становищі й
зіпхнути з нього противника. Медведиця була вже близько; Мирослава
пробувала заставитися від неї ратищем, але медведиця вхопила дрючину
зубами і шарпнула її так сильно, що мало не зіпхнула Мирославу з
каменя; ратище виховзлось їй із рук, і звір кинув ним геть у ломи.

«Тепер прийдеться загибати?» - блиснуло в думці в Мирослави, але
«відвага не покинула її. Вона вхопила обома руками топір і стала міцно
«до остатньої оборони. Звір сунув чимраз ближче: гарячий його віддих
«чула вже Мирослава на своїм лиці; мохната лапа, насторожена острими
«кігтями, грозила її груді; ще хвиля - і їй довелось би, пошарпаній,
«кровавій, упасти з каменя, бо топорище було закоротке супроти лап
«величезного звіра.

- Рятунку! скрикнула у смертельній тривозі Мирослава, і в тій хвилі
- понад її головою блиснуло ратище і пхнута в горло медведиця, мов
- колода, впала з каменя. В щілині кам'яних звалищ понад головою
- Мирослави показалось радісне» живим огнем палаюче лице Максима
- Беркута. Один вдячний погляд урятованої дівчини пройняв Максима
- наскрізь. Але слова не було між ним ані одного. На те не було часу.
- Медведиця ще жила і, ревучи, зірвалася з місця.

Одним скоком була вона коло своїх молодих, що, не розуміючи цілої тої
боротьби, бавилися і переверталися в гнізді. Обнюхавши їх, медведиця
кинулася знов до Мирослави. На се Мирослава була приготована і,
піднявши обіруч топір, одним замахом розрубала ним голову медведиці.
Впала опосочена звірюка і, метнувши собою кілька разів у боки,
сконала.

Тим часом і Максим, продертися крізь навалені ломи, станув обік
Мирослави.

В очах дівчини заблисли дві перлові сльози, і, не кажучи ані слова,
вона гаряче стиснула руку свого порятівника. Максим чогось немов
змішався, почервонів, спустив очі і, зупиняючись, проговорив:

- Я чув твій тривожний знак… але не знав, де ти… Богу дякувати, що й
- так додряпався!

Мирослава все ще стояла на місці, держачи руку гарного парубка в своїй
руці і дивлячись у його хороше, сонцем опалене і здоровим рум'янцем
осяяне, одверте, щире лице. В тій хвилі вона не почувала нічого, крім
вдячності за рятунок від нехибної смерті. Але коли Максим, трохи
осмілившись, стиснув її ніжну, а так сильну руку, тоді Мирослава
почула, як щось солодко защеміло їй коло серця, як лице її загорілось
стидливим рум'янцем,- і вона спустила очі, а слово подяки, котре
готове було вилетіти з її уст, так і завмерло на губах і розіллялось
по лиці дивним чаром розгоряючого сердечного чуття.

Максим перший отямився. В його серці, смілім і чистім, як щире золото,
відразу блиснула щаслива думка, котра тут же перемінилася в незломне
рішення. Се вернуло йому всю смілість і певність поступування.
Приложивши ріг до уст, він затрубив радісно на знак побіди. Тут же, за
стіною вивертів, обізвалися роги Тугара й інших бояр. Звинна, як
вивірка, Мирослава швидко видряпалась назад на той вал, з якого була
впала, і відтам оголосила цілому стрілецькому товариству свою пригоду
і поміч, якої дізнала від Максима. З трудом видряпався сюди Тугар
Вовк, а за ним і інші бояри; Тугар довго держав доньку в обіймах, а
побачивши кров на її одежі, аж затремтів.

- І ти, ти, моя доню, була в такій небезпеці! І він раз по разу
- обнімав доньку, немов боячись утратити її.

Потім він зліз униз до Максима, що порався коло мед-ведиці і коло
молодих медведят. Молоді, що не знали ще свого ворога в чоловіці,
муркотіли любенько в гнізді і бавились собі, мов малі песики; вони
давали себе гладити руками і зовсім не боялися людей. Максим узяв їх
на руки і положив перед

Мирославою й Тугаром.

- Отеє ваша здобич! сказав він.Ви чей же радо приймете в своїм домі
- таких гостей.

Згромаджені бояри гляділи то радісно на малі медве-дята, то зо страхом
на вбиту медведицю, обзирали рану і подивляли силу й смілість
Мирослави, що могла вдатися в боротьбу з такою страшною звірюкою.

- О ні,сказала, сміючись, Мирослава,без помочі отсього чесного молодця
- була б я тепер лежала там, як сеся звірюка, пошарпана й
- закровавлена! Йому від мене належиться велика подяка.

Тугар Вовк якось немов нерадо слухав тої бесіди своєї доньки. Хоч і як
він любив її, хоч і як радувався її вибавленням із великої небезпеки,
але все-таки він волів би був, якби вибавив його доньку боярський син,
а не сей простий тухольський мужик, не сей «смерд», хоч і як, зрештою,
той смерд умів подобатися Тугарові. Та всетаки йому, гордому
бояринові, що виріс і великої честі дослужився при князівськім дворі,
важко було прилюдно віддавати подяку за вирятування доньки - мужикові.
Але ніщо було діяти… Обов'язок вдячності так був глибоко вкорінений у
наших рицарських предків, що й Ту- гар Вовк не міг від нього
виламатися. Він узяв Максима за руку і випровадив його наперед.

- Молодче,сказав він,донька моя, єдина моя дитина, говорить, що ти
- вирятував її життя з великої небезпеки. Я не маю причини не вірити
- її слову.

Прийми ж за своє чесне діло подяку вітця, котрого вся любов і вся
надія в тій одній дитині. Я не знаю, чим тобі можемо відплатити за се
діло, але будь певний, що скоро се коли-будь буде в моїй силі, то
боярин Тугар Вовк не забуде того, що тобі завдячує.

Максим стояв при тих словах, мов на грані. Він не привик до таких
прилюдних похвал і зовсім не надіявся, ані не бажав нічого подібного.
Він змішався при боярських похвалах і не знав, чи відповідати що-
небудь, чи ні, а вкінці сказав коротко:

- Нема за що дякувати, боярине! Я зробив те, що кождий на моїм місці
- зробив би,за що ж тут дякувати? Нехай донька твоя буде здорова, але
- на вдячність ніяку я не заслужив.

Сказавши се, він пішов, аби закликати своїх тухоль-ських товаришів.
При їх помочі медведицю швидко обдерто зі шкури, а малі медведята
перенесено на збірне місце, відки ціле товариство по скінченню ловів
мало удатися назад до табору.

Сонце доходило вже полудня і сипало гаряче золотисте проміння на
тухольські гори; розігріта живиця сильніше запахла в лісах; гордо і
тільки десь-колись помахуючи розпластаними крилами, плавав яструб
високо понад полонинами в лазуровім океані. Тиша стояла в природі.
Тільки з одного пригірка Зелеменя лунали голоси ловецьких труб і крики
ловецького товариства. Лови скінчилися, хоч і не зовсім щасливо. На
дрючках несли тухольські парубки поперед ловцями три медведячі шкури і
в мішку двоє медведят, а на ношах із галуззя несли боярські слуги
позаду товариства окровавленого, задубілого вже трупа нещасливого
боярина, що погиб від медве-дячих лап.

Швидко під проводом Максима дійшло товариство до мисливського табору.

Лови були скінчені. Сьогодні ще хотіло ціле товариство вертати домів,
зараз, скоро лише по обіді. Дорога була вправді не близька, але Максим
обіцяв випровадити товариство простішою лісовою стежкою до Тухлі, а
відтам до двора Тугара Вовка. Тухоль-ські пасемці, скоро тільки
пообідали, зараз пішли наперед до домів; Максим лишився з боярами,
поки слуги здійняли табір і попрятали всі кухонні та ловецькі
знаряддя; тоді й боярське товариство вирушило в дорогу з поворотом
додому.




ІI


Стародавнє село Тухля - се була велика гірська оселя з двома чи трьома
чималими присілками, всього коло півтори тисячі душ. Село й присілки
лежали не там, де лежить теперішня Тухля, але геть вище серед гір у
просторій подовжній долині, що тепер поросла лісом і зоветься Запалою
долиною. В ті давні часи, коли йде наше оповідання. Запала долина не
була поросла лісом, але, навпаки, була управлена і годувала своїх
жильців достатнім хлібом.

Простягаючись звиш півмилі вдовж, а мало що не чверть милі в ширину,
рівна й намулиста, обведена з усіх боків стрімкими скалистими стінами,
високими декуди на іри або й чотири сажні, долина тота була немов
величезним кітлом, із якого вилито воду. І певно, що воно й не інакше
було. Чималий гірський потік впадав від сходу до тої долини високим на
півтора сажня во-допадом, прориваючи собі дорогу поміж тісні, тверді
скали і обкрутившися вужакою по долині, випливав на захід у таку ж
саму тісну браму, розбиваючись поміж гладкі кам'яні стіни і гуркотячи
ще кількома водопада-ми, поки чверть милі понижче не впав до Опору.
Високі, стрімкі береги тухольської кітловини покриті були темним
смерековим лісом, що надавав самій долині позір ще більшого
заглиблення і якоїсь пустинної тиші та відрубності від усього світу.
Так, справді, се була величезна гірська криївка, з усіх боків тільки з
великим трудом доступна,- але такі були в тих часах ненастанних війн,
усобиць і нападів майже всі гірські села, і тільки дякуючи тій своїй
неприступності, вони змогли довше, ніж подільські села, охоронити своє
свобідке староруське громадське життя, яке деінде силувалися чимраз
більше підірвати горді, війнами збагачені бояри.

Тухольський народ жив головно скотарством. Тільки та долина, де лежало
село, а також кілька поменших порічин, не покритих лісом, надавалися
до хліборобства і видавали щороку багаті збори вівса, ячменю і проса.
Зате в полонинах, що були, так само, як і всі доокружні ліси,
власністю тухольської громади, паслися великі отари овець, у котрих
спочивав головний скарб тухольців: з них вони