�에 정임을 위하여 거짓말을 아니 할 수가 없지 않소? 내가 거짓말을 아니 하면 정임은 아니 갈 것이 분명하였소.
"전 가요."
하고 정임은 또 한 번 절을 하였으나 소리를 내어서 울었소.
"울지 마라! 몸 상한다."
하고 나는 정임에게 대한 최후의 친절을 정임의 곁에 한 걸음 가까이 가서 어깨를 또닥또닥하여 주고, 외투를 입혀 주었소.
"안녕히 주무세요."
하고 정임은 문을 열고 나가 버렸소.
정임의 걸어가는 소리가 차차 멀어졌소.
나는 얼빠진 사람 모양으로 그 자리에 우두커니 서 있었소.
창에 부딪히는 빗발 소리가 들리고 자동차 소리가 먼 나라에서 오는 것같이 들리오. 이것이 정임이가 타고 가는 자동차 소리인가. 나는 정임을 따라가서 붙들어 오고 싶었소. 내 몸과 마음은 정임을 따라서 허공에 떠가는 것 같았소.
아아 이렇게 나는 정임을 곁에 두고 싶을까. 이렇게 내가 정임의 곁에 있고 싶을까. 그러하건마는 나는 정임을 떼어 버리고 가지 아니하면 아니 된다! 그것은 애끓는 일이다. 기막히는 일이다! 그러나 내 도덕적 책임은 엄정하게 그렇게 명령하지 않느냐. 나는 이 도덕적 책임의 명령 그것은 더위가 없는 명령이다 을 털끝만치라도 휘어서는 아니 된다.
그러나 정임이가 호텔 현관까지 자동차를 타기 전에 한 번만 더 바라보는 것도 못 할 일일까. 한 번만, 잠깐만 더 바라보는 것도 못 할 일일까. 잠깐만 일 분만 아니 일 초만 한 시그마라는 극히 짧은 동안만 바라보는 것도 못 할 일일까. 아니, 정임을 한 시그마 동안만 더 보고 싶다 나는 이렇게 생각하고 벌떡 일어나서 도어의 핸들에 손을 대었소.
`안 된다! 옳잖다!'
하고 나는 내 소파에 돌아와서 털썩 몸을 던졌소.
`최후의 순간이 아니냐. 최후의 순간에 용감히 이겨야 할 것이 아니냐. 아서라! 아서라!'
하고 나는 혼자 주먹을 불끈불끈 쥐었소.
이 때에 짜박짜박 하고 걸어오는 소리가 들리오. 내 가슴은 쌍방망이로 두들기는 것같이 뛰었소.
`설마 정임일까.'
하면서도 나는 숨을 죽이고 귀를 기울였소.
그 발자국 소리는 분명 내 문 밖에 와서 그쳤소. 그리고는 소리가 없었소.
`내 귀의 환각인가.'
하고 나는 한숨을 내쉬었소.
그러나 다음 순간 또 두어 번 문을 두드리는 소리가 들렸소.
"이에스."
하고 나는 대답하고 문을 바라보았소.
문