ικό γέλιο ξέσπασε και όλοι έτρεξαν να τον σηκώσουν. Το κλαδί ήταν χαμηλό, ο Αντώνης παλικάρι, δεν είχε, λέει, χτυπήσει, και η κατρακύλα του πήρε μαζί της τη στενοχώρια της πρώτης στιγμής, που έλιωσε μες στα γέλια.
- Να σ' έβλεπε ο μπαμπούλας!... είπε ξεκαρδισμένη η Αλίς.
- Πάει ο μπαμπούλας! αποκρίθηκε ο Αντώνης.
- Ξέρεις, Αλίς; Έφυγε ο μπαμπούλας! πρόσθεσε ο Αλέξανδρος.
Η Αλίς του γύρισε το χαρούμενο πρόσωπο της.
- Το ξέρω, είπε. Ο Μαξ κι εγώ την είδαμε.
- Κι εγώ την είδα, πρόσθεσε ο Αλέκος.
Τ' αδέλφια σάστισαν. Περίεργα μαζεύθηκαν όλα γύρω στην Αλίς.
- Πού την είδατε;
- Την ώρα που έφευγε. Χθες βράδυ.
- Ήταν άσχημηηη!!! Και ήταν η μύτη της κόκκινηηη!!! Πφούι! έκανε ο Αλέκος.
- Πώς την είδατε; Πού; Πότε έφυγε; ρώτησαν όλα μαζί τα τέσσερα αδέλφια.
- Έξω, στο δρόμο. Έφυγε με το αμάξι, τη νύχτα, είπε η Αλίς πολύ υπερήφανη πως είχε τόσα να διηγηθεί. Εμείς το ξέραμε πως θα φύγει. Η μαμά το είπε ευθύς. Η μαμά είπε: «Δεν μπορούν πια να την κρατήσουν, μιας και το μήνυσε η βασίλισσα...»
- Τι μήνυσε η βασίλισσα; ρώτησαν τα δυο κορίτσια με κομμένη από τη συγκίνηση αναπνοή.
- Μπα! Δεν το ξέρετε; Βέβαια! Το μήνυσε η βασίλισσα! Την ώρα που γυρίσατε χθες, δεν κάθουνταν η βασίλισσα με τη Ρωσίδα κυρία της Τιμής και με το βασιλέα και με τους αξιωματικούς απέξω από την αυλή τους;
- Ναι! Τους είδαμε! είπε η Αλεξάνδρα.
- Λοιπόν σας είδαν κι εκείνοι! Και μήνυσε η βασίλισσα της θείας σας πως ήταν ο μπαμπούλας μεθυσμένος!
- Τι ήταν; ρώτησε η Πουλουδιά.
- Μεθυσμένη, στουπί! είπε ο Αλέκος.
- Και πώς το ήξερε η βασίλισσα; έκανε σαστισμένος ο Αντώνης.
- Ε, καλά, δε φαίνουνταν; Η φούστα της ήταν ξεκούμπωτη, το καπέλο της στραβό... Σαν καρνάβαλος ήταν! είπε η Αλίς.
Ναι, τη θυμήθηκαν τ' αδέλφια, και πώς σκόνταφτε και πώς ξέχασε πίσω τον Αλέξανδρο και πώς μια από δω πήγαινε και μια από κει, σα μαούνα άδεια που την κυλούν τα κύματα.
- Κι έκανε την άρρωστη, εξακολούθησε η Αλίς, και η θεία σας τρόμαξε κι έφερε το γιατρό, γιατί νόμιζε πως είχε παραμιλητά, και ύστερα στάθηκαν στην πόρτα και την κοίταζε ο γιατρός και την είδε που έβγαζε μια μποτίλια από κάτω από το μαξιλάρι της κι έπινε. Και ύστερα ήλθε το μήνυμα της βασίλισσας και είπε η θεία σας: «Αυτή δεν μπορεί πια να μείνει, αυτή θα φύγει αμέσως!» Και της έδωσε ο γιατρός... δεν ξέρω τι γιατρικό, που την ξεμέθυσε, και την κατέβασαν κι εκείνη και το σεντούκι της και την έβαλαν σ' ένα αμάξι κ�