�ρνε. Λοιπόν; είπε ο Αλέκος.
Και τα τέσσερα αδέλφια δε βρήκαν απάντηση. Και κοκορεύθηκε ο Αλέκος με την επιτυχία του και είπε:
- Γίνεται μια τέτοια φασαρία στο σπίτι σας και σεις ούτε παίρνετε χαμπάρι! Ούτε ρωτάτε τίποτα! Και χάβετε ό,τι κολοκύθια σας πουν!
Ο Αντώνης άρχισε να θυμώνει. Απ' όλη αυτή την ιστορία έβγαινε μειωμένος και αυτός και τ' αδέλφια του και όλο το σπιτικό. Αυτός και τ' αδέλφια του περνούσαν για μπούφοι, εκεί που η Αλίς και ο Αλέκος όλα τα ήξεραν και όλα τα είχαν δει. Αισθάνθηκε την ανάγκη να ξανασηκώσει το γόητρο του σπιτιού του.
- Και πρώτον, είπε με στόμφο, η θεία δεν επιτρέπει κουσκουσουριές στο σπίτι, ούτε στην υπηρεσία ούτε σε μας! Και θα είπε της Αφροδίτης να μην πει τίποτα για ό,τι έγινε...
- Πουφ! διέκοψε ο Αλέκος. Και πώς το μάθαμε μεις; Από την Αφροδίτη και την κερα-Ρήνη σας!
Το πράμα ήταν ασυζήτητο. Μ' όλο