� есть,
— то есть те души, которые, точно, уже умерли.

Манилов совершенно растерялся. Он чувствовал, что ему нужно что-то
сделать, предложить вопрос, а какой вопрос — черт его знает. Кончил он
наконец тем, что выпустил опять дым, но только уже не ртом, а чрез
носовые ноздри.

— Итак, если нет препятствий, то с богом можно бы приступить к
— совершению купчей крепости, — сказал Чичиков.

— Как, на мертвые души купчую?

— А, нет! — сказал Чичиков. — Мы напишем, что они живы, так, как стоит
— действительно в ревизской сказке. Я привык ни в чем не отступать от
— гражданских законов, хотя за это и потерпел на службе, но уж
— извините: обязанность для меня дело священное, закон — я немею пред
— законом.

Последние слова понравились Манилову, но в толк самого дела он все-
таки никак не вник и вместо ответа принялся насасывать свой чубук так
сильно, что тот начал наконец хрипеть, как фагот. Казалось, как будто
он хотел вытянуть из него мнение относительно такого неслыханного
обстоятельства; но чубук хрипел и больше ничего.

— Может быть, вы имеете какие-нибудь сомнения?

— О! помилуйте, ничуть. Я не насчет того говорю, чтобы имел какое-
— нибудь, то есть, критическое предосуждение о вас. Но позвольте
— доложить, не будет ли это предприятие или, чтоб еще более, так
— сказать, выразиться, негоция, — так не будет ли эта негоция
— несоответствующею гражданским постановлениям и дальнейшим видам
— России?

Здесь Манилов, сделавши некоторое движение головою, посмотрел очень
значительно в лицо Чичикова, показав во всех чертах лица своего и
сжатых губах такое глубокое выражение, какого, может быть, и не видано
было на человеческом лице, разве только у какого-нибудь слишком умного
министра, да и то в минуту самого головоломного дела.

Но Чичиков сказал просто, что подобное предприятие, или негоция, никак
не будет несоответствующею гражданским постановлениям и дальнейшим
видам России, а чрез минуту потом прибавил, что казна получит даже
выгоды, ибо получит законные пошлины.

— Так вы полагаете?..

— Я полагаю, что это будет хорошо.

— А, если хорошо, это другое дело: я против этого ничего, — сказал
— Манилов и совершенно успокоился.

— Теперь остается условиться в цене.

— Как в цене? — сказал опять Манилов и остановился. — Неужели вы
— полагаете, что я стану брать деньги за души, которые в некотором
— роде окончили свое существование? Если уж вам пришло этакое, так
— сказать, фантастическое желание, то с своей стороны я передаю их вам
— безынтересно и купчую беру на себя.

Великий упрек был бы историку предлагаемых событий, если бы он упустил
сказать, что удовольствие одолело гостя после таких слов,
произнесенных Маниловым. Как он ни был степенен и рассудителен, но тут
чуть не произвел даже скачок по образцу козла, что, как известно,
производится только в самых сильных порывах радости. Он поворотился
так сильно в креслах, что лопнула шерстяная материя, обтягивавшая
подушку; сам Манилов посмотрел на него в некотором недоумении.
Побужденный признательностию, он наговорил тут же столько
благодарностей, что тот смешался, весь покраснел, производил головою
отрицательный жест и наконец уже выразился, что это сущее ничего, что
он, точно, хотел бы доказать чем-нибудь сердечное влечение, магнетизм
души, а умершие души в некотором роде совершенная дрянь.

— Очень не дрянь, — сказал Чичиков, пожав ему руку. Здесь был испущен
— очень глубокий вздох. Казалось, он был настроен к сердечным
— излияниям; не без чувства и выражения произнес он наконец следующие
— слова: — Если б вы знали, какую услугу оказали сей, по-видимому,
— дрянью человеку без племени и роду! Да и действительно, чего не
— потерпел я? как барка какая-нибудь среди свирепых волн… Каких
— гонений, каких преследований не испытал, какого горя не вкусил, а за
— что? за то, что соблюдал правду, что был чист на своей совести, что
— подавал руку и вдовице беспомощной, и сироте-горемыке!.. — Тут даже
— он отер платком выкатившуюся слезу.

Манилов был совершенно растроган. Оба приятеля долго жали друг другу
руку и долго смотрели молча один другому в глаза, в которых видны были
навернувшиеся слезы. Манилов никак не хотел выпустить руки нашего
героя и продолжал жать ее так горячо, что тот уже не знал, как ее
выручить. Наконец, выдернувши ее потихоньку, он сказал, что не худо бы
купчую совершить поскорее и хорошо бы, если бы он сам понаведался в
город. Потом взял шляпу и стал откланиваться.

— Как? вы уж хотите ехать? — сказал Манилов, вдруг очнувшись и почти
— испугавшись.

В это время вошла в кабинет Манилова.

— Лизанька, — сказал Манилов с несколько жалостливым видом, — Павел
— Иванович оставляет нас!

— Потому что мы надоели Павлу Ивановичу, — отвечала Манилова.

— Сударыня! здесь, — сказал Чичиков, — здесь, вот где, — тут он
— положил руку на сердце, — да, здесь пребудет приятность времени,
— проведенного с вами! и поверьте, не было бы для меня большего
— блаженства, как жить с вами если не в одном доме, то по крайней мере
— в самом ближайшем соседстве.

— А знаете, Павел Иванович, — сказал Манилов, которому очень
— понравилась такая мысль, — как было бы в самом деле хорошо, если бы
— жить этак вместе, под одною кровлею, или под тенью какого-нибудь
— вяза пофилософствовать о чем-нибудь, углубиться!..

— О! это была бы райская жизнь! — сказал Чичиков, вздохнувши. —
— Прощайте, сударыня! — продолжал он, подходя к ручке Маниловой. —
— Прощайте, почтеннейший друг! Не позабудьте просьбы!

— О, будьте уверены! — отвечал Манилов. — Я с вами расстаюсь не долее
— как на два дни.

Все вышли в столовую.

— Прощайте, миленькие малютки! — сказал Чичиков, увидевши Алкида и
— Фемистоклюса, которые занимались каким-то деревянным гусаром, у
— которого уже не было ни руки, ни носа. — Прощайте, мои крошки. Вы
— извините меня, что я не привез вам гостинца, потому что, признаюсь,
— не знал даже, живете ли вы на свете, но теперь, как приеду,
— непременно привезу. Тебе привезу саблю; хочешь саблю?

— Хочу, — отвечал Фемистоклюс.

— А тебе барабан; не правда ли, тебе барабан? — продолжал он,
— наклонившись к Алкиду.

— Парапан, — отвечал шепотом и потупив голову Алкид.

— Хорошо, а тебе привезу барабан. Такой славный барабан, этак все
— будет: туррр… ру… тра-та-та, та-та-та… Прощай, душенька! прощай! —
— Тут поцеловал он его в голову и обратился к Манилову и его супруге с
— небольшим смехом, с какие обыкновенно обращаются к родителям, давая
— им знать о невинности желаний их детей.

— Право, останьтесь, Павел Иванович! — сказал Манилов, когда уже все
— вышли на крыльцо. — Посмотрите, какие тучи.

— Это маленькие тучки, — отвечал Чичиков.

— Да зна�