� и сказал ему
даже один раз «вы».

Кучер, услышав, что нужно пропустить два поворота и поворотить на
третий, сказал: «Потрафим, ваше благородие», — и Чичиков уехал,
сопровождаемый долго поклонами и маханьями платка приподымавшихся на
цыпочках хозяев.

Манилов долго стоял на крыльце, провожая глазами удалявшуюся бричку, и
когда она уже совершенно стала не видна, он все еще стоял, куря
трубку. Наконец вошел он в комнату, сел на стуле и предался
размышлению, душевно радуясь, что доставил гостю своему небольшое
удовольствие. Потом мысли его перенеслись незаметно к другим предметам
и наконец занеслись бог знает куда. Он думал о благополучии дружеской
жизни, о том, как бы хорошо было жить с другом на берегу какой-нибудь
реки, потом чрез эту реку начал строиться у него мост, потом
огромнейший дом с таким высоким бельведером, что можно оттуда видеть
даже Москву и там пить вечером чай на открытом воздухе и рассуждать о
каких-нибудь приятных предметах. Потом, что они вместе с Чичиковым
приехали в какое-то общество в хороших каретах, где обворожают всех
приятностию обращения, и что будто бы государь, узнавши о такой их
дружбе, пожаловал их генералами, и далее, наконец, бог знает что
такое, чего уже он и сам никак не мог разобрать. Странная просьба
Чичикова прервала вдруг все его мечтания. Мысль о ней как-то особенно
не варилась в его голове: как ни переворачивал он ее, но никак не мог
изъяснить себе, и все время сидел он и курил трубку, что тянулось до
самого ужина.






Глава третья


А Чичиков в довольном расположении духа сидел в своей бричке,
катившейся давно по столбовой дороге. Из предыдущей главы уже видно, в
чем состоял главный предмет его вкуса и склонностей, а потому не диво,
что он скоро погрузился весь в него и телом и душою. Предположения,
сметы и соображения, блуждавшие по лицу его, видно, были очень
приятны, ибо ежеминутно оставляли после себя следы довольной усмешки.
Занятый ими, он не обращал никакого внимания на то, как его кучер,
довольный приемом дворовых людей Манилова, делал весьма дельные
замечания чубарому пристяжному коню, запряженному с правой стороны.
Этот чубарый конь был сильно лукав и показывал только для вида, будто
бы везет, тогда как коренной гнедой и пристяжной каурой масти,
называвшийся Заседателем, потому что был приобретен от какого-то
заседателя, трудилися от всего сердца, так что даже в глазах их было
заметно получаемое ими от того удовольствие. «Хитри, хитри! вот я тебя
перехитрю! — говорил Селифан, приподнявшись и хлыснув кнутом ленивца.
— Ты знай свое дело, панталонник ты немецкий! Гнедой — почтенный конь,
он сполняет свой долг, я ему с охотою дам лишнюю меру, потому что он
почтенный конь, и Заседатель тож хороший конь… Ну, ну! что
потряхиваешь ушами? Ты, дурак, слушай, коли говорят! я тебя, невежа,
не стану дурному учить. Ишь куда ползет!» Здесь он опять хлыснул его
кнутом, примолвив; «У, варвар! Бонапарт ты проклятый!» Потом
прикрикнул на всех: «Эй вы, любезные!» — и стегнул по всем по трем уже
не в виде наказания, но чтобы показать, что был ими доволен. Доставив
такое удовольствие, он опять обратил речь к чубарому: «Ты думаешь, что
скроешь свое поведение. Нет, ты живи по правде, когда хочешь, чтобы
тебе оказывали почтение. Вот у помещика, что мы были, хорошие люди. Я
с удовольствием поговорю, коли хороший человек; с человеком хорошим мы
всегда свои други, тонкие приятели; выпить ли чаю, или закусить — с
охотою, коли хороший человек. Хорошему человеку всякой отдаст
почтение. Вот барина нашего всякой уважает, потому что он, слышь ты,
сполнял службу государскую, он сколеской советник…»

Так рассуждая, Селифан забрался наконец в самые отдаленные
отвлеченности. Если бы Чичиков прислушался, то узнал бы много
подробностей, относившихся лично к нему; но мысли его так были заняты
своим предметом, что один только сильный удар грома заставил его
очнуться и посмотреть вокруг себя; все небо было совершенно обложено
тучами, и пыльная почтовая дорога опрыскалась каплями дождя. Наконец
громовый удар раздался в другой раз громче и ближе, и дождь хлынул
вдруг как из ведра. Сначала, принявши косое направление, хлестал он в
одну сторону кузова кибитки, потом в другую, потом, изменив и образ
нападения и сделавшись совершенно прямым, барабанил прямо в верх его
кузова; брызги наконец стали долетать ему в лицо. Это заставило его
задернуться кожаными занавесками с двумя круглыми окошечками,
определенными на рассматривание дорожных видов, и приказать Селифану
ехать скорее. Селифан, прерванный тоже на самой середине речи,
смекнул, что, точно, не нужно мешкать, вытащил тут же из-под козел
какую-то дрянь из серого сукна, надел ее в рукава, схватил в руки
вожжи и прикрикнул на свою тройку, которая чуть-чуть переступала
ногами, ибо чувствовала приятное расслабление от поучительных речей.
Но Селифан никак не мог припомнить, два или три поворота проехал.
Сообразив и припоминая несколько дорогу, он догадался, что много было
поворотов, которые все пропустил он мимо. Так как русский человек в
решительные минуты найдется, что сделать, не вдаваясь в дальние
рассуждения, то, поворотивши направо, на первую перекрестную дорогу,
прикрикнул он: «Эй вы, други почтенные!» — и пустился вскачь, мало
помышляя о том, куда приведет взятая дорога.

Дождь, однако же, казалось, зарядил надолго. Лежавшая на дороге пыль
быстро замесилась в грязь, и лошадям ежеминутно становилось тяжелее
тащить бричку. Чичиков уже начинал сильно беспокоиться, не видя так
долго деревни Собакевича. По расчету его, давно бы пора было приехать.
Он высматривал по сторонам, но темнота была такая, хоть глаз выколи.

— Селифан! — сказал он наконец, высунувшись из брички.

— Что, барин? — отвечал Селифан.

— Погляди-ка, не видно ли деревни?

— Нет, барин, нигде не видно! — После чего Селифан, помахивая кнутом,
— затянул песню не песню, но что-то такое длинное, чему и конца не
— было. Туда все вошло: все ободрительные и побудительные крики,
— которыми потчевают лошадей по всей России от одного конца до
— другого; прилагательные всех родов без дальнейшего разбора, как что
— первое попалось на язык. Таким образом дошло до того, что он начал
— называть их наконец секретарями.

Между тем Чичиков стал примечать, что бричка качалась на все стороны и
наделяла его пресильными толчками; это дало ему почувствовать, что они
своротили с дороги и, вероятно, тащились по взбороненному полю.
Селифан, казалось, сам смекнул, но не говорил ни слова.

— Что, мошенник, по какой дороге ты едешь? — сказал Чичиков.

— Да что ж, барин, делать, время-то такое; кнута не видишь, такая
— потьма! — Сказавши это, он так покосил бричку, что Чичиков принужден
— был держаться обеими руками. Тут только заметил он, что Селифан
— подгулял.

— Держи, держи, опрокинешь! — кричал он ему.

— Нет, барин, как можно, чтоб я опрокинул, — говорил Селифан. — Это
— нехорошо опрокинуть, я уж сам знаю; уж я никак не опрокину. — Затем
— начал он слегка поворачивать бричку, поворачивал, поворачивал и
— наконец выворотил ее совершенно набок. Чичиков и руками и ногами
— шлепнулся в грязь. Селифан лошадей, однако ж, остановил, впрочем,
— они остановились бы и сами, потому что были сильно изнурены. Такой
— непредвиденный случай совершенно изумил его. Слезши с козел, он стал
— перед бричкою, подперся в бока обеими руками, в то время как барин
— барахтался в грязи, силясь оттуда вылезть, и сказал после некоторого
— размышления: «Вишь ты, и перекинулась!»

— Ты пьян как сапожник! — сказал Чичиков.

— Нет, барин, как можно, чтоб я был пьян! Я знаю, что это нехорошее
— дело быть пьяным. С приятелем поговорил, потому что с хорошим
— человеком можно поговорить, в том нет худого; и закусили вместе.
— Закуска не обидное дело; с хорошим человеком можно закусить.

— А что я тебе сказал последний раз, когда ты напился? а? забыл? —
— сказал Чичиков.

— Нет, ваше благородие, как можно, чтобы я позабыл. Я уже дело свое
— знаю. Я знаю, что нехорошо быть пьяным. С хорошим человеком
— поговорил, потому что…

— Вот я тебя как высеку, так ты у меня будешь знать, как говорить с
— хорошим человеком!

— Как милости вашей будет угодно, — отвечал на все согласный Селифан,
— — коли высечь, то и высечь; я ничуть не прочь от того. Почему ж не
— посечь, коли за дело, на то воля господская. Оно нужно посечь,
— потому что мужик балуется, порядок нужно наблюдать. Коли за дело, то
— и посеки; почему ж не посечь?

На такое рассуждение барин совершенно не нашелся, что отвечать. Но в
это время, казалось, как будто сама судьба решилась над ним сжалиться.
Издали послышался собачий лай. Обрадованный Чичиков дал приказание
погонять лошадей. Русский возница имеет доброе чутье вместо глаз; от
этого случается, что он, зажмуря глаза, качает иногда во весь дух и
всегда куда-нибудь да приезжает. Селифан, не видя ни зги, направил
лошадей так прямо на деревню, что остановился тогда только, когда
бричка ударилася оглоблями в забор и когда решительно уже некуда было
ехать. Чичиков только заметил сквозь густое покрывало лившего дождя
что-то похожее на крышу. Он послал Селифана отыскивать ворота, что,
без сомнения, продолжалось бы долго, если бы на Руси не было вместо
швейцаров лихих собак, которые доложили о нем так звонко, что он
поднес пальцы к ушам своим. Свет мелькнул в одном окошке и досягнул
туманною струею до забора, указавши нашим дорожным ворота. Селифан
принялся стучать, и скоро, отворив калитку, высунулась какая-то
фигура, покрытая армяком, и барин со слугою услышали хриплый бабий
голос:

— Кто стучит? чего расходились?

— Приезжие, ма�