�ложить, что деревушка была порядочная; но
промокший и озябший герой наш ни о чем не думал, как только о постели.
Не успела бричка совершенно остановиться, как он уже соскочил на
крыльцо, пошатнулся и чуть не упал. На крыльцо вышла опять какая-то
женщина, помоложе прежней, но очень на нее похожая. Она проводила его
в комнату. Чичиков кинул вскользь два взгляда: комната была обвешана
старенькими полосатыми обоями; картины с какими-то птицами; между окон
старинные маленькие зеркала с темными рамками в виде свернувшихся
листьев; за всяким зеркалом заложены были или письмо, или старая
колода карт, или чулок; стенные часы с нарисованными цветами на
циферблате… невмочь было ничего более заметить. Он чувствовал, что
глаза его липнули, как будто их кто-нибудь вымазал медом. Минуту
спустя вошла хозяйка женщина пожилых лет, в каком-то спальном чепце,
надетом наскоро, с фланелью на шее, одна из тех матушек, небольших
помещиц, которые плачутся на неурожаи, убытки и держат голову
несколько набок, а между тем набирают по�