им звуком,
как бы кто колотил палкой по разбитому горшку, после чего маятник
пошел опять покойно щелкать направо и налево.

Чичиков поблагодарил хозяйку, сказавши, что ему не нужно ничего, чтобы
она не беспокоилась ни о чем, что, кроме постели, он ничего не
требует, и полюбопытствовал только знать, в какие места заехал он и
далеко ли отсюда пути к помещику Собакевичу, на что старуха сказала,
что и не слыхивала такого имени и что такого помещика вовсе нет.

— По крайней мере знаете Манилова? — сказал Чичиков

— А кто таков Манилов?

— Помещик, матушка.

— Нет, не слыхивала, нет такого помещика.

— Какие же есть?

— Бобров, Свиньин, Канапатьев, Харпакин, Трепакин, Плешаков.

— Богатые люди или нет?

— Нет, отец, богатых слишком нет. У кого двадцать душ, у кого
— тридцать, а таких, чтоб по сотне, таких нет.

Чичиков заметил, что он заехал в порядочную глушь.

— Далеко ли по крайней мере до города?

— А верст шестьдесят будет. Как жаль мне, что нечего вам покушать! не
— хотите ли, батюшка, выпить чаю?

— Благодарю, матушка. Ничего не нужно, кроме постели.

— Правда, с такой дороги и очень нужно отдохнуть. Вот здесь и
— расположитесь, батюшка, на этом диване. Эй, Фетинья, принеси перину,
— подушки и простыню. Какое-то время послал бог: гром такой — у меня
— всю ночь горела свеча перед образом. Эх, отец мой, да у тебя-то, как
— у борова, вся спина и бок в грязи! где так изволил засалиться?

— Еще славу богу, что только засалился, нужно благодарить, что не
— отломал совсем боков.

— Святители, какие страсти! Да не нужно ли чем потереть спину?

— Спасибо, спасибо. Не беспокойтесь, а прикажите только вашей девке
— повысушить и вычистить мое платье.

— Слышишь, Фетинья! — сказала хозяйка, обратясь к женщине, выходившей
— на крыльцо со свечою, которая успела уже притащить перину и, взбивши
— ее с обоих боков руками, напустила целый потоп перьев по всей
— комнате. — Ты возьми ихний-то кафтан вместе с исподним и прежде
— просуши их перед огнем, как делывали покойнику барину, а после
— перетри и выколоти хорошенько.

— Слушаю, сударыня! — говорила Фетинья, постилая сверх перины простыню
— и кладя подушки.

— Ну, вот тебе постель готова, — сказала хозяйка. — Прощай, батюшка,
— желаю покойной ночи. Да не нужно ли еще чего? Может, ты привык, отец
— мой, чтобы кто-нибудь почесал на ночь пятки? Покойник мой без этого
— никак не засыпал.

Но гость отказался и от почесывания пяток. Хозяйка вышла, и он тот же
час поспешил раздеться, отдав Фетинье всю снятую с себя сбрую, как
верхнюю, так и нижнюю, и Фетинья, пожелав также с своей стороны
покойной ночи, утащила эти мокрые доспехи. Оставшись один, он не без
удовольствия взглянул на свою постель, которая была почти до потолка.
Фетинья, как видно, была мастерица взбивать перины. Когда, подставивши
стул, взобрался он на постель, она опустилась под ним почти до самого
пола, и перья, вытесненные им из пределов, разлетелись во все углы
комнаты. Погасив свечу, он накрылся ситцевым одеялом и, свернувшись
под ним кренделем, заснул в ту же минуту. Проснулся на другой лень он
уже довольно поздним утром. Солнце сквозь окно блистало ему прямо в
глаза, и мухи, которые вчера спали спокойно на стенах и на потолке,
все обратились к нему: одна села ему на губу, другая на ухо, третья
норовила как бы усесться на самый глаз, ту же, которая имела
неосторожность подсесть близко к носовой ноздре, он потянул впросонках
в самый нос, что заставило его крепко чихнуть, — обстоятельство,
бывшее причиною его пробуждения. Окинувши взглядом комнату, он теперь
заметил, что на картинах не всё были птицы: между ними висел портрет
Кутузова и писанный масляными красками какой-то старик с красными
обшлагами на мундире, как нашивали при Павле Петровиче. Часы опять
испустили шипение и пробили десять; в дверь выглянуло женское лицо и в
ту же минуту спряталось, ибо Чичиков, желая получше заснуть, скинул с
себя совершенно все. Выглянувшее лицо показалось ему как будто
несколько знакомо. Он стал припоминать себе: кто бы это был, и наконец
вспомнил, что это была хозяйка. Он надел рубаху; платье, уже
высушенное и вычищенное, лежало возле него. Одевшись, подошел он к
зеркалу и чихнул опять так громко, что подошедший в это время к окну
индейский петух — окно же было очень близко от земли — заболтал ему
что-то вдруг и весьма скоро на своем странном языке, вероятно «желаю
здравствовать», на что Чичиков сказал ему дурака. Подошедши к окну, он
начал рассматривать бывшие перед ним виды: окно глядело едва ли не в
курятник; по крайней мере, находившийся перед ним узенький дворик весь
был наполнен птицами и всякой домашней тварью. Индейкам и курам не
было числа; промеж них расхаживал петух мерными шагами, потряхивая
гребнем и поворачивая голову набок, как будто к чему-то прислушиваясь;
свинья с семейством очутилась тут же; тут же, разгребая кучу сора,
съела она мимоходом цыпленка и, не замечая этого, продолжала уписывать
арбузные корки своим порядком. Этот небольшой дворик, или курятник,
переграждал дощатый забор, за которым тянулись пространные огороды с
капустой, луком, картофелем, светлой и прочим хозяйственным овощем. По
огороду были разбросаны кое-где яблони и другие фруктовые деревья,
накрытые сетями для защиты от сорок и воробьев, из которых последние
целыми косвенными тучами переносились с одного места на другое. Для
этой же самой причины водружено было несколько чучел на длинных
шестах, с растопыренными руками; на одном из них надет был чепец самой
хозяйки. За огородами следовали крестьянские избы, которые хотя были
выстроены врассыпную и не заключены в правильные улицы, но, по
замечанию, сделанному Чичиковым, показывали довольство обитателей, ибо
были поддерживаемы как следует: изветшавший тес на крышах везде был
заменен новым; ворота нигде не покосились, а в обращенных к нему
крестьянских крытых сараях заметил он где стоявшую запасную почти
новую телегу, а где и две. «Да у ней деревушка не маленька», — сказал
он и положил тут же разговориться и познакомиться с хозяйкой покороче.
Он заглянул в щелочку двери, из которой она было высунула голову, и,
увидев ее, сидящую за чайным столиком, вошел к ней с веселым и
ласковым видом.

— Здравствуйте, батюшка. Каково почивали? — сказала хозяйка,
— приподнимаясь с места. Она была одета лучше, нежели вчера, — в
— темном платье и уже не в спальном чепце, но на шее все так же было
— что-то завязано.

— Хорошо, хорошо, — говорил Чичиков, садясь в кресла. — Вы как,
— матушка?

— Плохо, отец мой.

— Как так?

— Бессонница. Все поясница болит, и нога, что повыше косточки, так вот
— и ломит.

— Пройдет, пройдет, матушка. На это нечего глядеть.

— Дай бог, чтобы прошло. Я-то смазывала свиным салом и скипидаром тоже
— смачивала. А с чем прихлебаете чайку? Во фляжке фруктовая.

— Недурно, матушка, хлебнем и фруктовой.

Читатель, я думаю, уже заметил, что Чичиков, несмотря на ласковый вид,
говорил, однако же, с большею свободою, нежели с Маниловым, и вовсе не
церемонился. Надобно сказать, кто у нас на Руси если не угнались еще
кой в чем другою за иностранцами, то далеко перегнали их в умении
обращаться. Пересчитать нельзя всех оттенков и тонкостей нашего
обращения. Француз или немец век не смекнет и не поймет всех его
особенностей и различий; он почти тем же голосом и тем же языком
станет говорить и с миллионщиком, и с мелким табачным торгашом, хотя,
конечно, в душе поподличает в меру перед первым. У нас не то: у нас
есть такие мудрецы, которые с помещиком, имеющим двести душ, будут
говорить совсем иначе, нежели с тем, у которого их триста, а у
которого их триста, будут говорить опять не так, как с тем, у которого
их пятьсот, а с тем, у которого их пятьсот, опять не так, как с тем, у
которого их восемьсот, — словом, хоть восходи до миллиона, всё найдут
оттенки. Положим, например, существует канцелярия, не здесь, а в
тридевятом государстве, а в канцелярии, положим, существует правитель
канцелярии. Прошу смотреть на него, когда он сидит среди своих
подчиненных, — да просто от страха и слова не выговоришь! гордость и
благородство, и уж чего не выражает лицо его? просто бери кисть, да и
рисуй: Прометей, решительный Прометей! Высматривает орлом, выступает
плавно, мерно. Тот же самый орел, как только вышел из комнаты и
приближается к кабинету своего начальника, куропаткой такой спешит с
бумагами под мышкой, что мочи нет. В обществе и на вечеринке, будь все
небольшого чина, Прометей так и останется Прометеем, а чуть немного
повыше его, с Прометеем сделается такое превращение, какого и Овидий
не выдумает: муха, меньше даже мухи, уничтожился в песчинку! «Да это
не Иван Петрович, — говоришь, глядя на него. — Иван Петрович выше
ростом, а этот и низенький и худенький; тот говорит громко, басит и
никогда не смеется, а этот черт знает что: пищит птицей и все
смеется». Подходишь ближе, глядишь — точно Иван Петрович! «Эхе-хе», —
думаешь себе… Но, однако ж, обратимся к действующим лицам. Чичиков,
как уж мы видели, решился вовсе не церемониться и потому, взявши в
руки чашку с чаем и вливши туда фруктовой, повел такие речи:

— У вас, матушка, хорошая деревенька. Сколько в ней душ?

— Душ-то в ней, отец мой, без малого восемьдесят, — сказала хозяйка, —
— да беда, времена плохи, вот и прошлый год был такой неурожай, что
— боже храни.

— Однако ж мужички на вид дюжие, избенки крепкие. А позвольте узнать
— фамилию вашу. Я так рассеялся… приехал в ночное время…:

— Коробочка, коллежская секретарша.

— Покорнейше благодарю. А имя и отчество?

— Настасья Петровна.

— Настасья Петровна? хорошее имя Настасья Петровна. У меня тетка
— родная, сестра моей матери, Настасья Петровна.

— А ваше имя как? — спросила помещица. — Ведь вы, я чай, заседатель?

— Нет, матушка, — отвечал Чичиков, усмехнувшись, — чай, не заседатель,
— а так ездим по своим делишкам.

— А, так вы покупщик! Как же жаль, право, что я продала мед купцам так
— дешево, а вот ты бы, отец мой, у меня, верно, его купил.

— А вот меду и не купил бы.

— Что ж другое? Разве пеньку? Да вить и пеньки у меня теперь маловато:
— полпуда всего.

— Нет, матушка, другого рода товарец: скажите, у вас умирали
— крестьяне?

— Ох, батюшка, осьмнадцать человека — сказала старуха, вздохнувши. — И
— умер такой всё славный народ, всё работники. После того, правда,
— народилось, да что в них: все такая мелюзга; а заседатель подъехал —
— подать, говорит, уплачивать с души. Народ мертвый, а плати, как за
— живого. На прошлой неделе сгорел у меня кузнец, такой искусный
— кузнец и слесарное мастерство знал.

— Разве у вас был пожар, матушка?

— Бог приберег от такой беды, пожар бы еще хуже; сам сгорел, отец мой.
— Внутри у него как-то загорелось, чересчур выпил, только синий огонек
— пошел от него, весь истлел, истлел и почернел, как уголь, а такой
— был преискусный кузнец! и теперь мне выехать не на чем: некому
— лошадей подковать.

— На все воля божья, матушка! — сказал Чичиков, вздохнувши, — против
— мудрости божией ничего нельзя сказать… Уступите-ка их мне, Настасья
— Петровна?

— Кого, батюшка?

— Да вот этих-то всех, что умерли.

— Да как же уступить их?

— Да так просто. Или, пожалуй, продайте. Я вам за них дам деньги.

— Да как же? Я, право, в толк-то не возьму. Нешто хочешь ты их
— откапывать из земли?

Чичиков увидел, что старуха хватила далеко и что необходимо ей нужно
растолковать, в чем дело. В немногих словах объяснил он ей, что
перевод или покупка будет значиться только на бумаге и души будут
прописаны как бы живые.

— Да на что ж они тебе? — сказала старуха, выпучив на него �