�і землі, з родиною такого прогнати з границь
- громадських, а дім його розвалити і зрівняти з землею.

- Ха-ха-ха! зареготався силуваним сміхом боярин.То ви сміли б мене,
- княжого боярина, наділеного княжою ласкою за мої заслуги, рівняти з
- розбійниками і конокрадами?

- Що ж, боярине, а скажи сам по совісті, чи ліпше ти поступаєш з нами,
- як розбійник? Адже ж землю нашу забираєш наше найбільше і єдине
- добро.

Людей наших гониш і вбиваєш на смерть, худобу нашу стріляєш! Чи так
роблять чесні громадяни?

- Старче, покинь таку мову, я її не можу слухати, вона нарушає мою
- честь.

- ІІостій, боярине, я ще не скінчив,сказав спокійно Захар Беркут.Отеє
- ти згадав про свою честь і раз у раз говориш про свої великі
- заслуги. Будь ласкав, скажи нам, які се твої заслуги, щоб і ми могли
- вшанувати їх!

- У двадцятьох битвах я проливав свою кров!

- Кров свою проливати, боярине, се ще не заслуга. І розбійник не раз
- проливає свою кров, а його ж за те вішають. Скажи нам, проти кого і
- за ким ти воював?

- Проти князя київського, проти князів волинських, і польських, і
- мазовецьких…

- Досить, боярине! Ті війни се ганьба, не заслуга, і для тебе, і для
- князів. Се чисто розбійницькі війни.

- Я воював і проти монголів над Калкою.

- І як же ти воював протії них?

- Як то як? Так, як повинен був воювати, не вступаючись із місця,
- поки, ранений, не дістався до неволі.

- Отеє ти добре сказав,не знаємо тільки, чи се правда.

- Як не знаєте, то й не мішайтеся в те, чого не знаєте.

- Постій, боярине, не насміхайся над нашим незнанням. Постараємось
- переконатися.

І за тим словом Захар устав і, звертаючись до громади, сказав:

- Чесна громадо, ви чули признання боярина Тугара Вовка?

- Чули.

- Чи може хто свідчить за ним або против нього?

- Я можу! озвався голос із народу. Мов стрілою поражений, стрепенувся
- боярин на той голос і перший раз уважно, з якоюсь тривогою поглянув
- на громаду.

- Хто може свідчити, нехай вийде перед громаду і свідчить,сказав
- Захар.

Перед громаду вийшов не старий ще чоловік, каліка, без руки і ноги,
навхрест перекалічений. Лице його було порите глибокими шрамами. Се
був Митько

Вовк, як звала його громада. Перед кількома літами зайшов він до
громади на кулі, розповідаючи страшні вісті про монголів, про битву
над Калкою, про погром руських князів і про смерть тих, що дісталися
до неволі, а потім під час обіду монгольських полководців були удушені
під дошками, на яких монголи засіли до учти. Він, Митько, також був у
тій битві в дружиш одного боярина і разом з ним дістався до неволі, з
якої потім якимсь чудом уйшов. Довго блукав він по селах і містах
святої Русі, поки вкінці не зайшов і до Тухлі. Тут йому сподобалося
жити, а що своєю одною рукою вмів плестіг скусні коші і знав багато
пісень та оповідань про далекі краї, то громада прийняла його р свої
члени, живила його і зодягала за чергою, загально люблячи і поважаючи
його за рани, понесені в війні з наїзником, і за його чесний, веселий
характер. Отой-то

Митько тепер вийшов свідчити протії боярина.

- Скажи нам, Вояче Митьку,почав питати його Захар,ти знаєш сього
- боярина, проти котрого хочеш свідчити?

- Знаю,відповів твердим голосом Митько.В його дружині я служив і був у
- битві над Калкою.

- Яке ж свідоцтво хочеш ти зложити проти нього?

- Мовчи, підлий рабе! скрикнув, побліднівши, боярин.Мовчи, а то тут
- буде й конепь твоя amp;му нужденному життю!

- Боярине, я тепер не раб твій, але вільний громадянин, і тільки моя
- громада може веліти мені мовчати. Я досі мовчав, але тепер мені
- велять говорити. Чесна громадо! Свідоцтво моє проти боярина Тугара
- Вовка велике і страшне: він зра…

- Мовчав досі, то мовчи й далі! ревнув боярин, блиснув топір, і Митько
- Вояк з розлупаною головою, окровавлений упав додолу.

Охнула громада і зірвалася на ноги. Страшний крик залунав довкола:

- Смерть йому! Смерть! Він зганьбив святість суду! На раді забив мужа
- нашого!

- Смерди погані! скрикнув до них боярин.Не боюсь вас! От так буде
- кождому, хто поважиться торкнути мене чи рукою, чи словом. Гей, мої
- вірні слуги, сюди, до мене!

Лучники і топірники, хоч самі бліді й тремтючі, обступили боярина.
Грізний, червоний з лютості, стояв він посеред них з кровавим топором
у руці. На знак

Захара громада втихла.

- Боярине,сказав Захар,ти смертельно провинивсь проти бога і громади.
- Ти на суді забив свідка, нашого громадянина. Що він хотів проти тебе
- свідчити, ми не дізналися і не хочемо знати,нехай твоя совість
- судить тебе. Але своїм убійством ти признався до вини і поповнив
- нову вину. Громада не може тебе терпіти на своїй землі. Віддалися
- з-між нас! За три дні віднині прийдуть наші люди, щоб розвалити твій
- дім і загладити навіть слід твого буття у нас.

- Нехай приходять! крикнув люто боярин.Побачимо, хто чий слід
- загладить.

Я плюю на ваш суд! Рад побачити того, хто приступить до мого дому!
Ану, мої слуги, ходімо з сього поганого збору!

Боярин віддалився зі своїми слугами. Довгий час стояла мовчанка в
зборі.

Молодці винесли кроваве тіло Мить-ка Вояка.

- Чесна громадо,сказав Захар,чи воля ваша поступити з боярином Тугаром

Вовком так, як батьки наші веліли поступати з такими людьми?

- Так, так! загула громада.

- Кого ж вибираєте до сповнення громадської волі? Вибрано десять
- молодців, між ними й Максима Беркута. Важко було Максимові приймати
- сей вибір. Хоч і як ненависний був йому боярин, але все-таки він був
- віт-цем тої, котра мов чаром опанувала його серце і його мислі, за
- котру він віддав би був життя. А тепер, о горе, і вона була
- засуджена, безвинно, за батькову провину. Але проте

Максим не відпирався від вибору. Хоч і як тяжке для нього було
завдання сповнити громадський засуд, усе-таки він у глибині свого
серця радувався ним: адже ж при тій нагоді він побачить її! А може,
йому удасться як-небудь потішити її, злагодити хоть своєю щирістю
остр