�ька залива йде в угорську країну. На бога і
- богів батьків наших взиваємо вас, сусіди і браття: спиніть тоту
- страшну хмару, не допустіть її звалитися в нашу країну! Ваші села
- твердині; кожда скала, кожда дебра ваша стане за тисячу вояків. А
- скоро раз вони переваляться через гори, то вже там ніяка сила не
- спинить їх, і всі ми погибнемо марно. Ми готові дати вам поміч, якої
- зажадаєте,і хлібом, і людьми, тільки не опускайте рук, не тратьте
- надії, ставайте до бою з поганим наїзником!

Тоді Захар Беркут сказав:

- Чесна громадо, і ви, чесні посли сусідські! Всі ми тут чули, яка
- страшна хмара йде на нашу країну. Воєнні сили виступали проти них і
- погибли. Сила їх велика, а нещасні порядки на наших долах дозволили
- їм зайти аж у серце нашого краю, перед поріг нашої хати. Князі й
- бояри потратили голови або зраджують край свій очевидячки. Що нам
- тут зробити? Як нам боронитися? Я думав би, що нам поза границі
- нашої Тухольщини удаватися не можна. Шлях наш при вашій помочі,
- чесні загірні громадяни, ми чень оборонимо. Але інших шляхів ми
- оборо