и і громадами поскидати з себе ті пута, в які обпутала вас
боярська неситість і княжа сваволя. Поки сього не буде, поти й ми не
зможемо допомогти вам.

Сумно похилили голови тустанські післанці на ті Захарові слова.

- Ей, батьку Захаре,сказали вони,знаєш тп наших громадян, а говориш,
- немовби зовсім не знав їх. Зламана у них давня відвага, притоптана
- їх воля. За твою раду дякуємо тобі і передамо її нашим громадам, але
- чи підуть вони за нею?.. Ей, коби ти був між ними і ска-вав їм своє
- слово!

- Невже ж таки, чесні сусіди, моє слово у ваших громадян може мати
- більшу вагу, ніж їх власна потреба, ніж їх власний розум? Ні! Коли б
- так було, то нічого вже й моє слово вам не поможе, то вже пропали
- наші громади, пропала наша

Русь.

Сонце геть-геть уже схилилося з полудня, коли тухольська громада по
скінченій раді вертала до села. Без радісних співів і викриків, сумно,
повагом ішли старі й молоді, повні важких дум. Що то принесуть їм
будущі дні?

Післанці сторонських громад, піднесені на дусі й заохочені,
порозходилися.

Тільки копне знамено, знак сили і згоди громадської, повівало високо і
весело в повітрі, і весняне небо ясніло пречистим блакитом, немов не
бачачи земної журби та тривоги.




ІV


Широкою рікою плили по Русі пожежі, руїна та смерть. Страшенна
монгольська орда з далекої степової Азії налетіла на нашу країну, щоб
на довгі віки в самім корені підтятії її силу, розбити її народне
життя. Найперші міста -

Київ, Канів, Переяслав - упали і були зруйновані до основи; їх слідом
пішли тисячі сіл і менших городів. Страшний начальник монгольський
Бату-хан, прозваний Батиєм, ішов на чолі своєї стотисячної орди,
женучи перед собою вчетверо стільки всяких полоняників, що мусили
битися за нього в перших рядах,- ішов поздовж руської землі,
розпускаючи широко свої загони і бродячи по коліна в крові. Про який-
будь опір на рівнім полі ніщо було й думати, тим більше, що Русь була
роз'єднана і роздерта внутрішніми межиусобицями.

Декуди ставали опором міщани в своїх мурах, і непривичні до ведення
правильної облоги монголи мусили не раз тратити багато часу, добуваючи
брам

і мурів топорами. Але слабі твердині падали більше через зраду і
підкупство, ніж силою поборені. Ціль походу страшної орди були Угри,
багата країна, заселена племенем, спорідненим з монголами, від котрого
великий Чінгісхан монгольський домагався, щоб йому піддалося. Угри не
хотіли піддатися, і страшенний похід монгольської орди мав їм показати
месть великого Чін- гісхана. З трьох боків разом, після плану Батия,
мала впасти орда до Угорщини: зі сходу в землю Семигород-ську, з
заходу з землі Моравської і з півночі через

Карпати. В тій цілі орда поділилася на три часті: одна, під проводом
Кайдана, пішла бессарабськими степами в Волощину, друга, під проводом
Пети, відділилася від головної орди в землі Волинській і поперек
Червоної Русі, через

Пліснесько, змагала до верхів'я ріки Дністра, щоб перейти її вбрід, а
далі розлилася по Підгір'ю, шукаючи проходів через Карпати. Взяті до
неволі місцеві люди, а також деякі бояри-зрадники провадили монголів
горі рікою Стриєм на тухольський шлях, і вже, як говорили корчинські
післанці, їх шатра білілися на рівнині понижче Синевідська.

Вечоріло. Густі сумерки лягали на Підгір'я. Лісисті тухольські гори
задимилися, мов незлічимі вулкани, готовлячись вибухати. Стрий шумів
по кам'яних бродах і пінився по закрутинах. Небо покривалось зорями.
Але й на землі, на широкій надстрийськііі рівнині, почали
розблискуватись якісь світила, зразу де-де, рідко, мов не-сміло, далі
чимраз густіше, сильніше,- поки врешті ціла рів