�ежали на горах і величезними клубами
котилися з ярів і дебрів чимраз вище на верхи, не могли на його лиці
закрити виразу глибокого невдоволення, гніву і якоїсь сліпої
завзятості, що щохвилі розливався по ньому то їдким, прикрим сміхом,
то понурою хмарою,- немов щось шарпало його сустави несподіваними
судорожними рухами і давалося взнаки його гарному коневі.

Другий їздець - то була молода, гарна дівчина, одіта в полотняну,
шовковими нитками перетикану одежу, з невеличким бобровим ковпаком на
голові, що не міг вмістити в собі її багатого, буйного золотисто-
жовтого волосся. Через плечі у неї перевішений був лук з турового рога
і сагайдак зо стрілами, її чорні палкі очі ластівками літали довкола,
любуючись рівними, хвилястими контурами верховини і темно-зеленими
ситими барвами лісів та полонин.

- Що за гарна країна, таточку! скрикнула вона дзвінким, срібним
- голосом, коли коні їх на хвильку зупинилися на крутім пригірку,
- через який вони з трудом пробиралися, щоб перед цілковитим смерком
- доїхати до цілі.Що за чудово гарна країна! повторила вона вже
- тихішим, ніжнішим голосом, озираючись позад себе і тонучи поглядом у
- незглибимо темних зворах.

- А що за поганий народ живе в тій країні! гнівно відрізав їздець.

- Ні, таточку, сього не кажи! сказала вона сміло, але зараз же якось
- змішалась і, значно понизивши голос, додала по хвилі: Я не знаю, але
- народ тутешній мені сподобався…

- О, я знаю, що він тобі сподобався! скрикнув з докором їздець.А
- радше, що сподобався тобі один із того народу той проклятий Беркут!
- О, я знаю, що ти гот