�ліший і чесніший від усіх тих боярчуків, яких я
- бачила досі. Впрочім, таточку, дарма вже відмовляти я присягла.

- Що значить присяга дурної, осліпленої дівчини?

- Ні, таточку, я не дурна і не осліплена! Не в пориві дикої
- пристрасті, не без ваговання й думання я зробила се. Навіть не без
- вищої волі, таточку!

Остатні слова сказала вона якимсь приглушеним, таємничим голосом.

Боярин цікаво обернувся до неї:

- Ну, а се що знов? Яка вища воля спонукала тебе до такого безумства?

- Слухай, таточку,говорила дівчина, обертаючись до нього та звільняючи
- в

їзді.- Вночі перед тим днем, коли ми мали рушати на медведів,
показалась мені в сні моя мати. Така була, якою ти описував мені її: в
білій одежі, з розпущеним волоссям, але з лицем рум'яним і ясним, мов
сонце, з радістю на устах і з усміхом та безмірною любов'ю в ясних
очах. Вона приступила до мене з розпростертими руками і обняла мене,
сильно притискаючи до грудей.

«Мамо!» - сказала я і більше не могла нічого сказати з радості та
«розкоші, що наповняла цілу мою істоту.

«Мирославе, дитя моє єдине,- говорила вона лагідним, м'яким голосом,
«що й досі тремтить мені в серці,- слухай, що я тобі скажу. Велика для
«тебе хвиля зближається, доню! Серце твоє пробудиться і заговорить.
«Слухай свого серця, доню, і йди за його голосом!»

«Так, мамо!» - сказала я, тремтячи з якоїсь несказанної радості.

«Благословлю ж твоє серце!» - І сказавши се, вона розвіялася запахущим
«леготом, а я прокинулась. І серце моє справді заговорило, таточку, і
«я пішла за його голосом. На мені благословенство мами!

- Але ж, дурна дівчино, се був сон! Про що ти вдень думала, те вночі й
- приснилось тобі! А втім,додав боярин по недовгій хвилі,а вті:,г, ти
- вже й не побачиш його ніколи!

- Не побачу? скрикнула живо Мирослава.Чому не побачу? Хіба він умер?

- Хоч би й сто літ жив, то таки не побачиш його, бо ми ми не вернемось
- уже більше в ті прокляті сторони.

- Не вернемось? А се для чого?

- Для того,сказав боярин з силуваним супокоєм,що ті твої добрі люди, а
- поперед усіх той старий чорт, батько твого укоханого Максима,
- ухвалили на своїй раді вигнати нас із свого села, розвалити наш дім
- і зрівняти його з землею!

Але постійте ви, хамове плем'я, пізнаєте ви, з ким маєте діло! Тугар
Вовк - се не тухольський вовк, він і тухольським медведям зуміє
показати зуби!

Болюче тьохнуло в серці Мирослави, коли почула ті слова.

- Вигнали нас, таточку? І за що ж нас вигнали? Певно, за того
- лісничого, що ти казав так немилосердно бити, хоч я з слізьми
- благала тебе пустити його на волю?

- Як ти все те тямиш! підхопив злісно Тугар, хоч у серці глибоко
- вкололо його те скарження з уст доньки.О, я знаю, що коли б ти була
- на тій раді, то й ти була б стала за ними прогив свого батька! Що ж
- діяти,батько старий, понурий, не вміє блискати очима, ані зітхати, а
- тобі хочеться не такого товариша! І що з того, що батько отеє перед
- часом посивів, стараючись забезпечити твою долю, а той новий,
- миліш�