�рослава.

- Наші союзники,сказав понуро Тугар Вовк.

- Ах, се мусять бути монголи, про котрих прихід говорив народ з такою
- тривогою?

- Так, се вони!

- Нищителі руської землі!

- Наші союзники проти тих проклятих смердів і їх громадівства.

- Тату, се загибель наша! Як не стане хлопів, то хто буде кормити
- бояр?

- Не бійся, не вродилась іще та буря, що здужала б до кореня знищити
- те підле насіння!

- Але ж, таточку, монголи не щадять ні хати, ні двору, ні князівської
- палати!

Сам же ти не раз оповідав, як вони подушили князів під дошками.

- І се добре! Нехай їх душать, тих хитрих круків! Але боярина не
- задушили ніякого. Ще раз кажу тобі: се наші союзники!

- Але ж, таточку, ти хотів би входити в союз із тими дикунами,
- обагреними кров'ю нашого народ