�азав він лагідно,не жалуйся на мене! Горе наповнило
- гіркістю моє серце, гнівом налило мої думи. Але я знаю, що твоє
- серце щире золото, що ти не покинеш мене в днях тривоги й боротьби.
- Адже ж ми самі тепер на світі, ні до кого нам прихилитися, ні від
- кого ждати помочі, а тільки від себе самих.

Вибору не маємо. Берімо поміч, де її знайдемо!

- Таточку, таточку! говорила з слізьми Мирослава.Гнів проти тухольців
- засліпив тебе і пхає тебе до загибелі. Нехай і так, що ми
- нещасливі,а чи для того мусимо бути зрадниками свого краю? Ні, радше
- згинути нам із голоду під плотом!

- Молода ти ще доню, гаряча, палка, і не знаєш, як смакує голод, як
- смакує нужда. Я зазнав їх і хочу оберегти тебе від них. Не переч же
- мені! Ходи, їдьмо до цілі! Що буде, те буде, долі своєї не об'їдемо!

І він скочив на свого коня і шпигнув його острогами. Даремно Мирослава
хотіла спинити його - він погнав униз горою. Ридаючи, подалася за ним
і вона. В своїй непохитній дитячій вірі вона все ще думала, що зможе
охоронити батька від загибелі, від віковистої ганьби - від зради свого
краю. Вона, бідна, й не знала, як глибоко її батько був уже застряг у
тім огиднім багні, як безповоротно він уже впав у безодню, так, що для
нього справді не було іншого виходу, як падати глибше, аж до дна.

Чим дальше з'їздили в долину, тим густіше пітьма обкапувала їх, тим
менше могли що-небудь бачити, крім блимання огнищ і жевріння
віддалених пожеж.

Зате гомін і рик величезної юрби ставався чимраз голоснішим,
оглушаючим.

Дим виїдав їм очі, захапував віддих у грудях. Боярин простував до
першого огнища, що палало серед поля. Се була монгольська сторожа.
Наближаючись, вони бачили п'ять люда в кожухах, обернених волоссям
догори, в таких самих пелехатих острокінчастих ковпаках, з луками на
плечах і з топорами в руках.

Аж недалеко варти Мирослава дігнала батька й сіпнула його за рукав.

- Таточку, богом святим молю тебе, вертаймо відси.

- Куди?

- Ходімо до Тухлі!

- Ні, пропало вже! Підемо, але не з униженою просьбою. Підемо в гості
- і рад я побачити, чи твої Беркути посміють тепер виганяти нас!

В тій хвилі монголи почули прихід чужих людей і з диким криком
похапали за луки та окружили їх.

- Хто їде? закричали різними голосами, то по-нашому, то по-свому.

- Поклонник великого Чінгісхана! сказав по-мон-гольськи Тугар Вовк.

Монголи стали, витріщившії очі на нього.

- Ти відки, що за один, за чим приходиш? спитав один, очевидно,
- начальник сторожі.

- Не твоє діло,відповів остро на монгольській мові боярин.Хто веде
- вашу силу?

- Внуки великого Чінгісхана: Пета-бегадир і Бурун-да-бегадир.

- Іди ж і скажи їм, що «Калка-ріка по болоті тече і в Дон упадає». А
- ми на твій поворот пождемо коло огнища.

З рабським ушанованням розступилися монголи перед незнайомим
приїжджим, що говорив їх мовою та й ще таким певним тоном, до якого
вони привикли від своїх ханів та бегадирів. В одній хвилі начальник
варти здав своє місце на другого а сам, допавши коня, погнав до
табору, якої, може, чверть милі віддаленого від вартового вогнища.

Тугар Вовк і Мирослава позлазили з коней, яких дехто з вартових зараз
узяли, обчистили, напоїли й прип'яли на мужицькій, житом засіяній
ниві. Приїжджі гості приступили до огнища, гріючи над ним руки, в які
щипав їх весняний нічний холод. Мирослава тремтіла цілим тілом, мов у
лихорадці, вона була бліда

і не сміла піднести очей ка батька. Аж тепер, почувши з батькових уст
монгольську мову і побачивши, з якою пошаною монголи сповняли його
волю, вона догадалася, що батько її не віднині знається з тими
страшними нищителями рідної землі і що правдивою мусить бути та вість,
яка глухо шепталась при дворі князя Данила, немовто Тугар Вовк у битві
над Калкою зрадив Русь монголам, виявивши їм наперед цілий план битви,
уложений руськими князями. Правда,- говорили вісті,- доказу на те
певного нема, а то б бояринові прийшлось понести голову на колоду;
боярин стояв у битві в першім ряді і при першім замішанню взятий був
до неволі. Але дивним видавалось декому його швидке увільнення без
окупу, хоч боярин божився, що Монголії випустили його, шануючи ного
хоробрість. Діло було темне, а тільки те було певне, що при княжім
дворі всі почали якось сторонити від Тугара і сам князь не довіряв
йому так, як довіряв давніше. Боярин вкінці почув тоту зміну і
попросив у князя даровизни землі в Тухольщині. Не допитуючись, для
чого задумав боярин покидати Галич і для чого хоче закопатися в такій
лісистій пустині, та й ще з молодою дочкою, князь Данило дав йому
даровизну - очевидно, рад був його позбутися. І при від'їзді з Галича
якось холодно прощалися всі з боярином - довголітнім товаришем оружжя.
Все те згадала тепер в одній хвилі Мирослава, і все те, що тоді
дивувало й гнівало її, стало тепер ясне й зрозуміле перед її очима.
Так, значиться, вісті й шепти говорили правдуі Так, значиться, батько
її віддавна, від десятьох літ, був у порозумінню з монголами, був
зрадником! Мов придавлена, мов підкошена тою гадкою, похилила
Мирослава свою прегарну голову додолу. Серце її боліло дуже: вона
чула, як у ньому одна за другою рвалися найсильніші й найсвятіші нитки
- нитки дитячої любові й поважання.

Якою самітною, якою круглою сиротою чула себе вона тепер на світі, хоч
тут же коло неї сидів її батько! Якою нещасною чула вона себе тепер,
хоч батько недавно ще запевнював її, що все робить для її щастя!

Але й боярин сидів тепер якийсь невеселий: його рішуче серце тисли,
очевидно, якісь важкі думи. Не знати, про що думав він, але його очі
гляділи, не змигаючи, в полум'я огнища, слідили уважно за тим, як
догорали червоні, мов розжарене залізо, поліна, як тріскали в огні,
злизувані полум'ям. Чи се було спокійне думання чоловіка, що дійшов до
своєї мети, чи, може, яке тривожне прочуття будущини холодною рукою
вхопило його за серце і печать мовчання положило на його устах? Тільки
ж і він, старий розважний чоловік, уникав погляду

Мирослави, лише глядів і глядів у огнище на миготячі іскри та
попеліючі поліна.

- Доню! сказав він вкінці стиха, не підводячи на неї очей.

- Чому ти вчора не вбив мене, тату? прошептала Мирослава, насилу
- здержуючи сльози в очах. Голос її, хоч тихий, дунув на боярина
- ледовим холодом. Він не знайшов на те питання відповіді, і мовчав, і
- вдивлювався в огнище, поки не прибіг вартівник із табору.

- Внуки великого Чінгісхана шлють свій привіт новому другові і просять
- його до свого шатра на воєнну раду.

- Ходімо! сказав коротко боярин і піднявся з місця.

Мирослава встала також, але ноги її відмовляли послуху. Та не час було
тепер вертатися. В одній хвилі монголи привели їх коней, висадили
Мирославу і, окруживши їх обоє, повели до табору.

Монгольський табір був розложений у величезнім чотирикутнику і
обкопаний глибоким ровом. В кождім боці чотирикутника було по
дванадцять входів, окружених оружною вартою. Хоч неприятель ніякий не
грозив таборові, то все- таки його стережено чуйно - таке вже було
воєнне правило монголів, зовсім у суперечність із християнським
рицарством, яке не дорівнювало монголам ані в військовій карності, ані
в умілості тактики та кер-мовання великими масами.

Вартові при вході табору дикими голосами перекликалися з вартовими, що
вели боярина з донькою, а потім перейняли незвичайних гостей і повели
їх до шатра своїх начальників. Хоч і як придавлена була Мирослава
своїм болем і стидом, що випалював гарячі рум'янці на її дівочім лиці,
то все ж вона була надто смілої вдачі, надто свобідно і по-рицарськи
вихована, щоб не зацікавитися розкладом табора і всім новим та
невиданим окруясен-ням. Бистрим оком окинула вона пооводжаючих її
вартових. Низькі, підсадкуваті їх постави, повбирані в овечі кожухи,
через які перевішений був у кождого лук і сагайдак зі стрілами,
виглядали мов медведі або які інші дикі звірі. Лице без заросту, з
вистаючими вилицями і підочними кістьми, з маленькими і глибоко
впалими очи. ма, що ледве блищалися з вузьких, скісно прорізаних
повік, з невеликими приплесканими носами, виглядали якось гидко,
відразливе, а жовтава їх барва, що в відблиску огнищ переливалася в
якийсь зеленкуватий відтінок, робила їх

іще страшнішими та відразливішими. З похнюпленими додолу головами і з
горляною, співучою мовою, вони подобали на вовків, що шукають, кого б
пожерти. Шатра їх, як Мирослава зблизька приглянулася, зроблені були з
войлоку, розп'ятого на чотирьох жердках, зв'заних угорі докупи, і
накриті були вверху для забезпеки від дощу великими шапками з кінської
шкіри. Перед шатрами стояли на жердках понастромлювані людські голови,
кроваві, з застиглим виразом болю і розпуки на блідих, посинілих,
світлом огнищ дивовижно освічених лицях. Холодний піт виступив на чоло
Мирослави На сей вид; її, геройську, смілу дівчину, не мучила думка,
що швидко й її голова так само стримітиме де-будь перед шатром якого
монгольського бегадира. Та ні, вона воліла б тепер тліти в пожежі і
стриміти як кро-вавий трофей перед шатром побідителя, аніж своїми
живими очима оглядати ті трофеї, з яких кождий недавно ще був живим
чоловіком, думав, працював і любив,- аніж іти здовж оцього страшного
табору на безчесне, зрадницьке діло!

«Ні, ні,-думалось їй,-не буде того. Я не піду дальше! Я не стану
«зрадницею свого краю! Я покину батька, коли не зможу відвести його
«від його проклятого наміру».

Тим часом вони станули перед шатром начальника чети, любимця
Батиєвого.

Шатро не відзначувалося від інших шатрів зверха нічим, окрім прип'ятої
на його вершку жердки з трьома бунчуками; зате всередині було далеко
пишніше, по- азіатськи уладжене. Тільки ж ані боярин, ані Мирослава до
середини шатра не входили, бо начальників монгольських застали перед
шатром, коло огнища, на котрім невільники пекли двох баранів. Поба-
чивши гостей, начальники схопилися всі враз на рівпї ноги і похапали
до рук свою зброю, хоч, впрочім, не поступилися з місця, щоби стрічати
їх. Знаючи монгольський звичай, боярин кивнув доньці, щоб лишилась
позаду, а сам, знявши з голови шолом, а з плечей лук, приступив до них
з поклоном і став мовчки, з похиленими до землі очима, на три кроки
перед головним начальником Петою.

- Від якого царя приносиш нам вісти? спитав його Пета.

- Я не знаю ніякого царя, крім великого Чінгісхана, пана всього світу!
- сказав боярин. Се була звичайна формула піддання. Пета тоді поважно,
- але радо простяг бояринові руку.

- В пору приходиш,сказав Пета,ми дожидали свого союзника.

- Я знаю свій обов'язок,сказав Тугар Вовк.В однім лишень я переступив
- ваш звичай: я привів доньку свою до табору.

- Доньку? сказав зачудуваний Пета.Хіба ж ти не знаєш, що звичай наш
- забороняє женщинам вступати в збір вояків?

- Знаю. Але що ж я мав зробити з нею? У мене нема дому, ні родини, ні
- дружини! Крім мене і великого Чінгісхана, вона не має ніякої опіки!
- Мій князь рад був позбутися мене зі свого міста, а ті прокляті
- смерди, мої невольники, збунтувалися против мене.

- Але все ж таки тут вона не може лишитися.

- Я прошу внуків великого Чінгісхана позволити їй лишитися нинішню ніч
- і завтрашній день, поки не винайду для неї безпечного пристановища.

- Для другів наших ми гостинні,сказав Пета, і потім, обертаючись до

Мирослави, він сказав ламаною руською мовою:

- Зблизись, дивчина!

Мирослава аж затремтіла, почувши ті звернені до себе слова страшного
монгольського начальника. Повними ненависті й погорди очима гляділа
вона на того нищителя Русі, зовсім не слухаючи його слів.

- Зблизись, Мирославе! сказав її батько.Великий начальник
- монгольського війська ласкавий до нас.

- Не хочу його ласки! відказала Мирослава.

- Зблизись, розказую тобі! сказав грізно боярин. Мирослава неохітно
- зблизилася.

Пета своїми малими блискучими очима поглянув на неї.

- Гарни дивчина! Жаль, що не остатись. Гляди, дивчина, на свій тат.
- Будь вірна велики Чінгісхан. Велика лас ка буде! На тоюі, дівчина,
- отсе коко, з вашого князь Мстислав. Знак безпеки. Покажи монгольськи
- вояк усі пропустить, нічого злого не зробить. А тепер до шатра?

З тими словами Пета подав Мирославі зі свого пальця великий золотий
перстень, здобутий ним у битві над Кал-кою з князя Мстислава. На
перстені буз великий золотисто-зелений берил із вирізаними на нім
фігурами. Мирослава вагувалася, чи прийняти дар від ворога,- може,
навіть заплату за батькову зраду.

- Візьми, доню, сей знак від великого внука Чінгіс-хана,сказав
- боярин.Се знак його великої ласки для тебе, дає тобі безпечний
- прохід у монгольськім таборі.

Нам-бо прийдеться розстатися, доню. їх воєнний звичай забороняє
женщинам бути в таборі. Але з тим пер amp;тенем ти можеш безпечно
приходити і виходити, коли тобі запотребиться.

Мирослава ще вагувалась. Але, втім, нова якась дума шибнула їй у
голову - вона взяла перстень і, відвертаючись, уриваним голосом
сказала:

- Дякую!

Потім Пета велів відвести її до окремого шатра, котре наборзі
приготовано для її батька, а Тугар Вовк лишився сам з монгольськими
бегадирами, щоб радити воєнну раду.

Перший забрав голос Пета, головний начальник сього відділу, чоловічок
літ коло сорока, тип монгола: невеличкий, повертливий, з хитро
мигаючими малими, мов мишачими, очима.

- Сідай, гостю,сказав він до боярина.Коли скажем тобі, що ми дожидали
- тебе, то нехай се буде найвища похвала твоєї вірності для великого
- Чінгісхана. Але все-таки ти троха запізно прийшов. Військо наше жде
- вже третій день, а великий

Чінгісхан, виправляючи нас на захід, до краю рабів своїх Арпадів,
наказував нам довше трьох день без потреби ніде не задержуватись. Брат
наш, Кайдан-бегадир, що пішов через край волохів, буде перед нами в
домі Арпадів, здобуде їх столичне місто, а яку ж славу ми принесемо з
того походу?

На те сказав боярин:

- Я порозумів слова твої, великий бегадире, і ось що відповім на них.
- Вірний слуга великого Чінгісхана не міг швидше прибути до вашого
- табору, бо аж учора дізнався про ваш похід, а дізнавшися, прибув
- зараз. Про задержку не журися. Шляхи наші хоч неширокі, але
- безпечні. Брама в царство Арпадів стане вам отвором, лиш тільки
- застукайте.

- Які шляхи і в чиїх руках? спитав коротко Пета.

- Один шлях дуклянський, горі Саном-рікою, а потім через низький
- гірський провал. Шлях широкий і вигідний, топтаний уже не раз
- руськими й угорськими воєнними силами.

- Далеко відси?

- Відси до Перемишля два дні ходу, а з Перемишля до гір іще два дні.

- Хто стереже?

- Стережуть його нашого князя бояри, що на нім поробили засіки. Але
- бояри нерадо служать князеві Данилові Романовичу, нерадо стережуть
- засіків. Мала обіцянка склонить їх на сторону великого Чінгісхана.

- Але чому ж досі ми нікого з них не бачили в нашім таборі? спитав
- Пета.

- Годі їм, великий бегадире. Народ, серед якого вони живуть і який
- мусить поставляти оружних людей для оборони засіків, нерадо зносить
- їх вдасть над собою. Дух бунту і непокори живе в народі. Серце його
- тужить за давніми порядками, де не було ні князів, ні власті, де
- кожда громада жила для себе, а против спільного вороге всі дружилися
- по добрій волі і вибирали та скидали свою старшину. В отсих горах
- живе один дід, що його прозвали бесідником, і той роздуває полум'я
- непокори в ім'я тих старих порядків. Народ глядить на бояр, мов
- пастухи на вовка, і скоро би тільки побачив, що бояри тягнуть у
- сторону великого Чінгісхана одверто, то побив біі їх камінням. Коли
- ж за приближенням вашої сили бояри піддадуться вам і віддадуть вам
- засіки, народ пирсне, як полова від вітру.

Пета слухав уважно бесіди боярина. Насміх і погорда заблискотіли на
його тонких губах,

- Дивні ж у вас порядки! сказав він.Князь бунтує против своїх слуг,
- слуги проти князя, князь і слуги против народу, а народ против
- усякої власті! Дивні порядки! У нас коли дрібні ватажки хотіли
- бунтувати проти великого

Чінгісхана, то той згромадив їх до свого аулу і, окруживши аул своїми
вірними синами, велів настановити вісімдесят великих кітлів на грані і
налити їх водою, а коли вода закипіла, то, не розбираючи нічиєї вини,
велів у кождий котел вкинути по два бунтівники і варити їх так довго,
поки тіло зовсім не відкипіло від кості. Тоді велів повиймати голі
кістяки з котлів, посадити їх коней і повідводити до підвладних їм
племен, щоб ті на примірі своїх ватажків училися послкху і покори
великому Чінгісханові. От так би і вас її вчити. І ми навчимо вас її.
Дякуйте богам, що зіслали нас до сього краю, бо коли б не ми, то ви,
певно, мов ті голодні вовки, пожерли б одні других.

Кров постила бояринові в тілі при тім оповіданню монгола, але він ні
словечка не відказав на се.

- Ну. а який же ваш другий шлях? спитав дальше Пета.

- Другий шлях тухольський,відповів боярин,хоч вужчий і не такий
- рівний, але зате ближчий і рівно безпечний. На тім шляху засіків
- нема, ані княжих бояр нема. Самі хлопи пильнують його.

- Хлопів ваших ми не боїмося! сказав з погордою Пета.

- І ніщо їх боятися,підхопив боярин.Вони ж без оружжя і без умілості
- воєнної. Тим шляхом я сам можу вам бути провідником.

- Але, може, на арпадській стороні ті шляхи сильно замкнені?

- Тухольський не замкнений зовсім. Дуклянський замкнений, але не дуже
- сильно.

- А довга дорога тухольським шляхом до краю Ар-падів?

- Для оружних мужів до Тухлі день ходу. В Тухлі переночувати, а разом
- зо світом у дорогу, і на вечір будете вже на рівнині.

- А дуклянським?

- Вчисляючи, кілько часу треба на понищення засіків, три дні ходу.

- Ну, то веди нас тухольським! сказав Пета.

- Дозволь мені слово сказати, великий бегадире,сказав один із
- начальників монгольських, мужчина величезного росту й геркулесової
- будови тіла, а лицем темно-оливкової барви, одітий у шкуру степового
- тигра, що все разом аж надто свідчило про його походження з тур-
- команського племені. Се був страшний, безтямно смілий і кровожадлия
- воновник, Бурунда-бегадир, супірник у славі з

Кайданом. Монгольські загони, які він провадив, лишали по собі
найстрашнішу руїну, найбільше число трупів, найширшу ріку пожеж. Він
безмірно переви-щав

Пету своєю відвагою; перед його шатром кождого вечора було два рази
більше свіжих голів, ніж перед шатром усякого іншого вояка. Але Пета
не завидів йому тої смілості, чуючи надто добре свою перевагу над
Бурундото в штуці ведення великих мас і кермовання великими битвами та
походами. Він радо пускав

Бурунду на найнебез-печніші місця, держав його в запасі на найтяжчу,
рішучу хвилю, немов непоборний залізний таран,- а тоді пускав його з
відділом

«кровавих туркоманів» довершувати побіди.

- Говори, брате Бурундо! сказав Пета.

- Дозволь мені з десятитисячним відділом іти ту-хольським шляхом, а ти
- сам простуй на дуклянський. Перейшовши на арпадський бік, я вдарю
- зразу на тих, що стережуть дуклянського шляху, і прорівняю тобі
- дорогу.

Пета з подивом глянув на Бурунду, немов се перший раз вирвалось тому
рубаці з уст таке розумне слово. І справді, план Бурунди був хоч і
смілий, та зате дуже розумний, і Бурунда був єдиний смільчак до
виконання сього плану.

- Добре,сказав Пета,нехай буде по-твойому! Вибирай собі вояків і рушай
- з ними зараз завтра.

- Позвольте ще й мені слово сказати, великі бегади-ри,сказав Тугар
- Вовк.

- Говори! сказав Пета.

- Коли воля ваша слати часть своєї сили тухольським шляхом,а всеї
- задля тісноти шляху й я не радив би слати,то позвольте мені піти
- наперед, з невеличким відділом і зайняти вхід того шляху, заким іще
- тухоль-ські смерди дізнаються про ваш прихід і завалять його
- засіками.

- Добре, йди! сказав Пета.Коли хочеш вирушити?

- Зараз, щоб іще завтра на південь сповнити своє діло.

- Коли так, то нехай буде конець нашій раді і нехай боги щастять нашій
- зброї! сказав Пета, встаючи з місця. Встали й інші начальники. Тугар
- Вовк просив

Пету, щоб визначив для нього відділ смілих мужів, а сам пішов до шатра
покріпитися і попрощатися з донькою.

В темнім шатрі на ліжку, покритім м'якими зрабова-ннми перинами,
сиділа

Мирослава і гірко плакала. По всіх страшних і несподіваних вражіннях
сього вечора вона аж тепер мала час зібрати свої думки, розглянути
добре своє теперішнє положення, в яке втягнув її батько. Положення те
було справді страшне, бачилось навіть - безвихідне. Батько її -
зрадник, монгольський слуга; вона-в монгольськім таборі, напівгість,
напівбранка, а на всякий спосіб кругла сирота. Бо навіть остання її
підпора - непохитна віра в свій пророчий сон, в благословення матері і
в своє любовне щастя з Максимом, - і тота віра тепер, при холодній
розвазі, зачала похитуватись, кровавлячи їй серце. Бо яким лицем стане
вона тепер перед Максимом? Якими словами розповість йому про свій -
добровільний чи недобровільний? - побут у монгольському таборі? Мов
гадюки, вертіли її серце ті питання, і вона дала сльозам волю і
плакала мов з життям своїм прощалася.

Батько тихими, тривожними кроками приступив до неї, положив руку на її
плече,- вона не підводила голови, не рушалась, не переставала плакати.

- Доню Мирославе,сказав він,не плач! Дасть бог, усе ще добре буде!

Мирослава мов не чула нічого, сиділа недвижне, холодна, безучасна.

- Забудь того смерда! Гарна будучність чекає тебе, а він… Що він?
- Завтра в полуднє він упаде трупом від мойого меча.

- Хто? скрикнула Мирослава роздираючим серце голосом.

Боярин злякався того голосу і відступився від дочки, що зірвалась на
рівні ноги.

- Хто впаде трупом? повторила вона.Він, Максим? Ти ведеш напад на
- Тухлю?

- Та ні, ні! відпекувався боярин.Хто се сказав тобі?

- Сам ти сказав! наставала на нього Мирослава.Тату, скажи мені правду,
- що задумуєш? Не бійся за мене! Я тепер і сама вже добре бачу, що не
- можу бути

Максимова, через тебе не можу бути! О, ти розумний, ти хитрий! Ти
допровадив до свого! Не для того я не можу бути Максимова, що вища від
нього родом,- о ні! Я нижча від нього, я чую себе безмірно нижчою від
нього, бо він чиста, чесна душа, а я дочка зрадника, може, й сама
зрадниця? Так, тату! Ти дуже хитрий, такий хитрий, що аж себе самого
перехитрив! Ти кажеш, що мого щастя бажаєш, а ти вбив моє щастя. Але
нехай і так! Що з мене за хосен? Тільки скажи мені, що ти задумуєш
напротив нього?

- Але ж нічого, зовсім нічого! Він тепер, може, вже десь далеко в
- горах.

- Ні, ні, ні, не вірю тобі! Скажи мені, що ви урадили з монголами?

- Говорили про те, куди йти на Угри.

- І ти їм хочеш видати тухольський шлях, щоби по-мститися на
- тухольцях!

- Дурна дівчино, що мені мститися на них! Задрібні вони для моєї
- месті. Я хочу перепровадити монголів на Угри, бо чим скорше підуть
- із нашого краю, тим менше тут руїн нароблять.

- О, певно, певно! скрикнула Мирослава.Але з поворотом доруйнують, що
- тепер лишать ціле! І ти ведеш їх на Тухлю, тепер, зараз?

- Ні, не на Тухлю. Я веду тільки один малий відділ, щоб обсадити вхід
- до Тухлі.

- Хто має браму, той має й хату! Але розумію тепер! Ти ж сам сказав
- недавно он там, на горі, що завтра Максим має з тухольськими
- молодцями валити наш дім.

А ти хочеш з монголами напасти на нього, вбити його…

Боярин видивився на неї зачудуваними очима; він почав боятися, чи не
відьма вона, що так страшно бистро вгадувала, в чім діло.

- Доню, забудь за нього! сказав він.Яка доля йому судилася, така й
- буде.

- Ні, тату, тим ти не зведеш мене! Я їду, їду до Тухлі, я остережу
- його, спасу його від твоєї засідки! А коли в неї попадеться, то я
- стану обік нього і буду боронитися разом з ним, до остатнього скону,
- проти тебе, тату, і твоїх поганих союзників!

- Дівчино, ти божевільна! скрикнув боярин.Уважай, не доводи мене до
- гніву!

Се хвиля рішуча.

- Що мене обходить твій гнів! відказала холодно Мирослава.І що ти мені
- можеш іще більше злого зробити після того, що зробив досі? Коли
- уб'єш мене, то се буде тільки добродійство, бо й так мені не жити.
- Пусти мене!

- Ні, лишись тут, нерозумна!

- Так, лишись тут, поки ти спокійно не замордуєш того, хто дорожчий
- мені над життя моє! О ні, я не лишусь!

- Лишись! Богом клянусь тобі, що не підійму руки своєї на нього!

- О, знаю, знаю, що се значить! скрикнула Мирослава.-Ну, розуміється,
- ти боярин, де ж би ти піднімав руку на смерда. Але своїм диким
- товаришам велиш усі затроєні стріли націлити на його груди!

- Ні! Коли вже таке твоє над ним милосердя, то ще раз клянусь тобі, що
- ані я, ані ніхто з моєї дружини не ткне його, хоч би він не знати як
- нападав на нас! Досить тобі сього?

Мирослава стояла, шарпана страшною сердечною тривогою, і не могла
нічого більше сказати. Хіба ж вона знала, чи досить сього, чи ні? О,
як радо була б вона пташкою злетіла до нього, щирим щебетанням
перестерегла його! Але годі було.

Батько її взяв свою зброю і, виходячи з шатра, сказав:

- Доню, ще раз кажу тобі і заклинаю тебе: лишись у таборі, поки я не
- вернусь, а тоді роби собі, що твоя воля буде. А тепер прощай.

Він вийшов, і заслона з войлока, що служила замість дверей, неспокійно
захиталася за ним. З заломаними руками, образ найтяжчого горя і
найстрашнішої тривоги, стояла Мирослава насеред шатра німа, перехилена
наперед, з створеними устами, ухом ловлячи остатній стук кінських
копит, що глухли й німіли по мірі того, як віддалявся на полуднє
відділ монголів, ведений батьком на загибель Тухольщини.




V


З важким серцем ішов Максим Беркут посеред невеличкої ватаги
тухольських молодців на сповнення громадської волі. Відмалку виріс він
у глибокім почуванню своєї єдності з громадою і святості громадської
волі, тож і тепер, коли зовсім не впору для його серця на нього впав
почесний вибір громади - прогнати з громадських земель ворога громади,
якого бачили тухольці в боярині,- і тепер він не смів відмовитись від
того поручен-ня, хоч серце його рвалося і краялось на саму думку, що
буде мусив стрітися з Мирославою, з її батьком як з ворогами, що буде,
може, мусив боротися з боярськими лучниками або і з самим боярином,
проливати кров людську в очах тої, за котру він сам готов був свою
кров пролити. Правда, він твердо рішився зробити своє діло як можна
найспокійніше і не доводити його аж до проливання крові, але хто ж міг
йому заручити, що боярин, знаючи його слабу сторону, сам не буде
шукати зачіпки? Се легше могло бути, як що.

«Але ні,- думав собі Максим,- коли схоче моєї крові, я не буду
«боронитися, я надставлю йому свої груди добровільно, нехай б'є! Життя
«він не хоче мені дати, то нехай дає смерть! Прощай, моя Тухольщино!
«Прощай батьку мій, соколе сизий! Прощайте, браття і товариші мої! Не
«побачите вже Максима, а почувши про мою смерть, посумуєте і скажете:
«Згинув для добра громади!» Але ви не будете знати, що я сам бажав і
«шукав смерті!»

Так думав Максим, наближаючись до будинків боярських на горбку над

Опором. Дім боярина збудований був із грубих, у чотири гранки гладко
обтесаних і гиблем на споєннях вигладжених ялиць, будованих в угла,
так, як тепер ще будують наші сільські хати. Покритий був грубими
драницями, обмазаними зверха грубою верствою червоної, в воді не
розмокаючої глини.

Вікка, як і у всіх хатах, обернені були на полуднє; замість шибок
понапинані були на рами волові міхури, що пропускали слабе жовтаве
світло досередини.

Входові двері спереду і ззаду вели до просторих сіней, яких стіни
обвішані були всіляким оружжям, оленевими та жубровими рогами, шкурами
з диків, вовків і медведів. З сіней на оба боки вели двері до кімнат,
просторих, високих, з глиняними печами без коминів і з дерев'яними,
гарно вирізуваними полицями на всяку посуду. Одна світлиця бояринова,
а друга, по другім боці сіней,- його доньки. Ззаду були дві широкі
комори: в одній кухня, в другій - служебна. В світлиці боярина стіни
були обвішані шкурами мед-ведів, тільки над постіллю висів дорогий
заморський килим, здобутий боярином у якімсь поході. Там же висіли
його луки, мечі й інша підручна зброя. Світлиця ж Мирослави була, крім
м'яких шкур по стінах і помості, пристроєна в цвіти, а на стіні
навпроти вікон, над її ліжком, висіло дороге металеве дзеркало і обік
нього дерев'яний, сріблом окований чотириструнний теорбан, любий
повірник Мирославнних мрій і дівочих дум. Віддалік від дому, на
невеличкій долині, стояли стайні, стодоли й

інші господарські будинки; там також була невеличка хата для скотарів.
Але пусто і глухо було сьогодні в просторім боярськім домі. Боярина і
Мирослави нема дома, слуг боярин повідправляв, худобу велів перегнати
до череди сусіднього, корчинського, осадника; тільки лучники й
топірники лишилися, та й ті якісь невеселі, не гомонять, не жартують,
ані пісень не співають. Мабуть, важніше якесь жде їх діло, бо беруть
луки і стріли, топори й списи, а все те мовчки, сумовито, мов на
смерть готуються. Що се такого?

Та ось один, що стояв серед шляху, мов на сторожі, дав знак трубою,- і
в повній зброї всі дружинники стали в ряд перед боярським дот.юм,
піднявши списи, нап явши луки, мов до битви. По шляху надійшла
тульська ватага і. побачивши оружних людей перед бояр-ським домом,
почала й собі готовитися до бою

Тривожними очима позирнув Максим на оружних людей, чи нема між ними
боярина. Але, на щастя, боярина не було. Відітхнув Максим, немов гора
з грудей його звалилася, і сміліше почав порядкувати свою ватагу Се й
недовго часу забрало, і мовчки, з понатяганими луками, з блискучими
топорами і списами тухольці зближалися в ряді до боярських
дружинників. Не дальше як на п'ятдесят кроків одні від других
зупинилися.

- Боярине Тугаре Вовче! кликнув голосно Максим.

- Нема боярина Тугара Вовка! відповіли дружинники.

- Так ви, вірні його, слухайте, що я скажу вам від імені тухольської
- громади!

Післала нас громада, щоб прогнати вас волею чи неволею з тухольських
земель по засуду громадському. Питаємо вас: чи вступитесь по волі, чи
ні?

Дружинники мовчали.

- Питаємо другий раз! сказав Максим. Дружинники мовчали, не спускаючи
- луків.

- Питаємо третій раз! сказав, підносячи голос,

Максим.

Дружинники мовчали, але стояли недвижне в своїй ворожій поставі. Дивно
було

Максимові, що се має значити, але, не зупиняючись довше, він велів
своїм молодцям випустити стріли на дружинників. Стріли засвистіли, мов
змії, і, перелетівши понад головами дружинників, повбивалися в стіну.
В тій хвилі дружинники, мов на даний знак, кинули зброю на землю і з
простягненими руками ступили напроти тухольських молодців.

- Товариші, браття! сказали вони.Не прогнівайтесь на нас за нашу
- мовчанку.

Ми дали слово бояринові, що стрітимо вас ворожо, але ми не давали йому
слова проливати вашу кров, і проливати її за неправду. Ми були при
суді громадськім

і знаємо, що боярин скривдив громаду і що громадський суд
справедливий.

Робіть, що вам повелено, і, коли буде ласка батьків ваших, ми будемо
просити

їх, щоб прийняли нас до своєї громади. Не хочемо більше служити
бояринові!

Радість тухольців, а особливо Максима, коли почули ті слова, була
безмежна.

Зараз усі поскидали оружжя на купу перед боярським домом і серед
голосних веселих криків обіймали й цілували своїх нових і несподіваних
товаришів, з якими перед хвилею думали вступити в смертельний бій.
Максим найдужче рад був тому, що його побоювання не справдилося, що
йому не довелось перед очима Мирослави поборювати її батька і прого-
нювати на незвісні шляхи ту, з якою рад би був ніколи не розстатися.
Радість сумирного закінчення сеї немилої справи на хвилю заглушила в
нім усякі інші непевності. В товаристві веселих боярських дружинників
увійшли тухольці до боярського дому, все з зацікавленням оглядаючи,
хоч нічого не тикаючи. З сердечним трепетом наближався Максим до
світлиці Мирослави, надіючись тут стрітити її в сльозах або в гніві,
бажаючи щирим словом потішити, заспокоїти її. Але Мирослави не було в
світлиці, і се затурбувало Максима. «Де вона?» -подумав він і зараз
надумав спитати про се дружинників, що тим часом вешталися,
приготовуючи на радощах для своїх тухольських гостей братерську
гостину. Але відповідь дружинників на його питання зовсім не вдоволила
й не заспокоїла Максима.

Боярин учора рано виїхав з донькою, але куди, за чим, коли верне - не
знати.

Велів їм виступити вороже проти тухольців, але, чи то побачивши їх
понурі неохочі лиця, чи то, може, повзяв-ши яку іншу думку, урвав
бесіду й від'їхав. От

і все, що дізнався Максим від нових союзників. Очевидна річ, що такі
вісті мусили відразу закаламутити його чисту радість, ба навіть кинути
тінь якогось підозріння на дружинників. Що се таке? Чи не криється в
тім яка зрада? Чи не хоче боярин зловити їх у яку засідку? Але, не хо-
тячи всім уголос виявляти свого підозріння, Максим шепнув тільки
деяким із своїх товаришів, щоб малися на бачності, а сам почав пильно
і уважно переглядати весь дім від гори аж до долу, не минаючи ні одної
скритки, ні одного закамарка. Ніде не було нічого підозреного.

- Гарна будова! сказав Максим до дружинників, що заставляли столи.Але
- що ж, ми мусимо її розібрати. Звісна річ, ми не будемо її ні валити,
- ні палити, але зложимо все порядно на купу, щоб боярин, коли
- запотре-бує, міг собі все те забрати. І все добро його мусить бути
- йому схоронене в цілості.

Тим часом дружинники повиносили до сіней велиш дубові столи із
світлиці, прикрили їх білою скатертю і заставили всілякою стравою й
медом. Серед радісних окликів і співів почалася гостина. Тільки ж чим
довше сиділи молодці за столами, чим більше їли й пили, тим більше
щезала якось їх радість і веселість. І хоч мед пінився в точених
дерев'яних кубках, хоч м'ясо, печене на рожнах, димилось на дерев'яних
тарілках, хоча щирі, товариські слова гомоніли від одного кінця стола
до другого, то все-таки таємно тремтіли чогось усі серця, немов
дожидали якоїсь страшної вісті. Дивна недослідна, а всім чутна тривога
висіла в повітрі. Чи стіни боярського дому давили вільних громадян?..

Ось устав один із боярських дружинників і, піднімаючи вгору кубок,
повен пінистого меду, почав говорити:

- Браття! Радісний сей день для нас, і щоб ніяка лиха пригода…

Але не скінчив. Разом поблід і затремтів цілим тілом. Усі бенкетарі
напруго посхапувались і, вискакуючи хто куди міг, перевернули стіл з
усіма кубками і стравами.

- Що се? Що се? крикнули всі нараз і поперлися до дверей. Хоч і як
- дрібний на око і мало значучнй був знак глухий стук кінських копит,а
- прецінь якого безмірного переполоху наробив він у боярськім домі!
- Одну хвилю дійсне пекло було в сінях: сей біг туди, той сюди, сей
- шукав того, той сього, а всі мішалися і товпилися без ладу, топчучи
- по кубках і стравах, по білій скатерті і по дубовім переверненім
- столі. Максим перший вирвався надвір із тої замішанини і, раз тільки
- кинувши оком довкола, пізнав усю велич небезпеки.

- До зброї, браття, до зброї! Монголи! Монголи! Той крик був мов
- наглий удар грому. Всі стали мов мертві, безладна сумішка
- перемінилася на безладне остовпіння. Але й се тривало тільки хвилю.
- Стукіт кінських копит розлягався все ближче і ближче, а неминуча
- небезпека разом обудила всіх із мертвоти!

Адже ж усі були смілі, сильні, молоді! Адже ж кождий із них не раз у
своїх дитячих і молодечих снах бачив себе в битві, в небезпеці, в
кровавій боротьбі з ворогом, і бажав, і молився, щоб сон стався явою,
щоб довелось йому колись ставати грудьми в обороні свого краю. І ось
хвиля надійшла - і вони ж мали б її перелякатися? Тільки на хвилю
оглушила їх страшна вість, страшна назва

«монголи»,- в найближчій хвилі вони вже були тим, чим були звичайно:
«вже кождий держав у руках свою зброю, стояв у ряді поруч з іншими,
«готовий до кровавого бою.

- Головне діло наше, товариші, держатися сих стін. Поки ворог не випре
- нас від сього дому і не окружить на вільнім полі, поти не маємо чого
- боятися. Дім сей то буде наша твердиня!

І він розставляв лучників коло вікон, коло дверей по два і по три, як
до важності й доступності місця. Деякі мали бути внутрі дому, щоб
доносити з боярського складу лучникам стріл і рогатин, головна ж сила
мала стояти при входових дверях, щоб, у разі потреби, проломити ряди
напасників і відбити їх від дому.

А тим часом монголи на ріні над Опором зупинилися, позлазили з коней
і, розділившися на три відділи, рушили під горбок трьома стежками.
Очевидно, провадив їх хтось добре знайомий зі стежками й ходами, бо
цілий той маневр відбувся швидко, без вагання, без довшої запинки.
Маневр той показував ясно, що монголи хотіли зі всіх боків обійти й
окружити дім відразу.

Але хто се йде так завзято на чолі середнього, головного, відділу
монголів?

Глядять товариші і очам своїм віри не ймуть. Се не хто другий, як сам
властитель сього дому, гордий боярин Тугар Вовк.

- Наш боярин! Наш боярин! скрикнули деякі дружинники, яких Максим, не
- довіряючи їх щирості, поставив у ряди всуміш із тухольцями.

- Так, ваш боярин монгольський слуга, зрадник своєї батьківщиниі Невже
- ж ви й тепер іще схочете додержувати йому вірности?

- Ні, ні! скрикнули дружинники однодушно.Смерть зрадникові! Розіб'ємо
- вражу ватагу або самі погинемо в обороні свого краю.

Урадуваний тою заявою, сказав Максим:

- Простіть, браття! Одну хвилю я несправедливо судив вас, думаючи, що
- ви в змові зі своїм боярином. Але тепер бачу, що кривду робив я вам.
- Держімося разом, близько стін, так, аби не могли нас окружити, і
- стараймося завдавати їм якнайбільше страти. Монголії, як я чув,
- недобре вміють вести облогу, а ще в такій невеличкій силі. Чей, нам
- удасться відбити їх напад.

Бідний Максим! Він старався в інших вмовити надію, яка у нього самого
почала щезати від першої хвилі, коли тільки побачив монголів, і то тим
більше тепер, коли переважна їх сила вповні розвернулася перед очима
обля-жених. Але все- таки його слова мали велику вагу в його
товаришів, що не раз уже мали нагоду переконатися про його притомність
духу й оглядність в часі найбільшої небезпеки. Сліпо полягаючи на його
словах і розказах, кождий дбав лише про те, щоб пильнувати свого місця
до крайньої можності, знаючи добре, що й сусіднє місце буде так само
пильноване.

Та ось монголи широким колесом у три ряди обступили вже дім боярський
і кам'яні стріли на своїх луках держав? вже намірені на смілих
обляжених молодців. Тільки що начальник не дав іще знаку до бою.
Начальник, бачиться, хоче попереду пробувати ще намови, бо ось він
виступив з-поміж рядів наперед против головного відділу обляжених і
каже:

- Раби невірнії! Погані смерди! Невже ж зухвалість ваша така безмежна,
- як і ваша дурнота, що ви хотіли би піднімати оружжя на військо
- великого

Чінгісхана, нині безперечного пана всеї Русі? Піддайтеся йому без бою,
то він помилує вас. Але ті, що захотять опиратися його силі, будуть
нещадно роздавлені, як хробаки під колесами воза.

На таку мову голосно і сміло відповів Максим Беркут:

- Боярине! Дуже не впору назвав ти нас, синів вольної громади, рабами!
- Ти поглянь на себе! Може, до тебе така назва борше пристане, ніж до
- нас. Адже до вчора ще був ти раб княжий, а нині ти вже раб великого
- Чінгісхана і, певно, полизав молоко, розлите по хребті коня якогось
- його бегадира. Коли воно тобі смакувало, то ще з того не виходить,
- щоб і ми були ласі на нього. Великої сили великого Чінгісхана ми не
- лякаємось. Вона може нас зробити трупами, але не зробить нас рабами.
- А тебе, боярине, вся сила великого Чінгісхана не зробить уже ані
- вольним, ані чесним чоловіком!

Остра і різка була бесіда Максимова. Іншим часом він уважав би на те,
що перед ним батько Мирослави, але тепер він бачив тільки ворога - ні,
зрадника, чоловіка, що потоптав сам свою честь, котрому, проте, ніяка
честь не належиться. Голосно радувались товариші, почувши таку
Максимову мову. А боярин аж пінився зо злості.

- : Хлопе поганий! - кричав він.- Жди лишень, я тобі покажу, що
- : завчасно ти похвалявся своєю вільністю! Нині ще кайдани забряжчать
- : на твоїх руках і ногах! Нині ще ти будеш валятися в поросі перед
- : начальником монгольської сили!

- Швидше згинути! відповів Максим.

- Отже, не згинеш! крикнув боярин.Гей, діти,озвався він до монголів
- їхньою мовою,далі на нихі Тільки сього обминайте, сього мусимо мати
- живого в руках!

І він дав знак до бою. Залунав по горах і лісах роговий вереск і
урвався.

Стишилось довкола боярського дому, але се була страшна тиша. Мов
гадюки, свистіли монгольські стріли, градом сиплючись на боярську
оселю.

Правда, напасники були занадто далеко віддалені, щоб їх стріли могли
трафляти оборонців або, трафивши, небезпечно ранити їх. Для того
Максим крикнув до своїх товаришів, щоб тепер іще не стріляли і щоб
узагалі щадили стріл і зброї, а вживали їх аж тоді, коли можна добре
влучити ворога і одним ударом нанести йому значну страту. А щоб не
відразу припустити напасників до стін дому, він зі своїми вибраними
товаришами уставився на подвір'ю, о яких двадцять кроків перед входом,
ва міцним дощаним остінком - куснем недобудованого паркана.

Паркан був якраз у хлопа зависокий, і стріли монгольські не досягали
молодців.

Зате їх цільні, хоч і рідкі, стріли смертельно разили монголів і
стримували їх від наближення. Страшно розлютився Тугар Возк, побачивши
се.

- Приступом до них! крикнув він, і збита громада монголів під його
- проводом кинулася бігцем із голосним криком до остінка. За остінком
- було тихо, немов усе там вимерло. Ось-ось уже монголи добігають,
- ось-ось своїм напором обалять остінок; коли втім понад остінком
- вирвався, мов із землі виріс, ряд голів

і могутніх рамен - і свиснула громада сталених стріл, і ревнули з болю
поражені монголи страшними голосами. Половина їх упала мов підкошена,
а друга половина перла назад, не дбаючи на крики і прокляття боярина.

- Гурра, молодці! Гурра, Максим! Гурра, Тухольщи-на! закричали
- оборонці, і дух вступив у них. Але боярин, не тямлячись зо злості,
- зібрав уже другу громаду до нападу. Він повчав монголів, як треба
- нападати і не розсипатися за першим ударом противника, але бігти по
- трупах дальше. Тим часом і Максим поучав своїх молодців, що діяти, і
- з піднесеним оружжям ждали вони нападу монголів.

- Далі на них! крикнув боярин, і поперед усього цілими хмарами пустили
- монголи ряд стріл на противників, а потім знов пустилася громада
- приступом на остінок. Знов перед наближенням стрітили їх молодці
- цільними стрілами, і знов частина напасників із страшним криком
- упала на землю. Але решта вже не метнулася назад лише з оглушаючим
- криком летіла далі й досягла остінка.

Страшна була хвиля. Тонкий дощаний остінок ділив від себе смертельних
ворогів, що, хоч як близько себе були, не могли досягнути одні одних.

Хвилю мовчали одні й другі, тільки швидкий, гарячий віддих чути було
по обох боках остінка. Раптом, мов на даний знак, загримали
монгольські топори о ості- нок, але в тій самій хвилі тухольські
молодці сильними підоймами підважили вгору остінок, поперли його
плечима і обалили на монголів. А разом з тою хвилею, коли впав
остінок, обаляючи своїм тягарем передні ряди монголів, скочили наперед
молодці, узброєні в топори на довгих топорищах, лупаючи ними черепи
монгольські. Забризкала кров, залунали крики і стогнання ворогів,-

і знов розскочилася юрма напасників, лишаючи на місці бою трупів і
ранених. І знов радісний крик оборонців повітав побіду товаришів, і
знов відповіли на той крик монголи градом стріл, а боярин - лютими
прокляттями. Але молодцям прийшлось тепер покидати своє висунене
становище - із жалем прощали вони те місце, з якого так щасливо
відразили перші напади монголів. Без ніякої страти, без ран, в повній
зброї і найкращім порядку, лицем до ворога, молодці відступили під
стіни боярського дому.

Коли на полуденнім боці двора молодці так щасливо відбивали напад
монголів,

ішла завзята і не так щаслива боротьба на північнім подвір'ю. І тут
монгольські стріли просвистіли без шкоди для обляжених. Тільки ж тут
монголи відразу пішли на приступ, і обляженим при-йшлось дуже гаряче.
Вони кинулись купою проти монголів, але стрічені були стрілами і
мусили вертатися, стративши трьох ранених, яких монголи зараз порубали
на кусні.

Першим ділом Максима було тепер - обійти всі становища і оглянути
добре своє положення. Живим ланцюгом обступили монголи хату і
ненастанно сипали на неї градом стріл. Обляжені також стріляли, хоч і
не так густо. Максим відразу побачив, що напасники намагають до того,
щоб вперти їх досередини хати, відки б вони не так густо могли
стріляти, а потім легка мусила б бути над ними побіда. Значить,
головна річ для оборонців була - вдержатись перед стінами дому. Але
тут вони виставлені були на густі монгольські стріли. Щоб хоч троха
захиститися від них, Максим велів повідривати двері, познімати
верхняки із столів і поуставляти їх перед кож-дим становищем як великі
щити. Із-за тих щитів безпечно і вигідно стріляли молодці на монголів,
кепкуючи собі з їх стріл.

А Максим ходив від становища до становища, обдумував нові способи
оборони

і заохочував товаришів своїм словом і прикладом.

- Держімся, товариші! говорив він.Швидко в

Тухлі почують крики або хто-будь побачить, що тут діється, і нам
прибуде поміч!

Півгодини вже тривала облога. Монголи стріляли і кляли страшно
«руських псів», що не то що не піддавалися їм, але ще сміли так уперто
і щасливо боронитися. Тугар Вовк скликав знатніших їх ватажків на
нараду, щоб обдумати який одностайний рішучий удар.

- Приступом іти! говорив один.

- Ні, приступом трудно, а стріляти, поки всіх не постріляємо,говорив
- другий.

- Постійте,сказав Тугар Вовк,на все буде час. Тепер тільки в тім річ,
- щоб позганяти їх із менших становищ. Згромадьте найбільші наші сили
- ніби до приступу, щоб відвести їх увагу, а тим часом малі відряди
- нехай рушать з обох боків до причілкових, нестережених стін. Стіни
- ті, правда, без вікон, але всетаки, коли наші люди стануть під ними,
- то будуть їм могли багато шкодити.

Ватажки пристали на тоту раду, бо вони, несвідущі в подібних маневрах,
не вміли б і такої придумати. Заворушилася монгольська сила,
забряжчала зброя, заблискотіли до сонця мечі та топори, і сміло
стискали в руках своє оружжя тухольські молодці, готуючись до тяжкого
бою. Але поки монголи радились і ладились до уданого приступу, Максим
також не дрімав. Щаслива думка прийшла до голови. В дощаній криші
боярського дому були на всі чотири боки пророблені невеличкі вікна, і
от в тих-то вікнах Максим поставив у кождім по двох слабших з своїх
людей, аби пильнували відтам усяких рухів ворога, а також старалися зі
своїх безпечних становищ шкодити йому чи то стрілами, чи камінням.
Поки один стояв при вікні, другий завше готов був достачати йому, чого
треба, а один мав доносити від них вісті товаришам надолину.

Заграли труби, і завили дикими голосами монголи, кидаючись на
противників.

Та тільки ж вони не мали на думці дійти аж зустріту з ними, але,
прибігши до пів-віддалення, разом зупинились і випустили стріли на об-
ляжених. Коли ж і обляжеш, що готовилися на останню, рішучу боротьбу,
повітали їх градом стріл

і причинили їм багато ран і страт, то вся монгольська лінія разом
подалася назад. Голосними насміхами повітали молодці той відступ.

- А що, боярине,крикнув Максим,сила великого Чінгісхана, бачиться,
- заяче серце має: розженеться і відступить! Хіба ж не стидно тобі,
- старому рицареві, ватажкувати над такими бездухами, що тільки в юрбі
- смілі, мов барани, а поєдинчо нікотрий і за півмужа не стоїть?

Боярин нічого не відповідав на той насміх; він добре бачив, що Максим
завчасно сміявсь. І сам Максим швидко побачив се.

Радісний крик монголів залунав ось-ось за причілковими стінами дому,
направо

і наліво відразу. Під час уданого монгольського приступу вони рушили
проти тих стін. Се були стіни без вікон і дверей, тож товариші не так
дуже пильнували

їх. Правда, поставлені на подрі молодці побачили надходячих із тих
боків монголів, і кілька цільних стріл упало з дахових вікон на них,
але не спинило їх, тим більше, що, стоячи при самій стіні, вони
дощаним окапом заслонені були від усякої небезпеки згори.

Максим поблід, чуючи тут же біля себе зловіщі крики і дізнавшися від
вартового з подрі, що вони значать.

«Пропали ми,- подумав він.- Про рятунок і мови нема. Тепер приходиться
«вже боротись не на життя, а на смерть».

Та й Тугар Вовк, побачивши вдачу свойого задуму, голосно порадувавсь
їй.

- А що, хлопи! крикнув він.Побачимо, чи надовго ще стане вашої
- гордості.

Глядіть, мої вояки вже під вашими стінами. Огню під стіни! Живо ми
викуримо

їх із того гнізда, а на чистім полі вони проти нас, мов миш проти
кота.

Бачить Максим, що непереливки, скликає своїх товаришів докупи, бо ніщо
вже тепер боронитись на поєдин-чих становищах, коли під причілковими
стінами гюнго-ли огонь кладуть.

- Браття,говорив він,мабуть, прийдеться нам погибати, бо на рятунок
- слаба надія, а монголи, се знайте наперед, не пощадять нікого, хто
- дістанеться в їх руки, так, як не пощадили наших ранених товаришів.
- А коли гинути, то гиньмо як мужі з оружжям у руках. Як гадаєте: чи
- будемо стояти тут і боронитися до остатнього духу, заслонені хоч
- вчасти стінами, чи волимо всі разом ударити на монголів, може б, нам
- таки удалося проломити їх ряди?

- Так, так, ударимо на монголів! закричали всі товариші.Ми ж не лиси,
- що їх стрілець викурює з ями.

- Добре, коли така ваша воля,сказав Максим Ставайте ж у три ряди, луки
- й стріли кидайте геть, а то-пори й ножі до рук і за мною!

Мов один величезний камінь, випущений із великої метавки навпроти
мурів твердині, так ударили наші молодці на монгольські ряди. Правда,
заким іще добігли до монголів, стрічені були градом стріл,- тільки ж
ті стріли нічого не зробили їм, бо перший ряд ніс перед собою замість
щита верхняк із стола, вбитий на дві списи, і в той верхняк
повпивалися монгольські стріли. Аж наближуючись до монголів, перший
ряд кинув свій дерев'яний щит - і цілий відряд кинувся на ворога з
безтямною завзятістю. Відразу змішалися монголи і почали подаватися в
боки, але Тугар Вовк був уже тут зі своїм відділом і окружив молодців
цілою громадою монголів, мов стрільці цілою ватагою псів окружають
розжертого дика. Розпочалась страшна різанина. Цілими десятками валили
хоробрі молодці монголів, але Тугар Вовк слав щораз нові роти
навпротив них. Кров бризкала далеко із скаженої сутолоки людей,
трупів, ран та кровавого оружжя. Стогнання ранених, зойки конаючих,
скажені крики убійців - усе те мішалося в якусь пекольну гармонію, що
різала вухо і серце, лунаючи під отим усміх-нутим ясним сонцем, на тлі
ситої зелені смерекових лісів та під лад ненастанного шуму холодних
потоків.

- Направо, товариші! Разом і дружно напрім на них! кричав Максим,
- відбиваючися від трьох монголів, що старалися вибити йому оружжя з
- руки. Зі страшною натугою наперли товариші направо, де лінія
- монголів була найслабіша і місце для оборони найдогідніше. По
- короткім опорі монголи подалися.

- Далі, далі женіть їх, наперед себе! кричав Максим, кидаючися зі
- своїм кровавим топором на уступаючих монголів. Товариші поперли за
- ним, і відворіт монголів швидко перемінився на пополох і безладну
- втіка-нину. А товариші гнали слідом за ними, валячи одного за другим
- іззаду на землю. Перед ними було чисте поле, а недалечке темний,
- запахущий ліс. Коли б їм удалося добігти до нього, то були б
- спасені, ніяка монгольська сила не здужала б їм тут нічого зробити.

- Далі, товариші, далі, до лісу! -кричав Максим, і без віддиху,
- мовчки, кроваві й страшні, мов справді дикі звірі, гнали товариші
- наперед себе втікаючих монголів у напрямі до лісу. Тугар Вовк одним
- позирком переглянув положення обох сторін і зареготався:

- Щаслива дорога! крикнув він услід за молодцями.На тій дорозі ми ще
- здиблемося!

І живо він відділив часть монголів і післав їх горою на тухольськнй
шлях, щоб зайшли молодців іспереду, від лісу. Він знав добре, що його
монголи впору поспіють. А сам з рештою монголів пустився навздогін за
тухоль-цями.

Три тумани куряви стояли на полю над Опором; три громадки людей гнали
за собою тим полем. Перша бігла громадка переляканих, розбитих
монголів; за ними, здоганяючи їх, наші молодці під проводом Максима, а
за ними головна сила монголів під проводом Тугара Вовка. Третій відділ
монгольський, висланий Тугаром горою навперейми, швидко десь заховався
і щез, не завважений роз'яреними в своїй погоні молодцями.

Нараз утікаючі монголи спинилися, стали. Перед ними показалася
несподівана завада: глибокий, у скалі викутий вивіз - початок
тухольського шляху. Вивіз був у тім місці майже на два сажні глибокий;
стіни його стрімкі й гладкі, так що злізти в долину зовсім не можна, а
скакати дуже небезпечно, особливо першому рядові втікачів, які могли
надіятися, що тут же за ними і па них скочить другий ряд. У
смертельній тривозі, яка й найбоязливішому не раз у остатній хвилі
додає відваги, зупинилися монголи і обернулися лицем до своїх
противників. В тій хвилі блиснула їм несподівана надія: за слідом
противників побачили настигаючих своїх одновірців - і руки їх мимоволі
вхопили за оружжя. Але сей наглий вибух відваги не був в силі спасти
їх. Мов розгу-кана буря, впали на них тухольські молодці, ломлячи и
друхочучи всі завади,- і попхнули їх до пропасті.

З зойком повалились ті, що стояли ззаду, на дно вивозу, коли тим часом
передні конали від мечів і топорів ту-хольських. Тепер молодці самі
опинилися над стрімкою стіною вивозу і затремтіли. Тут іззаду настигає
Тугар Вовк з монголами, а спереду оця страшна пропасть! Що діяти?
Хвилі розваги досить було для Максима. Вид лежачих на дні вивозу
потовчених монголів навів його на добру думку.

- Задній ряд нехай обернеться лицем до монголів і стримує на хвилю їх
- нагін, а передній кидай монгольські трупи в вивіз і скачи на них!
- кричав він.

- Гурра! закричали радісно молодці, сповняючи його розказ. Застугоніли
- теплі ще монгольські трупи, падучи додолу, заясніла для наших
- молодців надія рятунку. А втім, надлетіла монгольська погоня, Тугар
- Вовк попереду.

- Ні вже,кричав він,сим разом не уйдете моєї руки! І своїм важким
- топором повалив першого стрічного противника, що вчора ще був його
- найвірнішим лучником. Зойкнув смертельно ранений і впав під ноги
- боярина. Товариш його замахнувсь топором на Тугара, щоб помститись
- смерті товариша, але в тій хвилі його з двох боків піднято на
- монгольські списи. Цілий перший ряд молодців упав по короткім опорі.
- Се ж були самі найслабші поранені в попередній битві, що в погоні
- бігли з самого заду. Але все-таки монголів на хвилю вони спинили, а
- їх щасливіші товариші були вже безпечні на дні вивозу.

- Стійте! кричав до своїх Максим.В ряди і під стіну вивозу! Коли
- схотять гнатися за нами, то тут їм справимо кроваву купіль.

- Перший ряд скачи за ними,командував у нерозважнім запалі Тугар Вовк.
- І скочив перший ряд монголів, але не встав уже живий, ба многі й до
- землі не долетіли живі, стрічені в повітрі топорами молодців.

- Гурра! закричали ті, радуючись.Ану, другий ряд, скачи також!

Але другий ряд стояв над вивозом і не квапився скакати. Тугар Вовк
побачив свою помилку і швидко вислав сильний відділ нижче, щоб
іздолини замкнути вихід вивозу.

- Тепер не уйдуть нам пташки,радувався він.От уже мої ловці надходять!
- Ану, діти, далі на них!

Скажений крик монголів залунав у вивозі, тут же під ногами Тугара
Вовка. Се був відділ, висланий горою •навперейми; вниз вивозом він
ударив тепер на ту- хольців.

- Вниз вивозом утікаймо! скрикнули молодці, але один позирк переконав
- їх, що вся надія на рятунок пропала. При вході внизу чорнілася вже
- друга купа монголів, що йшла навпроти них, щоб їх зовсім замкнути в
- тій кам'яній клітці.

- Аж тепер смерть наша! сказав Максим, обтираючи о кожух забитого, при
- його ногах лежачого монгола свій кровавий топір.Товариші, сміло до
- остатнього бою!

Та й сміло ж виступили вони! Добуваючи остатніх сил, ударили на
монголів і, невважаючи на некорисну, згористу місцевість, що сприяла
монголам, ще раз змішали їх, ще раз завдали їм велику страту. Але
монголи силою свого розгону поперли їх у долину і розбили їх ряди. В
геройській обороні падали молодці один за другим, тільки Максим, хоч
бився, як лев, прецінь не мав іще рани на своїм тілі. Монголи уникали
його, а коли тислися на нього, то тільки в надії витрутити йому оружжя
з руки і взяти його живого. Такий був виразний наказ

Ту-гара Вовка.

Ось наступив і другий відділ монгольський з долини; молодців стиснено
в тій безвихідній кам'яній кліті, приперто їх до стіни, і лиш тілько
вільного місця було перед ними, кілько могли його зробити своїми
мечами та топорами. Але руки їх зачали ослабати, а монголи пруться і
пруться на них, мов хвилі повені. Вже деякі, стративши всяку надію і
бачачи неможливість дальшої боротьби, наосліп кинулися в найгустіші
ряди монголів і в одній хвилі погибали, розсікані топорами. Інші,
шепчучи молитви, тулилися ще до стіни, мов вона могла дати їм яку-
небудь поміч; треті хоть і ніби боронилися, але безтямно, машинально
махали топорами, і смертельні удари монголів заставали їх уже трупами,
нечутливими й бездушними. Тільки невеличка горстка найсильніших -
п'ять їх було,- окруживши Максима, держалися ще просто, мов шпиль
скали серед розгуканої заливи. Три приступи монголів відбила вже та
горстка, стоячи на купі трупів, мов на башті; вже мечі й топори в
руках героїв затулилися, одіж їх, руки й лиця скрізь заплили кров'ю,
але все ще різко й виразно відзивався голос Максима, що загрівав
товаришів до оборони. Тугар Вовк на-півгнівно, напів з подивом глядів
на молодця згори.

- їй-богу, славний молодець! сказав він сам до себе.Не дивуюсь, що він
- очарував мою доньку. І мене самого він міг би очарувати своєю
- рицарською вдачею!

А потім, обертаючися до своїх монголів, що стояли над берегом яру, він
крикнув:

- Далі, скачіть на них! Нехай скінчиться та різанина. Лиш сього
- (показав на

Максима) не тикайте!

І разом, мов важка скала, скочили монголи згори на не побіджену ще
купку героїв і повалили їх на землю. Ще раз залунали скажені крики, ще
борикалися напід-сили монголи з тухольцями, але недовго. На кождого з
героїв навалилася ціла юрба монголів - і всі полягли головами. Тільки
Максим сам-один стояв іще, мов дуб серед поля. Він розсік голову тому
монголові, що скочив був на нього, і саме замахнувся на другого, коли
втім якась сильна рука залізним стиском ухопила його ззаду за горло і
кинула ним до землі. Упав, підступно повалений,

Максим, і над ним, почервоніле від гніву й натуги, нахилилося лице
Тугара

Вовка.

- А що, смерде! насмішливо кричав боярин.Бачиш тепер, що я вмію
- додержати слова? Ану, діти, закуйте його в залізні пута!

- Хоч і в путах, я все буду вольний чоловік. У мене пута на руках, а в
- тебе на душі! сказав Максим.

Боярин зареготався і відійшов від нього давати порядок монгольському
війську, якого число сильно змаліло в тій кровавій різанині. З
головною частиною оставших іще монголів Тугар Вовк пішов до своєї
хати; решті велів обсадити нещасний, тепер трупами завалений вивіз.
Виділивши всіх здорових до стереження вивозу, сам він з невеличкою
рештою і взятим до неволі Максимом мав вернутися до табору.

- Прокляті хлопи! буркотів боярин, переглядаючи свої страти.Скілько
- народу понівечили! Ну, але чорт бери монголів їх не шкода! Коб
- тільки мені по тих трупах дійти до власті й сили,обернувся б і я
- лицем проти них. Але сей поганець, сей Максим,то мені борець! А хто
- знає, може, й він міг би послужити до моєї цілі? Треба використати
- його, коли його маю в руках. Він мусить служити нам за провідника в
- горах, бо чорт їх там знає, який се той їх шлях і чи нема де на нім
- яких манівців. Тепер, коли він у моїх руках, треба приєднати,
- вкоськати його троха, хто знає, на що ще може він пригодитися.

А тим часом монголи готовили вже коней до від'їзду. Максиїл,- скований
за руки і за ноги в тяжкі ланцюги, кровавий, простоволосий, із
пошарпаною на шматки одежею,- сидів на камені над річкою, німий, з
затиснени-ми зубами і з розпукою в серці. Перед ним на полі і в вивозі
купами лежали не застиглі ще, пошматовані і кров'ю оббризкані трупи
його товаришів і ворогів. Які щасливі були ті трупи! Вони лежали так
тихо, так сумирно на своїй кровавій постелі, без гніву, без муки, без
ворогування. Вони сміялись тепер зі всяких пут, із цілої сили великого
Чінгісхана, а його кусень заліза зробив бездушним знарядом у руках
дикої самоволі, жертвою крова-вої пімсти! Які щасливі були трупи!
Вони, хоч покалічені, носили на собі образ і подобу людську,- а його
оці пута в одній хвилі зробили скотиною, невольником!

- Сонце праведне! кликнув у своїй душевній муці Максим.Невже ж така
- твоя воля, щоб я гинув у кайданах? Невже ж ти так часто своїм ясним
- усміхом вітало дні моєї радості на те лише, щоб сьогодні повітати
- моє бездонне горе? Сонце, невже ж ти перестало бути добрим богом
- Тухольщини, а сталося опікуном тих лютих дикунів? . А сонце
- сміялося! Ясним, гарячим промінням воно блискотіло в калюжах крові,
- цілувало посинілі уста і глибокі рани трупів, крізь які витікав
- мозок, вистирчу-вали теплі ще людські тельбухи. І таким самим ясним,
- гарячим промінням воно обливало зелений ліс, і чудові запахущі
- цвіти, і високі полонини, що купалися в чистім лазуровім ефірі.
- Сонце сміялося і своїм божеським, без-учасним усміхом ще дужче
- ранило роздерту Максимову Душу.

EOT;

    /*
    *** START: FULL LICENSE ***

    Creative Commons Legal Code

    Attribution-ShareAlike 3.0 Unported


    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE
    LEGAL SERVICES. DISTRIBUTION OF THIS LICENSE DOES NOT CREATE AN
    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS
    INFORMATION ON AN "AS-IS" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES
    REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR
    DAMAGES RESULTING FROM ITS USE. License

    THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS
    CREATIVE COMMONS PUBLIC LICENSE ("CCPL" OR "LICENSE"). THE WORK IS
    PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE
    WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS
    PROHIBITED.

    BY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND
    AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS
    LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU
    THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH
    TERMS AND CONDITIONS.

    1. Definitions

    "Adaptation" means a work based upon the Work, or upon the Work and
    other pre-existing works, such as a translation, adaptation,
    derivative work, arrangement of music or other alterations of a
    literary or artistic work, or phonogram or performance and includes
    cinematographic adaptations or any other form in which the Work may be
    recast, transformed, or adapted including in any form recognizably
    derived from the original, except that a work that constitutes a
    Collection will not be considered an Adaptation for the purpose of
    this License. For the avoidance of doubt, where the Work is a musical
    work, performance or phonogram, the synchronization of the Work in
    timed-relation with a moving image ("synching") will be considered an
    Adaptation for the purpose of this License. "Collection" means a
    collection of literary or artistic works, such as encyclopedias and
    anthologies, or performances, phonograms or broadcasts, or other works
    or subject matter other than works listed in Section 1(f) below,
    which, by reason of the selection and arrangement of their contents,
    constitute intellectual creations, in which the Work is included in
    its entirety in unmodified form along with one or more other
    contributions, each constituting separate and independent works in
    themselves, which together are assembled into a collective whole. A
    work that constitutes a Collection will not be considered an
    Adaptation (as defined below) for the purposes of this License.
    "Creative Commons Compatible License" means a license that is listed
    at http://creativecommons.org/compatiblelicenses that has been
    approved by Creative Commons as being essentially equivalent to this
    License, including, at a minimum, because that license: (i) contains
    terms that have the same purpose, meaning and effect as the License
    Elements of this License; and, (ii) explicitly permits the relicensing
    of adaptations of works made available under that license under this
    License or a Creative Commons jurisdiction license with the same
    License Elements as this License. "Distribute" means to make available
    to the public the original and copies of the Work or Adaptation, as
    appropriate, through sale or other transfer of ownership. "License
    Elements" means the following high-level license attributes as
    selected by Licensor and indicated in the title of this License:
    Attribution, ShareAlike. "Licensor" means the individual, individuals,
    entity or entities that offer(s) the Work under the terms of this
    License. "Original Author" means, in the case of a literary or
    artistic work, the individual, individuals, entity or entities who
    created the Work or if no individual or entity can be identified, the
    publisher; and in addition (i) in the case of a performance the
    actors, singers, musicians, dancers, and other persons who act, sing,
    deliver, declaim, play in, interpret or otherwise perform literary or
    artistic works or expressions of folklore; (ii) in the case of a
    phonogram the producer being the person or legal entity who first
    fixes the sounds of a performance or other sounds; and, (iii) in the
    case of broadcasts, the organization that transmits the broadcast.
    "Work" means the literary and/or artistic work offered under the terms
    of this License including without limitation any production in the
    literary, scientific and artistic domain, whatever may be the mode or
    form of its expression including digital form, such as a book,
    pamphlet and other writing; a lecture, address, sermon or other work
    of the same nature; a dramatic or dramatico-musical work; a
    choreographic work or entertainment in dumb show; a musical
    composition with or without words; a cinematographic work to which are
    assimilated works expressed by a process analogous to cinematography;
    a work of drawing, painting, architecture, sculpture, engraving or
    lithography; a photographic work to which are assimilated works
    expressed by a process analogous to photography; a work of applied
    art; an illustration, map, plan, sketch or three-dimensional work
    relative to geography, topography, architecture or science; a
    performance; a broadcast; a phonogram; a compilation of data to the
    extent it is protected as a copyrightable work; or a work performed by
    a variety or circus performer to the extent it is not otherwise
    considered a literary or artistic work. "You" means an individual or
    entity exercising rights under this License who has not previously
    violated the terms of this License with respect to the Work, or who
    has received express permission from the Licensor to exercise rights
    under this License despite a previous violation. "Publicly Perform"
    means to perform public recitations of the Work and to communicate to
    the public those public recitations, by any means or process,
    including by wire or wireless means or public digital performances; to
    make available to the public Works in such a way that members of the
    public may access these Works from a place and at a place individually
    chosen by them; to perform the Work to the public by any means or
    process and the communication to the public of the performances of the
    Work, including by public digital performance; to broadcast and
    rebroadcast the Work by any means including signs, sounds or images.
    "Reproduce" means to make copies of the Work by any means including
    without limitation by sound or visual recordings and the right of
    fixation and reproducing fixations of the Work, including storage of a
    protected performance or phonogram in digital form or other electronic
    medium. 2. Fair Dealing Rights. Nothing in this License is intended to
    reduce, limit, or restrict any uses free from copyright or rights
    arising from limitations or exceptions that are provided for in
    connection with the copyright protection under copyright law or other
    applicable laws.

    3. License Grant. Subject to the terms and conditions of this License,
    Licensor hereby grants You a worldwide, royalty-free, non-exclusive,
    perpetual (for the duration of the applicable copyright) license to
    exercise the rights in the Work as stated below:

    to Reproduce the Work, to incorporate the Work into one or more
    Collections, and to Reproduce the Work as incorporated in the
    Collections; to create and Reproduce Adaptations provided that any
    such Adaptation, including any translation in any medium, takes
    reasonable steps to clearly label, demarcate or otherwise identify
    that changes were made to the original Work. For example, a
    translation could be marked "The original work was translated from
    English to Spanish," or a modification could indicate "The original
    work has been modified."; to Distribute and Publicly Perform the Work
    including as incorporated in Collections; and, to Distribute and
    Publicly Perform Adaptations. For the avoidance of doubt:

    Non-waivable Compulsory License Schemes. In those jurisdictions in
    which the right to collect royalties through any statutory or
    compulsory licensing scheme cannot be waived, the Licensor reserves
    the exclusive right to collect such royalties for any exercise by You
    of the rights granted under this License; Waivable Compulsory License
    Schemes. In those jurisdictions in which the right to collect
    royalties through any statutory or compulsory licensing scheme can be
    waived, the Licensor waives the exclusive right to collect such
    royalties for any exercise by You of the rights granted under this
    License; and, Voluntary License Schemes. The Licensor waives the right
    to collect royalties, whether individually or, in the event that the
    Licensor is a member of a collecting society that administers
    voluntary licensing schemes, via that society, from any exercise by
    You of the rights granted under this License. The above rights may be
    exercised in all media and formats whether now known or hereafter
    devised. The above rights include the right to make such modifications
    as are technically necessary to exercise the rights in other media and
    formats. Subject to Section 8(f), all rights not expressly granted by
    Licensor are hereby reserved.

    4. Restrictions. The license granted in Section 3 above is expressly
    made subject to and limited by the following restrictions:

    You may Distribute or Publicly Perform the Work only under the terms
    of this License. You must include a copy of, or the Uniform Resource
    Identifier (URI) for, this License with every copy of the Work You
    Distribute or Publicly Perform. You may not offer or impose any terms
    on the Work that restrict the terms of this License or the ability of
    the recipient of the Work to exercise the rights granted to that
    recipient under the terms of the License. You may not sublicense the
    Work. You must keep intact all notices that refer to this License and
    to the disclaimer of warranties with every copy of the Work You
    Distribute or Publicly Perform. When You Distribute or Publicly
    Perform the Work, You may not impose any effective technological
    measures on the Work that restrict the ability of a recipient of the
    Work from You to exercise the rights granted to that recipient under
    the terms of the License. This Section 4(a) applies to the Work as
    incorporated in a Collection, but this does not require the Collection
    apart from the Work itself to be made subject to the terms of this
    License. If You create a Collection, upon notice from any Licensor You
    must, to the extent practicable, remove from the Collection any credit
    as required by Section 4(c), as requested. If You create an
    Adaptation, upon notice from any Licensor You must, to the extent
    practicable, remove from the Adaptation any credit as required by
    Section 4(c), as requested. You may Distribute or Publicly Perform an
    Adaptation only under the terms of: (i) this License; (ii) a later
    version of this License with the same License Elements as this
    License; (iii) a Creative Commons jurisdiction license (either this or
    a later license version) that contains the same License Elements as
    this License (e.g., Attribution-ShareAlike 3.0 US)); (iv) a Creative
    Commons Compatible License. If you license the Adaptation under one of
    the licenses mentioned in (iv), you must comply with the terms of that
    license. If you license the Adaptation under the terms of any of the
    licenses mentioned in (i), (ii) or (iii) (the "Applicable License"),
    you must comply with the terms of the Applicable License generally and
    the following provisions: (I) You must include a copy of, or the URI
    for, the Applicable License with every copy of each Adaptation You
    Distribute or Publicly Perform; (II) You may not offer or impose any
    terms on the Adaptation that restrict the terms of the Applicable
    License or the ability of the recipient of the Adaptation to exercise
    the rights granted to that recipient under the terms of the Applicable
    License; (III) You must keep intact all notices that refer to the
    Applicable License and to the disclaimer of warranties with every copy
    of the Work as included in the Adaptation You Distribute or Publicly
    Perform; (IV) when You Distribute or Publicly Perform the Adaptation,
    You may not impose any effective technological measures on the
    Adaptation that restrict the ability of a recipient of the Adaptation
    from You to exercise the rights granted to that recipient under the
    terms of the Applicable License. This Section 4(b) applies to the
    Adaptation as incorporated in a Collection, but this does not require
    the Collection apart from the Adaptation itself to be made subject to
    the terms of the Applicable License. If You Distribute, or Publicly
    Perform the Work or any Adaptations or Collections, You must, unless a
    request has been made pursuant to Section 4(a), keep intact all
    copyright notices for the Work and provide, reasonable to the medium
    or means You are utilizing: (i) the name of the Original Author (or
    pseudonym, if applicable) if supplied, and/or if the Original Author
    and/or Licensor designate another party or parties (e.g., a sponsor
    institute, publishing entity, journal) for attribution ("Attribution
    Parties") in Licensor's copyright notice, terms of service or by other
    reasonable means, the name of such party or parties; (ii) the title of
    the Work if supplied; (iii) to the extent reasonably practicable, the
    URI, if any, that Licensor specifies to be associated with the Work,
    unless such URI does not refer to the copyright notice or licensing
    information for the Work; and (iv) , consistent with Ssection 3(b), in
    the case of an Adaptation, a credit identifying the use of the Work in
    the Adaptation (e.g., "French translation of the Work by Original
    Author," or "Screenplay based on original Work by Original Author").
    The credit required by this Section 4(c) may be implemented in any
    reasonable manner; provided, however, that in the case of a Adaptation
    or Collection, at a minimum such credit will appear, if a credit for
    all contributing authors of the Adaptation or Collection appears, then
    as part of these credits and in a manner at least as prominent as the
    credits for the other contributing authors. For the avoidance of
    doubt, You may only use the credit required by this Section for the
    purpose of attribution in the manner set out above and, by exercising
    Your rights under this License, You may not implicitly or explicitly
    assert or imply any connection with, sponsorship or endorsement by the
    Original Author, Licensor and/or Attribution Parties, as appropriate,
    of You or Your use of the Work, without the separate, express prior
    written permission of the Original Author, Licensor and/or Attribution
    Parties. Except as otherwise agreed in writing by the Licensor or as
    may be otherwise permitted by applicable law, if You Reproduce,
    Distribute or Publicly Perform the Work either by itself or as part of
    any Adaptations or Collections, You must not distort, mutilate, modify
    or take other derogatory action in relation to the Work which would be
    prejudicial to the Original Author's honor or reputation. Licensor
    agrees that in those jurisdictions (e.g. Japan), in which any exercise
    of the right granted in Section 3(b) of this License (the right to
    make Adaptations) would be deemed to be a distortion, mutilation,
    modification or other derogatory action prejudicial to the Original
    Author's honor and reputation, the Licensor will waive or not assert,
    as appropriate, this Section, to the fullest extent permitted by the
    applicable national law, to enable You to reasonably exercise Your
    right under Section 3(b) of this License (right to make Adaptations)
    but not otherwise. 5. Representations, Warranties and Disclaimer

    UNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING,
    LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR
    WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED,
    STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF
    TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE,
    NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY,
    OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE.
    SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES,
    SO SUCH EXCLUSION MAY NOT APPLY TO YOU.

    6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY
    APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY
    LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR
    EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK,
    EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.

    7. Termination

    This License and the rights granted hereunder will terminate
    automatically upon any breach by You of the terms of this License.
    Individuals or entities who have received Adaptations or Collections
    from You under this License, however, will not have their licenses
    terminated provided such individuals or entities remain in full
    compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will
    survive any termination of this License. Subject to the above terms
    and conditions, the license granted here is perpetual (for the
    duration of the applicable copyright in the Work). Notwithstanding the
    above, Licensor reserves the right to release the Work under different
    license terms or to stop distributing the Work at any time; provided,
    however that any such election will not serve to withdraw this License
    (or any other license that has been, or is required to be, granted
    under the terms of this License), and this License will continue in
    full force and effect unless terminated as stated above. 8.
    Miscellaneous

    Each time You Distribute or Publicly Perform the Work or a Collection,
    the Licensor offers to the recipient a license to the Work on the same
    terms and conditions as the license granted to You under this License.
    Each time You Distribute or Publicly Perform an Adaptation, Licensor
    offers to the recipient a license to the original Work on the same
    terms and conditions as the license granted to You under this License.
    If any provision of this License is invalid or unenforceable under
    applicable law, it shall not affect the validity or enforceability of
    the remainder of the terms of this License, and without further action
    by the parties to this agreement, such provision shall be reformed to
    the minimum extent necessary to make such provision valid and
    enforceable. No term or provision of this License shall be deemed
    waived and no breach consented to unless such waiver or consent shall
    be in writing and signed by the party to be charged with such waiver
    or consent. This License constitutes the entire agreement between the
    parties with respect to the Work licensed here. There are no
    understandings, agreements or representations with respect to the Work
    not specified here. Licensor shall not be bound by any additional
    provisions that may appear in any communication from You. This License
    may not be modified without the mutual written agreement of the
    Licensor and You. The rights granted under, and the subject matter
    referenced, in this License were drafted utilizing the terminology of
    the Berne Convention for the Protection of Literary and Artistic Works
    (as amended on September 28, 1979), the Rome Convention of 1961, the
    WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms
    Treaty of 1996 and the Universal Copyright Convention (as revised on
    July 24, 1971). These rights and subject matter take effect in the
    relevant jurisdiction in which the License terms are sought to be
    enforced according to the corresponding provisions of the
    implementation of those treaty provisions in the applicable national
    law. If the standard suite of rights granted under applicable
    copyright law includes additional rights not granted under this
    License, such additional rights are deemed to be included in the
    License; this License is not intended to restrict the license of any
    rights under applicable law. Creative Commons Notice

    Creative Commons is not a party to this License, and makes no warranty
    whatsoever in connection with the Work. Creative Commons will not be
    liable to You or any party on any legal theory for any damages
    whatsoever, including without limitation any general, special,
    incidental or consequential damages arising in connection to this
    license. Notwithstanding the foregoing two (2) sentences, if Creative
    Commons has expressly identified itself as the Licensor hereunder, it
    shall have all rights and obligations of Licensor.

    Except for the limited purpose of indicating to the public that the
    Work is licensed under the CCPL, Creative Commons does not authorize
    the use by either party of the trademark "Creative Commons" or any
    related trademark or logo of Creative Commons without the prior
    written consent of Creative Commons. Any permitted use will be in
    compliance with Creative Commons' then-current trademark usage
    guidelines, as may be published on its website or otherwise made
    available upon request from time to time. For the avoidance of doubt,
    this trademark restriction does not form part of the License.

    Creative Commons may be contacted at http://creativecommons.org/.

    */
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                     <?php

namespace Faker\Provider\vi_VN;

class Address extends \Faker\Provider\Address
{
    protected static $buildingNumber = array('####', '###', '##', '#');
    protected static $postcode = array('#####', '######', '#####-####');
    protected static $province = array(
        'An Giang', 'Bà Rịa - Vũng Tàu',
        'Bắc Giang', 'Bắc Kạn', 'Bạc Liêu',
        'Bắc Ninh', 'Bến Tre', 'Bình Định',
        'Bình Dương', 'Bình Phước', 'Bình Thuận',
        'Cà Mau', 'Cao Bằng', 'Đắk Lắk',
        'Đắk Nông', 'Điện Biên', 'Đồng Nai',
        'Đồng Tháp', 'Gia Lai', 'Hà Giang',
        'Hà Nam', 'Hà Tĩnh', 'Hải Dương',
        'Hậu Giang', 'Hòa Bình', 'Hưng Yên',
        'Khánh Hòa', 'Kiên Giang', 'Kon Tum',
        'Lai Châu', 'Lâm Đồng', 'Lạng Sơn',
        'Lào Cai', 'Long An', 'Nam Định',
        'Nghệ An', 'Ninh Bình', 'Ninh Thuận',
        'Phú Thọ', 'Quảng Bình', 'Quảng Nam',
        'Quảng Ngãi', 'Quảng Ninh', 'Quảng Trị',
        'Sóc Trăng', 'Sơn La', 'Tây Ninh',
        'Thái Bình', 'Thái Nguyên', 'Thanh Hóa',
        'Thừa Thiên Huế', 'Tiền Giang', 'Trà Vinh',
        'Tuyên Quang', 'Vĩnh Long', 'Vĩnh Phúc',
        'Yên Bái', 'Phú Yên',
    );
    protected static $city = array(
        'Cần Thơ', 'Đà Nẵng', 'Hải Phòng', 'Hà Nội', 'Hồ Chí Minh',
    );
    protected static $streetNameFormats = array(
        'Phố {{lastName}} {{middleName}} {{firstName}}',
        'Phố {{lastName}} {{middleName}} {{firstName}}',
        'Phố {{lastName}} {{middleName}} {{firstName}}',
        'Phố {{firstName}}',
        'Phố {{lastName}}',
    );
    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{streetName}}',
    );
    protected static $hamletNameFormats = array(
        '{{hamletPrefix}} {{middleName}} {{firstName}}',
        '{{hamletPrefix}} {{lastName}} {{firstName}}',
        '{{hamletPrefix}} {{firstName}} {{lastName}}',
        '{{hamletPrefix}} {{middleName}} {{firstName}}',
        '{{hamletPrefix}} {{lastName}} {{middleName}} {{firstName}}',
        '{{hamletPrefix}} {{firstName}}',
        '{{hamletPrefix}} {{lastName}}',
        '{{hamletPrefix}} ##',
        '{{hamletPrefix}} #',
    );
    protected static $hamletPrefix = array(
        'Thôn', 'Ấp',
    );
    protected static $wardNameFormats = array(
        '{{hamletPrefix}} {{middleName}} {{firstName}}',
        '{{hamletPrefix}} {{lastName}} {{firstName}}',
        '{{wardPrefix}} {{firstName}} {{lastName}}',
        '{{wardPrefix}} {{middleName}} {{firstName}}',
        '{{wardPrefix}} {{lastName}} {{middleName}} {{firstName}}',
        '{{wardPrefix}} {{firstName}}',
        '{{wardPrefix}} {{lastName}}',
        '{{wardPrefix}} ##',
        '{{wardPrefix}} #',
    );
    protected static $wardPrefix = array(
        'Phường', 'Xã',
    );
    protected static $districtNameFormats = array(
        '{{districtPrefix}} {{middleName}} {{firstName}}',
        '{{districtPrefix}} {{lastName}} {{firstName}}',
        '{{districtPrefix}} {{firstName}} {{lastName}}',
        '{{districtPrefix}} {{middleName}} {{firstName}}',
        '{{districtPrefix}} {{lastName}} {{middleName}} {{firstName}}',
        '{{districtPrefix}} {{firstName}}',
        '{{districtPrefix}} {{lastName}}',
        '{{districtPrefix}} ##',
        '{{districtPrefix}} #',
    );
    protected static $districtPrefix = array(
        'Quận', 'Huyện',
    );
    protected static $addressFormats = array(
        "{{streetAddress}}, {{wardName}}, {{districtName}}\n{{city}}",
        "{{streetAddress}}, {{wardName}}, {{districtName}}\n{{province}}",
        "{{buildingNumber}}, {{hamletName}}, {{wardName}}, {{districtName}}\n{{province}}",
    );
    protected static $country = array(
        'Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra', 'Angola', 'Anguilla', 'Antarctica (the territory South of 60 deg S)', 'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba', 'Australia', 'Austria', 'Azerbaijan',
        'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Bouvet Island (Bouvetoya)', 'Brazil', 'British Indian Ocean Territory (Chagos Archipelago)', 'British Virgin Islands', 'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
        'Cambodia', 'Cameroon', 'Canada', 'Cape Verde', 'Cayman Islands', 'Central African Republic', 'Chad', 'Chile', 'China', 'Christmas Island', 'Cocos (Keeling) Islands', 'Colombia', 'Comoros', 'Congo', 'Cook Islands', 'Costa Rica', 'Cote d\'Ivoire', 'Croatia', 'Cuba', 'Cyprus', 'Czech Republic',
        'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic',
        'Ecuador', 'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia',
        'Faroe Islands', 'Falkland Islands (Malvinas)', 'Fiji', 'Finland', 'France', 'French Guiana', 'French Polynesia', 'French Southern Territories',
        'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Gibraltar', 'Greece', 'Greenland', 'Grenada', 'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea', 'Guinea-Bissau', 'Guyana',
        'Haiti', 'Heard Island and McDonald Islands', 'Holy See (Vatican City State)', 'Honduras', 'Hong Kong', 'Hungary',
        'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Isle of Man', 'Israel', 'Italy',
        'Jamaica', 'Japan', 'Jersey', 'Jordan',
        'Kazakhstan', 'Kenya', 'Kiribati', 'Korea', 'Korea', 'Kuwait', 'Kyrgyz Republic',
        'Lao People\'s Democratic Republic', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libyan Arab Jamahiriya', 'Liechtenstein', 'Lithuania', 'Luxembourg',
        'Macao', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Martinique', 'Mauritania', 'Mauritius', 'Mayotte', 'Mexico', 'Micronesia', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Montserrat', 'Morocco', 'Mozambique', 'Myanmar',
        'Namibia', 'Nauru', 'Nepal', 'Netherlands Antilles', 'Netherlands', 'New Caledonia', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Niue', 'Norfolk Island', 'Northern Mariana Islands', 'Norway',
        'Oman',
        'Pakistan', 'Palau', 'Palestinian Territories', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Pitcairn Islands', 'Poland', 'Portugal', 'Puerto Rico',
        'Qatar',
        'Reunion', 'Romania', 'Russian Federation', 'Rwanda',
        'Saint Barthelemy', 'Saint Helena', 'Saint Kitts and Nevis', 'Saint Lucia', 'Saint Martin', 'Saint Pierre and Miquelon', 'Saint Vincent and the Grenadines', 'Samoa', 'San Marino', 'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia (Slovak Republic)', 'Slovenia', 'Solomon Islands', 'Somalia', 'South Africa', 'South Georgia and the South Sandwich Islands', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Svalbard & Jan Mayen Islands', 'Swaziland', 'Sweden', 'Switzerland', 'Syrian Arab Republic',
        'Taiwan', 'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo', 'Tokelau', 'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu',
        'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom', 'United States of America', 'United States Minor Outlying Islands', 'United States Virgin Islands', 'Uruguay', 'Uzbekistan',
        'Vanuatu', 'Venezuela', 'Vietnam',
        'Wallis and Futuna', 'Western Sahara',
        'Yemen',
        'Zambia', 'Zimbabwe'
    );

    public function hamletName()
    {
        $format = static::randomElement(static::$hamletNameFormats);

        return static::bothify($this->generator->parse($format));
    }

    public function hamletPrefix()
    {
        return static::randomElement(static::$hamletPrefix);
    }

    public function wardName()
    {
        $format = static::randomElement(static::$wardNameFormats);

        return static::bothify($this->generator->parse($format));
    }

    public function wardPrefix()
    {
        return static::randomElement(static::$wardPrefix);
    }

    public function districtName()
    {
        $format = static::randomElement(static::$districtNameFormats);

        return static::bothify($this->generator->parse($format));
    }

    public function districtPrefix()
    {
        return static::randomElement(static::$districtPrefix);
    }

    /**
     * @example 'Hà Nội'
     */
    public function city()
    {
        return static::randomElement(static::$city);
    }

    /**
     * @example 'Bắc Giang'
     */
    public static function province()
    {
        return static::randomElement(static::$province);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      <?php

namespace Faker\Provider\vi_VN;

class Color extends \Faker\Provider\Color
{
    protected static $safeColorNames = array(
        'đen', 'xanh', 'ô liu',
        'tím ', 'vôi', 'xanh', 'bạc',
        'xám', 'vàng', 'trắng',
    );

    protected static $allColorNames = array(
        'Hổ phách', 'Ametit', 'Xanh berin',
        'Xanh da trời', 'Be', 'Nâu sẫm',
        'Đen', 'Xanh lam', 'Nâu',
        'Da bò', 'Cam cháy', 'Hồng y',
        'Đỏ yên chi', 'Men ngọc', 'Anh đào',
        'Xanh hoàng hôn', 'Xanh nõn chuối', 'Xanh cô ban',
        'Đồng', 'San hô', 'Kem',
        'Đỏ thắm', 'Xanh lơ', 'Lục bảo',
        'Vàng kim loại', 'Xám', 'Xanh lá cây',
        'Vòi voi', 'Chàm', 'Ngọc thạch',
        'Kaki', 'Oải hương', 'Vàng chanh',
        'Hồng sẫm', 'Hạt dẻ', 'Cẩm quỳ',
        'Hoa cà', 'Lam sẫm', 'Ochre',
        'Ô liu', 'Da cam', 'Lan tím',
        'Lòng đào', 'Dừa cạn', 'Hồng',
        'Mận', 'Xanh thủy tinh', 'Hồng đất',
        'Tía', 'Đỏ', 'Cá hồi',
        'Đỏ tươi', 'Nâu đen',
        'Bạc', 'Nâu tanin', 'Mòng két',
        'Xanh Thổ', 'Đỏ son', 'Tím',
        'Xanh crôm', 'Trắng', 'Vàng',
    );
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         <?php

namespace Faker\Provider\vi_VN;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{lastName}} {{firstNameMale}}',
        '{{titleMale}}. {{lastName}} {{firstNameMale}}',
        '{{lastName}} {{middleNameMale}} {{firstNameMale}}',
        '{{titleMale}}. {{lastName}} {{middleNameMale}} {{firstNameMale}}',
    );

    protected static $femaleNameFormats = array(
        '{{lastName}} {{firstNameFemale}}',
        '{{titleFemale}}. {{lastName}} {{firstNameFemale}}',
        '{{lastName}} {{middleNameFemale}} {{firstNameFemale}}',
        '{{titleFemale}}. {{lastName}} {{middleNameFemale}} {{firstNameFemale}}',
    );

    protected static $middleNameFormat = array(
      '{{firstNameMale}}',
      '{{firstNameFemale}}',
    );

    /**
     * @link http://www.dattenhay.vn/1001-ten-cho-be-trai.htm
     */
    protected static $firstNameMale = array(
        'An', 'Anh',
        'Bào', 'Bình', 'Bạch', 'Bảo', 'Bắc', 'Bằng', 'Bổng', 'Bửu',
        'Ca', 'Canh', 'Chiến', 'Chiểu', 'Châu', 'Chính', 'Chương', 'Chưởng', 'Chấn', 'Công', 'Cơ', 'Cương', 'Cường', 'Cảnh', 'Cần', 'Cẩn',
        'Danh', 'Di', 'Dinh', 'Diệp', 'Diệu', 'Du', 'Duy', 'Duệ', 'Dân', 'Dũng', 'Dương', 'Dụng',
        'Giang', 'Giác', 'Giáp',
        'Hiên', 'Hiếu', 'Hiền', 'Hiển', 'Hiệp', 'Hoa', 'Hoài', 'Hoàn', 'Hoàng', 'Hoán', 'Huy', 'Huynh', 'Huấn', 'Huỳnh', 'Hà', 'Hành', 'Hào', 'Hòa', 'Hùng', 'Hưng', 'Hạnh', 'Hải', 'Hảo', 'Hậu', 'Học', 'Hồng', 'Hội', 'Hợp', 'Hữu', 'Hỷ',
        'Kha', 'Khang', 'Khanh', 'Khiêm', 'Khiếu', 'Khoa', 'Khoát', 'Khánh', 'Khôi', 'Khương', 'Khải', 'Kim', 'Kiên', 'Kiếm', 'Kiện', 'Kiệt', 'Kính', 'Kỳ', 'Kỷ',
        'Lai', 'Lam', 'Linh', 'Liêm', 'Long', 'Luận', 'Luật', 'Lâm', 'Lân', 'Lý', 'Lĩnh', 'Lương', 'Lạc', 'Lập', 'Lễ', 'Lộ', 'Lộc', 'Lực',
        'Minh', 'Mạnh', 'Mẫn', 'Mỹ',
        'Nam', 'Nghiêm', 'Nghiệp', 'Nghĩa', 'Nghị', 'Nguyên', 'Ngân', 'Ngôn', 'Ngạn', 'Ngọc', 'Nhiên', 'Nhu', 'Nhuận', 'Nhân', 'Nhã', 'Nhượng', 'Nhạn', 'Nhật', 'Ninh',
        'Phi', 'Phong', 'Pháp', 'Phát', 'Phú', 'Phúc', 'Phương', 'Phước', 'Phụng',
        'Quang', 'Quyết', 'Quyền', 'Quân', 'Quý', 'Quảng', 'Quế', 'Quốc', 'Quỳnh',
        'Sang', 'Sinh', 'Siêu', 'Sáng', 'Sâm', 'Sĩ', 'Sơn', 'Sử', 'Sỹ',
        'Thanh', 'Thiên', 'Thiện', 'Thuận', 'Thành', 'Thái', 'Thông', 'Thúc', 'Thạc', 'Thạch', 'Thắng', 'Thể', 'Thịnh', 'Thọ', 'Thống', 'Thời', 'Thụy', 'Thủy', 'Thực', 'Tiến', 'Tiếp', 'Tiền', 'Tiển', 'Toàn', 'Toại', 'Toản', 'Trang', 'Triết', 'Triều', 'Triệu', 'Trung', 'Trác', 'Tráng', 'Trân', 'Trình', 'Trí', 'Trúc', 'Trường', 'Trưởng', 'Trạch', 'Trọng', 'Trụ', 'Trực', 'Tuyền', 'Tuấn', 'Tuệ', 'Tài', 'Tâm', 'Tân', 'Tín', 'Tùng', 'Tú', 'Tường', 'Tấn', 'Tụ', 'Từ',
        'Uy',
        'Vinh', 'Viên', 'Việt', 'Vu', 'Võ', 'Văn', 'Vĩ', 'Vĩnh', 'Vũ', 'Vương', 'Vượng', 'Vịnh', 'Vỹ',
        'Xuân',
        'Yên',
        'Án', 'Ân',
        'Đan', 'Điền', 'Điệp', 'Đoàn', 'Đình', 'Đôn', 'Đăng', 'Đại', 'Đạo', 'Đạt', 'Định', 'Đồng', 'Độ', 'Đức', 'Đức',
        'Ẩn',
    );

    /**
     * @link http://www.dattenhay.vn/1001-ten-cho-be-trai.htm
     */
    protected static $middleNameMale = array(
        'An', 'Anh',
        'Bá', 'Bách', 'Bình', 'Bích', 'Bảo', 'Bằng', 'Bửu', 'Bữu',
        'Cao', 'Chiêu', 'Chiến', 'Chung', 'Chuẩn', 'Chánh', 'Chí', 'Chính', 'Chấn', 'Chế', 'Cát', 'Công', 'Cương', 'Cường', 'Cảnh',
        'Danh', 'Duy', 'Dân', 'Dũng', 'Dương',
        'Gia', 'Giang',
        'Hiếu', 'Hiền', 'Hiểu', 'Hiệp', 'Hoài', 'Hoàn', 'Hoàng', 'Huy', 'Huân', 'Hà', 'Hào', 'Hán', 'Hòa', 'Hùng', 'Hưng', 'Hướng', 'Hạnh', 'Hạo', 'Hải', 'Hồ', 'Hồng', 'Hữu',
        'Khai', 'Khang', 'Khoa', 'Khuyến', 'Khánh', 'Khôi', 'Khương', 'Khải', 'Khắc', 'Khởi', 'Kim', 'Kiên', 'Kiến', 'Kiệt', 'Kỳ',
        'Lam', 'Liên', 'Long', 'Lâm', 'Lương', 'Lạc', 'Lập',
        'Minh', 'Mạnh', 'Mộng',
        'Nam', 'Nghĩa', 'Nghị', 'Nguyên', 'Nguyễn', 'Ngọc', 'Nhân', 'Như', 'Nhất', 'Nhật', 'Niệm',
        'Phi', 'Phong', 'Phú', 'Phúc', 'Phương', 'Phước', 'Phượng', 'Phục', 'Phụng',
        'Quang', 'Quyết', 'Quân', 'Quý', 'Quảng', 'Quốc',
        'Song', 'Sĩ', 'Sơn', 'Sỹ',
        'Tài', 'Tạ',
        'Ân',
        'Đan', 'Đinh', 'Đoàn', 'Đình', 'Đông', 'Đăng', 'Đại', 'Đạt', 'Đắc', 'Định', 'Đồng', 'Đức', 'Đăng', 'Đức',
    );

    /**
     * @link http://www.dattenhay.vn/1001-ten-cho-be-gai.htm
     */
    protected static $firstNameFemale = array(
        'An', 'Anh',
        'Bình', 'Bích', 'Băng', 'Bạch', 'Bảo',
        'Ca', 'Chi', 'Chinh', 'Chiêu', 'Chung', 'Châu', 'Cát', 'Cúc', 'Cương', 'Cầm',
        'Dao', 'Di', 'Diễm', 'Diệp', 'Diệu', 'Du', 'Dung', 'Duyên', 'Dân', 'Dương',
        'Giang', 'Giao',
        'Hiếu', 'Hiền', 'Hiệp', 'Hoa', 'Hoan', 'Hoài', 'Hoàn', 'Huyền', 'Huệ', 'Hà', 'Hân', 'Hòa', 'Hương', 'Hường', 'Hạ', 'Hạnh', 'Hải', 'Hảo', 'Hậu', 'Hằng', 'Hồng', 'Hợp',
        'Khai', 'Khanh', 'Khuyên', 'Khuê', 'Khánh', 'Khê', 'Khôi', 'Kim', 'Kiều',
        'Lam', 'Lan', 'Linh', 'Liên', 'Liễu', 'Loan', 'Ly', 'Lâm', 'Lý', 'Lễ', 'Lệ', 'Lộc', 'Lợi',
        'Mai', 'Mi', 'Minh', 'Miên', 'My', 'Mẫn', 'Mỹ',
        'Nga', 'Nghi', 'Nguyên', 'Nguyệt', 'Ngà', 'Ngân', 'Ngôn', 'Ngọc', 'Nhi', 'Nhiên', 'Nhung', 'Nhàn', 'Nhân', 'Nhã', 'Như', 'Nương', 'Nữ',
        'Oanh',
        'Phi',
        'Phong', 'Phúc', 'Phương', 'Phước', 'Phượng', 'Phụng',
        'Quyên', 'Quân', 'Quế', 'Quỳnh',
        'Sa', 'San', 'Sinh', 'Sương',
        'Thanh', 'Thảo', 'Thi', 'Thiên', 'Thiện', 'Thoa', 'Thoại', 'Thu', 'Thuần', 'Thuận', 'Thy', 'Thêu', 'Thùy', 'Thúy', 'Thơ', 'Thư', 'Thương', 'Thường', 'Thảo', 'Thắm', 'Thục', 'Thủy', 'Tiên', 'Trang', 'Trinh', 'Trung', 'Trà', 'Trâm', 'Trân', 'Trúc', 'Trầm', 'Tuyến', 'Tuyết', 'Tuyền', 'Tuệ', 'Ty', 'Tâm', 'Tú',
        'Uyên', 'Uyển',
        'Vi', 'Việt',
        'Vy', 'Vân', 'Vũ', 'Vọng', 'Vỹ',
        'Xuyến', 'Xuân',
        'Yên', 'Yến',
        'Ái', 'Ánh', 'Ân',
        'Đan', 'Điệp', 'Đoan', 'Đài', 'Đàn', 'Đào', 'Đình', 'Đường', 'Đan',
        'Ý',
    );

    /**
     * @link http://www.dattenhay.vn/1001-ten-cho-be-gai.htm
     */
    protected static $middleNameFemale = array(
        'An', 'Anh',
        'Ban', 'Bích', 'Băng', 'Bạch', 'Bảo', 'Bội',
        'Cam', 'Chi', 'Chiêu', 'Cát', 'Cẩm',
        'Di', 'Diên', 'Diễm', 'Diệp', 'Diệu', 'Duy', 'Duyên', 'Dã', 'Dạ',
        'Gia', 'Giang', 'Giao', 'Giáng',
        'Hiếu', 'Hiền', 'Hiểu', 'Hoa', 'Hoài', 'Hoàn', 'Hoàng', 'Huyền', 'Huệ', 'Huỳnh', 'Hà', 'Hàm', 'Hương', 'Hạ', 'Hạc', 'Hạnh', 'Hải', 'Hảo', 'Hằng', 'Họa', 'Hồ', 'Hồng',
        'Khiết', 'Khuê', 'Khánh', 'Khúc', 'Khả', 'Khải', 'Kim', 'Kiết', 'Kiều', 'Kỳ',
        'Lam', 'Lan', 'Linh', 'Liên', 'Liễu', 'Loan', 'Ly', 'Lâm', 'Lê', 'Lưu', 'Lệ', 'Lộc', 'Lục',
        'Mai', 'Minh', 'Mậu', 'Mộc', 'Mộng', 'Mỹ',
        'Nghi', 'Nguyên', 'Nguyết', 'Nguyệt', 'Ngân', 'Ngọc', 'Nhan', 'Nhã', 'Như', 'Nhất', 'Nhật',
        'Oanh',
        'Phi', 'Phong', 'Phương', 'Phước', 'Phượng', 'Phụng',
        'Quế', 'Quỳnh',
        'Sao', 'Song', 'Sông', 'Sơn', 'Sương',
        'Thanh', 'Thi', 'Thiên', 'Thiếu', 'Thiều', 'Thiện', 'Thu', 'Thuần', 'Thy', 'Thái', 'Thùy', 'Thúy', 'Thơ', 'Thư', 'Thương', 'Thạch', 'Thảo', 'Thục', 'Thụy', 'Thủy', 'Tiên', 'Tiểu', 'Trang', 'Triều', 'Triệu', 'Trà', 'Trâm', 'Trân', 'Trúc', 'Trầm', 'Tuyết', 'Tuệ', 'Tâm', 'Tùng', 'Tùy', 'Tú', 'Túy', 'Tường', 'Tịnh', 'Tố', 'Từ',
        'Uyên', 'Uyển',
        'Vi', 'Việt', 'Vy', 'Vàng', 'Vành', 'Vân', 'Vũ',
        'Xuyến', 'Xuân',
        'Yên', 'Yến',
        'Ái', 'Ánh',
        'Đan', 'Đinh', 'Đoan', 'Đài', 'Đông', 'Đồng', 'Đan', 'Đoan',
        'Ý',
    );

    /**
     * @link http://vi.wikipedia.org/wiki/H%E1%BB%8D_ng%C6%B0%E1%BB%9Di_Vi%E1%BB%87t_Nam
     */
    protected static $lastName = array(
        'An', 'Ánh',
        'Ân', 'Âu', 'Ấu',
        'Biện', 'Bàng', 'Bành', 'Bá', 'Bì', 'Bình', 'Bùi', 'Bạc', 'Bạch', 'Bảo', 'Bế', 'Bồ', 'Bửu',
        'Ca', 'Cam', 'Cao', 'Chiêm', 'Chu', 'Chung', 'Châu', 'Chương', 'Chế', 'Chử', 'Cung', 'Cái', 'Cát', 'Cù', 'Cấn', 'Cầm', 'Cổ', 'Cự',
        'Danh', 'Diêm', 'Diệp', 'Doãn', 'Dã', 'Dư', 'Dương',
        'Đan', 'Đàm', 'Đào', 'Đái', 'Đặng', 'Đậu', 'Đinh', 'Điền', 'Đoàn', 'Đôn', 'Đồng', 'Đổng', 'Đỗ', 'Đới', 'Đường',
        'Giang', 'Giao', 'Giáp', 'Giả',
        'Hoa', 'Hoàng', 'Huỳnh', 'Hy', 'Hà', 'Hàn', 'Hàng', 'Hán', 'Hình', 'Hùng', 'Hạ', 'Hồ', 'Hồng', 'Hứa',
        'Kha', 'Khoa', 'Khu', 'Khuất', 'Khâu', 'Khúc', 'Khưu', 'Khương', 'Khổng', 'Kim', 'Kiều',
        'La', 'Liễu', 'Lâm', 'Lã', 'Lê', 'Lò', 'Lô', 'Lý', 'Lư', 'Lưu', 'Lương', 'Lạc', 'Lại', 'Lều', 'Lỡ', 'Lục', 'Lữ', 'Lỳ',
        'Ma', 'Mai', 'Mang', 'Mâu', 'Mã', 'Mạc', 'Mạch', 'Mẫn', 'Mộc',
        'Nghiêm', 'Nghị', 'Nguyễn', 'Ngân', 'Ngô', 'Ngụy', 'Nhiệm', 'Nhâm', 'Nhậm', 'Nhữ', 'Ninh', 'Nông',
        'Ong',
        'Ông',
        'Phan', 'Phi', 'Phí', 'Phó', 'Phùng', 'Phương', 'Phạm',
        'Quách', 'Quản',
        'Sơn', 'Sử',
        'Thi', 'Thiều', 'Thào', 'Thái', 'Thân', 'Thôi', 'Thạch', 'Thập', 'Thịnh', 'Tiêu', 'Tiếp', 'Trang', 'Triệu', 'Trà', 'Trác', 'Trình', 'Trưng', 'Trương', 'Trần', 'Trịnh', 'Ty', 'Tào', 'Tòng', 'Tô', 'Tôn', 'Tông', 'Tăng', 'Tạ', 'Tống', 'Từ',
        'Ung', 'Uông',
        'Vi', 'Viên', 'Võ', 'Văn', 'Vũ', 'Vương', 'Vừ', 'Xa',
        'Yên',
    );

    protected static $titleMale = array('Cụ', 'Ông', 'Bác', 'Chú', 'Anh', 'Em');

    protected static $titleFemale = array('Cụ', 'Bà', 'Bác', 'Cô', 'Chị', 'Em');

    public function middleName($gender = null)
    {
        if ($gender === static::GENDER_MALE) {
            return static::middleNameMale();
        } elseif ($gender === static::GENDER_FEMALE) {
            return static::middleNameFemale();
        }

        return $this->generator->parse(static::randomElement(static::$middleNameFormat));
    }

    public static function middleNameMale()
    {
        return static::randomElement(static::$middleNameMale);
    }

    public static function middleNameFemale()
    {
        return static::randomElement(static::$middleNameFemale);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   <?php

namespace Faker\Provider\vi_VN;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    protected static $areaCodes = array(
        76, 281, 64, 781, 240, 241,
        75, 650, 56, 651, 62, 780,
        26, 710, 511, 500, 510, 230,
        61, 67, 59, 219, 351, 4,
        39, 320, 31, 711, 218, 321,
        8, 58, 77, 60, 231, 25,
        20, 63, 72, 350, 38, 30,
        68, 210, 57, 52, 510, 55,
        33, 53, 79, 22, 66, 36,
        280, 37, 54, 73, 74, 27,
        70, 211, 29,
        // Mobile
        96, 97, 98, 162, 163, 164, 165, 166, 167, 168, 169, // Viettel
        91, 94, 123, 124, 125, 127, 129, // Vinaphone
        90, 93, 120, 121, 122, 126, 128, // Mobifone
        92, 186, 188, // Vietnamobile
        99, 199, // Gmobile
        95, // Sfone
    );

    protected static $formats = array(
        '7' => array(
            '0[a] ### ####',
            '(0[a]) ### ####',
            '0[a]-###-####',
            '(0[a])###-####',
            '84-[a]-###-####',
            '(84)([a])###-####',
            '+84-[a]-###-####',
        ),
        '8' => array(
            '0[a] #### ####',
            '(0[a]) #### ####',
            '0[a]-####-####',
            '(0[a])####-####',
            '84-[a]-####-####',
            '(84)([a])####-####',
            '+84-[a]-####-####',
        ),
    );

    public function phoneNumber()
    {
        $areaCode = static::randomElement(static::$areaCodes);
        $areaCodeLength = strlen($areaCode);
        $digits = 7;

        if ($areaCodeLength < 2) {
            $digits = 8;
        }

        return static::numerify(str_replace('[a]', $areaCode, static::randomElement(static::$formats[$digits])));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         <?php

namespace Faker\Provider\zh_CN;

class Address extends \Faker\Provider\Address
{

    protected static $cites = array(
        '北京', '上海', '天津', '重庆',
        '哈尔滨', '长春', '沈阳', '呼和浩特',
        '石家庄', '乌鲁木齐', '兰州', '西宁',
        '西安', '银川', '郑州', '济南',
        '太原', '合肥', '武汉', '长沙',
        '南京', '成都', '贵阳', '昆明',
        '南宁', '拉萨', '杭州', '南昌',
        '广州', '福州', '海口',
        '香港', '澳门'
    );

    protected static $states = array(
        '北京市', '天津市', '河北省', '山西省',
        '内蒙古自治区', '辽宁省', '吉林省',
        '黑龙江省', '上海市', '江苏省',
        '浙江省', '安徽省', '福建省', '江西省',
        '山东省', '河南省', '湖北省', '湖南省',
        '广东省', '广西壮族自治区', '海南省',
        '重庆市', '四川省', '贵州省', '云南省',
        '西藏自治区', '陕西省', '甘肃省', '青海省',
        '宁夏回族自治区', '新疆维吾尔自治区',
        '香港特别行政区', '澳门特别行政区', '台湾省'
    );

    protected static $stateAbbr = array(
        '京', '皖', '渝', '闽',
        '甘', '粤', '桂', '黔',
        '琼', '冀', '豫', '黑',
        '鄂', '湘', '吉', '苏',
        '赣', '辽', '蒙', '宁',
        '青', '鲁', '晋', '陕',
        '沪', '川', '津', '藏',
        '新', '滇', '浙', '港',
        '澳', '台'
    );

    protected static $areas = array(
        '西夏区', '永川区', '秀英区', '高港区',
        '清城区', '兴山区', '锡山区', '清河区',
        '龙潭区', '华龙区', '海陵区', '滨城区',
        '东丽区', '高坪区', '沙湾区', '平山区',
        '城北区', '海港区', '沙市区', '双滦区',
        '长寿区', '山亭区', '南湖区', '浔阳区',
        '南长区', '友好区', '安次区', '翔安区',
        '沈河区', '魏都区', '西峰区', '萧山区',
        '金平区', '沈北新区', '孝南区', '上街区',
        '城东区', '牧野区', '大东区', '白云区',
        '花溪区', '吉利区', '新城区', '怀柔区',
        '六枝特区', '涪城区', '清浦区', '南溪区',
        '淄川区', '高明区', '金水区', '中原区',
        '高新开发区', '经济开发新区', '新区'
    );

    protected static $country = array(
        '阿富汗', '阿拉斯加', '阿尔巴尼亚', '阿尔及利亚',
        '安道尔', '安哥拉', '安圭拉岛英', '安提瓜和巴布达',
        '阿根廷', '亚美尼亚', '阿鲁巴岛', '阿森松', '澳大利亚',
        '奥地利', '阿塞拜疆', '巴林', '孟加拉国', '巴巴多斯',
        '白俄罗斯', '比利时', '伯利兹', '贝宁', '百慕大群岛',
        '不丹', '玻利维亚', '波斯尼亚和黑塞哥维那', '博茨瓦纳',
        '巴西', '保加利亚', '布基纳法索', '布隆迪', '喀麦隆',
        '加拿大', '加那利群岛', '佛得角', '开曼群岛', '中非',
        '乍得', '智利', '圣诞岛', '科科斯岛', '哥伦比亚',
        '巴哈马国', '多米尼克国', '科摩罗', '刚果', '科克群岛',
        '哥斯达黎加', '克罗地亚', '古巴', '塞浦路斯', '捷克',
        '丹麦', '迪戈加西亚岛', '吉布提', '多米尼加共和国',
        '厄瓜多尔', '埃及', '萨尔瓦多', '赤道几内亚',
        '厄立特里亚', '爱沙尼亚', '埃塞俄比亚', '福克兰群岛',
        '法罗群岛', '斐济', '芬兰', '法国', '法属圭亚那',
        '法属波里尼西亚', '加蓬', '冈比亚', '格鲁吉亚', '德国',
        '加纳', '直布罗陀', '希腊', '格陵兰岛', '格林纳达',
        '瓜德罗普岛', '关岛', '危地马拉', '几内亚', '几内亚比绍',
        '圭亚那', '海地', '夏威夷', '洪都拉斯', '匈牙利', '冰岛',
        '印度', '印度尼西亚', '伊郎', '伊拉克', '爱尔兰', '以色列',
        '意大利', '科特迪瓦', '牙买加', '日本', '约旦', '柬埔塞',
        '哈萨克斯坦', '肯尼亚', '基里巴斯', '朝鲜', '韩国', '科威特',
        '吉尔吉斯斯坦', '老挝', '拉脱维亚', '黎巴嫩', '莱索托',
        '利比里亚', '利比亚', '列支敦士登', '立陶宛', '卢森堡',
        '马其顿', '马达加斯加', '马拉维', '马来西亚', '马尔代夫',
        '马里', '马耳他', '马里亚纳群岛', '马绍尔群岛', '马提尼克',
        '毛里塔尼亚', '毛里求斯', '马约特岛', '墨西哥', '密克罗尼西亚',
        '中途岛', '摩尔多瓦', '摩纳哥', '蒙古', '蒙特塞拉特岛',
        '摩洛哥', '莫桑比克', '缅甸', '纳米比亚', '瑙鲁', '尼泊尔',
        '荷兰', '荷属安的列斯群岛', '新喀里多尼亚群岛', '新西兰',
        '尼加拉瓜', '尼日尔', '尼日利亚', '纽埃岛', '诺福克岛',
        '挪威', '阿曼', '帕劳', '巴拿马', '巴布亚新几内亚', '巴拉圭',
        '秘鲁', '菲律宾', '波兰', '葡萄牙', '巴基斯坦', '波多黎各',
        '卡塔尔', '留尼汪岛', '罗马尼亚', '俄罗斯', '卢旺达',
        '东萨摩亚', '西萨摩亚', '圣马力诺', '圣皮埃尔岛及密克隆岛',
        '圣多美和普林西比', '沙特阿拉伯', '塞内加尔', '塞舌尔',
        '新加坡', '斯洛伐克', '斯洛文尼亚', '所罗门群岛', '索马里',
        '南非', '西班牙', '斯里兰卡', '圣克里斯托弗和尼维斯',
        '圣赫勒拿', '圣卢西亚', '圣文森特岛', '苏丹', '苏里南',
        '斯威士兰', '瑞典', '瑞士', '叙利亚', '塔吉克斯坦', '坦桑尼亚',
        '泰国', '阿拉伯联合酋长国', '多哥', '托克劳群岛', '汤加',
        '特立尼达和多巴哥', '突尼斯', '土耳其', '土库曼斯坦',
        '特克斯和凯科斯群岛(', '图瓦卢', '美国', '乌干达', '乌克兰',
        '英国', '乌拉圭', '乌兹别克斯坦', '瓦努阿图', '梵蒂冈',
        '委内瑞拉', '越南', '维尔京群岛', '维尔京群岛和圣罗克伊',
        '威克岛', '瓦里斯和富士那群岛', '西撒哈拉', '也门', '南斯拉夫',
        '扎伊尔', '赞比亚', '桑给巴尔', '津巴布韦', '中华人民共和国', '中国'
    );

    public function city()
    {
        return static::randomElement(static::$cites);
    }

    public function state()
    {
        return static::randomElement(static::$states);
    }

    public function stateAbbr()
    {
        return static::randomElement(static::$stateAbbr);
    }

    public static function area()
    {
         return static::randomElement(static::$areas);
    }

    public static function country()
    {
         return static::randomElement(static::$country);
    }

    public function address()
    {
         return $this->city() . static::area();
    }

    public static function postcode()
    {
        $prefix = str_pad(mt_rand(1, 85), 2, 0, STR_PAD_LEFT);
        $suffix = '00';

        return $prefix . mt_rand(10, 88) . $suffix;
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         <?php

namespace Faker\Provider\zh_CN;

class Color extends \Faker\Provider\Color
{
    /**
     * @link https://zh.wikipedia.org/zh-cn/%E9%A2%9C%E8%89%B2%E5%88%97%E8%A1%A8
     */
    protected static $safeColorNames = array(
        '黑色', '粟色', '绿色', '藏青', '橄榄色',
        '紫', '凫绿', '鲜绿色', '蓝色', '银色',
        '灰色', '黄色', '品红', '水色', '白色'
    );

    protected static $allColorNames = array(
        '黑色', '昏灰', '灰色', '暗灰', '银色', '亮灰色',
        '庚斯博罗灰', '白烟色', '白色', '雪色', '铁灰色',
        '沙棕', '玫瑰褐', '亮珊瑚色', '印度红', '褐色',
        '耐火砖红', '栗色', '暗红', '鲜红', '红色', '柿子橙',
        '雾玫瑰色', '鲑红', '腥红', '蕃茄红', '暗鲑红',
        '珊瑚红', '橙红', '亮鲑红', '朱红', '赭黄', '热带橙',
        '驼色', '杏黄', '椰褐', '海贝色', '鞍褐', '巧克力色',
        '燃橙', '阳橙', '粉扑桃色', '沙褐', '古铜色', '亚麻色',
        '蜜橙', '秘鲁色', '乌贼墨色', '赭色', '陶坯黄', '橘色',
        '暗橙', '古董白', '日晒色', '硬木色', '杏仁白',
        '那瓦霍白', '万寿菊黄', '蕃木瓜色', '灰土色',
        '卡其色', '鹿皮鞋色', '旧蕾丝色', '小麦色', '桃色',
        '橙色', '花卉白', '金菊色', '暗金菊色', '咖啡色',
        '茉莉黄', '琥珀色', '玉米丝色', '铬黄', '金色',
        '柠檬绸色', '亮卡其色', '灰金菊色', '暗卡其色',
        '含羞草黄', '奶油色', '象牙色', '米黄色', '亮黄',
        '亮金菊黄', '香槟黄', '芥末黄', '月黄', '橄榄色',
        '鲜黄', '黄色', '苔藓绿', '亮柠檬绿', '橄榄军服绿',
        '黄绿', '暗橄榄绿', '苹果绿', '绿黄', '草绿', '草坪绿',
        '查特酒绿', '叶绿', '嫩绿', '明绿', '钴绿', '蜜瓜绿',
        '暗海绿', '亮绿', '灰绿', '常春藤绿', '森林绿',
        '柠檬绿', '暗绿', '绿色', '鲜绿色', '孔雀石绿',
        '薄荷绿', '青瓷绿', '碧绿', '绿松石绿', '铬绿', '苍色',
        '海绿', '中海绿', '薄荷奶油色', '春绿', '孔雀绿',
        '中春绿色', '中碧蓝色', '碧蓝色', '青蓝', '水蓝',
        '绿松石蓝', '绿松石色', '亮海绿', '中绿松石色',
        '亮青', '浅蓝', '灰绿松石色', '暗岩灰', '凫绿', '暗青',
        '青色', '水色', '暗绿松石色', '军服蓝', '孔雀蓝',
        '婴儿粉蓝', '浓蓝', '亮蓝', '灰蓝', '萨克斯蓝',
        '深天蓝', '天蓝', '亮天蓝', '水手蓝', '普鲁士蓝',
        '钢青色', '爱丽丝蓝', '岩灰', '亮岩灰', '道奇蓝',
        '矿蓝', '湛蓝', '韦奇伍德瓷蓝', '亮钢蓝', '钴蓝',
        '灰丁宁蓝', '矢车菊蓝', '鼠尾草蓝', '暗婴儿粉蓝',
        '蓝宝石色', '国际奇连蓝', '蔚蓝', '品蓝', '暗矿蓝',
        '极浓海蓝', '天青石蓝', '幽灵白', '薰衣草紫',
        '长春花色', '午夜蓝', '藏青', '暗蓝', '中蓝', '蓝色',
        '紫藤色', '暗岩蓝', '岩蓝', '中岩蓝', '木槿紫',
        '紫丁香色', '中紫红', '紫水晶色', '浅灰紫红',
        '缬草紫', '矿紫', '蓝紫', '紫罗兰色', '靛色', '暗兰紫',
        '暗紫', '三色堇紫', '锦葵紫', '优品紫红', '中兰紫',
        '淡紫丁香色', '蓟紫', '铁线莲紫', '梅红色', '亮紫',
        '紫色', '暗洋红', '洋红', '品红', '兰紫', '浅珍珠红',
        '陈玫红', '浅玫瑰红', '中青紫红', '洋玫瑰红',
        '玫瑰红', '红宝石色', '山茶红', '深粉红', '火鹤红',
        '浅珊瑚红', '暖粉红', '勃根第酒红', '尖晶石红',
        '胭脂红', '浅粉红', '枢机红', '薰衣草紫红', '灰紫红',
        '樱桃红', '浅鲑红', '绯红', '粉红', '亮粉红', '壳黄红',
        '茜红',
    );
}
                                                                                                                                <?php

namespace Faker\Provider\zh_CN;

class Company extends \Faker\Provider\Company
{
    protected static $formats = array(
        '{{companyPrefix}}{{companySuffix}}'
    );

    protected static $companyPrefix = array(
        '超艺', '和泰', '九方', '鑫博腾飞', '戴硕电子',
        '济南亿次元', '海创', '创联世纪', '凌云', '泰麒麟',
        '彩虹', '兰金电子', '晖来计算机', '天益', '恒聪百汇',
        '菊风公司', '惠派国际公司', '创汇', '思优', '时空盒数字',
        '易动力', '飞海科技', '华泰通安', '盟新', '商软冠联',
        '图龙信息', '易动力', '华远软件', '创亿', '时刻',
        '开发区世创', '明腾', '良诺', '天开', '毕博诚', '快讯',
        '凌颖信息', '黄石金承', '恩悌', '雨林木风计算机',
        '双敏电子', '维旺明', '网新恒天', '数字100', '飞利信',
        '立信电子', '联通时科', '中建创业', '新格林耐特',
        '新宇龙信息', '浙大万朋', 'MBP软件', '昂歌信息',
        '万迅电脑', '方正科技', '联软', '七喜', '南康', '银嘉',
        '巨奥', '佳禾', '国讯', '信诚致远', '浦华众城', '迪摩',
        '太极', '群英', '合联电子', '同兴万点', '襄樊地球村',
        '精芯', '艾提科信', '昊嘉', '鸿睿思博', '四通', '富罳',
        '商软冠联', '诺依曼软件', '东方峻景', '华成育卓', '趋势',
        '维涛', '通际名联'
    );

    protected static $companySuffix = array('科技', '网络', '信息', '传媒');

    /**
     * @see blog.renren.com/share/223844062/2387611567
     * @var array
     */
    protected static $catchPhrase = array(
        '燕舞，燕舞，一曲歌来一片情。',
        '康师傅方便面，好吃看得见。',
        '不要太潇洒！',
        '让一亿人先聪明起来。',
        '共创美的前程，共度美的人生。',
        '省优，部优，葛优？',
        '喝孔府宴酒，做天下文章。',
        '健康成就未来。',
        '牙好，胃口就好，身体倍儿棒，吃嘛嘛香。',
        '永远的绿色，永远的秦池。',
        '坐红旗车，走中国路。',
        '要想皮肤好，早晚用大宝。',
        '孔府家酒，叫人想家。',
        '补钙新观念，吸收是要害。',
        '喝汇源果汁，走健康之路。',
        '爱的就是你!',
        '一种可以世袭的古典浪漫',
        '实力创造价值',
        '爱生活，爱拉芳！',
        '人类失去联想，世界将会怎样？',
        '做女人挺好！',
        '世界在你眼中？',
        '今天你有否亿唐？',
        '只溶在口，不溶在手。',
        '三千烦恼丝，健康新开始。',
        '维维豆奶，欢乐开怀。',
        '我们的光彩来自你的风采。',
        '钻石恒久远，一颗永流传。',
        '放我的真心在你的手心。',
        '小身材，大味道。',
        '牛奶香浓，丝般感受。',
        '聆听并不代表沉默，有时安静也是一种力量。',
        '滴滴香浓，意犹未尽。',
        '水晶之恋，一生不变。',
        '中国移动通信，沟通从心开始！',
        '网易，网聚人的力量！',
        '科技以人为本，诺基亚',
        '我们一直在努力！',
        '阳光总在风雨后',
        '男人对西服的要求，就是女人对男人的要求',
        '晚报，不晚报',
        '原来生活可以更美的',
        '明天的明天，你还会送我“水晶之恋”吗？',
        '卫浴出出进进的快感',
        '有家就有联合利华',
        '减脂减肥，其实是一种生活态度',
        '人头马一开，好事自然来。',
        '假如五指一样长，怎能满足用户不同需求？',
        '新飞广告做的好，不好新飞冰箱好',
        '传奇品质，百年张裕',
        '李宁：把出色留给自己',
        '一旦拥有，别无选择',
        '科技让你更轻松',
        '情系中国结，联通四海心',
        '海尔，中国造',
        'SOHU：足迹生活每一天',
        '果冻我要喜之郎',
        '国宝大熊猫，心纯天自高',
        '世界因为不同',
        '放低偏见，你会有出色发现！',
        'Just',
        '创意似金，敬业如牛',
        '不要让男人一手把握',
        '如同情人的手',
        '金窝银窝，不如自己的安乐窝。',
        '没有什么大不了的',
        '时间因我存在',
        '只要有梦想',
        '南方周末',
        '时间改变一切',
        '地球人都知道了',
        '众里寻他千百度，想要几度就几度',
        '您身边的银行，可信赖的银行',
        '三叶钢琴：学琴的孩子不会变坏',
        '柯达：串起生活每一刻',
        '大众甲克虫汽车：想想还是小的好',
        '一直被模拟,从未被超越',
        '幸福生活',
        '朗讯的创造力科技的原动力',
        '事事因你而出色',
        '运动之美，世界共享',
        '鹤舞白沙',
        '想知道“清嘴”的味道吗？',
        '弹指一挥间，世界皆互联',
        '更多选择、更多欢笑',
        '方太，让家的感觉更好',
        '世上仅此一件，今生与你结缘！',
        '白里透红与众不同',
        '没有蛀牙-佳洁士',
        '有线的价值',
        '享受快乐科技',
        '四海一家的解决之道',
        '娃哈哈纯净水：爱你等于爱自己',
        '农民山泉：有点甜',
        '博大精深，西门子',
        '一切尽在把握',
        '声声百思特，遥遥两相知',
        '一呼天下应',
        '让我们做得更好！',
        '暖和亲情，金龙鱼的大家庭。',
        '自然最健康，绿色好心情',
        '支起网络世界',
        '立邦漆：处处放光彩！',
        'fm365:真情互动！',
        '庄重一生，吉祥一生。',
        '人人都为礼品愁，我送北极海狗油。',
        '假如说人生的离合是一场戏，那么百年的好合更是早有安排！',
        '一品黄山天高云淡',
        '上上下下的享受！',
        '我是、我行、我素',
        '让无力者有力，让悲观者前行',
        '金利来—-男人的世界！',
        '百衣百顺',
        '聪明何必绝顶，慧根长留',
        '水往高处流',
        '大石化小，小石化了！',
        '“闲”妻良母',
        '“口服”，“心服”！',
        '盛满青春的秘密！',
        '三十六计走为上',
        '为了她的节日，献上您纯金般的心！',
        '用我们的钓线，你可以在鱼儿发现你之前先找到它',
        '生活就是一场运动，喝下它。',
        '选择维聚阿尔，已经表明你心明眼亮。',
        '佳能，我们看得见你想表达什么。',
        '天天都是春天',
        '假如你不来，广告明星就是他',
        '享受黑夜中偷拍的快感！',
        '彩信发送动人一刻',
        '灵感点亮生活!',
        '聪明演绎，无处不在！',
        '事业我一定争取，对你我从未放弃!',
        '波导手机，手机中的战斗机',
        '鄂尔多斯羊绒衫暖和全世界',
        '洁婷245再大的动作也不要紧',
        '做光明的牛，产光明的奶',
        '假如你的汽车会游泳的话，请照直开，不必刹车。',
        '永远要让驾驶执照比你自己先到期。',
        '请记住，上帝并不是十全十美的，它给汽车预备了备件，而人没有。',
        '小别意酸酸，欢聚心甜甜。',
        '除钞票外，承印一切。',
        '更多欢乐，更多选择',
        '美由你做主',
        '由我天地宽',
        'Sun是太阳，Java是月亮。',
        '不断创新，因为专心',
        '趁早下『斑』，请勿『痘』留。',
        '请不要同刚刚走出本院的女人调情，她或许就是你的外祖母。',
        '创新就是生活',
        '有一个漂亮的地方，万科四季花城',
        '建筑无限生活',
        '臭名远扬，香飘万里',
        '尝尝欢笑，经常麦当劳',
        '深入成就深度',
        '出色湖南，红网了然！',
        '因为网络，地球如村！',
        '一种质感',
        '恒久期盼',
        '繁荣民族文化',
        '不信，死给你看！',
        '天生的，强生的',
        '雪津啤酒，真情的味道！',
        '听世界，打天下',
        '雅芳比女人更了解女人',
        'Sun是太阳，Java是月亮。',
        '中国网通',
        '无线你的无限',
        '家有三洋，冬暖夏凉',
        '倾诉冬日暖语',
        '谁让我心动？',
        '灵活，让篮球场不再是一个平面',
        '别吻我，我怕修。',
        '一呼四应！',
        '无所不包！',
        '当之无愧',
        '以帽取人！',
        '一毛不拔！',
        '自讨苦吃！',
        '成功与科技共辉映',
        '没有最',
    );

    public static function companyPrefix()
    {
        return static::randomElement(static::$companyPrefix);
    }

    public static function companySuffix()
    {
        return parent::companySuffix() . '有限公司';
    }

    public function catchPhrase()
    {
        return static::randomElement(static::$catchPhrase);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          <?php

namespace Faker\Provider\zh_CN;

class DateTime extends \Faker\Provider\DateTime
{
    public static function amPm($max = 'now')
    {
        return static::dateTime($max)->format('a') === 'am' ? '上午' : '下午';
    }

    public static function dayOfWeek($max = 'now')
    {
        $map = array(
            'Sunday' => '星期日',
            'Monday' => '星期一',
            'Tuesday' => '星期二',
            'Wednesday' => '星期三',
            'Thursday' => '星期四',
            'Friday' => '星期五',
            'Saturday' => '星期六',
        );
        $week = static::dateTime($max)->format('l');
        return isset($map[$week]) ? $map[$week] : $week;
    }

    public static function monthName($max = 'now')
    {
        $map = array(
            'January' => '一月',
            'February' => '二月',
            'March' => '三月',
            'April' => '四月',
            'May' => '五月',
            'June' => '六月',
            'July' => '七月',
            'August' => '八月',
            'September' => '九月',
            'October' => '十月',
            'November' => '十一月',
            'December' => '十二月',
        );
        $month = static::dateTime($max)->format('F');
        return isset($map[$month]) ? $map[$month] : $month;
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          <?php

namespace Faker\Provider\zh_CN;

class Payment extends \Faker\Provider\Payment
{
    /**
     * @see https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9B%BD%E9%93%B6%E8%A1%8C%E5%88%97%E8%A1%A8
     * @var array
     */
    protected static $banks = array(
        '渤海银行',
        '广发银行',
        '国家开发银行',
        '恒丰银行',
        '华夏银行',
        '交通银行',
        '平安银行',
        '上海浦东发展银行',
        '兴业银行',
        '招商银行',
        '浙商银行',
        '中国工商银行',
        '中国光大银行',
        '中国建设银行',
        '中国民生银行',
        '中国农业银行',
        '中国银行',
        '中国邮政储蓄银行',
        '中信银行',
    );

    /**
     * @example '中国建设银行'
     * @return string
     */
    public static function bank()
    {
        return static::randomElement(static::$banks);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   <?php

namespace Faker\Provider\zh_CN;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{lastName}}{{firstNameMale}}',
    );

    protected static $femaleNameFormats = array(
        '{{lastName}}{{firstNameFemale}}',
    );

    /**
     * According to http://baike.baidu.com/view/6109935.htm,
     * these are the top 300 lastnames from the 6th Chinese national census of population,
     * containing 299 single-character surname and 1 double-character surname '欧阳',
     * so you can get random names including double-character surname but not too many.
     */
    protected static $lastName = array(
        '李','王','张','刘','陈','杨','赵','黄','周','吴',
        '徐','孙','胡','朱','高','林','何','郭','马','罗',
        '梁','宋','郑','谢','韩','唐','冯','于','董','萧',
        '程','曹','袁','邓','许','傅','沉','曾','彭','吕',
        '苏','卢','蒋','蔡','贾','丁','林','薛','叶','阎',
        '余','潘','杜','戴','夏','钟','汪','田','任','姜',
        '范','方','石','姚','谭','廖','邹','熊','金','陆',
        '郝','孔','白','崔','康','毛','邱','秦','江','史',
        '顾','侯','邵','孟','龙','万','段','雷','钱','汤',
        '尹','黎','易','常','武','乔','贺','赖','龚','文',
        '庞','樊','兰','殷','施','陶','洪','翟','安','颜',
        '倪','严','牛','温','芦','季','俞','章','鲁','葛',
        '伍','韦','申','尤','毕','聂','丛','焦','向','柳',
        '邢','路','岳','齐','沿','梅','莫','庄','辛','管',
        '祝','左','涂','谷','祁','时','舒','耿','牟','卜',
        '路','詹','关','苗','凌','费','纪','靳','盛','童',
        '欧','甄','项','曲','成','游','阳','裴','席','卫',
        '查','屈','鲍','位','覃','霍','翁','隋','植','甘',
        '景','薄','单','包','司','柏','宁','柯','阮','桂',
        '闵','欧阳','解','强','柴','华','车','冉','房','边',
        '辜','吉','饶','刁','瞿','戚','丘','古','米','池',
        '滕','晋','苑','邬','臧','畅','宫','来','嵺','苟',
        '全','褚','廉','简','娄','盖','符','奚','木','穆',
        '党','燕','郎','邸','冀','谈','姬','屠','连','郜',
        '晏','栾','郁','商','蒙','计','喻','揭','窦','迟',
        '宇','敖','糜','鄢','冷','卓','花','仇','艾','蓝',
        '都','巩','稽','井','练','仲','乐','虞','卞','封',
        '竺','冼','原','官','衣','楚','佟','栗','匡','宗',
        '应','台','巫','鞠','僧','桑','荆','谌','银','扬',
        '明','沙','薄','伏','岑','习','胥','保','和','蔺',
    );

    protected static $firstNameMale = array(
        '伟','强','磊','洋','勇','军','杰','涛','超','明',
        '刚','平','辉','鹏','华','飞','鑫','波','斌','宇',
        '浩','凯','健','俊','帆','帅','旭','宁','龙','林',
        '欢','阳','建华','亮','成','畅','建','峰','建国','建军',
        '晨','瑞','志强','兵','雷','东','欣','博','彬','坤',
        '全安','荣','岩','杨','文','利','楠','建平','嘉俊','晧',
        '建明','子安','新华','鹏程','学明','博涛','捷','文彬','楼','鹰',
        '松','伦','超','钟','瑜','振国','洪','毅','昱然','哲',
        '翔','翼','祥','国庆','哲彦','正诚','正豪','正平','正业','志诚',
        '志新','志勇','志明','志强','志文','致远','智明','智勇','智敏','智渊',
    );
    
    protected static $firstNameFemale = array(
        '芳','娜','敏','静','敏静','秀英','丽','洋','艳','娟',
        '文娟','君','文君','珺','霞','明霞','秀兰','燕','芬','桂芬',
        '玲','桂英','丹','萍','华','红','玉兰','桂兰','英','梅',
        '莉','秀珍','雪','依琳','旭','宁','婷','馨予','玉珍','凤英',
        '晶','欢','玉英','颖','红梅','佳','倩','琴','兰英','云',
        '洁','爱华','淑珍','春梅','海燕','晨','冬梅','秀荣','瑞','桂珍',
        '莹','秀云','桂荣','秀梅','丽娟','婷婷','玉华','琳','雪梅','淑兰',
        '丽丽','玉','秀芳','欣','淑英','桂芳','丽华','丹丹','桂香','淑华',
        '秀华','桂芝','小红','金凤','文','利','楠','红霞','瑜','桂花',
        '璐','凤兰','腊梅','瑶','嘉','怡','冰冰','玉梅','慧','婕',
    );
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    INDX( 	 �dm             (   �  �                            �     h X     �      ���ok� Uze�Ց���<� ���ok�                       A d d r e s s . p h p �     h T     �     ���ok� Uze�/����<����ok�       �              	 C o l o r . p h p     �     h X     �     ����ok� Uze��U���<�����ok� 0      �%               C o m p a n y . p h p �     p Z     �     x� �ok� Uze�뷼��<�x� �ok�       6               D a t e T i m e . p h p       �     p Z     �     :|�ok� Uze�뷼��<�:|�ok��      �               I n t e r n e t . p h p       �     h X     �     ��ok� Uze�:���<���ok�       �               P a y m e n t . p h p �     h V     �     e��ok� Uze��|���<�e��ok�        �              
 P e r s o n . p h p   �     p `     �     �"�ok� Uze��|���<��"�ok�       #               P h o n e N u m b e r . p h p                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                <?php

namespace Faker\Provider\zh_CN;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    protected static $operators = array(
        134, 135, 136, 137, 138, 139, 147, 150, 151, 152, 157, 158, 159, 1705, 178, 182, 183, 184, 187, 188, // China Mobile
        130, 131, 132, 145, 155, 156, 1707, 1708, 1709, 1718, 1719, 176, 185, 186, // China Unicom
        133, 153, 1700, 1701, 177, 180, 181, 189, // China Telecom
        170, 171, // virtual operators
    );

    protected static $formats = array('###########');

    public function phoneNumber()
    {
        $operator = static::randomElement(static::$operators);
        $format = static::randomElement(static::$formats);

        return $operator . static::numerify(substr($format, 0, strlen($format) - strlen($operator)));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             <?php

namespace Faker\Provider\zh_TW;

class Address extends \Faker\Provider\Address
{
    protected static $streetNameFormats = array(
        '{{street}}{{streetSuffix}}',
        '{{street}}{{streetSuffix}}{{randomChineseNumber}}段',
    );

    protected static $streetAddressFormats = array(
        '{{streetName}}{{randomNumber3}}號',
        '{{streetName}}{{randomNumber3}}號{{randomNumber2}}樓',
        '{{streetName}}{{randomNumber3}}巷{{randomNumber3}}號',
        '{{streetName}}{{randomNumber3}}巷{{randomNumber3}}號{{randomNumber2}}樓',
        '{{streetName}}{{randomNumber3}}巷{{randomNumber3}}弄{{randomNumber3}}號',
        '{{streetName}}{{randomNumber3}}巷{{randomNumber3}}弄{{randomNumber3}}號{{randomNumber2}}樓',
    );

    protected static $secondaryAddressSuffix = array('室', '房');

    protected static $addressFormats = array(
        '{{postcode}} {{city}}{{streetAddress}}',
    );

    protected static $streetSuffix = array(
        '路', '街',
    );

    /**
     * @link http://blog.davidou.org/archives/583
     */
    protected static $street = array(
        '東英二', '大公十三', '美術南一', '漁港',
        '德美', '福林', '榮安', '忠孝南', '新立',
        '清壽', '豐偉', '華中三', '賴明', '樹仁二',
        '文萊', '凱得', '克武', '豐盛', '府前四',
        '昭德', '鳳仁', '富漁五', '炎峰街青年巷',
        '北園', '衙國一', '五和', '南村', '大埔五',
        '大有四', '太平', '瑞發', '大學二十八',
        '吉興六', '赤東一', '大學二十三', '龍德',
        '昌文', '天仁北', '賢好', '崇陽', '梅龍',
        '羅厝大坵村九江', '福鎮', '天玉', '新北一',
        '臥龍', '平生', '碇內', '衙國三', '慶豐九',
        '富漁二', '公興', '坤成', '民富十六',
        '光榮北', '赤崁東', '上麒麟',
        '公館村東平', '安船', '豐興', '三角',
        '豐裡二', '嘉豐九', '後協', '永樂南',
        '冷水', '德陽', '水汴一', '工明一',
        '環山九如', '永榮二', '清潭',
        '土地公嶺', '武淵三', '文莊', '長億東三',
        '舊城東', '大政', '玉興', '永春南',
        '國盛八', '工業區二十四', '北一', '樂群二',
        '東碇', '龍華南', '榮豐', '大豐',
        '楓江', '觀光街八連', '保興二',
        '安通二', '和順三', '彰濱東七', '麻園六',
        '上樹村北寧', '香賓街得月巷', '光平',
        '車子', '崇禮', '國慶', '阿玉', '中街',
        '同心一', '縣政十六', '德正', '濱一',
        '健行北', '大灣七', '大明', '三多五',
        '富裕三', '園南三', '安樂四', '新安七',
        '河南東四', '中坑', '明野', '秀峰', '溪心',
        '掃叭頂一', '復興南', '果峰', '新興三',
        '公安', '松智三', '國富二十八', '理想',
        '文工十二', '大竹二', '名山六', '文華一',
        '樹仁', '縣政六', '泰成', '河濱', '德吉',
        '竹林', '富台東', '東泰二', '茶專二',
        '海康', '廣安二', '軍福十八', '北文',
        '新興海埔地五', '秀隆', '福德南', '重化',
        '大安港', '東英三', '精明一', '寶強',
        '泰昌五', '立功', '文明一', '福吉一',
        '興竹', '德泉', '中正六', '工八',
        '鹽埕巷三汴', '龍天', '功安一', '炎峰',
        '路科一', '海明', '僑和', '松廉', '福豐南',
        '南園', '孝順', '富強', '保定一', '瑪鋉頂',
        '嘉興', '立德四', '中車', '陽東營區忠三',
        '福中九', '東十二', '頂湖五', '法院前',
        '西海', '士林', '北濱', '富農一', '厚北',
        '全福', '平新一', '集鹿南', '吉利六',
        '岩灣', '新基', '禾豐二', '東角', '青島一',
        '勢林街馨園一巷', '福陽', '文南一', '涵碧',
        '錦田', '國賢一', '北祥', '新成',
        '光榮東', '三鶯', '大通一', '平菁',
        '甘肅二', '古賀', '新北六', '大庄村田中',
        '四分子', '文三一', '站前街鐵路南舍',
        '新北二', '楓林十', '中北二', '北安三',
        '中華南', '光華西', '寧夏東二',
        '樹德', '八德中', '文館', '正英八',
        '大公十七', '銅科南', '長壽三', '漢翔',
        '太平十九', '宜平', '精武', '鼎金中',
        '鎮原', '明義一', '新烏', '蘭洲街三疊溪',
        '六家八', '南勢坑', '工業東六', '四平',
        '甘肅', '永康', '雙十',
        '大地', '中陽東', '立華', '維揚', '太原三',
        '水源', '重立', '民主四', '南福',
        '鎮國', '永勝', '新華', '柯林新', '南橋一',
        '大公十四', '勝利七', '三和二',
        '東庄', '文匯', '中新一', '松信一',
        '寶君', '平安南', '文學', '大華五',
        '行義', '百五', '草衙中', '嘉祥五',
        '平等', '光美', '成功十六', '精誠三',
        '水美', '文化十', '民權東', '大慶',
        '源泉', '文成北', '大坪五', '光華六',
        '玉清二', '龍鳳', '上山二', '西十四',
        '文康', '崇德十二', '天泉一', '新庄',
        '芝麻五', '中山西', '長春', '中一',
        '八張二', '嘉安八', '成德九', '三村',
        '忠孝東', '遼北', '徐州一', '徐州五',
        '六張', '中西', '大平', '順興', '新展',
        '南澳南', '吉利四', '久安二', '斗六五',
        '登山', '貴林', '桐竹', '社斗',
        '中樂', '山湖二', '長園二', '埤尾', '應化',
        '水碓二', '嶺頂九分', '中和', '幸福五',
        '長安東', '愛富二街厚生巷', '崇德三',
        '甲樹', '篤信', '金龍二', '為隨東',
        '明鳳五', '草湖村仁愛', '至平', '惟馨',
        '濃公', '錫安', '中庄東', '保順',
        '龍橋', '文二三', '通明', '東信',
        '秀福', '光榮', '棒球三', '立達',
        '長樂五', '永安', '瀋陽', '文宏一',
        '斗苑', '新興二', '新五', '科雅六',
        '青埔八', '永安東', '行忠', '梅亭東',
        '保榮', '國富二十六', '自強九', '學進',
        '線東', '中興二', '柯林七', '國盛三',
        '平安', '重建', '臥龍', '松文', '花秀',
        '太原四', '北門', '新生三', '花旗',
        '大源十九', '光華十', '內江', '埔興',
        '芝柏一', '府中', '乾興', '華廈', '長埤',
        '新富', '山明', '城中五', '富裕十七',
        '修明', '贊庄大仁', '三和', '科大一',
        '光州一', '平等十二', '新寮一', '東林東',
        '永新二', '頂橫', '東門', '石園', '寶深',
        '長青', '金鋒一', '福壽', '連雲',
        '自立二', '北辰一', '松三', '嘉朴',
        '鎮新二', '莊敬', '中興十', '忠明七',
        '福興八', '中心', '海口北', '工業三',
        '大弘一', '親民', '芳樂', '赤崁南', '文開',
        '五權西', '新興海埔地三', '華泰一',
        '文澄', '中山西', '崇德二十九',
        '內定七', '新基北', '南澳', '尚德',
        '後港一', '西建', '力行五', '中央七',
        '苓安', '裕隆', '布西', '鹽田',
        '建國南', '順興', '朝奉', '賜安',
        '崇德十八', '頂庄', '福營', '工業二十',
        '徐州四', '鼎愛', '香檳二', '竹社',
        '惠中一', '重仁', '德福', '同源',
        '下莊新生', '廣明', '明仁一', '中正東',
        '鳳尾', '濟南', '復華四', '新基南',
        '潭工一', '學三', '龍善二', '六路七',
        '環美', '建興三', '福錦', '永義九',
        '和祥七', '漁港中一', '樹林六', '東信',
        '壽福', '鳳楠', '五福六', '大源二十',
        '南勢十', '中港三', '小坑', '勝利十五',
        '老吸', '鎮新五', '名水', '蘇港',
        '櫻城三', '裕孝三', '稻香五', '豐源',
        '大功', '陜西',
    );

    /**
     * @link http://zh.wikipedia.org/wiki/%E8%87%BA%E7%81%A3%E8%A1%8C%E6%94%BF%E5%8D%80%E5%8A%83
     */
    protected static $city = array(
        '新北市' => array(
            '板橋區', '三重區', '中和區', '永和區',
            '新莊區', '新店區', '樹林區', '鶯歌區',
            '三峽區', '淡水區', '汐止區', '瑞芳區',
            '土城區', '蘆洲區', '五股區', '泰山區',
            '林口區', '深坑區', '石碇區', '坪林區',
            '三芝區', '石門區', '八里區', '平溪區',
            '雙溪區', '貢寮區', '金山區', '萬里區',
            '烏來區',
        ),
        '宜蘭縣' => array(
            '宜蘭市', '羅東鎮', '蘇澳鎮', '頭城鎮', '礁溪鄉',
            '壯圍鄉', '員山鄉', '冬山鄉', '五結鄉', '三星鄉',
            '大同鄉', '南澳鄉',
        ),
        '桃園市' => array(
            '桃園區', '中壢區', '大溪區', '楊梅區', '蘆竹區',
            '大園區', '龜山區', '八德區', '龍潭區', '平鎮區',
            '新屋區', '觀音區', '復興區',
        ),
        '新竹縣' => array(
            '竹北市', '竹東鎮', '新埔鎮', '關西鎮', '湖口鄉',
            '新豐鄉', '芎林鄉', '橫山鄉', '北埔鄉', '寶山鄉',
            '峨眉鄉', '尖石鄉', '五峰鄉',
        ),
        '苗栗縣' => array(
            '苗栗市', '苑裡鎮', '通霄鎮', '竹南鎮', '頭份鎮',
            '後龍鎮', '卓蘭鎮', '大湖鄉', '公館鄉', '銅鑼鄉',
            '南庄鄉', '頭屋鄉', '三義鄉', '西湖鄉', '造橋鄉',
            '三灣鄉', '獅潭鄉', '泰安鄉',
        ),
        '臺中市' => array(
            '豐原區', '東勢區', '大甲區', '清水區', '沙鹿區',
            '梧棲區', '后里區', '神岡區', '潭子區', '大雅區',
            '新社區', '石岡區', '外埔區', '大安區', '烏日區',
            '大肚區', '龍井區', '霧峰區', '太平區', '大里區',
            '和平區', '中區', '東區', '南區', '西區', '北區',
            '西屯區', '南屯區', '北屯區',
        ),
        '彰化縣' => array(
            '彰化市', '鹿港鎮', '和美鎮', '線西鄉', '伸港鄉',
            '福興鄉', '秀水鄉', '花壇鄉', '芬園鄉', '員林鎮',
            '溪湖鎮', '田中鎮', '大村鄉', '埔鹽鄉', '埔心鄉',
            '永靖鄉', '社頭鄉', '二水鄉', '北斗鎮', '二林鎮',
            '田尾鄉', '埤頭鄉', '芳苑鄉', '大城鄉', '竹塘鄉',
            '溪州鄉',
        ),
        '南投縣' => array(
            '南投市', '埔里鎮', '草屯鎮', '竹山鎮', '集集鎮',
            '名間鄉', '鹿谷鄉', '中寮鄉', '魚池鄉', '國姓鄉',
            '水里鄉', '信義鄉', '仁愛鄉',
        ),
        '雲林縣' => array(
            '斗六市', '斗南鎮', '虎尾鎮', '西螺鎮', '土庫鎮',
            '北港鎮', '古坑鄉', '大埤鄉', '莿桐鄉', '林內鄉',
            '二崙鄉', '崙背鄉', '麥寮鄉', '東勢鄉', '褒忠鄉',
            '臺西鄉', '元長鄉', '四湖鄉', '口湖鄉', '水林鄉',
        ),
        '嘉義縣' => array(
            '太保市', '朴子市', '布袋鎮', '大林鎮', '民雄鄉',
            '溪口鄉', '新港鄉', '六腳鄉', '東石鄉', '義竹鄉',
            '鹿草鄉', '水上鄉', '中埔鄉', '竹崎鄉', '梅山鄉',
            '番路鄉', '大埔鄉', '阿里山鄉',
        ),
        '臺南市' => array(
            '新營區', '鹽水區', '白河區', '柳營區', '後壁區',
            '東山區', '麻豆區', '下營區', '六甲區', '官田區',
            '大內區', '佳里區', '學甲區', '西港區', '七股區',
            '將軍區', '北門區', '新化區', '善化區', '新市區',
            '安定區', '山上區', '玉井區', '楠西區', '南化區',
            '左鎮區', '仁德區', '歸仁區', '關廟區', '龍崎區',
            '永康區', '東區', '南區', '西區', '北區', '中區',
            '安南區', '安平區',
        ),
        '高雄市' => array(
            '鳳山區', '林園區', '大寮區', '大樹區', '大社區',
            '仁武區', '鳥松區', '岡山區', '橋頭區', '燕巢區',
            '田寮區', '阿蓮區', '路竹區', '湖內區', '茄萣區',
            '永安區', '彌陀區', '梓官區', '旗山區', '美濃區',
            '六龜區', '甲仙區', '杉林區', '內門區', '茂林區',
            '桃源區', '三民區', '鹽埕區', '鼓山區', '左營區',
            '楠梓區', '三民區', '新興區', '前金區', '苓雅區',
            '前鎮區', '旗津區', '小港區',
        ),
        '屏東縣' => array(
            '屏東市', '潮州鎮', '東港鎮', '恆春鎮', '萬丹鄉',
            '長治鄉', '麟洛鄉', '九如鄉', '里港鄉', '鹽埔鄉',
            '高樹鄉', '萬巒鄉', '內埔鄉', '竹田鄉', '新埤鄉',
            '枋寮鄉', '新園鄉', '崁頂鄉', '林邊鄉', '南州鄉',
            '佳冬鄉', '琉球鄉', '車城鄉', '滿州鄉', '枋山鄉',
            '三地門鄉', '霧臺鄉', '瑪家鄉', '泰武鄉', '來義鄉',
            '春日鄉', '獅子鄉', '牡丹鄉',
        ),
        '臺東縣' => array(
            '臺東市', '成功鎮', '關山鎮', '卑南鄉', '鹿野鄉',
            '池上鄉', '東河鄉', '長濱鄉', '太麻里鄉', '大武鄉',
            '綠島鄉', '海端鄉', '延平鄉', '金峰鄉', '達仁鄉',
            '蘭嶼鄉',
        ),
        '花蓮縣' => array(
            '花蓮市', '鳳林鎮', '玉里鎮', '新城鄉', '吉安鄉',
            '壽豐鄉', '光復鄉', '豐濱鄉', '瑞穗鄉', '富里鄉',
            '秀林鄉', '萬榮鄉', '卓溪鄉',
        ),
        '澎湖縣' => array(
            '馬公市', '湖西鄉', '白沙鄉', '西嶼鄉', '望安鄉',
            '七美鄉',
        ),
        '基隆市' => array(
            '中正區', '七堵區', '暖暖區', '仁愛區', '中山區',
            '安樂區', '信義區',
        ),
        '新竹市' => array(
            '東區', '北區', '香山區',
        ),
        '嘉義市' => array(
            '東區', '西區',
        ),
        '臺北市' => array(
            '松山區', '信義區', '大安區', '中山區', '中正區',
            '大同區', '萬華區', '文山區', '南港區', '內湖區',
            '士林區', '北投區',
        ),
        '連江縣' => array(
            '南竿鄉', '北竿鄉', '莒光鄉', '東引鄉',
        ),
        '金門縣' => array(
            '金城鎮', '金沙鎮', '金湖鎮', '金寧鄉', '烈嶼鄉', '烏坵鄉',
        ),
    );

    /**
     * @link http://terms.naer.edu.tw/download/287/
     */
    protected static $country = array(
        '不丹', '中非', '丹麥', '伊朗', '冰島', '剛果',
        '加彭', '北韓', '南非', '卡達', '印尼', '印度',
        '古巴', '哥德', '埃及', '多哥', '寮國', '尼日',
        '巴曼', '巴林', '巴紐', '巴西', '希臘', '帛琉',
        '德國', '挪威', '捷克', '教廷', '斐濟', '日本',
        '智利', '東加', '查德', '汶萊', '法國', '波蘭',
        '波赫', '泰國', '海地', '瑞典', '瑞士', '祕魯',
        '秘魯', '約旦', '紐埃', '緬甸', '美國', '聖尼',
        '聖普', '肯亞', '芬蘭', '英國', '荷蘭', '葉門',
        '蘇丹', '諾魯', '貝南', '越南', '迦彭',
        '迦納', '阿曼', '阿聯', '韓國', '馬利',
        '以色列', '以色利', '伊拉克', '俄羅斯',
        '利比亞', '加拿大', '匈牙利', '南極洲',
        '南蘇丹', '厄瓜多', '吉布地', '吐瓦魯',
        '哈撒克', '哈薩克', '喀麥隆', '喬治亞',
        '土庫曼', '土耳其', '塔吉克', '塞席爾',
        '墨西哥', '大西洋', '奧地利', '孟加拉',
        '安哥拉', '安地卡', '安道爾', '尚比亞',
        '尼伯爾', '尼泊爾', '巴哈馬', '巴拉圭',
        '巴拿馬', '巴貝多', '幾內亞', '愛爾蘭',
        '所在國', '摩洛哥', '摩納哥', '敍利亞',
        '敘利亞', '新加坡', '東帝汶', '柬埔寨',
        '比利時', '波扎那', '波札那', '烏克蘭',
        '烏干達', '烏拉圭', '牙買加', '獅子山',
        '甘比亞', '盧安達', '盧森堡', '科威特',
        '科索夫', '科索沃', '立陶宛', '紐西蘭',
        '維德角', '義大利', '聖文森', '艾塞亞',
        '菲律賓', '萬那杜', '葡萄牙', '蒲隆地',
        '蓋亞納', '薩摩亞', '蘇利南', '西班牙',
        '貝里斯', '賴索托', '辛巴威', '阿富汗',
        '阿根廷', '馬其頓', '馬拉威', '馬爾他',
        '黎巴嫩', '亞塞拜然', '亞美尼亞', '保加利亞',
        '南斯拉夫', '厄利垂亞', '史瓦濟蘭', '吉爾吉斯',
        '吉里巴斯', '哥倫比亞', '坦尚尼亞', '塞內加爾',
        '塞内加爾', '塞爾維亞', '多明尼加', '多米尼克',
        '奈及利亞', '委內瑞拉', '宏都拉斯', '尼加拉瓜',
        '巴基斯坦', '庫克群島', '愛沙尼亞', '拉脫維亞',
        '摩爾多瓦', '摩里西斯', '斯洛伐克', '斯里蘭卡',
        '格瑞那達', '模里西斯', '波多黎各', '澳大利亞',
        '烏茲別克', '玻利維亞', '瓜地馬拉', '白俄羅斯',
        '突尼西亞', '納米比亞', '索馬利亞', '索馬尼亞',
        '羅馬尼亞', '聖露西亞', '聖馬利諾', '莫三比克',
        '莫三鼻克', '葛摩聯盟', '薩爾瓦多', '衣索比亞',
        '西薩摩亞', '象牙海岸', '賴比瑞亞', '賽普勒斯',
        '馬來西亞', '馬爾地夫', '克羅埃西亞',
        '列支敦斯登', '哥斯大黎加', '布吉納法索',
        '布吉那法索', '幾內亞比索', '幾內亞比紹',
        '斯洛維尼亞', '索羅門群島', '茅利塔尼亞',
        '蒙特內哥羅', '赤道幾內亞', '阿爾及利亞',
        '阿爾及尼亞', '阿爾巴尼亞', '馬紹爾群島',
        '馬達加斯加', '密克羅尼西亞', '沙烏地阿拉伯',
        '千里達及托巴哥',
    );

    protected static $postcode = array('###-##', '###');

    public function street()
    {
        return static::randomElement(static::$street);
    }

    public static function randomChineseNumber()
    {
        $digits = array(
            '', '一', '二', '三', '四', '五', '六', '七', '八', '九',
        );
        return $digits[static::randomDigitNotNull()];
    }

    public static function randomNumber2()
    {
        return static::randomNumber(2) + 1;
    }

    public static function randomNumber3()
    {
        return static::randomNumber(3) + 1;
    }

    public static function localLatitude()
    {
        return number_format(mt_rand(22000000, 25000000)/1000000, 6);
    }

    public static function localLongitude()
    {
        return number_format(mt_rand(120000000, 122000000)/1000000, 6);
    }

    public function city()
    {
        $county = static::randomElement(array_keys(static::$city));
        $city = static::randomElement(static::$city[$county]);
        return $county.$city;
    }

    public function state()
    {
        return '臺灣省';
    }

    public static function stateAbbr()
    {
        return '臺';
    }

    public static function cityPrefix()
    {
        return '';
    }

    public static function citySuffix()
    {
        return '';
    }

    public static function secondaryAddress()
    {
        return (static::randomNumber(2)+1).static::randomElement(static::$secondaryAddressSuffix);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 <?php

namespace Faker\Provider\zh_TW;

class Color extends \Faker\Provider\Color
{
    /**
     * @link http://zh.wikipedia.org/zh-tw/%E9%A2%9C%E8%89%B2%E5%88%97%E8%A1%A8
     */
    protected static $safeColorNames = array(
        '黑色', '粟色', '綠色', '藏青', '橄欖色',
        '紫', '鳧綠', '鮮綠色', '藍色', '銀色',
        '灰色', '黃色', '品紅', '水色', '白色'
    );

    protected static $allColorNames = array(
        '黑色', '昏灰', '灰色', '暗灰', '銀色', '亮灰色',
        '庚斯博羅灰', '白煙色', '白色', '雪色', '鐵灰色',
        '沙棕', '玫瑰褐', '亮珊瑚色', '印度紅', '褐色',
        '耐火磚紅', '栗色', '暗紅', '鮮紅', '紅色', '柿子橙',
        '霧玫瑰色', '鮭紅', '腥紅', '蕃茄紅', '暗鮭紅',
        '珊瑚紅', '橙紅', '亮鮭紅', '朱紅', '赭黃', '熱帶橙',
        '駝色', '杏黃', '椰褐', '海貝色', '鞍褐', '巧克力色',
        '燃橙', '陽橙', '粉撲桃色', '沙褐', '古銅色', '亞麻色',
        '蜜橙', '秘魯色', '烏賊墨色', '赭色', '陶坯黃', '橘色',
        '暗橙', '古董白', '日曬色', '硬木色', '杏仁白',
        '那瓦霍白', '萬壽菊黃', '蕃木瓜色', '灰土色',
        '卡其色', '鹿皮鞋色', '舊蕾絲色', '小麥色', '桃色',
        '橙色', '花卉白', '金菊色', '暗金菊色', '咖啡色',
        '茉莉黃', '琥珀色', '玉米絲色', '鉻黃', '金色',
        '檸檬綢色', '亮卡其色', '灰金菊色', '暗卡其色',
        '含羞草黃', '奶油色', '象牙色', '米黃色', '亮黃',
        '亮金菊黃', '香檳黃', '芥末黃', '月黃', '橄欖色',
        '鮮黃', '黃色', '苔蘚綠', '亮檸檬綠', '橄欖軍服綠',
        '黃綠', '暗橄欖綠', '蘋果綠', '綠黃', '草綠', '草坪綠',
        '查特酒綠', '葉綠', '嫩綠', '明綠', '鈷綠', '蜜瓜綠',
        '暗海綠', '亮綠', '灰綠', '常春藤綠', '森林綠',
        '檸檬綠', '暗綠', '綠色', '鮮綠色', '孔雀石綠',
        '薄荷綠', '青瓷綠', '碧綠', '綠松石綠', '鉻綠', '蒼色',
        '海綠', '中海綠', '薄荷奶油色', '春綠', '孔雀綠',
        '中春綠色', '中碧藍色', '碧藍色', '青藍', '水藍',
        '綠松石藍', '綠松石色', '亮海綠', '中綠松石色',
        '亮青', '淺藍', '灰綠松石色', '暗岩灰', '鳧綠', '暗青',
        '青色', '水色', '暗綠松石色', '軍服藍', '孔雀藍',
        '嬰兒粉藍', '濃藍', '亮藍', '灰藍', '薩克斯藍',
        '深天藍', '天藍', '亮天藍', '水手藍', '普魯士藍',
        '鋼青色', '愛麗絲藍', '岩灰', '亮岩灰', '道奇藍',
        '礦藍', '湛藍', '韋奇伍德瓷藍', '亮鋼藍', '鈷藍',
        '灰丁寧藍', '矢車菊藍', '鼠尾草藍', '暗嬰兒粉藍',
        '藍寶石色', '國際奇連藍', '蔚藍', '品藍', '暗礦藍',
        '極濃海藍', '天青石藍', '幽靈白', '薰衣草紫',
        '長春花色', '午夜藍', '藏青', '暗藍', '中藍', '藍色',
        '紫藤色', '暗岩藍', '岩藍', '中岩藍', '木槿紫',
        '紫丁香色', '中紫紅', '紫水晶色', '淺灰紫紅',
        '纈草紫', '礦紫', '藍紫', '紫羅蘭色', '靛色', '暗蘭紫',
        '暗紫', '三色堇紫', '錦葵紫', '優品紫紅', '中蘭紫',
        '淡紫丁香色', '薊紫', '鐵線蓮紫', '梅紅色', '亮紫',
        '紫色', '暗洋紅', '洋紅', '品紅', '蘭紫', '淺珍珠紅',
        '陳玫紅', '淺玫瑰紅', '中青紫紅', '洋玫瑰紅',
        '玫瑰紅', '紅寶石色', '山茶紅', '深粉紅', '火鶴紅',
        '淺珊瑚紅', '暖粉紅', '勃艮第酒紅', '尖晶石紅',
        '胭脂紅', '淺粉紅', '樞機紅', '薰衣草紫紅', '灰紫紅',
        '櫻桃紅', '淺鮭紅', '緋紅', '粉紅', '亮粉紅', '殼黃紅',
        '茜紅',
    );
}
                                                                                                                                 <?php

namespace Faker\Provider\zh_TW;

class Company extends \Faker\Provider\Company
{
    protected static $companyEnSuffix = array(
        'Inc', 'and Sons', 'LLC', 'Group', 'PLC', 'Ltd'
    );

    protected static $companyEnFormats = array(
        '{{lastNameEn}} {{companyEnSuffix}}',
        '{{lastNameEn}}-{{lastNameEn}}',
        '{{lastNameEn}}, {{lastNameEn}} and {{lastNameEn}}'
    );

    protected static $formats = array(
        '{{companyPrefix}}{{companyModifier}}',
        '{{companyPrefix}}{{companySuffix}}',
        '{{companyPrefix}}{{companyModifier}}{{CompanySuffix}}',
    );

    /**
     * @link http://zh.wikipedia.org/zh-tw/Category:%E5%8F%B0%E7%81%A3%E5%85%AC%E5%8F%B8%E5%88%97%E8%A1%A8
     */
    protected static $companyPrefix = array(
        '乾坤', '亞神', '光譜', '典選', '凱基', '前衛花園',
        '創見', '友訊', '台達', '合勤', '喜瑪拉雅', '喬山',
        '多利安', '大國', '大宇', '太陽', '太陽動力', '宏碁',
        '宏達', '小白兔', '巨大', '巨室', '康師傅', '延伸',
        '弘煜', '彎的', '擎天', '新亞洲', '旺旺', '昱泉',
        '智冠', '未來', '松崗', '正新', '洧誠', '海蝶',
        '添翼創越', '滾石', '王品', '當然', '相信', '睛水',
        '研華', '福茂', '種子', '米樂士', '紅元素', '紅心辣椒',
        '統一', '美利達', '美妙', '美樂帝', '群石', '老鷹',
        '聯強', '芮河', '英特衛', '茂為', '華特', '華研',
        '華碩', '華義', '角頭', '訊連', '豐華', '豪客', '豪記',
        '貴族', '趨勢', '遊戲橘子', '野火樂集', '金革',
        '銀魚', '阿爾發', '風和日麗', '風潮', '風雲',
    );
    protected static $companyModifier = array(
        '科技', '電腦', '國際', '電子', '娛樂', '音樂', '唱片',
        '證券', '集團', '企業', '機械', '工業', '文化', '汽車',
        '百貨', '酒店', '數位',
    );
    protected static $companySuffix = array(
        '公司', '有限公司', '股份有限公司'
    );
    /**
     * @link https://zh-tw.facebook.com/notes/%E7%8E%A9%E5%BB%A3%E5%91%8Aplaying-with-advertising/%E5%9B%9E%E9%A1%A7%E8%87%BA%E7%81%A3%E6%AD%B7%E5%B1%86%E5%BB%A3%E5%91%8A%E9%87%91%E5%8F%A5%E7%8D%8E/294008963985215
     */
    protected static $catchPhrase = array(
        'Everything\'s ok',
        'Just call me be happy',
        'Keep Walking',
        'NOKIA相信科技始終來自於人性',
        'PayEasy，陪你Shopping一輩子',
        'Play不累',
        'The city never sleeps',
        'Trust me, you can make it!',
        'We are family',
        'We share',
        'You A.S.O beautiful',
        '一人吃，兩人補',
        '一定要幸福哦！',
        '一把抵兩把，何需瑪麗亞？！',
        '一次買好，就是頂好',
        '一步一腳印，大家愛台灣',
        '一段話，感動了一幅畫！',
        '一點一點 累積更好的自己',
        '三不五時，愛要及時',
        '三餐老是在外，人人叫我老外！',
        '不只辦公室，掌握更多事',
        '不在乎天長地久，只在乎曾經擁有',
        '不在辦公室，也能辦公事',
        '不平凡的平凡大眾',
        '不想分開 就永遠在一起吧',
        '不該愛的，趁早換',
        '不過～不過～，一定測不過',
        '世事難料，安泰比較好',
        '世事難料，對人要更好',
        '世界上最重要的一部車是爸爸的肩膀',
        '乎乾啦！',
        '人生30財開始',
        '什麼最青？',
        '什麼都有，什麼都賣，什麼都不奇怪！',
        '今天心情幾？',
        '他傻瓜、你聰明',
        '他捉得住我',
        '你未必出類拔萃 但肯定與眾不同',
        '你的愛，是孩子最好的示範',
        '你講台語嘛也通',
        '便宜一樣有好貨',
        '係金A！',
        '信任，帶來新幸福',
        '信義房屋，信任，帶來新幸福',
        '做你自己才叫乖，做你的乖乖！',
        '做自己 自己做',
        '傻瓜鏡片,聰明選擇',
        'お元気ですか？',
        '全國電子 足感心ㄟ',
        '全家就是你家',
        '再忙，也要和你喝杯咖啡',
        '別讓今天的應酬成為明天的負擔',
        '到服裝店培養氣質，到書店展示服裝',
        '化去心中那條線',
        '原來我們這麼近',
        '只有遠傳，沒有距離',
        '只要有夢，你會紅',
        '叫天天不印 Canon幫你印！',
        '可憐的舊情人，看不到我的新內衣',
        '台灣，加油！',
        '合味才會呷意',
        '啊！福氣啦！',
        '喜歡嗎? 爸爸買給你!',
        '嚕加嚕好呷',
        '回家的感覺真好',
        '因為你值得 L’ORE’AL',
        '夏天好熱 愛要趁熱',
        '多喝水沒事，沒事多喝水',
        '夜深了，打個電話回家',
        '天生超人氣，不該遭人棄',
        '女人說好，才算頂好',
        '好東西和好朋友分享',
        '好的開喜就是成功的一半！',
        '好身體，沒人敢惹你',
        '好險，有南山！',
        '孩子！我要你將來比我強！',
        '學琴的孩子不會變壞',
        '安全是回家唯一的路',
        '小而美、小而冷、小而省',
        '幸福怎能說不用',
        '心，是人生最大的戰場',
        '您真內行！',
        '想像力是你的超能力',
        '慈母心、豆腐心',
        '我不認識你，但是我謝謝你！',
        '我就是超愛 Send！',
        '我的八分新摺學！',
        '拍誰像誰，誰拍誰誰都得像誰',
        '挺立，不只挺阮 也挺恁',
        '捐血一袋，救人一命',
        '撼動天下的力量',
        '擋不住的感覺',
        '整個城市就是我的咖啡館',
        '最佳女主角換你做做看',
        '有心最要緊',
        '有書才會贏',
        '有青才敢大聲',
        '有點黏又不會太黏',
        '期待下一次，不如靠自己',
        '未來 就是現在',
        '正反，反正都很正！',
        '每一句話，都是思念',
        '沒說出口的 保誠也聽得懂',
        '現在的Nobody，未來的Somebody！',
        '生命就該浪費在美好的事物上',
        '用你想要的方式道別',
        '用大金，省大金',
        '用好心腸做好香腸',
        '用愛打敗不景氣',
        '用最愛 照顧最愛',
        '留一盞燈給最後回家的人',
        '百服寧、保護您',
        '真感情就是最好的服務',
        '知識使你更有魅力',
        '碼碼都有獎',
        '管他什麼垢，一瓶就夠',
        '紅利點數也能當飯吃',
        '紙有春風最溫柔',
        '紙要Double A 萬事都OK！',
        '給你好看',
        '給我小心點兒',
        '肝哪沒好，人生是黑白的！肝哪顧好，人生是彩色的！',
        '肝苦誰人知',
        '萬事皆可達，唯有情無價',
        '認真的女人最美麗',
        '贏甲嘸知人',
        '路，是ESCAPE走出來的',
        '這不是肯德基！',
        '這個月不會來，下個月也不會來了，以後都不會來了',
        '這是一定要的啦！',
        '這種時機，無閒也是一種幸福',
        '這種鬼地方都收得到',
        '通往成功的路，總是在施工中',
        '鑽石恆久遠，一顆永留傳',
        '關心自己，也關心別人',
        '關機是一種美德',
        '陪妳Shopping 一輩子',
        '雅芳比女人更瞭解女人',
        '青菜底呷啦',
        '靜得讓您耳根清靜',
        '馬上就會好',
    );

    protected static $bsWords = array(
        array(
            '實現', '實作', '整合', '最佳化',
            '革命', '轉變', '提昇', '啟用', '指揮',
            '利用', '重現', '結合', '架構', '加強',
            '集中', '變形', '強化', '推廣', '延伸',
            '生產', '進化', '改善', '提高', '開發',
            '創造', '專注',
        ), array(
            '加值', '縱向', '堅固', '全球', '在地', '領先',
            '虛擬', '動態', '完全', '成熟', '穩定', '穩健',
            '即時', '全年無休', '高效', '快速', '互動',
            '世界級', '下一代', '新一代', '無線', '無限',
            '豐富', '開源', '前端', '分散式', '無縫', '跨平臺',
        ),
        array(
            '典範', '市場', '合作', '架構', '基礎平臺', '頻道',
            '焦點', '方案', '解決方案', '社群', '科技', '技術',
            '內容', '入口', '供應鍊', '介面', '系統', '頻寬',
            '模型', '網路', '使用經驗', '評量', '方法',
        )
    );

    public static function companyEnSuffix()
    {
        return static::randomElement(static::$companyEnSuffix);
    }

    public function companyEn()
    {
        $format = static::randomElement(static::$companyEnFormats);
        return $this->generator->parse($format);
    }

    public static function companyModifier()
    {
        return static::randomElement(static::$companyModifier);
    }

    public static function companyPrefix()
    {
        return static::randomElement(static::$companyPrefix);
    }

    public function catchPhrase()
    {
        return static::randomElement(static::$catchPhrase);
    }

    public function bs()
    {
        $result = '';
        foreach (static::$bsWords as &$word) {
            $result .= static::randomElement($word);
        }
        return $result;
    }

    /**
     * return standard VAT / Tax ID / Uniform Serial Number
     *
     * @example 28263822
     *
     * @return int
     */
    public function VAT()
    {
        return static::randomNumber(8, true);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        <?php

namespace Faker\Provider\zh_TW;

class DateTime extends \Faker\Provider\DateTime
{
    public static function amPm($max = 'now')
    {
        return static::dateTime($max)->format('a') === 'am' ? '上午' : '下午';
    }

    public static function dayOfWeek($max = 'now')
    {
        $map = array(
            'Sunday' => '星期日',
            'Monday' => '星期一',
            'Tuesday' => '星期二',
            'Wednesday' => '星期三',
            'Thursday' => '星期四',
            'Friday' => '星期五',
            'Saturday' => '星期六',
        );
        $week = static::dateTime($max)->format('l');
        return isset($map[$week]) ? $map[$week] : $week;
    }

    public static function monthName($max = 'now')
    {
        $map = array(
            'January' => '一月',
            'February' => '二月',
            'March' => '三月',
            'April' => '四月',
            'May' => '五月',
            'June' => '六月',
            'July' => '七月',
            'August' => '八月',
            'September' => '九月',
            'October' => '十月',
            'November' => '十一月',
            'December' => '十二月',
        );
        $month = static::dateTime($max)->format('F');
        return isset($map[$month]) ? $map[$month] : $month;
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          <?php

namespace Faker\Provider\zh_TW;

class Person extends \Faker\Provider\Person
{
    /**
     * @see https://zh.wikipedia.org/wiki/%E4%B8%AD%E8%8F%AF%E6%B0%91%E5%9C%8B%E5%9C%8B%E6%B0%91%E8%BA%AB%E5%88%86%E8%AD%89
     */
    public static $idBirthplaceCode = array(
        'A' => 10,
        'B' => 11,
        'C' => 12,
        'D' => 13,
        'E' => 14,
        'F' => 15,
        'G' => 16,
        'H' => 17,
        'I' => 34,
        'J' => 18,
        'K' => 19,
        'M' => 21,
        'N' => 22,
        'O' => 35,
        'p' => 23,
        'Q' => 24,
        'T' => 27,
        'U' => 28,
        'V' => 29,
        'W' => 32,
        'X' => 30,
        'Z' => 33
    );

    /**
     * @see https://zh.wikipedia.org/wiki/%E4%B8%AD%E8%8F%AF%E6%B0%91%E5%9C%8B%E5%9C%8B%E6%B0%91%E8%BA%AB%E5%88%86%E8%AD%89
     */
    public static $idDigitValidator = array(1, 9, 8, 7, 6, 5, 4, 3, 2, 1, 1);

    protected static $maleNameFormats = array(
        '{{lastName}}{{firstNameMale}}',
    );

    protected static $femaleNameFormats = array(
        '{{lastName}}{{firstNameFemale}}',
    );

    protected static $titleMale = array('先生', '博士', '教授');
    protected static $titleFemale = array('小姐', '太太', '博士', '教授');

    /**
     * @link http://zh.wikipedia.org/wiki/%E7%99%BE%E5%AE%B6%E5%A7%93
     */
    protected static $lastName = array(
        '趙', '錢', '孫', '李', '周', '吳', '鄭', '王', '馮',
        '陳', '褚', '衛', '蔣', '沈', '韓', '楊', '朱', '秦',
        '尤', '許', '何', '呂', '施', '張', '孔', '曹', '嚴',
        '華', '金', '魏', '陶', '姜', '戚', '謝', '鄒', '喻',
        '柏', '水', '竇', '章', '雲', '蘇', '潘', '葛',
        '奚', '范', '彭', '郎', '魯', '韋', '昌', '馬',
        '苗', '鳳', '花', '方', '俞', '任', '袁', '柳',
        '酆', '鮑', '史', '唐', '費', '廉', '岑', '薛',
        '雷', '賀', '倪', '湯', '滕', '殷', '羅', '畢',
        '郝', '鄔', '安', '常', '樂', '于', '時', '傅',
        '皮', '卞', '齊', '康', '伍', '余', '元', '卜',
        '顧', '孟', '平', '黃', '和', '穆', '蕭', '尹',
        '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄',
        '米', '貝', '明', '臧', '計', '伏', '成', '戴',
        '談', '宋', '茅', '龐', '熊', '紀', '舒', '屈',
        '項', '祝', '董', '梁', '杜', '阮', '藍', '閔',
        '席', '季', '麻', '強', '賈', '路', '婁', '危',
        '江', '童', '顏', '郭', '梅', '盛', '林', '刁',
        '鍾', '徐', '丘', '駱', '高', '夏', '蔡', '田',
        '樊', '胡', '凌', '霍', '虞', '萬', '支', '柯',
        '昝', '管', '盧', '莫', '經', '房', '裘', '繆',
        '干', '解', '應', '宗', '丁', '宣', '賁', '鄧',
        '郁', '單', '杭', '洪', '包', '諸', '左', '石',
        '崔', '吉', '鈕', '龔', '程', '嵇', '邢', '滑',
        '裴', '陸', '榮', '翁', '荀', '羊', '於', '惠',
        '甄', '麴', '家', '封', '芮', '羿', '儲', '靳',
        '汲', '邴', '糜', '松', '井', '段', '富', '巫',
        '烏', '焦', '巴', '弓', '牧', '隗', '山', '谷',
        '車', '侯', '宓', '蓬', '全', '郗', '班', '仰',
        '秋', '仲', '伊', '宮', '甯', '仇', '欒', '暴',
        '甘', '鈄', '厲', '戎', '祖', '武', '符', '劉',
        '景', '詹', '束', '龍', '葉', '幸', '司', '韶',
        '郜', '黎', '薊', '薄', '印', '宿', '白', '懷',
        '蒲', '邰', '從', '鄂', '索', '咸', '籍', '賴',
        '卓', '藺', '屠', '蒙', '池', '喬', '陰', '鬱',
        '胥', '能', '蒼', '雙', '聞', '莘', '黨', '翟',
        '譚', '貢', '勞', '逄', '姬', '申', '扶', '堵',
        '冉', '宰', '酈', '雍', '郤', '璩', '桑', '桂',
        '濮', '牛', '壽', '通', '邊', '扈', '燕', '冀',
        '郟', '浦', '尚', '農', '溫', '別', '莊', '晏',
        '柴', '瞿', '閻', '充', '慕', '連', '茹', '習',
        '宦', '艾', '魚', '容', '向', '古', '易', '慎',
        '戈', '廖', '庾', '終', '暨', '居', '衡', '步',
        '都', '耿', '滿', '弘', '匡', '國', '文', '寇',
        '廣', '祿', '闕', '東', '歐', '殳', '沃', '利',
        '蔚', '越', '夔', '隆', '師', '鞏', '厙', '聶',
        '晁', '勾', '敖', '融', '冷', '訾', '辛', '闞',
        '那', '簡', '饒', '空', '曾', '毋', '沙', '乜',
        '養', '鞠', '須', '豐', '巢', '關', '蒯', '相',
        '查', '后', '荊', '紅', '游', '竺', '權', '逯',
        '蓋', '益', '桓', '公', '万俟', '司馬', '上官',
        '歐陽', '夏侯', '諸葛', '聞人', '東方', '赫連',
        '皇甫', '尉遲', '公羊', '澹臺', '公冶', '宗政',
        '濮陽', '淳于', '單于', '太叔', '申屠', '公孫',
        '仲孫', '軒轅', '令狐', '鍾離', '宇文', '長孫',
        '慕容', '鮮于', '閭丘', '司徒', '司空', '亓官',
        '司寇', '仉', '督', '子車', '顓孫', '端木', '巫馬',
        '公西', '漆雕', '樂正', '壤駟', '公良', '拓跋',
        '夾谷', '宰父', '穀梁', '晉', '楚', '閆', '法',
        '汝', '鄢', '涂', '欽', '段干', '百里', '東郭',
        '南門', '呼延', '歸', '海', '羊舌', '微生', '岳',
        '帥', '緱', '亢', '況', '後', '有', '琴', '梁丘',
        '左丘', '東門', '西門', '商', '牟', '佘', '佴',
        '伯', '賞', '南宮', '墨', '哈', '譙', '笪', '年',
        '愛', '陽', '佟', '第五', '言', '福',
    );

    /**
     * @link http://technology.chtsai.org/namefreq/
     */
    protected static $characterMale = array(
        '佳', '俊', '信', '偉', '傑', '冠', '君', '哲',
        '嘉', '威', '宇', '安', '宏', '宗', '宜', '家',
        '庭', '廷', '建', '彥', '心', '志', '思', '承',
        '文', '柏', '樺', '瑋', '穎', '美', '翰', '華',
        '詩', '豪', '賢', '軒', '銘', '霖',
    );

    protected static $characterFemale = array(
        '伶', '佩', '佳', '依', '儀', '冠', '君', '嘉',
        '如', '娟', '婉', '婷', '安', '宜', '家', '庭',
        '心', '思', '怡', '惠', '慧', '文', '欣', '涵',
        '淑', '玲', '珊', '琪', '琬', '瑜', '穎', '筑',
        '筱', '美', '芬', '芳', '華', '萍', '萱', '蓉',
        '詩', '貞', '郁', '鈺', '雅', '雯', '靜', '馨',
    );

    public static function randomName($pool, $n)
    {
        $name = '';
        for ($i = 0; $i < $n; ++$i) {
            $name .= static::randomElement($pool);
        }
        return $name;
    }

    public static function firstNameMale()
    {
        return static::randomName(static::$characterMale, mt_rand(1, 2));
    }

    public static function firstNameFemale()
    {
        return static::randomName(static::$characterFemale, mt_rand(1, 2));
    }

    public static function suffix()
    {
        return '';
    }

    /**
     * @param string $gender Person::GENDER_MALE || Person::GENDER_FEMALE
     *
     * @see https://en.wikipedia.org/wiki/National_Identification_Card_(Republic_of_China)
     *
     * @return string Length 10 alphanumeric characters, begins with 1 latin character (birthplace),
     * 1 number (gender) and then 8 numbers (the last one is check digit).
     */
    public function personalIdentityNumber($gender = null)
    {
        $birthPlace = self::randomKey(self::$idBirthplaceCode);
        $birthPlaceCode = self::$idBirthplaceCode[$birthPlace];

        $gender = ($gender != null) ? $gender : self::randomElement(array(self::GENDER_FEMALE, self::GENDER_MALE));
        $genderCode = ($gender === self::GENDER_MALE) ? 1 : 2;

        $randomNumberCode = self::randomNumber(7, true);

        $codes = str_split($birthPlaceCode . $genderCode . $randomNumberCode);
        $total = 0;

        foreach ($codes as $key => $code) {
            $total += $code * self::$idDigitValidator[$key];
        }

        $checkSumDigit = 10 - ($total % 10);

        if ($checkSumDigit == 10) {
            $checkSumDigit = 0;
        }

        $id = $birthPlace . $genderCode . $randomNumberCode . $checkSumDigit;

        return $id;
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        INDX( 	 �qm             (   �  �                            �     h X     �     `+5�ok� Uze���Å�<�`+5�ok� P      �M               A d d r e s s . p h p �     h T     �     9S<�ok� Uze�VBƅ�<�9S<�ok�                     	 C o l o r . p h p     �     h X     �     �yC�ok� Uze���ȅ�<��yC�ok� 0      ('               C o m p a n y . p h p �     p Z     �     ��J�ok� Uze���ȅ�<���J�ok�       6               D a t e T i m e . p h p       �     p Z     �     JeO�ok� Uze�˅�<�JeO�ok�0      /               I n t e r n e t . p h p       �     h X     �     *T�ok� Uze�liͅ�<�*T�ok��       �                P a y m e n t . p h p �     h V     �     ��X�ok� Uze�liͅ�<���X�ok� 0      X               
 P e r s o n . p h p   �     p `     �     !Q[�ok� Uze���υ�<�!Q[�ok��      �               P h o n e N u m b e r . p h p �     h R     �     [xb�ok� Uze�).҅�<�[xb�ok� �     ��              T e x t . p h p                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              <?php

namespace Faker\Provider\zh_TW;

class Text extends \Faker\Provider\Text
{
    protected static $separator = '';
    protected static $separatorLen = 0;

    /**
     * All punctuation in $baseText: 、 。 「 」 『 』 ！ ？ ー ， ： ；
     */
    protected static $notEndPunct = array('、', '「', '『', 'ー', '，', '：', '；');
    protected static $endPunct = array('。', '」', '』', '！', '？');
    protected static $notBeginPunct = array('、', '。', '」', '』', '！', '？', 'ー', '，', '：', '；');

    /**
     * Title: 吶喊 Call to Arms (1922)
     * Author: 魯迅 Lu Xun
     * Language: Traditional Chinese
     * @see https://zh.wikisource.org/wiki/%E5%90%B6%E5%96%8A
     * @var string
     */
    protected static $baseText = <<<'EOT'
我在年青時候也曾經做過許多夢，後來大半忘卻了，但自己也並不以爲可惜。所謂回憶者，雖說可以使人歡欣，有時也不免使人寂寞，使精神的絲縷還牽著已逝的寂寞的時光，又有什麼意味呢，而我偏苦于不能全忘卻，這不能全忘的一部分，到現在便成了《吶喊》的來由。
我有四年多，曾經常常，——幾乎是每天，出入于質鋪和藥店裏，年紀可是忘卻了，總之是藥店的櫃臺正和我一樣高，質鋪的是比我高一倍，我從一倍高的櫃臺外送上衣服或首飾去，在侮蔑裡接了錢，再到一樣高的櫃臺上給我久病的父親去買藥。回家之後，又須忙別的事了，因爲開方的醫生是最有名的，以此所用的藥引也奇特：冬天的蘆根，經霜三年的甘蔗，蟋蟀要原對的，結子的平地木，……多不是容易辦到的東西。然而我的父親終于日重一日的亡故了。
有誰從小康人家而墜入困頓的麼，我以爲在這途路中，大概可以看見世人的真面目；我要到N進K學堂去了，仿佛是想走異路，逃異地，去尋求別樣的人們。我的母親沒有法，辦了八元的川資，說是由我的自便；然而伊哭了，這正是情理中的事，因爲那時讀書應試是正路，所謂學洋務，社會上便以爲是一種走投無路的人，只得將靈魂賣給鬼子，要加倍的奚落而且排斥的，而況伊又看不見自己的兒子了。然而我也顧不得這些事，終于到N去進了K學堂了，在這學堂裏，我纔知道世上還有所謂格致，算學，地理，歷史，繪圖和體操。生理學並不教，但我們卻看到些木版的《全體新論》和《化學衛生論》之類了。我還記得先前的醫生的議論和方藥，和現在所知道的比較起來，便漸漸的悟得中醫不過是一種有意的或無意的騙子，同時又很起了對于被騙的病人和他的家族的同情；而且從譯出的歷史上，又知道了日本維新是大半發端于西方醫學的事實。
因爲這些幼稚的知識，後來便使我的學籍列在日本一個鄉間的醫學專門學校裏了。我的夢很美滿，預備卒業回來，救治像我父親似的被誤的病人的疾苦，戰爭時候便去當軍醫，一面又促進了國人對于維新的信仰。我已不知道教授微生物學的方法，現在又有了怎樣的進步了，總之那時是用了電影，來顯示微生物的形狀的，因此有時講義的一段落已完，而時間還沒有到，教師便映些風景或時事的畫片給學生看，以用去這多餘的光陰。其時正當日俄戰爭的時候，關于戰事的畫片自然也就比較的多了，我在這一個講堂中，便須常常隨喜我那同學們的拍手和喝采。有一回，我竟在畫片上忽然會見我久違的許多中國人了，一個綁在中間，許多站在左右，一樣是強壯的體格，而顯出麻木的神情。據解說，則綁著的是替俄國做了軍事上的偵探，正要被日軍砍下頭顱來示衆，而圍著的便是來賞鑑這示衆的盛舉的人們。
這一學年沒有完畢，我已經到了東京了，因爲從那一回以後，我便覺得醫學並非一件緊要事，凡是愚弱的國民，卽使體格如何健全，如何茁壯，也只能做毫無意義的示衆的材料和看客，病死多少是不必以爲不幸的。所以我們的第一要著，是在改變他們的精神，而善于改變精神的是，我那時以爲當然要推文藝，于是想提倡文藝運動了。在東京的留學生很有學法政理化以至警察工業的，但沒有人治文學和美術；可是在冷淡的空氣中，也幸而尋到幾個同志了，此外又邀集了必須的幾個人，商量之後，第一步當然是出雜誌，名目是取“新的生命”的意思，因爲我們那時大抵帶些復古的傾向，所以只謂之《新生》。
《新生》的出版之期接近了，但最先就隱去了若干擔當文字的人，接着又逃走了資本，結果只剩下不名一錢的三個人。創始時候旣已背時，失敗時候當然無可吿語，而其後卻連這三個人也都爲各自的運命所驅策，不能在一處縱談將來的好夢了，這就是我們的並未產生的《新生》的結局。
我感到未嘗經驗的無聊，是自此以後的事。我當初是不知其所以然的；後來想，凡有一人的主張，得了贊和，是促其前進的，得了反對，是促其奮鬭的，獨有叫喊于生人中，而生人並無反應，既非贊同，也無反對，如置身毫無邊際的荒原，無可措手的了，這是怎樣的悲哀呵，我于是以我所感到者爲寂寞。
這寂寞又一天一天的長大起來，如大毒蛇，纏住了我的靈魂了。
然而我雖然自有無端的悲哀，卻也並不憤懣，因爲這經驗使我反省，看見自己了：就是我決不是一個振臂一呼應者雲集的英雄。
只是我自己的寂寞是不可不驅除的，因爲這于我太痛苦。我于是用了種種法，來麻醉自己的靈魂，使我沈入于國民中，使我回到古代去，後來也親歷或旁觀過幾樣更寂寞更悲哀的事，都爲我所不願追懷，甘心使他們和我的腦一同消滅在泥土裏的，但我的麻醉法卻也似乎已經奏了功，再沒有青年時候的慷慨激昂的意思了。
S會館裏有三間屋，相傳是往昔曾在院子裏的槐樹上縊死過一個女人的，現在槐樹已經高不可攀了，而這屋還沒有人住；許多年，我便寓在這屋裏鈔古碑。客中少有人來，古碑中也遇不到什麼問題和主義，而我的生命卻居然暗暗的消去了，這也就是我惟一的願望。夏夜，蚊子多了，便搖著蒲扇坐在槐樹下，從密葉縫裡看那一點一點的青天，晚出的槐蠶又每每冰冷的落在頭頸上。
那時偶或來談的是一個老朋友金心異，將手提的大皮夾放在破桌上，脫下長衫，對面坐下了，因爲怕狗，似乎心房還在怦怦的跳動。
“你鈔了這些有什麼用？”有一夜，他翻著我那古碑的鈔本，發了研究的質問了。“沒有什麼用。”“那麼，你鈔他是什麼意思呢？”“沒有什麼意思。”“我想，你可以做點文章……”
我懂得他的意思了，他們正辦《新青年》，然而那時仿佛不特沒有人來贊同，並且也還沒有人來反對，我想，他們許是感到寂寞了，但是說：
“假如一間鐵屋子，是絕無窗戶而萬難破毀的，裏面有許多熟睡的人們，不久都要悶死了，然而是從昏睡入死滅，並不感到就死的悲哀。現在你大嚷起來，驚起了較爲清醒的幾個人，使這不幸的少數者來受無可挽救的臨終的苦楚，你倒以爲對得起他們麼？”
“然而幾個人旣然起來，你不能說決沒有毀壞這鐵屋的希望。”
是的，我雖然自有我的確信，然而說到希望，卻是不能抹殺的，因爲希望是在于將來，決不能以我之必無的證明，來折服了他之所謂可有，于是我終于答應他也做文章了，這便是最初的一篇《狂人日記》。從此以後，便一發而不可收，每寫些小說模樣的文章，以敷衍朋友們的囑托，積久就有了十餘篇。
在我自己，本以爲現在是已經並非一個切迫而不能已于言的人了，但或者也還未能忘懷于當日自己的寂寞的悲哀罷，所以有時候仍不免吶喊幾聲，聊以慰藉那在寂寞裏奔馳的猛士，使他不憚于前驅。至于我的喊聲是勇猛或是悲哀，是可憎或是可笑，那倒是不暇顧及的；但旣然是吶喊，則當然須聽將令的了，所以我往往不恤用了曲筆，在《藥》的瑜兒的墳上平空添上一個花環，在《明天》裏也不敍單四嫂子竟沒有做到看見兒子的夢，因爲那時的主將是不主張消極的。至于自己，卻也並不願將自以爲苦的寂寞，再來傳染給也如我那年青時候似的正做著好夢的青年。
這樣說來，我的小說和藝術的距離之遠，也就可想而知了，然而到今日還能蒙着小說的名，甚而至于且有成集的機會，無論如何總不能不說是一件徼幸的事，但徼幸雖使我不安于心，而懸揣人間暫時還有讀者，則究竟也仍然是高興的。
所以我竟將我的短篇小說結集起來，而且付印了，又因爲上面所說的緣由，便稱之爲《吶喊》。
魯鎭的酒店的格局，是和別處不同的：都是當街一個曲尺形的大櫃臺，櫃裏面豫備着熱水，可以隨時溫酒。做工的人，傍午傍晚散了工，每每花四文銅錢，買一碗酒，——這是二十多年前的事，現在每碗要漲到十文，——靠櫃外站着，熱熱的喝了休息；倘肯多花一文，便可以買一碟鹽煮筍，或者茴香豆，做下酒物了，如果出到十幾文，那就能買一樣葷菜，但這些顧客，多是短衣幫，大抵沒有這樣闊綽。只有穿長衫的，纔踱進店面隔壁的房子裏，要酒要菜，慢慢地坐喝。
我從十二歲起，便在鎭口的咸亨酒店裏當夥計，掌櫃說，樣子太傻，怕侍候不了長衫主顧，就在外面做點事罷。外面的短衣主顧，雖然容易說話，但嘮嘮叨叨纏夾不清的也很不少。他們往往要親眼看着黃酒從罎子裏舀出，看過壺子底裏有水沒有，又親看將壺子放在熱水裏，然後放心：在這嚴重監督下，羼水也很爲難。所以過了幾天，掌櫃又說我幹不了這事。幸虧薦頭的情面大，辭退不得，便改爲專管溫酒的一種無聊職務了。
我從此便整天的站在櫃臺裏，專管我的職務。雖然沒有什麼失職，但總覺得有些單調，有些無聊。掌櫃是一副凶臉孔，主顧也沒有好聲氣，教人活潑不得；只有孔乙己到店，纔可以笑幾聲，所以至今還記得。
孔乙己是站着喝酒而穿長衫的唯一的人。他身材很高大；青白臉色，皺紋間時常夾些傷痕；一部亂蓬蓬的花白的鬍子。穿的雖然是長衫，可是又髒又破，似乎十多年沒有補，也沒有洗。他對人說話，總是滿口之乎者也，教人半懂不懂的。因爲他姓孔，別人便從描紅紙上的「上大人孔乙己」這半懂不懂的話裏，替他取下一個綽號，叫作孔乙己。孔乙己一到店，所有喝酒的人便都看着他笑，有的叫道，「孔乙己，你臉上又添上新傷疤了！」他不回答，對櫃裏說，「溫兩碗酒，要一碟茴香豆。」便排出九文大錢。他們又故意的高聲嚷道，「你一定又偷了人家的東西了！」孔乙己睜大眼睛說，「你怎麼這樣憑空汚人清白……」「什麼清白？我前天親眼見你偷了何家的書，弔着打。」孔乙己便漲紅了臉，額上的青筋條條綻出，爭辯道，「竊書不能算偷……竊書！……讀書人的事，能算偷麼？」接連便是難懂的話，什麼「君子固窮」，什麼「者乎」之類，引得衆人都哄笑起來：店內外充滿了快活的空氣。
聽人家背地裏談論，孔乙己原來也讀過書，但終于沒有進學，又不會營生；于是愈過愈窮，弄到將要討飯了。幸而寫得一筆好字，便替人家鈔鈔書，換一碗飯喫。可惜他又有一樣壞脾氣，便是好喝嬾做。坐不到幾天，便連人和書籍紙張筆硯，一齊失蹤。如是幾次，叫他鈔書的人也沒有了。孔乙己沒有法，便免不了偶然做些偷竊的事。但他在我們店裏，品行卻比別人都好，就是從不拖欠；雖然間或沒有現錢，暫時記在粉板上，但不出一月，定然還清，從粉板上拭去了孔乙己的名字。
孔乙己喝過半碗酒，漲紅的臉色漸漸復了原，旁人便又問道，「孔乙己，你當眞認識字麼？」孔乙己看着問他的人，顯出不屑置辯的神氣。他們便接着說道，「你怎的連半個秀才也撈不到呢？」孔乙己立刻顯出頹唐不安模樣，臉上籠上了一層灰色，嘴裏說些話；這回可是全是之乎者也之類，一些不懂了。在這時候，衆人也都哄笑起來：店內外充滿了快活的空氣。
在這些時候，我可以附和着笑，掌櫃是決不責備的。而且掌櫃見了孔乙己，也每每這樣問他，引人發笑。孔乙己自己知道不能和他們談天，便只好向孩子說話。有一回對我說道，「你讀過書麼？」我略略點一點頭。他說，「讀過書，……我便考你一考。茴香豆的茴字，怎樣寫的？」我想，討飯一樣的人，也配考我麼？便回過臉去，不再理會。孔乙己等了許久，很懇切的說道，「不能寫罷？……我教給你，記着！這些字應該記着。將來做掌櫃的時候，寫賬要用。」我暗想我和掌櫃的等級還很遠呢，而且我們掌櫃也從不將茴香豆上賬；又好笑，又不耐煩，嬾嬾的答他道，「誰要你教，不是草頭底下一個來回的回字麼？」孔乙己顯出極高興的樣子，將兩個指頭的長指甲敲着櫃臺，點頭說，「對呀對呀！……回字有四樣寫法，你知道麼？」我愈不耐煩了，努着嘴走遠。孔乙己剛用指甲蘸了酒，想在櫃上寫字，見我毫不熱心，便又歎一口氣，顯出極惋惜的樣子。
有幾回，鄰舍孩子聽得笑聲，也趕熱鬧，圍住了孔乙己。他便給他們茴香豆喫，一人一顆。孩子喫完豆，仍然不散，眼睛都望着碟子。孔乙己着了慌，伸開五指將碟子罩住，彎腰下去說道，「不多了，我已經不多了。」直起身又看一看豆，自己搖頭說，「不多不多！多乎哉？不多也。」於是這一羣孩子都在笑聲裏走散了。
孔乙己是這樣的使人快活，可是沒有他，別人也便這麼過。
有一天，大約是中秋前的兩三天，掌櫃正在慢慢的結賬，取下粉板，忽然說，「孔乙己長久沒有來了。還欠十九個錢呢！」我纔也覺得他的確長久沒有來了。一個喝酒的人說道，「他怎麼會來？……他打折了腿了。」掌櫃說，「哦！」「他總仍舊是偷。這一回，是自己發昏，竟偷到丁舉人家裏去了。他家的東西，偷得的麼？」「後來怎麼樣？」「怎麼樣？先寫服辯，後來是打，打了大半夜，再打折了腿。」「後來呢？」「後來打折了腿了。」「打折了怎樣呢？」「怎樣？……誰曉得？許是死了。」掌櫃也不再問，仍然慢慢的算他的賬。
中秋之後，秋風是一天涼比一天，看看將近初冬；我整天的靠着火，也須穿上棉襖了。一天的下半天，沒有一個顧客，我正合了眼坐着。忽然間聽得一個聲音，「溫一碗酒。」這聲音雖然極低，卻很耳熟。看時又全沒有人。站起來向外一望，那孔乙己便在櫃臺下對了門檻坐着。他臉上黑而且瘦，已經不成樣子；穿一件破夾襖，盤着兩腿，下面墊一個蒲包，用草繩在肩上掛住；見了我，又說道，「溫一碗酒。」掌櫃也伸出頭去，一面說，「孔乙己麼？你還欠十九個錢呢！」孔乙己很頹唐的仰面答道，「這……下回還清罷。這一回是現錢，酒要好。」掌櫃仍然同平常一樣，笑着對他說，「孔乙己，你又偷了東西了！」但他這回卻不十分分辯，單說了一句「不要取笑！」「取笑？要是不偷，怎麼會打斷腿？」孔乙己低聲說道，「跌斷，跌，跌……」他的眼色，很像懇求掌櫃，不要再提。此時已經聚集了幾個人，便和掌櫃都笑了。我溫了酒，端出去，放在門檻上。他從破衣袋裏摸出四文大錢，放在我手裏，見他滿手是泥，原來他便用這手走來的。不一會，他喝完酒，便又在旁人的說笑聲中，坐着用這手慢慢走去了。
自此以後，又長久沒有看見孔乙己。到了年關，掌櫃取下粉板說，「孔乙己還欠十九個錢呢！」到第二年的端午，又說「孔乙己還欠十九個錢呢！」到中秋可是沒有說，再到年關也沒有看見他。
我到現在終于沒有見——大約孔乙己的確死了。
秋天的後半夜，月亮下去了，太陽還沒有出，只剩下一片烏藍的天；除了夜遊的東西，什麽都睡著。華老栓忽然坐起身，擦着火柴，點上遍身油膩的燈盞，茶館的兩間屋子裏，便彌滿了青白的光。
「小栓的爹，你就去麽？」是一個老女人的聲音。裏邊的小屋子裏，也發出一陣咳嗽。「唔。」老栓一面聽，一面應，一面扣上衣服；伸手過去說，「你給我罷。」
華大媽在枕頭底下掏了半天，掏出一包洋錢，交給老栓，老栓接了，抖抖的裝入衣袋，又在外面按了兩下；便點上燈籠，吹熄燈盞，走向裏屋子去了。那屋子裏面，正在窸窸窣窣的響，接著便是一通咳嗽。老栓候他平靜下去，才低低的叫道，「小栓……你不要起來。……店麽？你娘會安排的。」
老栓聽得兒子不再說話，料他安心睡了；便出了門，走到街上。街上黑沈沈的一無所有，只有一條灰白的路，看得分明。燈光照着他的兩腳，一前一後的走。有時也遇到幾隻狗，可是一隻也沒有叫。天氣比屋子裏冷多了；老栓倒覺爽快，彷彿一旦變了少年，得了神通，有給人生命的本領似的，跨步格外高遠。而且路也愈走愈分明，天也愈走愈亮了。
老栓正在專心走路，忽然吃了一驚，遠遠裏看見一條丁字街，明明白白橫著。他便退了幾步，尋到一家關着門的鋪子，蹩進簷下，靠門立住了。好一會，身上覺得有些發冷。「哼，老頭子。」「倒高興……。」
老栓又喫一驚，睜眼看時，幾個人從他面前過去了。一個還回頭看他，樣子不甚分明，但很像久餓的人見了食物一般，眼裏閃出一種攫取的光。老栓看看燈籠，已經熄了。按一按衣袋，硬硬的還在。仰起頭兩面一望，只見許多古怪的人，三三兩兩，鬼似的在那裏徘徊；定睛再看，卻也看不出什麼別的奇怪。
沒有多久，又見幾個兵，在那邊走動；衣服前後的一個大白圓圈，遠地裏也看得清楚，走過面前的，並且看出號衣上暗紅的鑲邊。——一陣腳步聲響，一眨眼，已經擁過了一大簇人。那三三兩兩的人，也忽然合作一堆，潮一般向前趕；將到丁字街口，便突然立住，簇成一個半圓。
老栓也向那邊看，卻只見一堆人的後背；頸項都伸得很長，彷彿許多鴨，被無形的手揑住了的，向上提着。靜了一會，似乎有點聲音，便又動搖起來，轟的一聲，都向後退；一直散到老栓立着的地方，幾乎將他擠倒了。
「喂！一手交錢，一手交貨！」一個渾身黑色的人，站在老栓面前，眼光正像兩把刀，刺得老栓縮小了一半。那人一隻大手，向他攤着；一隻手卻撮着一個鮮紅的饅頭，那紅的還是一點一點的往下滴。
老栓慌忙摸出洋錢，抖抖的想交給他，卻又不敢去接他的東西。那人便焦急起來，嚷道，「怕什麼？怎的不拿！」老栓還躊躇着；黑的人便搶過燈籠，一把扯下紙罩，裹了饅頭，塞與老栓；一手抓過洋錢，揑一揑，轉身去了。嘴裏哼着說，「這老東西……。」
「這給誰治病的呀？」老栓也似乎聽得有人問他，但他並不答應；他的精神，現在只在一個包上，彷彿抱着一個十世單傳的嬰兒，別的事情，都已置之度外了。他現在要將這包裏的新的生命，移植到他家裏，收穫許多幸福。太陽也出來了；在他面前，顯出一條大道，直到他家中，後面也照見丁字街頭破匾上「古口亭口」這四個黯淡的金字。
老栓走到家，店面早經收拾乾淨，一排一排的茶桌，滑溜溜的發光。但是沒有客人；只有小栓坐在裏排的桌前吃飯，大粒的汗，從額上滾下，夾襖也帖住了脊心，兩塊肩胛骨高高凸出，印成一個陽文的「八字」。老栓見這樣子，不免皺一皺展開的眉心。他的女人，從竈下急急走出，睜着眼睛，嘴唇有些發抖。「得了麼？」「得了。」
兩個人一齊走進竈下，商量了一會；華大媽便出去了，不多時，拏着一片老荷葉回來，攤在桌上。老栓也打開燈籠罩，用荷葉重新包了那紅的饅頭。小栓也吃完飯，他的母親慌忙說：「小栓——你坐着，不要到這裏來。」一面整頓了竈火，老栓便把一個碧綠的包，一個紅紅白白的破燈籠，一同塞在竈裏；一陣紅黑的火焰過去時，店屋裏散滿了一種奇怪的香味。
「好香！你們吃什麼點心呀？」這是駝背五少爺到了。這人每天總在茶館裏過日，來得最早，去得最遲，此時恰恰蹩到臨街的壁角的桌邊，便坐下問話，然而沒有人答應他。「炒米粥麽？」仍然沒有人應。老栓匆匆走出，給他泡上茶。
「小栓進來罷！」華大媽叫小栓進了裏面的屋子，中間放好一條凳，小栓坐了。他的母親端過一碟烏黑的圓東西，輕輕說：——「喫下去罷，——病便好了。」
小栓撮起這黑東西，看了一會，似乎拏着自己的性命一般，心裏說不出的奇怪。十分小心的拗開了，焦皮裏面竄出一道白氣，白氣散了，是兩半個白麵的饅頭。——不多工夫，已經全在肚裏了，卻全忘了什麼味；面前只剩下一張空盤。他的旁邊，一面立着他的父親，一面立着他的母親，兩人的眼光，都彷彿要在他身裏注進什麽又要取出什麽似的；便禁不住心跳起來，按着胸膛，又是一陣咳嗽。
「睡一會罷，——便好了。」
小栓依他母親的話，咳着睡了。華大媽候他喘氣平靜，才輕輕的給他蓋上了滿幅補釘的夾被。
店裏坐着許多人，老栓也忙了，提着大銅壺，一趟一趟的給客人沖茶；兩個眼眶，都圍着一圈黑線。
「老栓，你有些不舒服麽？——你生病麽？」一個花白鬍子的人說。「沒有。」
「沒有？——我想笑嘻嘻的，原也不像……」花白鬍子便取消了自己的話。
「老栓只是忙。要是他的兒子……」駝背五少爺話還未完，突然闖進了一個滿臉橫肉的人，披一件玄色布衫，散着紐扣，用很寬的玄色腰帶，胡亂捆在腰間。剛進門，便對老栓嚷道：
「吃了麽？好了麽？老栓，就是運氣了你！你運氣，要不是我信息靈……。」
老栓一手提了茶壺，一手恭恭敬敬的垂着；笑嘻嘻的聽。滿座的人，也都恭恭敬敬的聽。華大媽也黑着眼眶，笑嘻嘻的送出茶碗茶葉來，加上一個橄欖，老栓便去沖了水。
「這是包好！這是與眾不同的。你想，趁熱的拏來，趁熱吃下。」橫肉的人只是嚷。
「真的呢，要沒有康大叔照顧，怎麽會這樣……」華大媽也很感激的謝他。
「包好，包好！這樣的趁熱吃下。這樣的人血饅頭，什麽癆病都包好！」
華大媽聽到「癆病」這兩個字，變了一點臉色，似乎有些不高興；但又立刻堆上笑，搭訕着走開了。這康大叔卻沒有覺察，仍然提高了喉嚨只是嚷，嚷得裏面睡着的小栓也合夥咳嗽起來。
「原來你家小栓碰到了這樣的好運氣了。這病自然一定全好；怪不得老栓整天的笑着呢。」花白鬍子一面說，一面走到康大叔面前，低聲下氣的問道，「康大叔——聽說今天結果的一個犯人，便是夏家的孩子，那是誰的孩子？究竟是什麼事？」
「誰的？不就是夏四奶奶的兒子麽？那個小傢伙！」康大叔見眾人都聳起耳朵聽他，便格外高興，橫肉塊塊飽綻，越發大聲說，「這小東西不要命，不要就是了。我可是這一回一點沒有得到好處；連剝下來的衣服，都給管牢的紅眼睛阿義拏去了。——第一要算我們栓叔運氣；第二是夏三爺賞了二十五兩雪白的銀子，獨自落腰包，一文不花。」
小栓慢慢的從小屋子裏走出，兩手按了胸口，不住的咳嗽；走到竈下，盛出一碗冷飯，泡上熱水，坐下便吃。華大媽跟着他走，輕輕的問道，「小栓，你好些麽？——你仍舊只是肚餓？……」
「包好，包好！」康大叔瞥了小栓一眼，仍然回過臉，對眾人說，「夏三爺真是乖角兒，要是他不先告官，連他滿門抄斬。現在怎樣？銀子！——這小東西也真不成東西！關在牢裏，還要勸牢頭造反。」
「阿呀，那還了得。」坐在後排的一個二十多歲的人，很現出氣憤模樣。
「你要曉得紅眼睛阿義是去盤盤底細的，他卻和他攀談了。他說：這大清的天下是我們大家的。你想：這是人話麽？紅眼睛原知道他家裏只有一個老娘，可是沒有料到他竟會那麽窮，搾不出一點油水，已經氣破肚皮了。他還要老虎頭上搔癢，便給他兩個嘴巴！」
「義哥是一手好拳棒，這兩下，一定夠他受用了。」壁角的駝背忽然高興起來。
「他這賤骨頭打不怕，還要說可憐可憐哩。」
花白鬍子的人說，「打了這種東西，有什麽可憐呢？」
康大叔顯出看他不上的樣子，冷笑着說，「你沒有聽清我的話；看他神氣，是說阿義可憐哩！」
聽着的人的眼光，忽然有些板滯；話也停頓了。小栓已經吃完飯，吃得滿身流汗，頭上都冒出蒸氣來。
「阿義可憐——瘋話，簡直是發了瘋了。」花白鬍子恍然大悟似的說。
「發了瘋了。」二十多歲的人也恍然大悟的說。
店裏的坐客，便又現出活氣，談笑起來。小栓也趁着熱鬧，拚命咳嗽；康大叔走上前，拍他肩膀說：
「包好！小栓——你不要這麼咳。包好！」
「瘋了。」駝背五少爺點着頭說。
西關外靠着城根的地面，本是一塊官地；中間歪歪斜斜一條細路，是貪走便道的人，用鞋底造成的，但卻成了自然的界限。路的左邊，都埋着死刑和瘐斃的人，右邊是窮人的叢塚。兩面都已埋到層層疊疊，宛然闊人家裏祝壽時候的饅頭。
這一年的清明，分外寒冷；楊柳才吐出半粒米大的新芽。天明未久，華大媽已在右邊的一坐新墳前面，排出四碟菜，一碗飯，哭了一場。化過紙，呆呆的坐在地上；彷彿等候什麽似的，但自己也說不出等候什麽。微風起來，吹動他短髮，確乎比去年白得多了。
小路上又來了一個女人，也是半白頭髮，襤褸的衣裙；提一個破舊的朱漆圓籃，外掛一串紙錠，三步一歇的走。忽然見華大媽坐在地上看他，便有些躊躇，慘白的臉上，現出些羞愧的顏色；但終於硬着頭皮，走到左邊的一坐墳前，放下了籃子。
那墳與小栓的墳，一字兒排着，中間只隔一條小路。華大媽看他排好四碟菜，一碗飯，立着哭了一通，化過紙錠；心裏暗暗地想，「這墳裏的也是兒子了。」那老女人徘徊觀望了一回，忽然手腳有些發抖，蹌蹌踉踉退下幾步，瞪着眼只是發怔。
華大媽見這樣子，生怕他傷心到快要發狂了；便忍不住立起身，跨過小路，低聲對他說，「你這位老奶奶不要傷心了，——我們還是回去罷。」
那人點一點頭，眼睛仍然向上瞪着；也低聲吃吃的說道，「你看，——看這是什麽呢？」
華大媽跟了他指頭看去，眼光便到了前面的墳，這墳上草根還沒有全合，露出一塊一塊的黃土，煞是難看。再往上仔細看時，卻不覺也吃一驚；——分明有一圈紅白的花，圍着那尖圓的墳頂。
他們的眼睛都已老花多年了，但望這紅白的花，卻還能明白看見。花也不很多，圓圓的排成一個圈，不很精神，倒也整齊。華大媽忙看他兒子和別人的墳，卻只有不怕冷的幾點青白小花，零星開着；便覺得心裏忽然感到一種不足和空虛，不願意根究。那老女人又走近幾步，細看了一遍，自言自語的說，「這沒有根，不像自己開的。——這地方有誰來呢？孩子不會來玩；——親戚本家早不來了。——這是怎麼一回事呢？」他想了又想，忽又流下淚來，大聲說道：
「瑜兒，他們都冤枉了你，你還是忘不了，傷心不過，今天特意顯點靈，要我知道麽？」他四面一看，只見一隻烏鴉，站在一株沒有葉的樹上，便接着說，「我知道了。——瑜兒，可憐他們坑了你，他們將來總有報應，天都知道；你閉了眼睛就是了。——你如果真在這裏，聽到我的話，——便教這烏鴉飛上你的墳頂，給我看罷。」
微風早經停息了；枯草支支直立，有如銅絲。一絲發抖的聲音，在空氣中愈顫愈細，細到沒有，周圍便都是死一般靜。兩人站在枯草叢裏，仰面看那烏鴉；那烏鴉也在筆直的樹枝間，縮着頭，鐵鑄一般站著。
許多的工夫過去了；上墳的人漸漸增多，幾個老的小的，在土墳間出沒。
華大媽不知怎的，似乎卸下了一挑重擔，便想到要走；一面勸着說，「我們還是回去罷。」
那老女人嘆一口氣，無精打采的收起飯菜；又遲疑了一刻，終於慢慢地走了。嘴裏自言自語的說，「這是怎麼一回事呢？……」
他們走不上二三十步遠，忽聽得背後「啞——」的一聲大叫；兩個人都竦然的回過頭，只見那烏鴉張開兩翅，一挫身，直向着遠處的天空，箭也似的飛去了。
住在我們後進院子裏的三太太，在夏間買了一對白兔，是給伊的孩子們看的。
這一對白兔，似乎離娘並不久，雖然是異類，也可以看出他們的天真爛熳來。但也豎直了小小的通紅的長耳朵，動著鼻子，眼睛裏頗現些驚疑的神色，大約究竟覺得人地生疏，沒有在老家時候的安心了。這種東西，倘到廟會日期自己出去買，每個至多不過兩弔錢，而三太太卻花了一元，因為是叫小使上店買來的。
孩子們自然大得意了，嚷著圍住了看；大人也都圍著看；還有一匹小狗名叫S的也跑來，闖過去一嗅，打了一個噴嚏，退了幾步。三太太吆喝道，「S，聽著，不准你咬他！」於是在他頭上打了一拳，S便退開了，從此並不咬。
這一對兔總是關在後窗後面的小院子裏的時候多，聽說是因為太喜歡撕壁紙，也常常啃木器腳。這小院子裏有一株野桑樹，桑子落地，他們最愛吃，便連喂他們的菠菜也不吃了。烏鴉喜鵲想要下來時，他們便躬著身子用後腳在地上使勁的一彈，砉的一聲直跳上來，像飛起了一團雪，鴉鵲嚇得趕緊走，這樣的幾回，再也不敢近來了。三太太說，鴉鵲到不打緊，至多也不過搶吃一點食料，可惡的是一匹大黑貓，常在矮牆上惡狠狠的看，這卻要防的，幸而S和貓是對頭，或者還不至於有什麼罷。
孩子們時時捉他們來玩耍；他們很和氣，豎起耳朵，動著鼻子，馴良的站在小手的圈子裏，但一有空，卻也就溜開去了。他們夜裏的臥榻是一個小木箱，裏面鋪些稻草，就在後窗的房檐下。
這樣的幾個月之後，他們忽而自己掘土了，掘得非常快，前腳一抓，後腳一踢，不到半天，已經掘成一個深洞。大家都奇怪，後來仔細看時，原來一個的肚子比別一個的大得多了。他們第二天便將乾草和樹葉銜進洞裏去，忙了大半天。
大家都高興，說又有小兔可看了；三太太便對孩子們下了戒嚴令，從此不許再去捉。我的母親也很喜歡他們家族的繁榮，還說待生下來的離了乳，也要去討兩匹來養在自己的窗外面。
他們從此便住在自造的洞府裏，有時也出來吃些食，後來不見了，可不知道他們是預先運糧存在裏面呢還是竟不吃。過了十多天，三太太對我說，那兩匹又出來了，大約小兔是生下來又都死掉了，因為雌的一匹的奶非常多，卻並不見有進去哺養孩子的形跡。伊言語之間頗氣憤，然而也沒有法。
有一天，太陽很溫暖，也沒有風，樹葉都不動，我忽聽得許多人在那裏笑，尋聲看時，卻見許多人都靠著三太太的後窗看：原來有一個小兔，在院子裏跳躍了。這比他的父母買來的時候還小得遠，但也已經能用後腳一彈地，迸跳起來了。孩子們爭著告訴我說，還看見一個小兔到洞口來探一探頭，但是即刻便縮回去了，那該是他的弟弟罷。
那小的也撿些草葉吃，然而大的似乎不許他，往往夾口的搶去了，而自己並不吃。孩子們笑得響，那小的終於吃驚了，便跳著鑽進洞裏去；大的也跟到洞門口，用前腳推著他的孩子的脊樑，推進之後，又爬開泥土來封了洞。
從此小院子裏更熱鬧，窗口也時時有人窺探了。
然而竟又全不見了那小的和大的。這時是連日的陰天，三太太又慮到遭了那大黑貓的毒手的事去。我說不然，那是天氣冷，當然都躲著，太陽一齣，一定出來的。
太陽出來了，他們卻都不見。於是大家就忘卻了。
惟有三太太是常在那裏喂他們菠菜的，所以常想到。伊有一回走進窗後的小院子去，忽然在牆角發見了一個別的洞，再看舊洞口，卻依稀的還見有許多爪痕。這爪痕倘說是大兔的，爪該不會有這樣大，伊又疑心到那常在牆上的大黑貓去了，伊於是也就不能不定下發掘的決心了。伊終於出來取了鋤子，一路掘下去，雖然疑心，卻也希望著意外的見了小白兔的，但是待到底，卻只見一堆爛草夾些兔毛，怕還是臨蓐時候所鋪的罷，此外是冷清清的，全沒有什麼雪白的小兔的蹤跡，以及他那隻一探頭未出洞外的弟弟了。
氣憤和失望和淒涼，使伊不能不再掘那牆角上的新洞了。一動手，那大的兩匹便先竄出洞外面。伊以為他們搬了家了，很高興，然而仍然掘，待見底，那裏面也鋪著草葉和兔毛，而上面卻睡著七個很小的兔，遍身肉紅色，細看時，眼睛全都沒有開。
一切都明白了，三太太先前的預料果不錯。伊為預防危險起見，便將七個小的都裝在木箱中，搬進自己的房裏，又將大的也捺進箱裏面，勒令伊去哺乳。
三太太從此不但深恨黑貓，而且頗不以大兔為然了。據說當初那兩個被害之先，死掉的該還有，因為他們生一回，決不至於只兩個，但為了哺乳不勻，不能爭食的就先死了。這大概也不錯的，現在七個之中，就有兩個很瘦弱。所以三太太一有閑空，便捉住母兔，將小兔一個一個輪流的擺在肚子上來喝奶，不准有多少。
母親對我說，那樣麻煩的養兔法，伊歷來連聽也未曾聽到過，恐怕是可以收入《無雙譜》的。
白兔的家族更繁榮；大家也又都高興了。
但自此之後，我總覺得淒涼。夜半在燈下坐著想，那兩條小性命，竟是人不知鬼不覺的早在不知什麼時候喪失了，生物史上不著一些痕跡，並S也不叫一聲。我於是記起舊事來，先前我住在會館裏，清早起身，只見大槐樹下一片散亂的鴿子毛，這明明是膏於鷹吻的了，上午長班來一打掃，便什麼都不見，誰知道曾有一個生命斷送在這裏呢？我又曾路過西四牌樓，看見一匹小狗被馬車軋得快死，待回來時，什麼也不見了，搬掉了罷，過往行人憧憧的走著，誰知道曾有一個生命斷送在這裏呢？夏夜，窗外面，常聽到蒼蠅的悠長的吱吱的叫聲，這一定是給蠅虎咬住了，然而我向來無所容心於其間，而別人並且不聽到……
假使造物也可以責備，那麼，我以為他實在將生命造得太濫了，毀得太濫了。
嗥的一聲，又是兩條貓在窗外打起架來。「迅兒！你又在那裏打貓了？」「不，他們自己咬。他那裏會給我打呢。」
我的母親是素來很不以我的虐待貓為然的，現在大約疑心我要替小兔抱不平，下什麼辣手，便起來探問了。而我在全家的口碑上，卻的確算一個貓敵。我曾經害過貓，平時也常打貓，尤其是在他們配合的時候。但我之所以打的原因並非因為他們配合，是因為他們嚷，嚷到使我睡不著，我以為配合是不必這樣大嚷而特嚷的。
況且黑貓害了小兔，我更是「師出有名」的了。我覺得母親實在太修善，於是不由的就說出模棱的近乎不以為然的答話來。
造物太胡鬧，我不能不反抗他了，雖然也許是倒是幫他的忙……
那黑貓是不能久在矮牆上高視闊步的了，我決定的想，於是又不由的一瞥那藏在書箱裏的一瓶青酸鉀。
我在倒數上去的二十年中，只看過兩回中國戲，前十年是絕不看，因為沒有看戲的意思和機會，那兩回全在後十年，然而都沒有看出什麼來就走了。
第一回是民國元年我初到北京的時候，當時一個朋友對我說，北京戲最好，你不去見見世面麽？我想，看戲是有味的，而況在北京呢。於是都興緻勃勃的跑到什麼園，戲文已經開場了，在外面也早聽到鼕鼕地響。我們挨進門，幾個紅的綠的在我的眼前一閃爍，便又看見戲臺下滿是許多頭，再定神四面看，卻見中間也還有幾個空座，擠過去要坐時，又有人對我發議論，我因為耳朵已經喤的響著了，用了心，纔聽到他是說「有人，不行！」。
我們退到後面，一個辮子很光的卻來領我們到了側面，指出一個地位來。這所謂地位者，原來是一條長凳，然而他那坐板比我的上腿要狹到四分之三，他的腳比我的下腿要長過三分之二。我先是沒有爬上去的勇氣，接著便聯想到私刑拷打的刑具，不由的毛骨悚然的走出了。
走了許多路，忽聽得我的朋友的聲音道，「究竟怎的？」我回過臉去，原來他也被我帶出來了。他很詫異的說，「怎麼總是走，不答應？」我說，「朋友，對不起，我耳朵只在鼕鼕喤喤的響，並沒有聽到你的話。」
後來我每一想到，便很以為奇怪，似乎這戲太不好，——否則便是我近來在戲臺下不適於生存了。
第二回忘記了那一年，總之是募集湖北水災捐而譚叫天還沒有死。捐法是兩元錢買一張戲票，可以到第一舞臺去看戲，扮演的多是名角，其一就是小叫天。我買了一張票，本是對於勸募人聊以塞責的，然而似乎又有好事家乘機對我說了些叫天不可不看的大法要了。我於是忘了前幾年的鼕鼕喤喤之災，竟到第一舞臺去了，但大約一半也因為重價購來的寶票，總得使用了纔舒服。我打聽得叫天出臺是遲的，而第一舞臺卻是新式構造，用不著爭座位，便放了心，延宕到九點鐘纔去，誰料照例，人都滿了，連立足也難，我只得擠在遠處的人叢中看一個老旦在臺上唱。那老旦嘴邊插著兩個點火的紙撚子，旁邊有一個鬼卒，我費盡思量，纔疑心他或者是目連的母親，因為後來又出來了一個和尚。然而我又不知道那名角是誰，就去問擠小在我的左邊的一位胖紳士。他很看不起似的斜瞥了我一眼，說道， 「龔雲甫！」我深愧淺陋而且粗疏，臉上一熱，同時腦裡也制出了決不再問的定章，於是看小旦唱，看花旦唱，看老生唱，看不知什麼角色唱，看一大班人亂打，看兩三個人互打，從九點多到十點，從十點到十一點，從十一點到十一點半，從十一點半到十二點，——然而叫天竟還沒有來。
我向來沒有這樣忍耐的等待過什麼事物，而況這身邊的胖紳士的吁吁的喘氣，這臺上的鼕鼕喤喤的敲打，紅紅綠綠的晃蕩，加之以十二點，忽而使我省誤到在這裡不適於生存了。我同時便機械的擰轉身子，用力往外只一擠，覺得背後便已滿滿的，大約那彈性的胖紳士早在我的空處胖開了他的右半身了。我後無迴路，自然擠而又擠，終於出了大門。街上除了專等看客的車輛之外，幾乎沒有什麼行人了，大門口卻還有十幾個人昂著頭看戲目，別有一堆人站著並不看什麼，我想：他們大概是看散戲之後出來的女人們的，而叫天卻還沒有來……
然而夜氣很清爽，真所謂「沁人心脾」，我在北京遇著這樣的好空氣，仿佛這是第一遭了。
這一夜，就是我對於中國戲告了別的一夜，此後再沒有想到他，即使偶而經過戲園，我們也漠不相關，精神上早已一在天之南一在地之北了。
但是前幾天，我忽在無意之中看到一本日本文的書，可惜忘記了書名和著者，總之是關於中國戲的。其中有一篇，大意仿佛說，中國戲是大敲，大叫，大跳，使看客頭昏腦眩，很不適於劇場，但若在野外散漫的所在，遠遠的看起來，也自有他的風致。我當時覺著這正是說了在我意中而未曾想到的話，因為我確記得在野外看過很好的戲，到北京以後的連進兩回戲園去，也許還是受了那時的影響哩。可惜我不知道怎麼一來，竟將書名忘卻了。
至於我看好戲的時候，卻實在已經是「遠哉遙遙」的了，其時恐怕我還不過十一二歲。我們魯鎮的習慣，本來是凡有出嫁的女兒，倘自己還未當家，夏間便大抵回到母家去消夏。那時我的祖母雖然還康建，但母親也已分擔了些家務，所以夏期便不能多日的歸省了，只得在掃墓完畢之後，抽空去住幾天，這時我便每年跟了我的母親住在外祖母的家裡。那地方叫平橋村，是一個離海邊不遠，極偏僻的，臨河的小村莊；住戶不滿三十家，都種田，打魚，只有一家很小的雜貨店。但在我是樂土：因為我在這裡不但得到優待，又可以免念「秩秩斯乾幽幽南山」了。
和我一同玩的是許多小朋友，因為有了遠客，他們也都從父母那裡得了減少工作的許可，伴我來遊戲。在小村裡，一家的客，幾乎也就是公共的。我們年紀都相仿，但論起行輩來，卻至少是叔子，有幾個還是太公，因為他們合村都同姓，是本家。然而我們是朋友，即使偶而吵鬧起來，打了太公，一村的老老少少，也決沒有一個會想出「犯上」這兩個字來，而他們也百分之九十九不識字。
我們每天的事情大概是掘蚯蚓，掘來穿在銅絲做的小鉤上，伏在河沿上去釣蝦。蝦是水世界裡的呆子，決不憚用了自己的兩個鉗捧著鉤尖送到嘴裡去的，所以不半天便可以釣到一大碗。這蝦照例是歸我吃的。其次便是一同去放牛，但或者因為高等動物了的緣故罷，黃牛水牛都欺生，敢於欺侮我，因此我也總不敢走近身，只好遠遠地跟著，站著。這時候，小朋友們便不再原諒我會讀「秩秩斯干」，卻全都嘲笑起來了。
至於我在那裡所第一盼望的，卻在到趙莊去看戲。趙莊是離平橋村五里的較大的村莊；平橋村太小，自己演不起戲，每年總付給趙莊多少錢，算作合做的。當時我並不想到他們為什麼年年要演戲。現在想，那或者是春賽，是社戲了。
就在我十一二歲時候的這一年，這日期也看看等到了。不料這一年真可惜，在早上就叫不到船。平橋村只有一隻早出晚歸的航船是大船，決沒有留用的道理。其餘的都是小船，不合用；央人到鄰村去問，也沒有，早都給別人定下了。外祖母很氣惱，怪家裡的人不早定，絮叨起來。母親便寬慰伊，說我們魯鎮的戲比小村裡的好得多，一年看幾回，今天就算了。只有我急得要哭，母親卻竭力的囑咐我，說萬不能裝模裝樣，怕又招外祖母生氣，又不准和別人一同去，說是怕外祖母要擔心。
總之，是完了。到下午，我的朋友都去了，戲已經開場了，我似乎聽到鑼鼓的聲音，而且知道他們在戲臺下買豆漿喝。
這一天我不釣蝦，東西也少吃。母親很為難，沒有法子想。到晚飯時候，外祖母也終於覺察了，並且說我應當不高興，他們太怠慢，是待客的禮數裡從來沒有的。吃飯之後，看過戲的少年們也都聚攏來了，高高興興的來講戲。只有我不開口；他們都嘆息而且表同情。忽然間，一個最聰明的雙喜大悟似的提議了，他說，「大船？八叔的航船不是回來了麽？」十幾個別的少年也大悟，立刻攛掇起來，說可以坐了這航船和我一同去。我高興了。然而外祖母又怕都是孩子，不可靠；母親又說是若叫大人一同去，他們白天全有工作，要他熬夜，是不合情理的。在這遲疑之中，雙喜可又看出底細來了，便又大聲的說道，「我寫包票！船又大；迅哥兒向來不亂跑；我們又都是識水性的！」
誠然！這十多個少年，委實沒有一個不會鳧水的，而且兩三個還是弄潮的好手。
外祖母和母親也相信，便不再駁回，都微笑了。我們立刻一哄的出了門。
我的很重的心忽而輕鬆了，身體也似乎舒展到說不出的大。一出門，便望見月下的平橋內泊著一隻白篷的航船，大家跳下船，雙喜拔前篙，阿發拔後篙，年幼的都陪我坐在艙中，較大的聚在船尾。母親送出來吩咐「要小心」的時候，我們已經點開船，在橋石上一磕，退後幾尺，即又上前出了橋。於是架起兩支櫓，一支兩人，一里一換，有說笑的，有嚷的，夾著潺潺的船頭激水的聲音，在左右都是碧綠的豆麥田地的河流中，飛一般徑向趙莊前進了。
兩岸的豆麥和河底的水草所發散出來的清香，夾雜在水氣中撲面的吹來；月色便朦朧在這水氣裡。淡黑的起伏的連山，仿佛是踴躍的鐵的獸脊似的，都遠遠的向船尾跑去了，但我卻還以為船慢。他們換了四回手，漸望見依稀的趙莊，而且似乎聽到歌吹了，還有幾點火，料想便是戲臺，但或者也許是漁火。
那聲音大概是橫笛，宛轉，悠揚，使我的心也沉靜，然而又自失起來，覺得要和他彌散在含著豆麥蘊藻之香的夜氣裡。
那火接近了，果然是漁火；我纔記得先前望見的也不是趙莊。那是正對船頭的一叢松柏林，我去年也曾經去遊玩過，還看見破的石馬倒在地下，一個石羊蹲在草裡呢。過了那林，船便彎進了叉港，於是趙莊便真在眼前了。
最惹眼的是屹立在莊外臨河的空地上的一座戲臺，模胡在遠處的月夜中，和空間幾乎分不出界限，我疑心畫上見過的仙境，就在這裡出現了。這時船走得更快，不多時，在臺上顯出人物來，紅紅綠綠的動，近臺的河裡一望烏黑的是看戲的人家的船篷。
「近臺沒有什麼空了，我們遠遠的看罷。」阿發說。
這時船慢了，不久就到，果然近不得台旁，大家只能下了篙，比那正對戲臺的神棚還要遠。其實我們這白篷的航船，本也不願意和烏篷的船在一處，而況沒有空地呢……
在停船的匆忙中，看見臺上有一個黑的長鬍子的背上插著四張旗，捏著長槍，和一群赤膊的人正打仗。雙喜說，那就是有名的鐵頭老生，能連翻八十四個筋斗，他日裡親自數過的。
我們便都擠在船頭上看打仗，但那鐵頭老生卻又並不翻筋斗，只有幾個赤膊的人翻，翻了一陣，都進去了，接著走出一個小旦來，咿咿呀呀的唱。雙喜說，「晚上看客少，鐵頭老生也懈了，誰肯顯本領給白地看呢？」我相信這話對，因為其時臺下已經不很有人，鄉下人為了明天的工作，熬不得夜，早都睡覺去了，疏疏朗朗的站著的不過是幾十個本村和鄰村的閑漢。烏篷船裡的那些土財主的家眷固然在，然而他們也不在乎看戲，多半是專到戲臺下來吃糕餅水果和瓜子的。所以簡直可以算白地。
然而我的意思卻也並不在乎看翻筋斗。我最願意看的是一個人蒙了白布，兩手在頭上捧著一支棒似的蛇頭的蛇精，其次是套了黃布衣跳老虎。但是等了許多時都不見，小旦雖然進去了，立刻又出來了一個很老的小生。我有些疲倦了，託桂生買豆漿去。他去了一刻，回來說，「沒有。賣豆漿的聾子也回去了。日裡倒有，我還喝了兩碗呢。現在去舀一瓢水來給你喝罷。」
我不喝水，支撐著仍然看，也說不出見了些什麼，只覺得戲子的臉都漸漸的有些稀奇了，那五官漸不明顯，似乎融成一片的再沒有什麼高低。年紀小的幾個多打呵欠了，大的也各管自己談話。忽而一個紅衫的小丑被綁在臺柱子上，給一個花白鬍子的用馬鞭打起來了，大家纔又振作精神的笑著看。在這一夜裡，我以為這實在要算是最好的一折。
然而老旦終於出臺了。老旦本來是我所最怕的東西，尤其是怕他坐下了唱。這時候，看見大家也都很掃興，纔知道他們的意見是和我一致的。那老旦當初還只是踱來踱去的唱，後來竟在中間的一把交椅上坐下了。我很擔心；雙喜他們卻就破口喃喃的罵。我忍耐的等著，許多工夫，只見那老旦將手一抬，我以為就要站起來了，不料他卻又慢慢的放下在原地方，仍舊唱。全船裡幾個人不住的吁氣，其餘的也打起哈欠來。雙喜終於熬不住了，說道，怕他會唱到天明還不完，還是我們走的好罷。大家立刻都贊成，和開船時候一樣踴躍，三四人徑奔船尾，拔了篙，點退幾丈，迴轉船頭，駕起櫓，罵著老旦，又向那松柏林前進了。
月還沒有落，仿佛看戲也並不很久似的，而一離趙莊，月光又顯得格外的皎潔。回望戲臺在燈火光中，卻又如初來未到時候一般，又漂渺得像一座仙山樓閣，滿被紅霞罩著了。吹到耳邊來的又是橫笛，很悠揚；我疑心老旦已經進去了，但也不好意思說再回去看。
不多久，松柏林早在船後了，船行也並不慢，但周圍的黑暗只是濃，可知已經到了深夜。他們一面議論著戲子，或罵，或笑，一面加緊的搖船。這一次船頭的激水聲更其響亮了，那航船，就像一條大白魚背著一群孩子在浪花裡躥，連夜漁的幾個老漁父，也停了艇子看著喝采起來。
離平橋村還有一里模樣，船行卻慢了，搖船的都說很疲乏，因為太用力，而且許久沒有東西吃。這回想出來的是桂生，說是羅漢豆正旺相，柴火又現成，我們可以偷一點來煮吃。大家都贊成，立刻近岸停了船；岸上的田裡，烏油油的都是結實的羅漢豆。
「阿阿，阿發，這邊是你家的，這邊是老六一家的，我們偷那一邊的呢？」雙喜先跳下去了，在岸上說。
我們也都跳上岸。阿發一面跳，一面說道，「且慢，讓我來看一看罷，」他於是往來的摸了一回，直起身來說道，「偷我們的罷，我們的大得多呢。」一聲答應，大家便散開在阿發家的豆田裡，各摘了一大捧，拋入船艙中。雙喜以為再多偷，倘給阿發的娘知道是要哭罵的，於是各人便到六一公公的田裡又各偷了一大捧。
我們中間幾個年長的仍然慢慢的搖著船，幾個到後艙去生火，年幼的和我都剝豆。不久豆熟了，便任憑航船浮在水面上，都圍起來用手撮著吃。吃完豆，又開船，一面洗器具，豆莢豆殼全拋在河水裡，什麼痕跡也沒有了。雙喜所慮的是用了八公公船上的鹽和柴，這老頭子很細心，一定要知道，會罵的。然而大家議論之後，歸結是不怕。他如果罵，我們便要他歸還去年在岸邊拾去的一枝枯桕樹，而且當面叫他「八癩子」。
「都回來了！那裡會錯。我原說過寫包票的！」雙喜在船頭上忽而大聲的說。
我向船頭一望，前面已經是平橋。橋腳上站著一個人，卻是我的母親，雙喜便是對伊說著話。我走出前艙去，船也就進了平橋了，停了船，我們紛紛都上岸。母親頗有些生氣，說是過了三更了，怎麼回來得這樣遲，但也就高興了，笑著邀大家去吃炒米。
大家都說已經吃了點心，又渴睡，不如及早睡的好，各自回去了。
第二天，我向午纔起來，並沒有聽到什麼關係八公公鹽柴事件的糾葛，下午仍然去釣蝦。
「雙喜，你們這班小鬼，昨天偷了我的豆了罷？又不肯好好的摘，蹋壞了不少。」 我抬頭看時，是六一公公棹著小船，賣了豆回來了，船肚裡還有剩下的一堆豆。
「是的。我們請客。我們當初還不要你的呢。你看，你把我的蝦嚇跑了！」雙喜說。
六一公公看見我，便停了楫，笑道，「請客？——這是應該的。」於是對我說， 「迅哥兒，昨天的戲可好麽？」
我點一點頭，說道，「好。」「豆可中吃呢？」我又點一點頭，說道，「很好。」
不料六一公公竟非常感激起來，將大拇指一翹，得意的說道，「這真是大市鎮裡出來的讀過書的人纔識貨！我的豆種是粒粒挑選過的，鄉下人不識好歹，還說我的豆比不上別人的呢。我今天也要送些給我們的姑奶奶嘗嘗去……」他於是打著楫子過去了。
待到母親叫我回去吃晚飯的時候，桌上便有一大碗煮熟了的羅漢豆，就是六一公公送給母親和我吃的。聽說他還對母親極口誇獎我，說「小小年紀便有見識，將來一定要中狀元。姑奶奶，你的福氣是可以寫包票的了。」但我吃了豆，卻並沒有昨夜的豆那麼好。
真的，一直到現在，我實在再沒有吃到那夜似的好豆，——也不再看到那夜似的好戲了。
方玄綽近來愛說「差不多」這一句話，幾乎成了「口頭禪」似的；而且不但說，的確也盤據在他腦裏了。他最初說的是「都一樣」，後來大約覺得欠穩當了，便改為「差不多」，一直使用到現在。
他自從發見了這一句平凡的警句以後，雖然引起了不少的新感慨，同時卻也到許多新慰安。譬如看見老輩威壓青年，在先是要憤憤的，但現在卻就轉念道，將來這少年有了兒孫時，大抵也要擺這架子的罷，便再沒有什麼不平了。又如看見兵士打車夫，在先也要憤憤的，但現在也就轉念道，倘使這車夫當了兵，這兵拉了車，大抵也就這麼打，便再也不放在心上了。他這樣想著的時候，有時也疑心是因為自己沒有和惡社會奮鬥的勇氣，所以瞞心昧己的故意造出來的一條逃路，很近於「無是非之心」，遠不如改正了好。然而這意見總反而在他腦裏生長起來。
他將這「差不多說」最初公表的時候是在北京首善學校的講堂上，其時大概是提起關於歷史上的事情來，於是說到「古今人不相遠」，說到各色人等的「性相近」，終於牽扯到學生和官僚身上，大發其議論道：
「現在社會上時髦的都通行罵官僚，而學生罵得尤利害。然而官僚並不是天生的特別種族，就是平民變就的。現在學生出身的官僚就不少，和老官僚有什麼兩樣呢？『易地則皆然』，思想言論舉動豐采都沒有什麼大區別……便是學生團體新辦的許多事業，不是也已經難免出弊病，大半煙消火滅了麽？差不多的。但中國將來之可慮就在此……」
散坐在講堂裏的二十多個聽講者，有的悵然了，或者是以為這話對；有的勃然了，大約是以為侮辱了神聖的青年；有幾個卻對他微笑了，大約以為這是他替自己的辯解：因為方玄綽就是兼做官僚的。
而其實卻是都錯誤。這不過是他的一種新不平；雖說不平，又只是他的一種安分的空論。他自己雖然不知道是因為懶，還是因為無用，總之覺得是一個不肯運動，十分安分守己的人。總長冤他有神經病，只要地位還不至於動搖，他決不開一開口；教員的薪水欠到大半年了，只要別有官俸支持，他也決不開一開口。不但不開口，當教員聯合索薪的時候，他還暗地裏以為欠斟酌，太嚷嚷；直到聽得同寮過分的奚落他們了，這纔略有些小感慨，後來一轉念，這或者因為自己正缺錢，而別的官並不兼做教員的緣故罷，於是就釋然了。
他雖然也缺錢，但從沒有加入教員的團體內，大家議決罷課，可是不去上課了。政府說「上了課纔給錢」，他纔略恨他們的類乎用果子耍猴子；一個大教育家說道「教員一手挾書包一手要錢不高尚」，他纔對於他的太太正式的發牢騷了。
「喂，怎麼只有兩盤？」聽了「不高尚說」這一日的晚餐時候，他看著菜蔬說。
他們是沒有受過新教育的，太太並無學名或雅號，所以也就沒有什麼稱呼了，照老例雖然也可以叫「太太」但他又不願意太守舊，於是就發明瞭一個「喂」字。太太對他卻連「喂」字也沒有，只要臉向著他說話，依據習慣法，他就知道這話是對他而發的。
「可是上月領來的一成半都完了……昨天的米，也還是好容易纔賒來的呢。」伊站在桌旁臉對著他說。
「你看，還說教書的要薪水是卑鄙哩。這種東西似乎連人要吃飯，飯要米做，米要錢買這一點粗淺事情都不知道……」
「對啦。沒有錢怎麼買米，沒有米怎麼煮……」
他兩頰都鼓起來了，仿佛氣惱這答案正和他的議論「差不多」，近乎隨聲附和模樣；接著便將頭轉向別一面去了，依據習慣法，這是宣告討論中止的表示。
待到淒風冷雨這一天，教員們因為向政府去索欠薪，在新華門前爛泥裏被國軍打得頭破血出之後，倒居然也發了一點薪水。方玄綽不費舉手之勞的領了錢，酌還些舊債，卻還缺一大筆款，這是因為官俸也頗有些拖欠了。當是時，便是廉吏清官們也漸以為薪之不可不索，而況兼做教員的方玄綽，自然更表同情於學界起來，所以大家主張繼續罷課的時候，他雖然仍未到場，事後卻尤其心悅誠服的確守了公共的決議。
然而政府竟又付錢，學校也就開課了。但在前幾天，卻有學生總會上一個呈文給政府，說「教員倘若不上課，便要付欠薪。」這雖然並無效，而方玄綽卻忽而記起前回政府所說的「上了課纔給錢」的話來，「差不多」這一個影子在他眼前又一幌，而且並不消滅，於是他便在講堂上公表了。
準此，可見如果將「差不多說」鍛煉羅織起來，自然也可以判作一種挾帶私心的不平，但總不能說是專為自己做官的辯解。只是每到這些時，他又常常喜歡拉上中國將來的命運之類的問題，一不小心，便連自己也以為是一個憂國的志士；人們是每苦於沒有「自知之明」的。
但是「差不多」的事實又發生了，政府當初雖只不理那些招人頭痛的教員，後來竟不理到無關痛癢的官吏，欠而又欠，終於逼得先前鄙薄教員要錢的好官，也很有幾員化為索薪大會裏的驍將了。惟有幾種日報上卻很發了些鄙薄譏笑他們的文字。方玄綽也毫不為奇，毫不介意，因為他根據了他的「差不多說」，知道這是新聞記者還未缺少潤筆的緣故，萬一政府或是闊人停了津貼，他們多半也要開大會的。
他既已表同情於教員的索薪，自然也贊成同寮的索俸，然而他仍安坐在衙門中，照例的並不一同去討債。至於有人疑心他孤高，那可也不過是一種誤解罷了。他自己說，他是自從出世以來，只有人向他來要債，他從沒有向人去討過債，所以這一端是「非其所長」。而且他是不敢見手握經經濟之權的人物，這種人待到失了權勢之後，捧著一本《大乘起信論》講佛學的時候，固然也很是「藹然可親」的了，但還在寶座上時，卻總是一副閻王臉，將別人都當奴才看自以為手操著你們這些窮小子們的生殺之權。他因此不敢見，也不願見他們。這種脾氣，雖然有時連自己也覺得是孤高，但往往同時也疑心這其實是沒本領。
大家左索右索，總自一節一節的挨過去了，但比起先前來，方玄綽究竟是萬分的拮据，所以使用的小廝和交易的店家不消說，便是方太太對於他也漸漸的缺了敬意，只要看伊近來不很附和，而且常常提出獨創的意見，有些唐突的舉動，也就可以瞭然了。到了陰曆五月初四的午前，他一回來，伊便將一疊賬單塞在他的鼻子跟前，這也是往常所沒有的。
「一總總得一百八十塊錢纔夠開消……發了麽？」伊並不對著他看的說。
「哼，我明天不做官了。錢的支票是領來的了，可是索薪大會的代表不發放，先說是沒有同去的人都不發，後來又說是要到他們跟前去親領。他們今天單捏著支票，就變了閻王臉了，我實在怕看見……我錢也不要了，官也不做了，這樣無限量的卑屈……」
方太太見了這少見的義憤，倒有些愕然了，但也就沉靜下來。
「我想，還不如去親領罷，這算什麼呢。」伊看著他的臉說。
「我不去！這是官俸，不是賞錢，照例應該由會計科送來的。」
「可是不送來又怎麼好呢……哦，昨夜忘記說了，孩子們說那學費，學校裏已經催過好幾次了，說是倘若再不繳……」
「胡說！做老子的辦事教書都不給錢，兒子去念幾句書倒要錢？」
伊覺得他已經不很顧忌道理，似乎就要將自己當作校長來出氣，犯不上，便不再言語了。
兩個默默的吃了午飯。他想了一會，又懊惱的出去了。
照舊例，近年是每逢節根或年關的前一天，他一定須在夜裏的十二點鐘纔回家，一面走，一面掏著懷中，一面大聲的叫道，「喂，領來了！」於是遞給伊一疊簇新的中交票，臉上很有些得意的形色。誰知道初四這一天卻破了例，他不到七點鐘便回家來。方太太很驚疑，以為他竟已辭了職了，但暗暗地察看他臉上，卻也並不見有什麼格外倒運的神情。「怎麼了？……這樣早？……」伊看定了他說。「發不及了，領不出了，銀行已經關了門，得等初八。」「親領？……」伊惴惴的問。
「親領這一層也已經取消了，聽說仍舊由會計科分送。可是銀行今天已經關了門，休息三天，得等到初八的上午。」他坐下，眼睛看著地面了，喝過一口茶，纔又慢慢的開口說，「幸而衙門裏也沒有什麼問題了，大約到初八就準有錢……向不相干的親戚朋友去借錢，實在是一件煩難事。我午後硬著頭皮去尋金永生，談了一會，他先恭維我不去索薪，不肯親領，非常之清高，一個人正應該這樣做；待到知道我想要向他通融五十元，就像我在他嘴裏塞了一大把鹽似的，凡有臉上可以打皺的地迫都打起皺來，說房租怎樣的收不起，買賣怎樣的賠本，在同事面前親身領款，也不算什麼的，即刻將我支使出來了。」
「這樣緊急的節根，誰還肯借出錢去呢。」方太太卻只淡淡的說，並沒有什麼慨然。
方玄綽低下頭來了，覺得這也無怪其然的，況且自己和金永生本來很疏遠。他接著就記起去年年關的事來，那時有一個同鄉來借十塊錢，他其時明明已經收到了衙門的領款憑單的了，因為死怕這人將來未必會還錢，便裝了副為難的神色，說道衙門裏既然領不到俸錢，學校裏又不發薪水，實在「愛莫能助」，將他空手送走了。他雖然自已並不看見裝了怎樣的臉，但此時卻覺得很局促，嘴唇微微一動，又搖一搖頭。
然而不多久，他忽而恍然大悟似的發命令了：叫小廝即刻上街去賒一瓶蓮花白。他知道店家希圖明天多還帳，大抵是不敢不賒的，假如不賒，則明天分文不還，正是他們應得的懲罰。蓮花白竟賒來了，他喝了兩杯，青白色的臉上泛了紅，吃完飯，又頗有些高興了，他點上一枝大號哈德門香煙，從桌上抓起一本《嘗試集》來，躺在床上就要看。
「那麼明天怎麼對付店家呢？」方太太追上去，站在床面前看著他的臉說。「店家？……教他們初八的下半天來。」「我可不能這麼說。他們不相信，不答應的。」「有什麼不相信。他們可以問去，全衙門裏什麼人也沒有領到，都得初八！」他戟著第二個指頭在帳子裏的空中畫了一個半圓，方太太跟著指頭也看了一個半圓，只見這手便去翻開了《嘗試集》。
方太太見他強橫到出乎情理之外了，也暫時開不得口。
「我想，這模樣是鬧不下去的，將來總得想點法，做點什麼別的事……」伊終於尋到了別的路，說。「什麼法呢？我『文不像謄錄生，武不像救火兵』，別的做什麼？」「你不是給上海的書鋪子做過文章麽？」
「上海的書鋪子？買稿要一個一個的算字，空格不算數。你看我做在那裏的白話詩去，空白有多少，怕只值三百大錢一本罷。收版權稅又半年六月沒消息，『遠水救不得近火』，誰耐煩。」「那麼，給這裏的報館裏……」
「給報館裏？便在這裏很大的報館裏，我靠著一個學生在那裏做編輯的大情面，一千字也就是這幾個錢，即使一早做到夜，能夠養活你們麽？況且我肚子裏也沒有這許多文章。」
「那麼，過了節怎麼辦呢？」「過了節麽？——仍舊做官……明天店家來要錢，你只要說初八的下午。」
他又要看《嘗試集》了。方太太怕失了機會，連忙吞吞吐吐的說：「我想，過了節，到了初八，我們……倒不如去買一張彩票……」「胡說！會說出這樣無教育的……」
這時候，他忽而又記起被金永生支使出來以後的事了。那時他惘惘的走過稻香村，看店門口豎著許多斗大的字的廣告道「頭彩幾萬元」，仿佛記得心裏也一動，或者也許放慢了腳步的罷，但似乎因為捨不得皮夾裏僅存的六角錢，所以竟也毅然決然的走遠了。他臉色一變，方太太料想他是在惱著伊的無教育，便趕緊退開，沒有說完話。方玄綽也沒有說完話，將腰一伸，咿咿嗚嗚的就念《嘗試集》。
我冒了嚴寒，回到相隔二千餘里，別了二十餘年的故鄉去。
時候既然是深冬；漸近故鄉時，天氣又陰晦了，冷風吹進船艙中，嗚嗚的響，從蓬隙向外一望，蒼黃的天底下，遠近橫著幾個蕭索的荒村，沒有一些活氣。我的心禁不住悲涼起來了。
阿！這不是我二十年來時時記得的故鄉？
我所記得的故鄉全不如此。我的故鄉好得多了。但要我記起他的美麗，說出他的佳處來，卻又沒有影像，沒有言辭了。仿佛也就如此。於是我自己解釋說：故鄉本也如此，——雖然沒有進步，也未必有如我所感的悲涼，這只是我自己心情的改變罷了，因為我這次回鄉，本沒有什麼好心緒。
我這次是專為了別他而來的。我們多年聚族而居的老屋，已經公同賣給別姓了，交屋的期限，只在本年，所以必須趕在正月初一以前，永別了熟識的老屋，而且遠離了熟識的故鄉，搬家到我在謀食的異地去。
第二日清早晨我到了我家的門口了。瓦楞上許多枯草的斷莖當風抖著，正在說明這老屋難免易主的原因。幾房的本家大約已經搬走了，所以很寂靜。我到了自家的房外，我的母親早已迎著出來了，接著便飛出了八歲的侄兒宏兒。
我的母親很高興，但也藏著許多淒涼的神情，教我坐下，歇息，喝茶，且不談搬家的事。宏兒沒有見過我，遠遠的對面站著只是看。
但我們終於談到搬家的事。我說外間的寓所已經租定了，又買了幾件傢具，此外須將家裡所有的木器賣去，再去增添。母親也說好，而且行李也略已齊集，木器不便搬運的，也小半賣去了，只是收不起錢來。
「你休息一兩天，去拜望親戚本家一回，我們便可以走了。」母親說。
「是的。」
「還有閏土，他每到我家來時，總問起你，很想見你一回面。我已經將你到家的大約日期通知他，他也許就要來了。」
這時候，我的腦裡忽然閃出一幅神異的圖畫來：深藍的天空中掛著一輪金黃的圓月，下麵是海邊的沙地，都種著一望無際的碧綠的西瓜，其間有一個十一二歲的少年，項帶銀圈，手捏一柄鋼叉，向一匹猹盡力的刺去，那猹卻將身一扭，反從他的胯下逃走了。
這少年便是閏土。我認識他時，也不過十多歲，離現在將有三十年了；那時我的父親還在世，家景也好，我正是一個少爺。那一年，我家是一件大祭祀的值年。這祭祀，說是三十多年才能輪到一回，所以很鄭重；正月裡供祖像，供品很多，祭器很講究，拜的人也很多，祭器也很要防偷去。我家只有一個忙月（我們這裡給人做工的分三種：整年給一定人家做工的叫長工；按日給人做工的叫短工；自己也種地，只在過年過節以及收租時候來給一定人家做工的稱忙月），忙不過來，他便對父親說，可以叫他的兒子閏土來管祭器的。
我的父親允許了；我也很高興，因為我早聽到閏土這名字，而且知道他和我仿佛年紀，閏月生的，五行缺土，所以他的父親叫他閏土。他是能裝弶捉小鳥雀的。
我於是日日盼望新年，新年到，閏土也就到了。好容易到了年末，有一日，母親告訴我，閏土來了，我便飛跑的去看。他正在廚房裡，紫色的圓臉，頭戴一頂小氈帽，頸上套一個明晃晃的銀項圈，這可見他的父親十分愛他，怕他死去，所以在神佛面前許下願心，用圈子將他套住了。他見人很怕羞，只是不怕我，沒有旁人的時候，便和我說話，於是不到半日，我們便熟識了。
我們那時候不知道談些什麼，只記得閏土很高興，說是上城之後，見了許多沒有見過的東西。
第二日，我便要他捕鳥。他說：
"這不能。須大雪下了才好。我們沙地上，下了雪，我掃出一塊空地來，用短棒支起一個大竹匾，撒下秕穀，看鳥雀來吃時，我遠遠地將縛在棒上的繩子只一拉，那鳥雀就罩在竹匾下了。什麼都有：稻雞，角雞，鵓鴣，藍背……"
我於是又很盼望下雪。
閏土又對我說：
"現在太冷，你夏天到我們這裡來。我們日裡到海邊撿貝殼去，紅的綠的都有，鬼見怕也有，觀音手也有。晚上我和爹管西瓜去，你也去。"
"管賊麽？"
"不是。走路的人口渴了摘一個瓜吃，我們這裡是不算偷的。要管的是獾豬，刺蝟，猹。月亮底下，你聽，啦啦的響了，猹在咬瓜了。你便捏了胡叉，輕輕地走去……"
我那時並不知道這所謂猹的是怎麼一件東西——便是現在也沒有知道——只是無端的覺得狀如小狗而很兇猛。
"他不人麽？"
"有胡叉呢。走到了，看見猹了，你便刺。這畜生很伶俐，倒向你奔來，反從胯下竄了。他的皮毛是油一般的滑……"
我素不知道天下有這許多新鮮事：海邊有如許五色的貝殼；西瓜有這樣危險的經歷，我先前單知道他在水果店裡出賣罷了。
"我們沙地裡，潮汛要來的時候，就有許多跳魚兒只是跳，都有青蛙似的兩個腳……"
阿！閏土的心裡有無窮無盡的希奇的事，都是我往常的朋友所不知道的。他們不知道一些事，閏土在海邊時，他們都和我一樣只看見院子裡高牆上的四角的天空。
可惜正月過去了，閏土須回家裡去，我急得大哭，他也躲到廚房裡，哭著不肯出門，但終於被他父親帶走了。他後來還托他的父親帶給我一包貝殼和幾支很好看的鳥毛，我也曾送他一兩次東西，但從此沒有再見面。
現在我的母親提起了他，我這兒時的記憶，忽而全都閃電似的蘇生過來，似乎看到了我的美麗的故鄉了。我應聲說：
"這好極！他，——怎樣？……"
"他？……他景況也很不如意……"母親說著，便向房外看，"這些人又來了。說是買木器，順手也就隨便拿走的，我得去看看。"
母親站起身，出去了。門外有幾個女人的聲音。我便招宏兒走近面前，和他閑話：問他可會寫字，可願意出門。
"我們坐火車去麽？"
"我們坐火車去。"
"船呢？"
"先坐船，……"
"哈！這模樣了！鬍子這麼長了！"一種尖利的怪聲突然大叫起來。
我吃了一嚇，趕忙抬起頭，卻見一個凸顴骨，薄嘴唇，五十歲上下的女人站在我面前，兩手搭在髀間，沒有系裙，張著兩腳，正像一個畫圖儀器裡細腳伶仃的圓規。
我愕然了。
"不認識了麽？我還抱過你咧！"
我愈加愕然了。幸而我的母親也就進來，從旁說：
"他多年出門，統忘卻了。你該記得罷，"便向著我說，"這是斜對門的楊二嫂，……開豆腐店的。"
哦，我記得了。我孩子時候，在斜對門的豆腐店裡確乎終日坐著一個楊二嫂，人都叫伊"豆腐西施"⑹。但是擦著白粉，顴骨沒有這麼高，嘴唇也沒有這麼薄，而且終日坐著，我也從沒有見過這圓規式的姿勢。那時人說：因為伊，這豆腐店的買賣非常好。但這大約因為年齡的關係，我卻並未蒙著一毫感化，所以竟完全忘卻了。然而圓規很不平，顯出鄙夷的神色，仿佛嗤笑法國人不知道拿破侖，美國人不知道華盛頓似的，冷笑說：
"忘了？這真是貴人眼高……"
"那有這事……我……"我惶恐著，站起來說。
"那麼，我對你說。迅哥兒，你闊了，搬動又笨重，你還要什麼這些破爛木器，讓我拿去罷。我們小戶人家，用得著。"
"我並有闊哩。我須賣了這些，再去……"
"阿呀呀，你放了道台了，還說不闊？你現在有三房姨太太；出門便是八抬的大轎，還說不闊？嚇，什麼都瞞不過我。"
我知道無話可說了，便閉了口，默默的站著。
"阿呀阿呀，真是愈有錢，便愈是一毫不肯放鬆，愈是一毫不肯放鬆，便愈有錢……"圓規一面憤憤的迴轉身，一面絮絮的說，慢慢向外走，順便將我母親的一副手套塞在褲腰裡，出去了。
此後又有近處的本家和親戚來訪問我。我一面應酬，偷空便收拾些行李，這樣的過了三四天。
一日是天氣很冷的午後，我吃過午飯，坐著喝茶，覺得外面有人進來了，便回頭去看。我看時，不由的非常出驚，慌忙站起身，迎著走去。
這來的便是閏土。雖然我一見便知道是閏土，但又不是我這記憶上的閏土了。他身材增加了一倍；先前的紫色的圓臉，已經變作灰黃，而且加上了很深的皺紋；眼睛也像他父親一樣，周圍都腫得通紅，這我知道，在海邊種地的人，終日吹著海風，大抵是這樣的。他頭上是一頂破氈帽，身上只一件極薄的棉衣，渾身瑟索著；手裡提著一個紙包和一支長煙管，那手也不是我所記得的紅活圓實的手，卻又粗又笨而且開裂，像是松樹皮了。
我這時很興奮，但不知道怎麼說才好，只是說：

"阿！閏土哥，——你來了？……"

我接著便有許多話，想要連珠一般湧出：角雞，跳魚兒，貝殼，猹，……但又總覺得被什麼擋著似的，單在腦裡面迴旋，吐不出口外去。

他站住了，臉上現出歡喜和淒涼的神情；動著嘴唇，卻沒有作聲。他的態度終於恭敬起來了，分明的叫道：
"老爺！……"
我似乎打了一個寒噤；我就知道，我們之間已經隔了一層可悲的厚障壁了。我也說不出話。
他回過頭去說，"水生，給老爺磕頭。"便拖出躲在背後的孩子來，這正是一個廿年前的閏土，只是黃瘦些，頸子上沒有銀圈罷了。"這是第五個孩子，沒有見過世面，躲躲閃閃……"
母親和宏兒樓來了，他們大約也聽到了聲音。
"老太太。信是早收到了。我實在喜歡的不得了，知道老爺回來……"閏土說。
"阿，你怎的這樣客氣起來。你們先前不是哥弟稱呼麽？還是照舊：迅哥兒。"母親高興的說。
"阿呀，老太太真是……這成什麼規矩。那時是孩子，不懂事……"閏土說著，又叫水生上來打拱，那孩子卻害羞，緊緊的只貼在他背後。
"他就是水生？第五個？都是生人，怕生也難怪的；還是宏兒和他去走走。"母親說。
宏兒聽得這話，便來招水生，水生卻鬆鬆爽爽同他一路出去了。母親叫閏土坐，他遲疑了一回，終於就了坐，將長煙管靠在桌旁，遞過紙包來，說：
"冬天沒什麼東西了。這一點乾青豆倒是自家曬在那裡的，請老爺……"
我問問他的景況。他只是搖頭。
"非常難。第六個孩子也會幫忙了，卻總是吃不夠……又不太平……什麼地方都要錢，沒有規定……收成又壞。種出東西來，挑去賣，總要捐幾回錢，折了本；不去賣，又只能爛掉……"
他只是搖頭；臉上雖然刻著許多皺紋，卻全然不動，仿佛石像一般。他大約只是覺得苦，卻又形容不出，沉默了片時，便拿起煙管來默默的吸煙了。
母親問他，知道他的家裡事務忙，明天便得回去；又沒有吃過午飯，便叫他自己到廚下炒飯吃去。
他出去了；母親和我都嘆息他的景況：多子，饑荒，苛稅，兵，匪，官，紳，都苦得他像一個木偶人了。母親對我說，凡是不必搬走的東西，盡可以送他，可以聽他自己去揀擇。
下午，他揀好了幾件東西：兩條長桌，四個椅子，一副香爐和燭臺，一桿抬秤。他又要所有的草灰（我們這裡煮飯是燒稻草的，那灰，可以做沙地的肥料），待我們啟程的時候，他用船來載去。
夜間，我們又談些閑天，都是無關緊要的話；第二天早晨，他就領了水生回去了。
又過了九日，是我們啟程的日期。閏土早晨便到了，水生沒有同來，卻只帶著一個五歲的女兒管船隻。我們終日很忙碌，再沒有談天的工夫。來客也不少，有送行的，有拿東西的，有送行兼拿東西的。待到傍晚我們上船的時候，這老屋裡的所有破舊大小粗細東西，已經一掃而空了。
我們的船向前走，兩岸的青山在黃昏中，都裝成了深黛顏色，連著退向船後梢去。
宏兒和我靠著船窗，同看外面模糊的風景，他忽然問道：
"大伯！我們什麼時候回來？"
"回來？你怎麼還沒有走就想回來了。"
"可是，水生約我到他家玩去咧……"他睜著大的黑眼睛，癡癡的想。
我和母親也都有些惘然，於是又提起閏土來。母親說，那豆腐西施的楊二嫂，自從我家收拾行李以來，本是每日必到的，前天伊在灰堆裡，掏出十多個碗碟來，議論之後，便定說是閏土埋著的，他可以在運灰的時候，一齊搬回家裡去；楊二嫂發見了這件事，自己很以為功，便拿了那狗氣殺（這是我們這裡養雞的器具，木盤上面有著柵欄，內盛食料，雞可以伸進頸子去啄，狗卻不能，只能看著氣死），飛也似的跑了，虧伊裝著這麼高低的小腳，竟跑得這樣快。
老屋離我愈遠了；故鄉的山水也都漸漸遠離了我，但我卻並不感到怎樣的留戀。我只覺得我四面有看不見的高牆，將我隔成孤身，使我非常氣悶；那西瓜地上的銀項圈的小英雄的影像，我本來十分清楚，現在卻忽地模糊了，又使我非常的悲哀。
母親和宏兒都睡著了。
我躺著，聽船底潺潺的水聲，知道我在走我的路。我想：我竟與閏土隔絕到這地步了，但我們的後輩還是一氣，宏兒不是正在想念水生麽。我希望他們不再像我，又大家隔膜起來……然而我又不願意他們因為要一氣，都如我的辛苦展轉而生活，也不願意他們都如閏土的辛苦麻木而生活，也不願意都如別人的辛苦恣睢而生活。他們應該有新的生活，為我們所未經生活過的。
我想到希望，忽然害怕起來了。閏土要香爐和燭臺的時候，我還暗地裡笑他，以為他總是崇拜偶像，什麼時候都不忘卻。現在我所謂希望，不也是我自己手製的偶像麽？只是他的願望切近，我的願望茫遠罷了。
我在朦朧中，眼前展開一片海邊碧綠的沙地來，上面深藍的天空中掛著一輪金黃的圓月。我想：希望本是無所謂有，無所謂無的。這正如地上的路；其實地上本沒有路，走的人多了，也便成了路。
臨河的土場上，太陽漸漸的收了他通黃的光線了。場邊靠河的烏桕樹葉，乾巴巴的纔喘過氣來，幾個花腳蚊子在下面哼著飛舞。面河的農家的煙突裏，逐漸減少了炊煙，女人孩子們都在自己門口的土場上波些水，放下小桌子和矮凳；人知道，這已經是晚飯的時候了。
老人男人坐在矮凳上，搖著大芭蕉扇閑談，孩子飛也似的跑，或者蹲在烏桕樹下賭玩石子。女人端出烏黑的蒸乾菜和松花黃的米飯，熱蓬蓬冒煙。河裏駛過文人的酒船，文豪見了，大發詩興，說：「無思無慮，這真是田家樂呵！」
但文豪的話有些不合事實，就因為他們沒有聽到九斤老太的話。這時候，九斤老太正在大怒，拿破芭蕉扇敲著凳腳說：
「我活到七十九歲了，活夠了，不願意眼見這些敗家相，——還是死的好。立刻就要喫飯了，還喫炒豆子，喫窮了一家子！」
伊的曾孫女兒六斤捏著一把豆，正從對面跑來，見這情形，便直奔河邊，藏在烏桕樹後，伸出雙丫角的小頭，大聲說，「這老不死的！」
九斤老太雖然高壽，耳朵卻還不很聾，但也沒有聽到孩子的話，仍舊自己說，「這真是一代不如一代！」
這村莊的習慣有點特別，女人生下孩子，多喜歡用秤稱了輕重，便用斤數當作小名。九斤老太自從慶祝了五十大壽以後，便漸漸的變了不平家，常說伊年青的時候，天氣沒有現在這般熱，豆子也沒有現在這般硬；總之現在的時世是不對了。何況六斤比伊的曾祖，少了三斤，比伊父親七斤，又少了一斤，這真是一條顛撲不破的實例。所以伊又用勁說，「這真是一代不如一代！」
伊的兒媳七斤嫂子正捧著飯籃走到桌邊，便將飯籃在桌上一摔，憤憤的說，「你老人家又這麼說了。六斤生下來的時候，不是六斤五兩麽？你家的秤又是私秤，加重稱，十八兩秤；用了準十六，我們的六斤該有七斤多哩。我想便是太公和公公，也不見得正是九斤八斤十足，用的秤也許是十四兩……」
「一代不如一代！」
七斤嫂還沒有答話，忽然看見七斤從小巷口轉出，便移了方向，對他嚷道，「你這死屍怎麼這時候纔回來，死到那裏去了！不管人家等著你開飯！」
七斤雖然住在農村，卻早有些飛黃騰達的意思。從他的祖父到他，三代不捏鋤頭柄了；他也照例的幫人撐著航船，每日一回，早晨從魯鎮進城，傍晚又回到魯鎮，因此很知道些時事：例如什麼地方，雷公劈死了蜈蚣精；什麼地方，閨女生了一個夜叉之類。他在村人裏面，的確已經是一名出場人物了。但夏天喫飯不點燈，卻還守著農家習慣，所以回家太遲，是該罵的。
七斤一手捏著象牙嘴白銅斗六尺多長的湘妃竹煙管，低著頭，慢慢地走來，坐在矮凳上。六斤也趁勢溜出，坐在他身邊，叫他爹爹。七斤沒有應。
「一代不如一代！」九斤老太說。
七斤慢慢地抬起頭來，嘆一口氣說，「皇帝坐了龍庭了。」
七斤嫂呆了一刻，忽而恍然大悟的道，「這可好了，這不是又要皇恩大赦了麽！」
七斤又嘆一口氣，說，「我沒有辮子。」
「皇帝要辮子麽？」
「皇帝要辮子。」
「你怎麼知道呢？」七斤嫂有些著急，趕忙的問。
「咸亨酒店裏的人，都說要的。」
七斤嫂這時從直覺上覺得事情似乎有些不妙了，因為咸亨酒店是消息靈通的所在。伊一轉眼瞥見七斤的光頭，便忍不住動怒，怪他恨他怨他；忽然又絕望起來，裝好一碗飯，搡在七斤的面前道，「還是趕快喫你的飯罷！哭喪著臉，就會長出辮子來麽？」
太陽收盡了他最末的光線了，水面暗暗地回覆過涼氣來；土場上一片碗筷聲響，人人的脊樑上又都吐出汗粒。七斤嫂喫完三碗飯，偶然抬起頭，心坎裏便禁不住突突地發跳。伊透過烏桕葉，看見又矮又胖的趙七爺正從獨木橋上走來，而且穿著寶藍色竹布的長衫。
趙七爺是鄰村茂源酒店的主人，又是這三十裏方圓以內的唯一的出色人物兼學問家；因為有學問，所以又有些遺老的臭味。他有十多本金聖嘆批評的《三國志》，時常坐著一個字一個字的讀；他不但能說出五虎將姓名，甚而至於還知道黃忠表字漢昇和馬超表字孟起。革命以後，他便將辮子盤在頂上，像道士一般；常常嘆息說，倘若趙子龍在世，天下便不會亂到這地步了。七斤嫂眼睛好，早望見今天的趙七爺已經不是道士，卻變成光滑頭皮，烏黑髮頂；伊便知道這一定是皇帝坐了龍庭，而且一定須有辮子，而且七斤一定是非常危險。因為趙七爺的這件竹布長衫，輕易是不常穿的，三年以來，只穿過兩次：一次是和他嘔氣的麻子阿四病了的時候，一次是曾經砸爛他酒店的魯大爺死了的時候；現在是第三次了，這一定又是於他有慶，於他的仇家有殃了。
七斤嫂記得，兩年前七斤喝醉了酒，曾經罵過趙七爺是「賤胎」，所以這時便立刻直覺到七斤的危險，心坎裏突突地發起跳來。
趙七爺一路走來，坐著喫飯的人都站起身，拿筷子點著自己的飯碗說，「七爺，請在我們這裏用飯！」七爺也一路點頭，說道「請請」，卻一徑走到七斤家的桌旁。七斤們連忙招呼，七爺也微笑著說「請請」，一面細細的研究他們的飯菜。
「好香的菜乾，——聽到了風聲了麽？」趙七爺站在七斤的後面七斤嫂的對面說。
「皇帝坐了龍庭了。」七斤說。
七斤嫂看著七爺的臉，竭力陪笑道，「皇帝已經坐了龍庭，幾時皇恩大赦呢？」
「皇恩大赦？——大赦是慢慢的總要大赦罷。」七爺說到這裏，聲色忽然嚴厲起來，「但是你家七斤的辮子呢，辮子？這倒是要緊的事。你們知道：長毛時候，留髮不留頭，留頭不留髮，……」
七斤和他的女人沒有讀過書，不很懂得這古典的奧妙，但覺得有學問的七爺這麼說，事情自然非常重大，無可輓回，便仿佛受了死刑宣告似的，耳朵裏嗡的一聲，再也說不出一句話。
「一代不如一代，——」九斤老太正在不平，趁這機會，便對趙七爺說，「現在的長毛，只是剪人家的辮子，僧不僧，道不道的。從前的長毛，這樣的麽？我活到七十九歲了，活夠了。從前的長毛是——整匹的紅緞子裹頭，拖下去，拖下去，一直拖到腳跟；王爺是黃緞子，拖下去，黃緞子；紅緞子，黃緞子，—— 我活夠了，七十九歲了。」
七斤嫂站起身，自言自語的說，「這怎麼好呢？這樣的一班老小，都靠他養活的人，……」
趙七爺搖頭道，「那也沒法。沒有辮子，該當何罪，書上都一條一條明明白白寫著的。不管他家裏有些什麼人。」
七斤嫂聽到書上寫著，可真是完全絕望了；自己急得沒法，便忽然又恨到七斤。伊用筷子指著他的鼻尖說，「這死屍自作自受！造反的時候，我本來說，不要撐船了，不要上城了。他偏要死進城去，滾進城去，進城便被人剪去了辮子。從前是絹光烏黑的辮子，現在弄得僧不僧道不道的。這囚徒自作自受，帶累了我們又怎麼說呢？這活死屍的囚徒……」
村人看見趙七爺到村，都趕緊喫完飯，聚在七斤家飯桌的周圍。七斤自己知道是出場人物，被女人當大眾這樣辱罵，很不雅觀，便只得抬起頭，慢慢地說道：
「你今天說現成話，那時你……」
「你這活死屍的囚徒……」
看客中間，八一嫂是心腸最好的人，抱著伊的兩周歲的遺腹子，正在七斤嫂身邊看熱鬧；這時過意不去，連忙解勸說，「七斤嫂，算了罷。人不是神仙，誰知道未來事呢？便是七斤嫂，那時不也說，沒有辮子倒也沒有什麼醜麽？況且衙門裏的大老爺也還沒有告示，……」
七斤嫂沒有聽完，兩個耳朵早通紅了；便將筷子轉過向來，指著八一嫂的鼻子，說，「阿呀，這是什麼話呵！八一嫂，我自己看來倒還是一個人，會說出這樣昏誕胡塗話麽？那時我是，整整哭了三天，誰都看見；連六斤這小鬼也都哭，……」六斤剛喫完一大碗飯，拿了空碗，伸手去嚷著要添。七斤嫂正沒好氣，便用筷子在伊的雙丫角中間，直紮下去，大喝道，「誰要你來多嘴！你這偷漢的小寡婦！」
撲的一聲，六斤手裏的空碗落在地上了，恰巧又碰著一塊磚角，立刻破成一個很大的缺口。七斤直跳起來，撿起破碗，合上檢查一回，也喝道，「入娘的！」一巴掌打倒了六斤。六斤躺著哭，九斤老太拉了伊的手，連說著「一代不如一代」，一同走了。
八一嫂也發怒，大聲說，「七斤嫂，你『恨棒打人』……」
趙七爺本來是笑著旁觀的；但自從八一嫂說了「衙門裏的大老爺沒有告示」這話以後，卻有些生氣了。這時他已經繞出桌旁，接著說，「『恨棒打人』，算什麼呢。大兵是就要到的。你可知道，這回保駕的是張大帥，張大帥就是燕人張翼德的後代，他一支丈八蛇矛，就有萬夫不當之勇，誰能抵擋他？」他兩手同時捏起空拳，仿佛握著無形的蛇矛模樣，向八一嫂搶進幾步道，「你能抵擋他麽！」
八一嫂正氣得抱著孩子發抖，忽然見趙七爺滿臉油汗，瞪著眼，準對伊衝過來，便十分害怕，不敢說完話，回身走了。趙七爺也跟著走去，眾人一面怪八一嫂多事，一面讓開路，幾個剪過辮子重新留起的便趕快躲在人叢後面，怕他看見。趙七爺也不細心察訪，通過人叢，忽然轉入烏桕樹後，說道「你能抵擋他麽！」 跨上獨木橋，揚長去了。
村人們呆呆站著，心裏計算，都覺得自己確乎抵不住張翼德，因此也決定七斤便要沒有性命。七斤既然犯了皇法，想起他往常對人談論城中的新聞的時候，就不該含著長煙管顯出那般驕傲模樣，所以對七斤的犯法，也覺得有些暢快。他們也仿佛想發些議論，卻又覺得沒有什麼議論可發。嗡嗡的一陣亂嚷，蚊子都撞過赤膊身子，闖到烏桕樹下去做市；他們也就慢慢地走散回家，關上門去睡覺。七斤嫂咕噥著，也收了傢伙和桌子矮凳回家，關上門睡覺了。
七斤將破碗拿回家裏，坐在門檻上吸煙；但非常憂愁，忘卻了吸煙，象牙嘴六尺多長湘妃竹煙管的白銅鬥裏的火光，漸漸發黑了。他心裏但覺得事情似乎十分危急，也想想些方法，想些計畫，但總是非常模糊，貫穿不得：「辮子呢辮子？丈八蛇矛。一代不如一代！皇帝坐龍庭。破的碗須得上城去釘好。誰能抵擋他？書上一條一條寫著。入娘的！……」
第二日清晨，七斤依舊從魯鎮撐航船進城，傍晚回到魯鎮，又拿著六尺多長的湘妃竹煙管和一個飯碗回村。他在晚飯席上，對九斤老太說，這碗是在城內釘合的，因為缺口大，所以要十六個銅釘，三文一個，一總用了四十八文小錢。
九斤老太很不高興的說，「一代不如一代，我是活夠了。三文錢一個釘；從前的釘，這樣的麽？從前的釘是……我活了七十九歲了，——」
此後七斤雖然是照例日日進城，但家景總有些黯淡，村人大抵迴避著，不再來聽他從城內得來的新聞。七斤嫂也沒有好聲氣，還時常叫他「囚徒」。
過了十多日，七斤從城內回家，看見他的女人非常高興，問他說，「你在城裏可聽到些什麼？」
「沒有聽到些什麼。」
「皇帝坐了龍庭沒有呢？」
「他沒有說。」
「咸亨酒店裏也沒有人說麽？」
「也沒人說。」
「我想皇帝一定是不坐龍庭了。我今天走過趙七爺的店前，看見他又坐著念書了，辮子又盤在頂上了，也沒有穿長衫。」
「…………」
「你想，不坐龍庭了罷？」
「我想，不坐了罷。」
現在的七斤，是七斤嫂和村人又都早給他相當的尊敬，相當的待遇了。到夏天，他們仍舊在自家門口的土場上喫飯；大家見了，都笑嘻嘻的招呼。九斤老太早已做過八十大壽，仍然不平而且健康。六斤的雙丫角，已經變成一支大辮子了；伊雖然新近裹腳，卻還能幫同七斤嫂做事，捧著十八個銅釘的飯碗，在土場上一瘤一拐的往來。
星期日的早晨，我揭去一張隔夜的日曆，向著新的那一張上看了又看的說：
“啊，十月十日，——今天原來正是雙十節。這裏卻一點沒有記載！”
我的一位前輩先生N，正走到我的寓裏來談閑天，一聽這話，便很不高興的對我說：
“他們對！他們不記得，你怎樣他；你記得，又怎樣呢？”
這位N先生本來脾氣有點乖張，時常生些無謂的氣，說些不通世故的話。當這時候，我大抵任他自言自語，不贊一辭；他獨自發完議論，也就算了。
他說：
“我最佩服北京雙十節的情形。早晨，員警到門，吩咐道：『掛旗！』『是，掛旗！』”各家大半懶洋洋的踱出一個國民來，撅起一塊斑駁陸離的洋布。這樣一直到夜，——收了旗關門；幾家偶然忘卻的，便掛到第二天的上午。
“他們忘卻了紀念，紀念也忘卻了他們！”
“我也是忘卻了紀念的一個人。倘使紀念起來，那第一個雙十節前後的事，便都上我的心頭，使我坐立不穩了。”
“多少故人的臉，都浮在我眼前。幾個少年辛苦奔走了十多年，暗地裏一顆彈丸要了他的性命；幾個少年一擊不中，在監牢裏身受一個多月的苦刑；幾個少年懷著遠志，忽然蹤影全無，連屍首也不知那裏去了。——”
“他們都在社會的冷笑惡罵迫害傾陷裏過了一生；現在他們的墳墓也早在忘卻裏漸漸平塌下去了。”
“我不堪紀念這些事。”
“我們還是記起一點得意的事來談談吧。”
N忽然現出笑容，伸手在自己頭上一摸，高聲說：
“我最得意的是自從第一個雙十節以後，我在路上走，不再被人笑駡了。”
“老兄，你可知道頭髮是我們中國人的寶貝和冤家，古今來多少人在這上頭吃些毫無價值的苦呵！”
“我們的很古的古人，對於頭髮似乎也還看輕。據刑法看來，最要緊的自然是腦袋，所以大辟是上刑；次要便是生殖器了，所以宮刑和幽閉也是一件嚇人的罰；至於髡，那是微乎其微了，然而推想起來，正不知道曾有多少人們因為光著頭皮便被社會踐踏了一生世。”
“我們講革命的時候，大談什麼揚州三日，嘉定屠城，其實也不過一種手段；老實說：那時中國人的反抗，何嘗因為亡國，只是因為拖辮子。”
“頑殺盡了，遺老都壽終了，辮子早留定了，洪楊又鬧起來了。我的祖母曾對我說，那時做百姓才難哩，全留著頭髮的被官兵殺，還是辮子的便被長毛殺！”
“我不知道有多少中國人只因為這不痛不癢的頭髮而吃苦，受難，滅亡。”
N兩眼望著屋樑，似乎想些事，仍然說：
“誰知道頭髮的苦輪到我了。”
“我出去留學，便剪掉了辮子，這並沒有別的奧妙，只為他不太便當罷了。不料有幾位辮子盤在頭頂上的同學們便很厭惡我；監督也大怒，說要停了我的官費，送回中國去。”
“不幾天，這位監督卻自己被人剪去辮子逃走了。去剪的人們裏面，一個便是做《革命軍》的鄒容，這人也因此不能再留學，回到上海來，後來死在西牢裏。你也早忘卻了罷？”
“過了幾年，我的家景大不如前了，非謀點事做便要受餓，只得也回到中國來。我一到上海，便買定一條假辮子，那時是二元的市價，帶著回家。我的母親倒也不說什麼，然而旁人一見面，便都首先研究這辮子，待到知道是假，就一聲冷笑，將我擬為殺頭的罪名；有一位本家，還預備去告官，但後來因為恐怕革命黨的造反或者要成功，這才中止了。”
“我想，假的不如真的直截爽快，我便索性廢了假辮子，穿著西裝在街上走。”
“一路走去，一路便是笑駡的聲音，有的還跟在後面罵：『這冒失鬼！』『假洋鬼子！』”
“我於是不穿洋服了，改了大衫，他們罵得更厲害。”
“在這日暮途窮的時候，我的手裏才添出一支手杖來，拚命的打了幾回，他們漸漸的不罵了。只是走到沒有打過的生地方還是罵。”
“這件事很使我悲哀，至今還時時記得哩。我在留學的時候，曾經看見日報上登載一個遊歷南洋和中國的本多博士的事；這位博士是不懂中國和馬來語的，人問他，你不懂話，怎麼走路呢？他拿起手杖來說，這便是他們的話，他們都懂！我因此氣憤了好幾天，誰知道我竟不知不覺的自己也做了，而且那些人都懂了。……”
“宣統初年，我在本地的中學校做監學，同事是避之惟恐不遠，官僚是防之惟恐不嚴，我終日如坐在冰窖子裏，如站在刑場旁邊，其實並非別的，只因為缺少了一條辮子！”
“有一日，幾個學生忽然走到我的房裏來，說：『先生，我們要剪辮子了。』我說：『不行！』『有辮子好呢，沒有辮子好呢？』『沒有辮子好……』『你怎麼說不行呢？』『犯不上，你們還是不剪上算，——等一等罷。』”他們不說什麼，撅著嘴唇走出房去，然而終於剪掉了。
“呵！不