и
«другими, которые складывались на память. Весь верхний ящик со всеми
«перегородками вынимался, и под ним находилось пространство, занятое
«кипами бумаг в лист, потом следовал маленький потаенный ящик для
«денег, выдвигавшийся незаметно сбоку шкатулки. Он всегда так поспешно
«выдвигался и задвигался в ту же минуту хозяином, что наверно нельзя
«сказать, сколько было там денег. Чичиков тут же занялся и, очинив
«перо, начал писать. В это время вошла хозяйка.

— Хорош у тебя ящик, отец мой, — сказала она, подсевши к нему. — Чай,
— в Москве купил его?

— В Москве, — отвечал Чичиков, продолжая писать.

— Я уж знала это: там все хорошая работа. Третьего года сестра моя
— привезла оттуда теплые сапожки для детей: такой прочный товар, до
— сих пор носится. Ахти, сколько у тебя тут гербовой бумаги! —
— продолжала она заглянувши к нему в шкатулку. И в самом деле,
— гербовой бумаги было там немало. — Хоть бы мне листок подарил! а у
— меня такой недостаток; случится в суд просьбу подать, а и не на чем.

Чичиков объяснил ей, что эта бумага не такого рода, что она назначена
д�