�ши тут же с
небольшим половину, похвалил его. И в самом деле, пирог сам по себе
был вкусен, а после всей возни и проделок со старухой показался еще
вкуснее.

— А блинков? — сказала хозяйка.

В ответ на это Чичиков свернул три блина вместе и, обмакнувши их в
растопленное масло, отправил в рот, а губы и руки вытер салфеткой.
Повторивши это раза три, он попросил хозяйку приказать заложить его
бричку. Настасья Петровна тут же послала Фетинью, приказавши в то же
время принести еще горячих блинов.

— У вас, матушка, блинцы очень вкусны, — сказал Чичиков, принимаясь за
— принесенные горячие.

— Да у меня-то их хорошо пекут, — сказала хозяйка, — да вот беда:
— урожай плох, мука уж такая неважная… Да что же, батюшка, вы так
— спешите? — проговорила она, увидя, что Чичиков взял в руки картуз, —
— ведь и бричка еще не заложена.

— Заложат, матушка, заложат. У меня скоро закладывают.

— Так уж, пожалуйста, не позабудьте насчет подрядов.

— Не забуду, не забуду, — говорил Чичиков, выходя в сени.

— А свиного сала не покупаете? — сказала хозяйка, следуя за ним.

— Почему не покупать? Покупаю, только после.

— У меня о святках и свиное сало будет.

— Купим, купим, всего купим, и свиного сала купим.

— Может быть, понадобится птичьих перьев. У меня к Филиппову посту
— будут и птичьи перья.

— Хорошо, хорошо, — говорил Чичиков.

— Вот видишь, отец мой, и бричка твоя еще не готова, — сказала
— хозяйка, когда они вышли на крыльцо.

— Будет, будет готова. Расскажите только мне, как добраться до большой
— дороги.

— Как же бы это сделать? — сказала хозяйка. — Рассказать-то мудрено,
— поворотов много; разве я тебе дам девчонку, чтобы проводила. Ведь у
— тебя, чай, место есть на козлах, где бы присесть ей.

— Как не быть.

— Пожалуй, я тебе дам девчонку; она у меня знает дорогу, только ты
— смотри! не завези ее, у меня уже одну завезли купцы.

Чичиков уверил ее, что не завезет, и Коробочка, успокоившись, уже
стала рассматривать все, что было во дворе ее; вперила глаза на
ключницу, выносившую из кладовой деревянную побратиму с медом, на
мужика, показавшегося в воротах, и мало-помалу вся переселилась в
хозяйственную жизнь. Но зачем так долго заниматься Коробочкой?
Коробочка ли, Манилова ли, хозяйственная ли жизнь, или нехозяйственная
— мимо их! Не то на свете дивно устроено: веселое мигом обратится в
печальное, если только долго застоишься перед ним, и тогда бог знает
что взбредет в голову. Может быть, станешь даже думать: да полно,
точно ли Коробочка стоит так низко на бесконечной лестнице
человеческого совершенствования? Точно ли так велика пропасть,
отделяющая ее от сестры ее, недосягаемо огражденной стенами
аристократического дома с благовонными чугунными лестницами, сияющей
медью, красным деревом и коврами, зевающей за недочитанной книгой в
ожидании остроумно-светского визита, где ей предстанет поле бле