как вычищены. Хомут
на одной из них, надевавшийся дотоле почти всегда в разодранном виде,
так что из-под кожи выглядывала пакля, был искусно зашит. Во всю
дорогу был он молчалив, только похлестывал кнутом, и не обращал
никакой поучительной речи к лошадям, хотя чубарому коню, конечно,
хотелось бы выслушать что-нибудь наставительное, ибо в это время вожжи
всегда как-то лениво держались в руках словоохотного возницы и кнут
только для формы гулял поверх спин. Но из угрюмых уст слышны были на
сей раз одни однообразно неприятные восклицания: «Ну же, ну, ворона!
зевай! зевай!» — и больше ничего. Даже сам гнедой и Заседатель были
недовольны, не услышавши ни разу ни «любезные», ни «почтенные».
Чубарый чувствовал пренеприятные удары по своим полным и широким
частям. «Вишь ты, как разнесло его! — думал он сам про себя, несколько
припрядывая ушами. — Небось знает, где бить! Не хлыснет прямо по
спине, а так и выбирает место, где поживее: по ушам зацепит или под
брюхо захлыснет».

— Направо, что ли? — с таким сухим вопросом обратился Селифан к
— сидевшей возле него девчонке, показывая ей кнутом на почерневшую от
— дождя дорогу между яркозелеными, освещенными полями.

— Нет, нет, я уж покажу, — отвечала девчонка.

— Куда ж? — сказал Селифан, когда подъехали поближе.

— Вот куды, — отвечала девчонка, показывая рукою.

— Эх ты! — сказал Селифан. — Да это и есть направо: не знает, где
— право, где лево!

Хотя день был очень хорош, но земля до такой степени загрязнилась, что
колеса брички, захватывая ее, сделались скоро покрытыми ею, как
войлоком, что значительно отяжелило экипаж; к тому же почва была
глиниста и цепка необыкновенно. То и другое было причиною, что они не
могли выбраться из проселков раньше полудня. Без девчонки было бы
трудно сделать и это, потому что дороги расползались во все стороны,
как пойманные раки, когда их высыпают из мешка, и Селифану довелось бы
поколесить уже не по своей вине. Скоро девчонка показала рукою на
черневшее вдали строение, сказавши:

— Вон столбовая дорога!

— А строение? — спросил Селифан.

— Трактир, — сказала девчонка.

— Ну, теперь мы сами доедем, — сказал Селифан, — ступай себе домой.

Он остановился и помог ей сойти, проговорив сквозь зубы: «Эх ты,
черноногая!»

Чичиков дал ей медный грош, и она побрела восвояси, уже довольная тем,
что посидела на козлах.






Глава четвертая


Подъехавши к трактиру, Чичиков велел остановиться по двум причинам. С
одной стороны, чтоб дать отдохнуть лошадям, а с другой стороны, чтоб и
самому несколько закусить и подкрепиться. Автор должен признаться, что
весьма завидует аппетиту и желудку такого рода людей. Для него
решительно ничего не значат все господа большой руки, живущие в
Петербурге и Москве, проводящие время в обдумывании, что бы такое
поесть завтра и какой бы обед сочинить на послезавтра, и принимающиеся
за этот обед не иначе, как отправивши прежде в рот пилюлю; глотающие
устерс, морских пауков и прочих чуд, а потом отправляющиеся в Карлсбад
или на Кавказ. Нет, эти господа никогда не возбуждали в нем зависти.
Но господа средней руки, что на одной станции потребуют ветчины, на
другой поросенка, на третьей ломоть осетра или какую-нибудь запеканную
колбасу с луком и потом как ни в чем не бывало садятся за стол в какое
хочешь время, и стерляжья уха с налимами и молоками шипит и ворчит у
них меж зубами, заедаемая расстегаем или кулебякой с сомовьим плёсом,
так что вчуже пронимает аппетит, — вот эти господа, точно, пользуются
завидным даянием неба! Не один господин большой руки пожертвовал бы
сию же минуту половину душ крестьян и половину имений, заложенных и
только, чтобы иметь такой желудок, какой имеет господин средней руки;
но то беда, что ни за какие деньги, ниже' имения, с улучшениями и без
улучшений, нельзя приобресть такого желудка, какой бывает у господина
средней руки.

Деревянный потемневший трактир принял Чичикова под свой узенький
гостеприимный навес на деревянных выточенных столбиках, похожих на
старинные церковные подсвечники. Трактир был что-то вроде русской
избы, несколько в большем размере. Резные узорочные карнизы из свежего
дерева вокруг окон и под крышей резко и живо пестрели темные его
стены; на ставнях были нарисованы кувшины с цветами.

Взобравшись узенькою деревянною лестницею наверх, в широкие сени, он
встретил отворявшуюся со скрипом дверь и толстую старуху в пестрых
ситцах, проговорившую: «Сюда пожалуйте!» В комнате попались всё старые
приятели, попадающиеся всякому в небольших деревянных трактирах, каких
немало выстроено по дорогам, а именно заиндевелый самовар,
выскобленные гладко сосновые стены, трехугольный шкаф с чайниками и
чашками в углу, фарфоровые вызолоченные яички пред образами, висевшие
на голубых и красных ленточках, окотившаяся недавно кошка, зеркало,
показывавшее вместо двух четыре глаза, а вместо лица какую-то лепешку;
наконец натыканные пучками душистые травы и гвоздики у образов,
высохшие до такой степени, что желавший понюхать их только чихал и
больше ничего.

— Поросенок есть? — с таким вопросом обратился Чичиков к стоявшей
— бабе.

— Есть.

— С хреном и со сметаною?

— С хреном и со сметаною.

— Давай его сюда!

Старуха пошла копаться и принесла тарелку, салфетку, накрахмаленную до
того что дыбилась, как засохшая кора, потом нож с пожелтевшею костяною
колодочкою, тоненький, как перочинный, двузубую вилку и солонку,
которую никак нельзя было поставить прямо на стол.

Герой наш, по обыкновению, сейчас вступил с нею в разговор и
расспросил, сама ли она держит трактир, или есть хозяин, а сколько
дает доходу трактир, и с ними ли живут сыновья, и что старший сын
холостой или женатый человек, и какую взял жену, с большим ли
приданым, или нет, и доволен ли был тесть, и не сердился ли, что мало
подарков получил на свадьбе, — словом, не пропустил ничего. Само собою
разумеется, что полюбопытствовал узнать, какие в окружности находятся
у них помещики, и узнал, что всякие есть помещики: Плотин, Почитаев,
Мыльной, Чепраков-полковник, Собакевич. «А! Собакевича знаешь?» —
спросил он и тут же услышал, что старуха знает не только Собакевича,
но и Манилова, и что Манилов будет поделикатней Собакевича: велит
тотчас сварить курицу, спросит и телятинки; коли есть баранья печенка,
то и бараньей печенки спросит, и всего только что попробует, а
Собакевич одного чего-нибудь спросит, да уж зато всё съест, даже и
подбавки потребует за ту же цену.

Когда он таким образом разговаривал, кушая поросенка, которого
оставался уже последний кусок, послышался стук колес подьехавшего
экипажа. Взглянувши в окно, увидел он остановившуюся перед трактиром
легонькую бричку, запряженную тройкою добрых лошадей. Из брички
вылезали двое какие-то мужчин. Один белокурый, высокого роста; другой
немного пониже, чернявый. Белокурый был в темно-синей венгерке,
чернявый просто в полосатом архалуке. Издали тащилась еще колясчонка,
пустая, влекомая какой-то длинношерстной четверней с изорванными
хомутами и веревочной упряжью. Белокурый тотчас же отправился по
лестнице наверх, между тем как черномазый еще оставался и щупал что-то
в бричке, разговаривая тут же со слугою и махая в то же время ехавшей
за ними коляске. Голос его показался Чичикову как будто несколько
знакомым. Пока он его рассматривал, белокурый успел уже нащупать дверь
и отворить ее. Это был мужчина высокого роста, лицом худощавый, или
что называют издержанный, с рыжими усиками. По загоревшему лицу его
можно было заключить, что он знал, что такое дым, если не пороховой,
то по крайней мере табачный. Он вежливо поклонился Чичикову, на что
последний ответил тем же. В продолжение немногих минут они вероятно бы
разговорились и хорошо познакомились между собою, потому что уже
начало было сделано, и оба почти в одно и то же время изъявили
удовольствие, что пыль по дороге была совершенно прибита вчерашним
дождем и теперь ехать и прохладно и приятно, как вошел чернявый его
товарищ, сбросив с головы на стол картуз свой, молодцевато взъерошив
рукой свои черные густые волосы. Это был среднего роста, очень недурно
сложенный молодец с полными румяными щеками, с белыми, как снег,
зубами и черными, как смоль, бакенбардами. Свеж он был, как кровь с
молоком; здоровье, казалось, так и прыскало с лица его.

— Ба, ба, ба! — вскричал он вдруг, расставив обе руки при виде
— Чичикова. — Какими судьбами?

Чичиков узнал Ноздрева, того самого, с которым он вместе обедал у
прокурора и который с ним в несколько минут сошелся на такую короткую
ногу, что начал уже говорить «ты», хотя, впрочем, он с своей стороны
не подал к тому никакого повода.

— Куда ездил? — говорил Ноздрев и, не дождавшись ответа, продолжал: —
— А я, брат, с ярмарки. Поздравь: продулся в пух! Веришь ли, что
— никогда в жизни так не продувался. Ведь я на обывательских приехал!
— Вот посмотри нарочно в окно! — Здесь он нагнул сам голову Чичикова,
— так что тот чуть не ударился ею об рамку. — Видишь, какая дрянь!
— Насилу дотащили, проклятые, я уже перелез вот в его бричку. — Говоря
— это, Ноздрев показал пальцем на своего товарища. — А вы еще не
— знакомы? Зять мой Мижуев! Мы с ним все утро говорили о тебе. «Ну,
— смотри, говорю, если мы не встретим Чичикова» Ну, брат, если б ты
— знал, как я продулся! Поверишь ли, что не только убухал четырех
— рысаков — всё спустил. Ведь на мне нет ни цепочки, ни часов… —
— Чичиков взглянул и увидел точно, что на нем не было ни цепочки, ни
— часов. Ему даже показалось, что и один бакенбард был у него меньше и
— не так густ, как другой. — А ведь будь только двадцать рублей в
— кармане, — продолжал Ноздрев, — именно не больше как двадцать, я
— отыграл бы все, то есть кроме того, что отыграл бы, вот как честный
— человек, тридцать тысяч сейчас положил бы в бумажник.

— Ты, однако, и тогда так говорил, — отвечал белокурый, — а когда я
— тебе дал пятьдесят рублей, тут же просадил их.

— И не просадил бы! ей-богу, не просадил бы! Не сделай я сам глупость,
— право, не просадил бы. Не загни я после пароле на проклятой семерке
— утку, я бы мог сорвать весь банк.

— Однако ж не сорвал, — сказал белокурый.

— Не сорвал потому, что загнул утку не вовремя. А ты думаешь, майор
— твой хорошо играет?

— Хорошо или не хорошо, однако ж он тебя обыграл.

— Эка важность! — сказал Ноздрев, — этак и я его обыграю. Нет, вот
— попробуй он играть дублетом, так вот тогда я посмотрю, я посмотрю
— тогда, какой он игрок! Зато, брат Чичиков, как покатили мы в первые
— дни! Правда, ярмарка была отличнейшая. Сами купцы говорят, что
— никогда не было такого съезда. У меня все, что ни привезли из
— деревни, продали по самой выгоднейшей цене. Эх, братец, как
— покутили! Теперь даже, как вспомнишь… черт возьми! то есть как жаль,
— что ты не был. Вообрази, что в трех верстах от города стоял
— драгунский полк. Веришь ли, что офицеры, сколько их ни было, сорок
— человек одних офицеров было в городе; как начали мы, братец, пить…
— Штабс-ротмистр Поцелуев… такой славный! усы, братец, такие! Бордо
— называет просто бурдашкой. «Принеси-ка, брат, говорит, бурдашки!»
— Поручик Кувшинников… Ах, братец, какой премилый человек! вот уж,
— можно сказать, во всей форме кутила. Мы все были с ним вместе.
— Какого вина отпустил нам Пономарев! Нужно тебе знать, что он
— мошенник и в его лавке ничего нельзя брать: в вино мешает всякую
— дрянь: сандал, жженую пробку и даже бузиной, подлец, затирает; но
— зато уж если вытащит из дальней комнатки, которая называется у него
— особенной, какую-нибудь бутылочку — ну просто, брат, находишься в
— эмпиреях. Шампанское у нас было такое — что пред ним губернаторское?
— просто квас. Вообрази, не клико, а какое-то клико-матрадура, это
— значит двойное клико. И еще достал одну бутылочку французского под
— названием: бонбон. Запах? — розетка и все что хочешь. Уж так
— покутили!.. После нас приехал какой-то князь, послал в лавку за
— шампанским, нет ни одной бутылки во всем городе, все офицеры выпили.
— Веришь ли, что я один в продолжение обеда выпил семнадцать бутылок
— шампанского!

— Ну, семнадцать бутылок ты не выпьешь, — заметил белокурый.

— Как честный человек говорю, что выпил, — отвечал Ноздрев.

— Ты можешь себе говорить все что хочешь, а я тебе говорю, что и
— десяти не выпьешь.

— Ну хочешь об заклад, что выпью!

— К чему же об заклад?

— Ну, поставь ружье, которое купил в городе.

— Не хочу.

— Ну да поставь, попробуй.

— И пробовать не хочу

— Да, был бы ты без ружья, как без шапки. Эх, брат Чичиков, то есть
— как я жалел, что тебя не было Я знаю, что ты бы не расстался с
— поручиком Кувшинниковым. Уж как бы вы с ним хорошо сошлись! Это не
— то что прокурор и все губернские скряги в нашем городе, которые так
— и трясутся за каждую копейку. Этот, братец, и в гальбик, и в
— банчишку, и во все что хочешь. Эх, Чичиков, ну что бы тебе стоило
— приехать? Право, свинтус ты за это, скотовод эдакой! Поцелуй меня,
— душа, смерть люблю тебя! Мижуев, смотри, вот судьба свела: ну что он
— мне или я ему? Он приехал бог знает откуда, я тоже здесь живу… А
— сколько было, брат, карет, и все это en gros[[1 - В большом
— количестве (франц.)]]. В фортунку крутнул: выиграл две банки помады,
— фарфоровую чашку и гитару; потом опять поставил один раз и
— прокрутил, канальство, еще сверх шесть целковых. А какой, если б ты
— знал, волокита Кувшинников! Мы с ним были на всех почти балах. Одна
— была такая разодетая, рюши на ней, и трюши, и черт знает чего не
— было… я думаю себе только: «черт возьми!» А Кувшинников, то есть это
— такая бестия, подсел к ней и на французском языке подпускает ей
— такие комплименты… Поверишь ли, простых баб не пропустил. Это он
— называет: попользоваться насчет клубнички. Рыб и балыков навезли
— чудных. Я таки привез с собою один; хорошо, что догадался купить,
— когда были еще деньги. Ты куда теперь едешь?

— А я к человечку к одному, — сказал Чичиков.

— Ну, что человечек, брось его! поедем во мне!

— Нет, нельзя, есть дело.

— Ну вот уж и дело! уж и выдумал! Ах ты, Оподелок Иванович!

— Право, дело, да еще и нужное.

— Пари держу, врешь! Ну скажи только, к кому едешь?

— Ну, к Собакевичу.

Здесь Ноздрей захохотал тем звонким смехом, каким заливается только
свежий, здоровый человек, у которого все до последнего выказываются
белые, как сахар, зубы, дрожат и прыгают щеки, а сосед за двумя
дверями, в третьей комнате, вскидывается со сна, вытаращив очи и
произнося: «Эк его разобрало!»

— Что ж тут смешного? — сказал Чичиков, отчасти недовольный таким
— смехом.

Но Ноздрев продолжал хохотать во все горло, приговаривая:

— Ой, пощади, право, тресну со смеху!

— Ничего нет смешного: я дал ему слово, — сказал Чичиков.

— Да ведь ты жизни не будешь рад, когда приедешь к нему, это просто
— жидомор! Ведь я знаю твой характер, ты жестоко опешишься, если
— думаешь найти там банчишку и добрую бутылку какого-нибудь бонбона.
— Послушай, братец: ну к черту Собакевича, поедем во мне! каким
— балыком попотчую! Пономарев, бестия, так раскланивался, говорит:
— «Для вас только, всю ярмарку, говорит, обыщите, не найдете такого».
— Плут, однако ж, ужасный. Я ему в глаза это говорил: «Вы, говорю, с
— нашим откупщиком первые мошенники!» Смеется, бестия, поглаживая
— бороду. Мы с Кувшинниковым каждый день завтракали в его лавке. Ах,
— брат, вот позабыл тебе сказать: знаю, что ты теперь не отстанешь, но
— за десять тысяч не отдам, наперед говорю. Эй, Порфирий! — закричал
— он, подошедши к окну, на своего человека, который держал в одной
— руке ножик, а в другой корку хлеба с куском балыка, который
— посчастливилось ему мимоходом отрезать, вынимая что-то из брички. —
— Эй, Порфирий, — кричал Ноздрев, — принеси-ка щенка! Каков щенок! —
— продолжал он, обращаясь к Чичикову. — Краденый, ни за самого себя не
— отдавал хозяин. Я ему сулил каурую кобылу, которую, помнишь, выменял
— у Хвостырева… — Чичиков, впрочем, отроду не видел ни каурой кобылы,
— ни Хвостырева.

— Барин! ничего не хотите закусить? — сказала в это время, подходя к
— нему, старуха.

— Ничего. Эх, брат, как покутили! Впрочем, давай рюмку водки; какая у
— тебя есть?

— Анисовая, — отвечала старуха.

— Ну, давай анисовой, — сказал Ноздрей.

— Давай уж и мне рюмку! — сказал белокурый.

— В театре одна актриса так, каналья, пела, как канарейка!
— Кувшинников, который сидел возле меня, «Вот, говорит, брат,
— попользоваться бы насчет клубнички!» Одних балаганов, я думаю, было
— пятьдесят. Фенарди четыре часа вертелся мельницею. — Здесь он принял
— рюмку из рук старухи, которая ему за то низко поклонилась. — А,
— давай его сюда! — закричал он увидевши Порфирия, вошедшего с щенком.
— Порфирий был одет, так же как и барин, в каком-то архалуке,
— стеганном на вате, но несколько позамасленней.

— Давай его, клади сюда на пол!

Порфирий положил щенка на пол, который, растянувшись на все четыре
лапы, нюхал землю.

— Вот щенок! — сказал Ноздрев, взявши его за приподнявши рукою. Щенок
— испустил довольно жалобный вой.

— Ты, однако ж, не сделал того, что я тебе говорил, — сказал Ноздрев,
— обратившись к Порфирию и рассматривая брюхо щенка, — и не подумал
— вычесать его?

— Нет, я его вычесывал.

— А отчего же блохи?

— Не могу знать. Статься может, как-нибудь из брички поналезли.

— Врешь, врешь, и не воображал чесать; я думаю, дурак, еще своих
— напустил. Вот посмотри-ка, Чичиков, посмотри, какие уши, на-ка
— пощупай рукою.

— Да зачем, я и так вижу: доброй породы! — отвечал Чичиков.

— Нет, возьми-ка нарочно, пощупай уши!

Чичиков в угодность ему пощупал уши, примолвивши:

— Да, хорошая будет собака.

— А нос, чувствуешь, какой холодный? возьми-на рукою.

Не желая обидеть его, Чичиков взял и за нос, сказавши:

— Хорошее чутье.

— Настоящий мордаш, — продолжал Ноздрев, — а, признаюсь, давно острил
— зубы на мордаша. На, Порфирий, отнеси его!

Порфирий, взявши щенка под брюхо, унес его в бричку.

— Послушай, Чичиков, ты должен непременно теперь е�