 Вот это хорошо, постой же, я тебя поцелую за
— это. — Здесь Ноздрев и Чичиков поцеловались. — И славно: втроем и
— покатим!

— Нет, ты уж, пожалуйста, меня-то отпусти, — говорил белокурый, — мне
— нужно домой.

— Пустяки, пустяки, брат, не пущу.

— Право, жена будет сердиться; теперь же ты можешь, пересесть вот в
— ихнюю бричку.

— Ни, ни, ни! И не думай.

Белокурый был один из тех людей, в характере которых на первый взгляд
есть какое-то упорство. Еще не успеешь открыть рта, как они уже готовы
спорить и, кажется, никогда не согласятся на то, что явно
противуположно их образу мыслей, что никогда не назовут глупого умным
и что в особенности не согласятся плясать по чужой дудке; а кончится
всегда тем, что в характере их окажется мягкость, что они согласятся
именно на то, что отвергали, глупое назовут умным и пойдут потом
поплясывать как нельзя лучше под чужую дудку, — словом, начнут гладью,
а кончат гадью.

— Вздор! — сказал Ноздрев в ответ на каков-то ставление белокурого,
— надел ему на голову картуз, и — белокурый отправился вслед за ними.

— За водочку, барин, не заплатили… — сказала старуха

— А, хорошо, хорошо, матушка. Послушай, зятек! заплати, пожалуйста. У
— меня нет ни копейки в кармане.

— Сколько тебе? — сказал зятек.

— Да что, батюшка, двугривенник всего, — сказала старуха.

— Врешь, врешь. Дай ей полтину, предовольно с нее.

— Маловато, барин, — сказала старуха, однако ж взяла деньги с
— благодарностию и еще побежала впопыхах отворять им дверь. Она была
— не в убытке, потому что запросила вчетверо против того, что стоила
— водка.

Приезжие уселись. Бричка Чичикова ехала рядом с бричкой, в которой
сидели Ноздрев и его зять, и потому они все трое могли свободно между
собою разговаривать в продолжение дороги. За ними следовала,
беспрестанно отставая, небольшая колясчонка Ноздрева на тощих
обывательских лошадях. В ней сидел Порфирий с щенком.

Так как разговор, который путешественники вели между собою, был не
очень интересен для читателя, то сделаем лучше, если скажем что-нибудь
о самом Ноздреве, которому, может быть, доведется сыграть не вовсе
последнюю роль в нашей поэме.

Лицо Ноздрева, верно, уже сколько-нибудь знакомо читателю. Таких людей
приходилось всякому встречать немало. Они называются разбитными
малыми, слывут еще в детстве и в школе за хороших товарищей и при всем
том бывают весьма больно поколачиваемы. В их лицах всегда видно что-то
открытое, прямое, удалое. Они скоро знакомятся, и не успеешь
оглянуться, как уже говорят тебе «ты». Дружбу заведут, кажется, навек:
но всегда почти так случается, что подружившийся подерется с ними того
же вечера на дружеской пирушке. Они всегда говоруны, кутилы, лихачи,
народ видный. Ноздрев в тридцать пять лет был таков же совершенно,
каким был в осьмнадцать и двадцать: охотник погулять. Женитьба его
ничуть не переменила, тем более что жена скоро отправилась на тот
свет, оставивши двух ребятишек, которые решительно ему были не нужны.
За детьми, однако ж, присматривала смазливая нянька. Дома он больше
дня никак не мог усидеть. Чуткий нос его слышал за несколько десятков
верст, где была ярмарка со всякими съездами и балами; он уж в одно
мгновенье ока был там, спорил и заводил сумятицу за зеленым столом,
ибо имел, подобно всем таковым, страстишку к картишкам. В картишки,
как мы уже видели из первой главы, играл он не совсем безгрешно и
чисто, зная много разных передержек и других тонкостей, и потому игра
весьма часто оканчивалась другою игрою: или поколачивали его сапогами,
или же задавали передержку его густым и очень хорошим бакенбардам, так
что возвращался домой он иногда с одной только бакенбардой, и то
довольно жидкой. Но здоровые и полные щеки его так хорошо были
сотворены и вмещали в себе столько растительной силы, что бакенбарды
скоро вырастали вновь, еще даже лучше прежних. И что всего страннее,
что может только на одной Руси случиться, он чрез несколько времени
уже встречался опять с теми приятелями, которые его тузили, и
встречался как ни в чем не бывало, и он, как говорится, ничего, и они
ничего.

Ноздрев был в некотором отношении исторический человек. Ни на одном
собрании, где он был, не обходилось без истории. Какая-нибудь история
непременно происходила: или выведут его под руки из зала жандармы, или
принуждены бывают вытолкать свои же приятели. Если же этого не
случится, то все-таки что-нибудь да будет такое, чего с другим никак
не будет: или нарежется в буфете таким образом, что только смеется,
или проврется самым жестоким образом, так что наконец самому сделается
совестно. И наврет совершенно без всякой нужды: вдруг расскажет, что у
него была лошадь какой-нибудь голубой или розовой шерсти, и тому
подобную чепуху, так что слушающие наконец все отходят, произнесши:
«Ну, брат, ты, кажется, уже начал пули лить». Есть люди, имеющие
страстишку нагадить ближнему, иногда вовсе без всякой причины. Иной,
например, даже человек в чинах, с благородною наружностию, со звездой
на груди, будет вам жать руку, разговорится с вами о предметах
глубоких, вызывающих на размышления, а потом, смотришь, тут же, пред
вашими глазами, и нагадит вам. И нагадит так, как простой коллежский
регистратор, а вовсе не так, как человек во звездой на груди,
разговаривающий о предметах, вызывающих на размышление, так что стоишь
только да дивишься, пожимая плечами, да и ничего более. Такую же
странную страсть имел и Ноздрев. Чем кто ближе с ним сходился, тому он
скорее всех насаливал: распускал небылицу, глупее которой трудно
выдумать, расстроивал свадьбу, торговую сделку и вовсе не почитал себя
вашим неприятелем; напротив, если случай приводил его опять
встретиться с вами, он обходился вновь по-дружески и даже говорил:
«Ведь ты такой подлец, никогда ко мне не заедешь». Ноздрев во многих
отношениях был многосторонний человек, то есть человек на все руки. В
ту же минуту он предлагал вам ехать куда угодно, хоть на край света,
войти в какое хотите предприятие, менять все что ни есть на все, что
хотите. Ружье, собака, лошадь — все было предметом мены, но вовсе не с
тем, чтобы выиграть: это происходило просто от какой-то неугомонной
юркости и бойкости характера. Если ему на ярмарке посчастливилось
напасть на простака и обыграть его, он накупал кучу всего, что прежде
попадалось ему на глаза в лавках: хомутов, курительных свечек, платков
для няньки, жеребца, изюму, серебряный рукомойник, голландского
холста, крупичатой муки, табаку, пистолетов, селедок, картин,
точильный инструмент, горшков, сапогов, фаянсовую посуду — насколько
хватало денег. Впрочем, редко случалось, чтобы это было довезен