омниться. «Я тебе, Чичиков, — сказал Ноздрев, — покажу отличнейшую
пару собак: крепость черных мясом просто наводит изумление, щиток —
игла!» — и повел их к выстроенному очень красиво маленькому домику,
окруженному большим загороженным со всех сторон двором. Вошедши на
двор, увидели там всяких собак, и густопсовых, и чистопсовых, всех
возможных цветов и мастей: муругих, черных с подпалинами, полво-пегих,
муруго-пегих, красно-пегих, черноухих, сероухих… Тут были все клички,
все повелительные наклонения: стреляй, обругай, порхай, пожар,
скосырь, черкай, допекай, припекай, северга, касатка, награда,
попечительница. Ноздрев был среди их совершенно как отец среди
семейства; все они, тут же пустивши вверх хвосты, зовомые у собачеев
прави'лами, полетели прямо навстречу гостям и стали с ними
здороваться. Штук десять из них положили свои лапы Ноздреву на плеча.
Обругай оказал такую же дружбу Чичикову и, поднявшись на задние ноги,
лизнул его языком в самые губы, так что Чичиков тут же выплюнул.
Осмотрели собак, наводивших изумление крепостью черных мясов, —
хорошие были собаки. Потом пошли осматривать крымскую суку, которая
была уже слепая и, по словам Ноздрева, должна была скоро издохнуть, но
года два тому назад была очень хорошая сука; осмотрели и суку — сука,
точно, была слепая. Потом пошли осматривать водяную мельницу, где
недоставало порхлицы, в которую утверждается верхний камень, быстро
вращающийся на веретене, — «порхающий», по чудному выражению русского
мужика.

— А вот тут скоро будет и кузница! — сказал Ноздрев. Немного прошедши,
— они увидели, точно, кузницу, осмотрели и кузницу.

— Вот на этом поле, — сказал Ноздрев, указывая пальцем на поле, —
— русаков такая гибель, что земли не видно; я сам своими руками поймал
— одного за задние ноги.

— Ну, русака ты не поймаешь рукою! — заметил зять.

— А вот же поймал, нарочно поймал! — отвечал Ноздрев — Теперь я поведу
— тебя посмотреть, — продолжал он, обращаясь к Чичикову, — границу,
— где оканчивается моя земля.

Ноздрев повел своих гостей полем, которое во многих местах состояло из
кочек. Гости должны были пробираться между перелогами и взбороненными
нивами. Чичиков начинал чувствовать усталость. Во многих местах ноги
их выдавливали под собою воду, до такой степени место было низко.
Сначала они было береглись и переступали осторожно, но потом, увидя,
что это ни к чему не служит, брели прямо, не разбирая, где бо'льшая, а
где меньшая грязь. Прошедши порядочное расстояние, увидели, точно,
границу, состоявшую из деревянного столбика и узенького рва.

— Вот граница! — сказал Ноздрев. — Все, что ни видишь по эту сторону,
— все это мое, и даже по ту сторону, весь этот лес, которым вон
— синеет, и все, что за лесом, все мое.

— Да когда же этот лес сделался твоим? — спросил зять. — Разве ты
— недавно купил его? Ведь он не был твой.

— Да, я купил его недавно, — отвечал Ноздрев.

— Когда же ты успел его так скоро купить?

— Как же, я еще третьего дня купил, и дорого, черт возьми, дал.

— Да ведь ты был в то время на ярмарке.

— Эх ты, Софрон! Разве нельзя быть в одно время и на ярмарке и купить
— землю? Ну, я был на ярмарке, а приказчик мой тут без меня и купил.

— Да, ну разве приказчик! — сказал зять, но и тут усумнился и покачал
— головою.

Гости воротились тою же гадкою дорогою к дому. Ноздрев повел их в свой
кабинет, в котором, впрочем, не было заметно следов того, что бывает в
кабинетах, то есть книг или бумаги; висели только сабли и два ружья —
одно в триста, а другое в восемьсот рублей. Зять, осмотревши, покачал
только головою. Потом были показаны турецкие кинжалы, на одном из
которых по ошибке было вырезано: «Мастер Савелий Сибиряков». Вслед за
тем показалась гостям шарманка. Ноздрев тут же провертел пред ними
кое-что. Шарманка играла не без приятности, но в средине ее, кажется,
что-то случилось, ибо мазурка оканчивалась песнею: «Мальбруг в поход
поехал», а «Мальбруг в поход поехал» неожиданно завершался каким-то
давно знакомым вальсом. Уже Ноздрев давно перестал вертеть, но в
шарманке была одна дудка очень бойкая, никак не хотевшая угомониться,
и долго еще потому свистела она одна. Потом показались трубки —
деревянные, глиняные, пенковые, обкуренные и необкуренные, обтянутые
замшею и необтянутые, чубук с янтарным мундштуком, недавно выигранный,
кисет, вышитый какою-то графинею, где-то на почтовой станции
влюбившеюся в него по уши, у которой ручки, по словам его, были самой
субдительной сюперфлю, — слово, вероятно означавшее у него высочайшую
точку совершенства. Закусивши балыком, они сели за стол близ пяти
часов. Обед, как видно, не составлял у Ноздрева главного в жизни;
блюда не играли большой роли: кое-что и пригорело, кое-что и вовсе не
сварилось. Видно, что повар руководствовался более каким-то
вдохновеньем и клал первое, что попадалось под руку: стоял ли возле
него перец — он сыпал перец, капуста ли попалась — совал капусту,
пичкал молоко, ветчину, горох — словом, катай-валяй, было бы горячо, а
вкус какой-нибудь, верно, выдет. Зато Ноздрев налег на вина: еще не
подавали супа, он уже налил гостям по большому стакану портвейна и по
другому госотерна, потому что в губернских и уездных городах не бывает
простого сотерна. Потому Ноздрев велел принести бутылку мадеры, лучше
которой не пивал сам фельдмаршал. Мадера, точно, даже горела во рту,
ибо купцы, зная уже вкус помещиков, любивших добрую мадеру, заправляли
ее беспощадно ромом, а иной раз вливали туда и царской водки, в
надежде, что всё вынесут русские желудки. Потом Ноздрев велел еще
принесть какую-то особенную бутылку, которая, по словам его, была и
бургоньон и шампаньон вместе. Он наливал очень усердно в оба стакана,
и направо и налево, и зятю и Чичикову; Чичиков заметил, однако же,
как-то вскользь, что самому себе он не много прибавлял. Это заставило
его быть осторожным, и как только Ноздрев как-нибудь заговаривался или
наливал зятю, он опрокидывал в ту же минуту свой стакан в тарелку. В
непродолжительном времени была принесена на стол рябиновка, имевшая,
по словам Ноздрева, совершенный вкус сливок, но в которой, к
изумлению, слышна была сивушища во всей своей силе. Потом пили какой-
то бальзам, носивший такое имя, которое даже трудно было припомнить,
да и сам хозяин в другой раз назвал его уже другим именем. Обед давно
уже кончился, и вина были перепробованы, но гости всё еще сидели за
столом. Чичиков никак не хотел заговорить с Ноздревым при зяте насчет
главного предмета. Все-таки зять был человек посторонний, а предмет
требовал уединенного и дружеского разговора. Впрочем, зять вряд ли мог
быть человеком опасным, потому что нагрузился, кажется, вдоволь и,
сидя на стуле, ежеминутно клевался носом. Заметив и сам, что находился
не в надежном состоянии, он стал наконец отпрашиваться домой, но таким
ленивым и вялым голосом, как будто бы, по русскому выражению,
натаскивал клещами на лошадь хомут.

— И ни-ни! не пущу! — сказал Ноздрев

— Нет, не обижай меня, друг мой, право, поеду, — говорил зять, — ты
— меня очень обидишь.

— Пустяки, пустяки! мы соорудим сию минуту банчишку.

— Нет, сооружай, брат, сам, а я не могу, жена будет в большой
— претензии, право, я должен ей рассказать о ярмарке. Нужно, брат,
— право, нужно доставить ей удовольствие. Нет, ты не держи меня!

— Ну ее, жену, к..! важное в самом деле дело станете делать вместе!

— Нет, брат! она такая почтенная и верная! Услуги оказывает такие…
— поверишь, у меня слезы на глазах. Нет, ты не держи меня; как честный
— человек, поеду. Я тебя в этом уверяю по истинной совести.

— Пусть его едет, что в нем проку! — сказал тихо Чичиков Ноздреву.

— А и вправду! — сказал Ноздрев. — Смерть не люблю таких растепелей! —
— и прибавил вслух: — Ну, черт с тобою, поезжай бабиться с женою,
— фетюк![[2 - Фетюк — слово, обидное для мужчины, происхоит от Фиты —
— буквы, почитаемой некоторыми неприличною буквою. (Прим. Н. В.
— Гоголя.)]]

— Нет, брат, ты не ругай меня фетюком, — отвечал зять, — я ей жизнью
— обязан. Такая, право, добрая, милая, такие ласки оказывает… до слез
— разбирает; спросит, что видел на ярмарке — нужно все рассказать,
— такая, право, милая.

— Ну поезжай, ври ей чепуху! Вот картуз твой.

— Нет, брат, тебе совсем не следует о ней так отзываться; этим ты,
— можно сказать, меня самого обижаешь, она такая милая.

— Ну, так и убирайся к ней скорее!

— Да, брат, поеду, извини, что не могу остаться. Душой рад бы был, но
— не могу.

Зять еще долго повторял свои извинения, не замечая, что сам уже давно
сидел в бричке, давно выехал за ворота и перед ним давно были одни
пустые поля. Должно думать, что жена не много слышала подробностей о
ярмарке.

— Такая дрянь! — говорил Ноздрев, стоя перед окном и глядя на
— уезжавший экипаж. — Вон как потащился! конек пристяжной недурен, я
— давно хотел подцепить его. Да ведь с ним нельзя никак сойтиться.
— Фетюк, просто фетюк!

Засим вошли они в комнату. Порфирий подал свечи, и Чичиков заметил в
руках хозяина неизвестно откуда взявшуюся колоду карт.

— А что брат, — говорил Ноздрев, прижавши бока колоды пальцами и
— несколько погнувши ее, так что треснула и отскочила бумажка. — Ну,
— для препровождения времени, держу триста рублей банку!

Но Чичиков прикинулся, как будто и не слышал, о чем речь, и сказал,
как бы вдруг припомнив:

— А! чтоб не позабыть: у меня к тебе просьба.

— Какая?

— Дай прежде слово, что исполнишь.

— Да какая просьба?

— Ну, да уж дай слово!

— Изволь

— Честное слово?

— Честное слово.

— Вот какая просьба: у тебя есть, чай, много умерших крестьян, которые
— еще не вычеркнуть из ревизии?

— Ну есть, а что?

— Переведи их на меня, на мое имя.

— А на что тебе?

— Ну да мне нужно.

— Да на что?

— Ну да уж нужно… уж это мое дело, — словом, нужно.

— Ну уж, верно, что-нибудь затеял. Признайся, что?

— Да что ж затеял? из этакого пустяка и затеять ничего нельзя.

— Да зачем же они тебе?

— Ох, какой любопытный! ему всякую дрянь хотелось бы пощупать рукой,
— да еще и понюхать!

— Да к чему ж ты не хочешь сказать?

— Да что же тебе за прибыль знать? ну, просто так, пришла фантазия.

— Так вот же: до тех пор, пока не скажешь, не сделаю!

— Ну вот видишь, вот уж и нечестно с твоей стороны: слово дал, да и на
— попятный двор.

— Ну, как ты себе хочешь, а не сделаю, пока не скажешь, на что.

«Что бы такое сказать ему?» — подумал Чичиков в после минутного
«размышления объявил, что мертвые души нужны ему для приобретения весу
«в обществе, что он поместьев больших не имеет, так до того времени
«хоть бы какие-нибудь душонки.

— Врешь, врешь! — сказал Ноздрев, не давши окончить. — Врешь, брат!

Чичиков и сам заметил, что придумал не очень ловко и предлог довольно
слаб.

— Ну, так я ж тебе скажу прямее, — сказал он, поправившись, — только,
— пожалуйста, не проговорись никому. Я задумал жениться; но нужно тебе
— знать, что отец и мать невесты преамбициозные люди. Такая, право,
— комиссия: не рад, что связался, хотят непременно, чтоб у жениха было
— никак не меньше трехсот душ, а так как у меня целых почти
— полутораста крестьян недостает…

— Ну врешь! врешь! — закричал опять Ноздрев.

— Ну вот уж здесь, — сказал Чичиков, — ни вот на столько не солгал, —
— и показал большим пальцем на своем мизинце самую маленькую часть.

— Голову ставлю, что врешь!

— Однако ж это обидно! что же я такое в самом деле! почему я
— непременно лгу?

— Ну да ведь я знаю тебя: ведь ты большой мошенник, позволь мне это
— сказать тебе по дружбе! Ежели бы я был твоим начальником, я бы тебя
— повесил на первом дереве.

Чичиков оскорбился таким замечанием. Уже всякое выражение, сколько-
нибудь грубое или оскорбляющее благопристойность, было ему неприятно.
Он даже не любил допускать с собой ни в каком случае фамильярного
обращения, разве только если особа была слишком высокого звания. И
потому теперь он совершенно обиделся.

— Ей-богу, повесил бы, — повторил Ноздрев, — я тебе говорю это
— откровенно, не с тем чтобы тебя обидеть, а просто по-дружески
— говорю.

— Всему есть границы, — сказал Чичиков с чувством достоинства. — Если
— хочешь пощеголять подобными речами, так ступай в казармы, — и потом
— присовокупил: — Не хочешь подарить, так продай.

— Продать! Да ведь я знаю тебя, ведь ты подлец, ведь ты дорого не дашь
— за них?

— Эх, да ты ведь тоже хорош! смотри ты! что они у тебя бриллиантовые,
— что ли?

— Ну, так и есть. Я уж тебя знал.

— Помилуй, брат, что ж у тебя за жидовское побуждение. Ты бы должен
— просто отдать мне их.

— Ну, послушай, чтоб доказать тебе, что я вовсе не какой-нибудь
— скалдырник, я не возьму за них ничего. Купи у меня жеребца, я тебе
— дам их в придачу.

— Помилуй, на что ж мне жеребец? — сказал Чичиков, изумленный в самом
— деле таким предложением.

— Как на что? да ведь я за него заплатил десять тысяч, а тебе отдаю за
— четыре.

— Да на что мне жеребец? завода я не держу.

— Да послушай, ты не понимаешь: ведь я с тебя возьму теперь всего
— только три тысячи, а остальную тысячу ты можешь заплатить мне после.

— Да не нужен мне жеребец, бог с ним!

— Ну, купи каурую кобылу.

— И кобылы не нужно.

— За кобылу и за серого коня, которого ты у меня видел, возьму я с
— тебя только две тысячи.

— Да не нужны мне лошади.

— Ты их продашь, тебе на первой ярмарке дадут за них втрое больше.

— Так лучше ж ты их сам продай, когда уверен, что выиграешь втрое.

— Я знаю, что выиграю, да мне хочется, чтобы и ты получил выгоду.

Чичиков поблагодарил за расположение и напрямик отказался и от серого
коня, и от каурой кобылы.

— Ну так купи собак. Я тебе продам такую пару, просто мороз по коже
— подирает! брудастая, с усами, шерсть стоит вверх, как щетина.
— Бочковатость ребр уму непостижимая, лапа вся в комке, земли не
— заденет.

— Да зачем мне собаки? я не охотник.

— Да мне хочется, чтобы у тебя были собаки. Послушай, если уж не
— хочешь собак, так купи у меня шарманку, чудная шарманка; самому, как
— честный человек, обошлась в полторы тысячи. тебе отдаю за девятьсот
— рублей.

— Да зачем же мне шарманка? Ведь я не немец, чтобы, тащася с ней по
— дорогам, выпрашивать деньги.

— Да ведь это не такая шарманка, как носят немцы. Это орган; посмотри
— нарочно: вся из красного дерева. Вот я тебе покажу ее еще! — Здесь
— Ноздрев, схвативши за руку Чичикова, стал тащить его в другую
— комнату, и как тот ни упирался ногами в пол и ни уверял, что он
— знает уже, какая шарманка, но должен был услышать еще раз, каким
— образом поехал в поход Мальбруг. — Когда ты не хочешь на деньги, так
— вот что, слушай: я тебе дам шарманку и все, сколько ни есть у меня,
— мертвые души, а ты мне дай свою бричку и триста рублей придачи.

— Ну вот еще, а я-то в чем поеду?

— Я тебе дам другую бричку. Вот пойдем в сарай, я тебе покажу ее! Ты
— ее только перекрасишь, и будет чудо бричка.

«Эк его неугомонный бес как обуял!» — подумал про себя Чичиков и
«решился во что бы то ни стало отделаться от всяких бричек, шарманок и
«всех возможных собак, несмотря на непостижимую уму бочковатость ребр
«и комкость лап.

— Да ведь бричка, шарманка и мертвые души, все вместе!

— Не хочу, — сказал еще раз Чичиков.

— Отчего ж ты не хочешь?

— Оттого, что просто не хочу, да и полно.

— Экой ты, право, такой! с тобой, как я вижу, нельзя, как водится
— между хорошими друзьями и товарищами, такой, право!.. Сейчас видно,
— что двуличный человек!

— Да что же я, дурак, что ли? ты посуди сам: зачем же приобретать
— вещь, решительно для меня ненужную?

— Ну уж, пожалуйста, не говори. Теперь я очень хорошо тебя знаю.
— Такая, право, ракалия! Ну, послушай, хочешь метнем банчик? Я
— поставлю всех умерших на карту, шарманку тоже.

— Ну, решаться в банк, значит подвергаться неизвестности, — говорил
— Чичиков и между тем взглянул искоса на бывшие в руках у него карты.
— Обе талии ему показались очень похожими на искусственные, и самый
— крап глядел весьма подозрительно.

— Отчего ж неизвестности? — сказал Ноздрев. — Никакой неизвестности!
— будь только на твоей стороне счастие, ты можешь выиграть чертову
— пропасть. Вон она! экое счастье! — говорил он, начиная метать для
— возбуждения задору. — Экое счастье! экое счастье! вон: так и
— колотит! вот та проклятая девятка, на которой я все просадил!
— Чувствовал, что продаст, да уже, зажмурив глаза, думаю себе: «Черт
— тебя побери, продавай, проклятая!»

Когда Ноздрев это говорил, Порфирий принес бутылку. Но Чичиков
отказался решительно как играть, так и пить.

— Отчего ж ты не хочешь играть? — сказал Ноздрев.

— Ну оттого, что не расположен. Да, признаться сказать, я вовсе не
— охотник играть.

— Отчего ж не охотник?

Чичиков пожал плечами и прибавил:

— Потому что не охотник.

— Дрянь же ты!

— Что ж делать? так бог создал.

— Фетюк просто! Я думал было прежде, что ты хоть сколько-нибудь
— порядочный человек, а ты никакого не понимаешь обращения. С тобой
— никак нельзя говорить, как с человеком близким… никакого прямодушия,
— ни искренности! совершенный Собакевич, такой подлец!

— Да за что же ты бранишь меня? Виноват разве я, что не играю? Продай
— мне душ одних, если уж ты такой человек, что дрожишь из-за этого
— вздору.

— Черта лысого получишь! хотел было, даром хотел отдать, но теперь вот
— не получишь же! Хоть три царства давай, не отдам. Такой шильник,
— печник гадкий! С этих пор с тобой никакого дела не хочу иметь.
— Порфирий, ступай скажи конюху, чтобы не давал овса лошадям его,
— пусть их едят одно сено.

Последнего заключения Чичиков никак не ожидал.

— Лучше б ты мне просто на глаза не показывался! — сказал Ноздрев.

Несмотря, однако ж, на такую размолвку, гость и хозяин поужинали
вместе, хотя на этот раз не стояло на столе никаких вин с затейливыми
именами. Торчала одна только бутылка с какие-то кипрским, которое было
то, что называют кислятина во всех отношениях. После ужина Ноздрев
сказал Чичикову, отведя его в боковую комнату, где была приготовлена
для него постель:

— Вот тебе постель! Не хочу и доброй ночи желать тебе!

Чичиков остался по уходе Ноздрева в самом неприятном расположении
духа. Он внутренно досадовал на себя, бранил себя за то, что к нему
заехал и потерял даром время. Но еще более бранил себя за то, что
заговорил с ним о деле, поступил неосторожно, как ребенок, как дурак:
ибо дело совсем не такого роду, чтобы быть вверену Ноздреву… Ноздрев
человек-дрянь, Ноздрев может наврать, прибавить, распустить черт знает
что, выйдут еще какие-нибудь сплетни — нехорошо, нехорошо. «Просто
дурак я». — говорил он сам себе. Ночь спал он очень дурно. Какие-то
маленькие пребойкие насекомые кусали его нестерпимо больно, так что он
всей горстью скреб по уязвленному месту, приговаривая: «А, чтоб вас
черт побрал вместе с Ноздревым!» Проснулся он ранним утром. Первым
делом его было, надевши халат и сапоги, отправиться через двор в
конюшню приказать Селифану сей же час закладывать бричку. Возвращаясь
через двор, он встретился с Ноздревым, который был также в халате, с
трубкою в зубах.

Ноздрев приветствовал его по-дружески и спросил, каково ему спалось.

— Так себе, — отвечал Чичиков весьма сухо.

— А я, брат, — говорил Ноздрев, — такая мерзость лезла всю ночь, что
— гнусно рассказывать, и во рту после вчерашнего точно эскадрон
— переночевал. Представь: снилось, что меня высекли, ей-ей! и,
— вообрази, кто? Вот ни за что не угадаешь: штабс-ротмистр Поцелуев
— вместе с Кувшинниковым.

«Да, — подумал про себя Чичиков, — хорошо бы, если б тебя отодрали
«наяву».

— Ей-богу! да пребольно! Проснулся: черт возьми, в самом деле что-то
— почесывается, — верно, ведьмы блохи. Ну, ты ступай теперь одевайся,
— я к тебе сейчас приду. Нужно только ругнуть подлеца приказчика.

Чичиков ушел в комнату одеться и умыться. Когда после того вышел он в
столовую, там уже стоял на столе чайный прибор с бутылкою рома. В
комнате были следы вчерашнего обеда и ужина; кажется, половая щетка не
притрогивалась вовсе. На полу валялись хлебные крохи, а табачная зола
видна даже была на скатерти. Сам хозяин, не замедливший скоро войти,
ничего не имел у себя под халатом, кроме открытой груди, на которой
росла какая-то борода. Держа в руке чубук и прихлебывая из чашки, он
был очень хорош для живописца, не любящего страх господ прилизанных и
завитых, подобно цирюльным вывескам, или выстриженных под гребенку.

— Ну, так как же думаешь? — сказал Ноздрев, немного помолчавши. — Не
— хочешь играть на души?

— Я уже сказал тебе, брат, что не играю; купить — изволь, куплю.

— Продать я не хочу, это будет не по-приятельски. Я не стану снимать
— плевы с черт знает чего. В бантик — другое дело. Прокинем хоть
— талию!

— Я уж сказал, что нет.

— А меняться не хочешь?

— Не хочу.

— Ну, послушай, сыграем в шашки, выиграешь — твои все. Ведь у меня
— много таких, которых нужно вычеркнуть из ревизии. Эй, Порфирий,
— принеси-ка сюда шашечницу.

— Напрасен труд, я не буду играть.

— Да ведь это не в банк; тут никакого не может быть счастия или
— фальши: все ведь от искусства; я даже тебя предваряю, что я совсем
— не умею играть, разве что-нибудь мне дашь вперед.

«Сем-ка я, — подумал про себя Чичиков, — сыграю с ним в шашки! В шашки
«игрывал я недурно, а на штуки ему здесь трудно подняться».

— Изволь, так и быть, в шашки сыграю.

— Души идут в ста рублях!

— Зачем же? довольно, если пойдут в пятидесяти.

— Нет, что ж за куш пятьдесят? Лучше ж в эту сумму я включу тебе
— какого-нибудь щенка средней руки или золотую печатку к часам.

— Ну, изволь! — сказал Чичиков.

— Сколько же ты мне дашь вперед? — сказал Ноздрев.

— Это с какой стати? Конечно, ничего.

— По крайней мере пусть будут мои два хода.

— Не хочу, я сам плохо играю.

— Знаем мы вас, как вы плохо играете! — сказал Ноздрев, выступая
— шашкой.

— Давненько не брал я в руки шашек! — говорил Чичиков, подвигая тоже
— шашку.

— Знаем мы вас, как вы плохо играете! — сказал Ноздрев, выступая
— шашкой.

— Давненько не брал я в руки шашек! — говорил Чичиков, подвигая шашку.

— Знаем мы вас, как вы плохо играете! — сказал Ноздрев, подвигая
— шашку, да в то же самое время подвинул обшлагом рукава и другую
— шашку.

— Давненько не брал я в руки!.. Э, э! это, брат, что? отсади-ка ее
— назад! — говорил Чичиков.

— Кого?

— Да шашку-то, — сказал Чичиков и в то же время увидел перед самым
— носом своим другую, которая, как казалось, пробиралась в дамки;
— откуда она взялась это один только бог знал. — Нет, — сказал
— Чичиков, вставши из-за стола, — с тобой нет никакой возможности
— играть! Этак не ходят, по три шашки вдруг!

— Отчего ж по три? Это по ошибке. Одна подвинулась нечаянно, я ее
— отодвину, изволь.

— А другая-то откуда взялась?

— Какая другая?

— А вот эта, что пробирается в дамки?

— Вот тебе на, будто не помнишь!

— Нет, брат, я все ходы считал и все помню; ты ее только теперь
— пристроил. Ей место вон где!

— Как, где место? — сказал Ноздрев, покрасневши. — Да, ты, брат, как я
— вижу, сочинитель!

— Нет, брат, это, кажется, ты сочинитель, да только неудачно.

— За кого ж ты меня почитаешь? — говорил Ноздрев. — Стану я разве
— плутоватать?

— Я тебя ни за кого не почитаю, но только играть с этих пор никогда не
— буду.

— Нет, ты не можешь отказаться, — говорил Ноздрев, горячась, — игра
— начата!

— Я имею право отказаться, потому что ты не так играешь, как прилично
— честному человеку.

— Нет, врешь, ты этого не можешь сказать!

— Нет, брат, сам ты врешь!

— Я не плутовал, а ты отказаться не можешь, ты должен кончить партию!

— Этого ты меня не заставишь сделать, — сказал Чичиков хладнокровно и,
— подошедши к доске, смешал шашки.

Ноздрев вспыхнул и подошел к Чичикову так близко, что тот отступил
шага два назад.

— Я тебя заставлю играть! Это ничего, что ты смешал шашки, я помню все
— ходы. Мы их поставим опять так, как были.

— Нет, брат, дело кончено, я с тобою не стану играть.

— Так ты не хочешь играть?

— Ты сам видишь, что с тобою нет возможности играть.

— Нет, скажи напрямик, ты не хочешь играть? — говорил Ноздрев,
— подступая еще ближе.

— Не хочу! — сказал Чичиков и поднес, однако ж, обе руки на всякий
— случай поближе к лицу, ибо дело становилось в самом деле жарко.

Эта предосторожность была весьма у места, потому что Ноздрев
размахнулся рукой… и очень бы могло статься, что одна из приятных и
полных щек нашего героя покрылась бы несмываемым бесчестием; но,
счастливо отведши удар, он схватил Ноздрева за обе задорные его руки и
держал его крепко.

— Порфирий, Павлушка! — кричал Ноздрев в бешенстве, порываясь
— вырваться.

Услыша эти слова, Чичиков, чтобы не сделать дворовых людей свидетелями
соблазнительной сцены и вместе с тем чувствуя, что держать Ноздрева
было бесполезно, выпустил его руки. В это самое время вошел Порфирий и
с ним Павлушка, парень дюжий, с которым иметь дело было совсем
невыгодно.

— Так ты не хочешь оканчивать партии? — говорил Ноздрев. — Отвечай мне
— напрямик!

— Партии нет возможности оканчивать, — говорил Чичиков и заглянул в
— окно. Он увидел свою бричку, которая стояла совсем готовая, а
— Селифан ожидал, казалось, мановения, чтобы подкатить под крыльцо, но
— из комнаты не было никакой возможности выбраться: в дверях стояли
— два дюжих крепостных дурака.

— Так ты не хочешь доканчивать партии? — повторил Ноздрев с лицом,
— горевшим, как в огне.

— Если бы ты играл, как прилично честному человеку. Но теперь не могу.

— А! так ты не можешь, подлец! когда увидел, что не твоя берет, так и
— не можешь! Бейте его! — кричал он исступленно, обратившись к
— Порфирию и Павлушке, а сам схватил в руку черешневый чубук. Чичиков
— стал бледен как полотно. Он хотел что-то сказать, но чувствовал, что
— губы его шевелились без звука.

— Бейте его! — кричал Ноздрев, порываясь вперед с черешневым чубуком,
— весь в жару, в поту, как будто подступал под неприступную крепость.
— — Бейте его! — кричал он таким же голосом, как во время великого
— приступа кричит своему взводу: «Ребята, вперед!» какой-нибудь
— отчаянный поручик, которого взбалмошная храбрость уже приобрела
— такую известность, что дается нарочный приказ держать его за руки во
— время горячих дел. Но поручик уже почувствовал бранный задор, все
— пошло кругом в голове его; перед ним носится Суворов, он лезет на
— великое дело. «Ребята, вперед!» — кричит он, порываясь, не помышляя,
— что вредит уже обдуманному плану общего приступа, что миллионы
— ружейных дул выставились в амбразуры неприступных, уходящих за-
— облака крепостных стен, что взлетит, как пух, на воздух его
— бессильный взвод и что уже свищет роковая пуля, готовясь захлопнуть
— его крикливую глотку. Но если Ноздрев выразил собою подступившего
— под крепость отчаянного, потерявшегося поручика, то крепость, на
— которую он шел, никак не была похожа на неприступную. Напротив,
— крепость чувствовала такой страх, что душа ее спряталась в самые
— пятки. Уже стул, которым он вздумал было защищаться, был вырван
— крепостными людьми из рук его, уже, зажмурив глаза, ни жив ни мертв,
— он готовился отведать черкесского чубука своего хозяина, и бог знает
— чего бы ни случилось с ним; но судьбам угодно было спасти бока,
— плеча и все благовоспитанные части нашего героя. Неожиданным образом
— звякнули вдруг, как с облаков, задребезжавшие звуки колокольчика,
— раздался ясно стук колес подлетевшей к крыльцу телеги, и отозвались
— даже в самой комнате тяжелый храп и тяжкая одышка разгоряченных
— коней остановившейся тройки. Все невольно глянули в окно: кто-то, с
— усами, в полувоенном сюртуке, вылезал из телеги. Осведомившись в
— передней, вошел он в ту самую минуту, когда Чичиков не успел еще
— опомниться от своего страха и был в самом жалком положении, в каком
— когда-либо находился смертный.

— Позвольте узнать, кто здесь господин Ноздрев? — сказал незнакомец,
— посмотревши в некотором недоумении на Ноздрева, который стоял с
— чубуком в руке, и на Чичикова, который едва начинал оправляться от
— своего невыгодного положения.

— Позвольте прежде узнать, с кем имею честь говорить? — сказал
— Ноздрев, подходя к нему ближе.

— Капитан-исправник.

— А что вам угодно?

— Я приехал вам объявить сообщенное мне извещение, что вы находитесь
— под судом до времени окончания решения по вашему делу.

— Что за вздор, по какому делу? — сказал Ноздрев.

— Вы были замешаны в историю, по случаю нанесения помещику Максимову
— личной обиды розгами в пьяном виде.

— Вы врете! я и в глаза не видал помещика Максимова!

— Милостивый государь! позвольте вам доложить, что я офицер. Вы можете
— это сказать вашему слуге, а не мне!

Здесь Чичиков, не дожидаясь, что будет отвечать на это Ноздрев, скорее
за шапку да по-за спиною капитана-исправника выскользнул на крыльцо,
сел в бричку и велел Селифану погонять лошадей во весь дух.






Глава пятая


Герой наш трухнул, однако ж, порядком. Хотя бричка мчалась во всю
пропащую и деревня Ноздрева давно унеслась из вида, закрывшись полями,
отлогостями и пригорками, но он все еще поглядывал назад со страхом,
как бы ожидая, что вот-вот налетит погоня. Дыхание его переводилось с
трудом, и когда он попробовал приложить руку к сердцу, то
почувствовал, что оно билось, как перепелка в клетке. «Эк какую баню
задал! смотри ты какой!» Тут много было посулено Ноздреву всяких
нелегких и сильных желаний; попались даже и нехорошие слова. Что ж
делать? Русский человек, да еще и в сердцах. К тому ж дело было совсем
нешуточное. «Что ни говори, — сказал он сам в себе, — а не подоспей
капитан-исправник, мне бы, может быть, не далось бы более и на свет
божий взглянуть! Пропал бы, как волдырь на воде, без всякого следа, не
оставивши потомков, не доставив будущим детям ни состояния, ни
честного имени!» Герой наш очень заботился о своих потомках.

«Экой скверный барин! — думал про себя Селифан. — Я еще не видал
«такого барина. То есть плюнуть бы ему за это! Ты лучше человеку не
«дай есть, а коня ты должен кормить, потому что конь любит овес. Это
«его продовольство: что, примером, нам кошт, то для него овес, он его
«продовольство».

Кони тоже, казалось, думали невыгодно об Ноздреве: не только гнедой и
Заседатель, но и сам чубарый был не в духе. Хотя ему на часть и
доставался всегда овес потуже и Селифан не иначе всыпал ему в корыто,
как сказавши прежде: «Эх ты, подлец!» — но, однако ж, это все-таки был
овес, а не простое сено, он жевал его с удовольствием и часто
засовывал длинную морду свою в корытца к товарищам поотведать, какое у
них было продовольствие, особливо когда Селифана не было в конюшне, но
теперь одно сено… нехорошо; все были недовольны.

Но скоро все недовольные были прерваны среди излияний своих внезапным
и совсем неожиданным образом. Все, не исключая и самого кучера,
опомнились и очнулись только тогда, когда на них наскакала коляска с
шестериком коней и почти над головами их раздалися крик сидевших в
коляске дам, брань и угрозы чужого кучера: «Ах ты мошенник эдакой;
ведь я тебе кричал в голос: сворачивай, ворона, направо! Пьян ты, что
ли?» Селифан почувствовал свою оплошность, но так как русский человек
не любит сознаться перед другим, что он виноват, то тут же вымолвил
он, приосанясь: «А ты что так расскакался? глаза-то свои в кабаке
заложил, что ли?» Вслед за сим он принялся отсаживать назад бричку,
чтобы высвободиться таким образом из чужой упряжи, но не тут-то было,
все перепуталось. Чубарый с любопытством обнюхивал новых своих
приятелей, которые очутились по обеим сторонам его. Между тем сидевшие
в коляске дамы глядели на все это с выражением страха в лицах. Одна
была старуха, другая молоденькая, шестнадцатилетняя, с золотистыми
волосами весьма ловко и мило приглаженными на небольшой головке.
Хорошенький овал лица ее круглился, как свеженькое яичко, и, подобно
ему, белел какою-то прозрачною белизною, когда свежее, только что
снесенное, оно держится против света в смуглых руках испытующей его
ключницы и пропускает сквозь себя лучи сияющего солнца; ее тоненькие
ушки также сквозили, рдея проникавшим их теплым светом. При этом испуг
в открытых, остановившихся устах, на глазах слезы — все это в ней было
так мило, что герой наш глядел на нее несколько минут, не обращая
никакого внимания на происшедшую кутерьму между лошадьми и кучерами.
«Отсаживай, что ли, нижегородская ворона!» — кричал чужой кучер.
Селифан потянул поводья назад, чужой кучер сделал то же, лошади
несколько попятились назад и потом опять сшиблись, переступивши
постромки. При этом обстоятельстве чубарому коню так понравилось новое
знакомство, что он никак не хотел выходить из колеи, в которую попал
непредвиденными судьбами, и, положивши свою морду на шею своего нового
приятеля, казалось, что-то нашептывал ему в самое ухо, вероятно,
чепуху страшную, потому что приезжий беспрестанно встряхивал ушами.

На такую сумятицу успели, однако ж, собраться мужики из деревни,
которая была, к счастию, неподалеку. Так как подобное зрелище для
мужика сущая благодать, все равно что для немца газеты или клуб, то
скоро около экипажа накопилась их бездна, и в деревне остались только
старые бабы да малые ребята. Постромки отвязали; несколько тычков
чубарому коню в морду заставали его попятиться; словом, их разрознили
и развели. Но досада ли, которую почувствовали приезжие кони за то,
что разлучили их с приятелями, или просто дурь, только, сколько ни
хлестал их кучер, они не двигались и стояли как вкопанные. Участие
мужиков возросло до невероятной степени. Каждый наперерыв совался с
советом: «Ступай, Андрюшка, проведи-ка ты пристяжного, что с правой
стороны, а дядя Митяй пусть сядет верхом на коренного! Садись, дядя
Митяй!» Сухощавый и длинный дядя Митяй с рыжей бородой взобрался на
коренного коня и сделался похожим на деревенскую колокольню, или,
лучше, на крючок, которым достают воду в колодцах. Кучер ударил по
лошадям, но не тут-то было, ничего не пособил дядя Митяй. «Стой, стой!
— кричали мужики. — Садись-ка ты, дядя Митяй, на пристяжную, а на
коренную пусть сядет дядя Миняй!» Дядя Миняй, широкоплечий мужик с
черною, как уголь, бородою и брюхом, похожим на тот исполинский
самовар, в котором варится сбитень для всего прозябнувшего рынка, с
охотою сел на коренного, который чуть не пригнулся под ним до земли.
«Теперь дело пойдет! — кричали мужики. — Накаливай, накаливай его!
пришпандорь кнутом вон того, того, солового, что он горячится, как
корамора!»[[3 - Корамора — большой, длинный, вялый комар; иногда
залетает в комнату и торчит где-нибудь одиночкой на стене. К нему
спокойно можно подойти и ухватить его за ногу, в ответ на что он
только топырится или горячится, как говорит народ. (Прим. Н. В.
Гоголя.)]] Но, увидевши, что дело не шло и не помогло никакое
накаливанье, дядя Митяй и дядя Миняй сели оба на коренного, а на
пристяжного посадили Андрюшку. Наконец, кучер, потерявши терпение,
прогнал и дядю Митяя и дядю Миняя, и хорошо сделал, потому что от
лошадей пошел такой пар, как будто бы они отхватали не переводя духа
станцию. Он дал им минуту отдохнуть, после чего они пошли сами собою.
Во все продолжение этой проделки Чичиков глядел очень внимательно на
молоденькую незнакомку. Он пытался несколько раз с нею заговорить, но
как-то не пришлось так. А между тем дамы уехали, хорошенькая головка с
тоненькими чертами лица и тоненьким станом скрылась, как что-то
похожее на виденье, и опять осталась дорога, бричка, тройка знакомых
читателю лошадей, Селифан, Чичиков, гладь и пустота окрестных полей.
Везде, где бы ни было в жизни, среди ли черствых, шероховато-бедных и
неопрятно-плесневеющих низменных рядов ее, или среди однообразно-
хладных и скучно-опрятных сословий высших, везде хоть раз встретится
на пути человеку явленье, не похожее на все то, что случалось ему
видеть дотоле, которое хоть раз пробудит в нем чувство, не похожее на
те, которые суждено ему чувствовать всю жизнь. Везде поперек каким бы
ни было печалям, из которых плетется жизнь наша, весело промчится
блистающая радость, как иногда блестящий экипаж с золотой упряжью,
картинными конями и сверкающим блеском стекол вдруг неожиданно
пронесется мимо какой-нибудь заглохнувшей бедной деревушки, не
видавшей ничего, кроме сельской телеги, и долго мужики стоят, зевая, с
открытыми ртами, не надевая шапок, хотя давно уже унесся и пропал из
виду дивный экипаж. Так и блондинка тоже вдруг совершенно неожиданным
образом показалась в нашей повести и так же скрылась. Попадись на ту
пору вместо Чичикова какой-нибудь двадцатилетний юноша, гусар ли он,
студент ли он, или просто только что начавший жизненное поприще, — и
боже! чего бы не проснулось, не зашевелилось, не заговорило в нем!
Долго бы стоял он бесчувственно на одном месте, вперивши бессмысленно
очи в даль, позабыв и дорогу, и все ожидающие впереди выговоры, и
распеканья за промедление, позабыв и себя, и службу, и мир, и все, что
ни есть в мире.

Но герой наш уже был средних лет и осмотрительно-охлажденного
характера. Он тоже задумался и думал, но положительнее, не так
безотчетны и даже отчасти очень основательны были его мысли. «Славная
бабешка! — сказал он, открывши табакерку и понюхавши табаку. — Но ведь
что, главное, в ней хорошо? Хорошо то, что она сейчас только, как
видно, выпущена из какого-нибудь пансиона или института, что в ней,
как говорится, нет еще ничего бабьего, то есть именно того, что у них
есть самого неприятного. Она теперь как дитя, все в ней просто, она
скажет, что ей вздумается, засмеется, где захочет засмеяться. Из нее
все можно сделать, она может быть чудо, а может выйти и дрянь, и выдет
дрянь! Вот пусть-на только за нее примутся теперь маменьки и тетушки.
В один год так ее наполнят всяким бабьем, что сам родной отец не
узнает. Откуда возьмется и надутость, и чопорность, станет ворочаться
по вытверженным наставлениям, станет ломать голову и придумывать, с
кем, и как, и сколько нужно говорить, как на кого смотреть, всякую
минуту будет бояться, чтобы не сказать больше, чем нужно, запутается
наконец сама, и кончится тем, что станет наконец врать всю жизнь, и
выдет просто черт знает что!» Здесь он несколько времени помолчал и
потом прибавил: «А любопытно бы знать, чьих она? что, как ее отец?
богатый ли помещик почтенного нрава, или просто благомыслящий человек
с капиталом, приобретенным на службе? Ведь если, положим, этой девушке
да придать тысячонок двести приданого, из нее бы мог выйти очень,
очень лакомый кусочек. Это бы могло составить, так сказать, счастье
порядочного человека». Двести тысячонок так привлекательно стали
рисоваться в голове его, что он внутренно начал досадовать на самого
себя, зачем в продолжение хлопотни около экипажей не разведал от
форейтора или кучера, кто такие были проезжающие. Скоро, однако ж,
показавшаяся деревня Собакевича рассеяла его мысли и заставила их
обратиться к своему постоянному предмету.

Деревня показалась ему довольно велика; два леса, березовый и
сосновый, как два крыла, одно темнее, другое светлее, были у ней
справа и слева; посреди виднелся деревянный дом с мезонином, красной
крышей и темными или, лучше, дикими стенами, — дом вроде тех, как у
нас строят для военных поселений и немецких колонистов. Было заметно,
что при постройке его зодчий беспрестанно боролся со вкусом хозяина.
Зодчий был педант и хотел симметрии, хозяин — удобства и, как видно,
вследствие того заколотил на одной стороне все отвечающие окна и
провертел на место их одно маленькое, вероятно понадобившееся для
темного чулана. Фронтон тоже никак не пришелся посреди дома, как ни
бился архитектор, потому что хозяин приказал одну колонну сбоку
выкинуть, и оттого очутилось не четыре колонны, как было назначено, а
только три. Двор окружен был крепкою и непомерно толстою деревянною
решеткой. Помещик, казалось, хлопотал много о прочности. На конюшни,
сараи и кухни были употреблены полновесные и толстые бревна,
определенные на вековое стояние. Деревенские избы мужиков тож срублены
были на диво: не было кирчёных стен, резных узоров и прочих затей, но
все было пригнано плотно и как следует. Даже колодец был обделан в
такой крепкий дуб, какой идет только на мельницы да на корабли.
Словом, все, на что ни глядел он, было упористо, без пошатки, в каком-
то крепком и неуклюжем порядке. Подъезжая к крыльцу, заметил он
выглянувшие из окна почти в одно время два лица: женское, в венце,
узкое, длинное, как огурец, и мужское, круглое, широкое, как
молдаванские тыквы, называемые горлянками, изо которых делают на Руси
балалайки, двухструнные легкие балалайки, красу и потеху ухватливого
двадцатилетнего парня, мигача и щеголя, и подмигивающего и
посвистывающего на белогрудых и белошейных девиц, собравшихся
послушать его тихострунного треньканья. Выглянувши, оба лица в ту же
минуту спрятались. На крыльцо вышел лакей в серой куртке с голубым
стоячим воротником и ввел Чичикова в сени, куда вышел уже сам хозяин.
Увидев гостя, он сказал отрывисто: «Прошу» — и повел его во внутренние
жилья.

Когда Чичиков взглянул искоса на Собакевича, он ему на этот раз
показался весьма похожим на средней величины медведя. Для довершение
сходства фрак на нем был совершенно медвежьего цвета, рукава длинны,
панталоны длинны, ступнями ступал он и вкривь и вкось и наступал
беспрестанно на чужие ноги. Цвет лица имел каленый, горячий, какой
бывает на медном пятаке. Известно, что есть много на свете таких лиц,
над отделкою которых натура недолго мудрила, не употребляла никаких
мелких инструментов, как-то: напильников, буравчиков и прочего, но
просто рубила со своего плеча: хватила топором раз — вышел нос,
хватила в другой — вышли губы, большим сверлом ковырнула глаза и, не
обскобливши, пустила на свет, сказавши: «Живет!» Такой же самый
крепкий и на диво стаченный образ был у Собакевича: держал он его
более вниз, чем вверх, шеей не ворочал вовсе и в силу такого
неповорота редко глядел на того, с которым говорил, но всегда или на
угол печки, или на дверь. Чичиков еще раз взглянул на него искоса,
когда проходили они столовую: медведь! совершенный медведь! Нужно же
такое странное сближение: его даже звали Михайлом Семеновичем. Зная
привычку его наступать на ноги, он очень осторожно передвигал своими и
давал ему дорогу вперед. Хозяин, казалось, сам чувствовал за собою
этот грех и тот же час спросил: «Не побеспокоил ли я вас?» Но Чичиков
поблагодарил, сказав, что еще не произошло никакого беспокойства.

Вошел в гостиную, Собакевич показал на кресла, сказавши опять:
«Прошу!» Садясь, Чичиков взглянул на стены и на висевшие на них
картины. На картинах все были молодцы, всё греческие полководцы,
гравированные во весь рост: Маврокордато в красных панталонах и
мундире, с очками на носу, Миаули, Канами. Все эти герои были с такими
толстыми ляжками и неслыханными усами, что дрожь проходила по телу.
Между крепкими греками, неизвестно каким образом и для чего,
поместился Багратион, тощий, худенький, с маленькими знаменами и
пушками внизу и в самых узеньких рамках. Потом опять следовала героиня
греческая Бобелина, которой одна нога казалась больше всего туловища
тех щеголей, которые наполняют нынешние гостиные. Хозяин, будучи сам
человек здоровый и крепкий, казалось, хотел, чтобы и комнату его
украшали тоже люди крепкие и здоровые. Возле Бобелины, у самого окна,
висела клетка, из которой глядел дрозд темного цвета с белыми
крапинками, очень похожий тоже на Собакевича. Гость и хозяин не успели
помолчать двух минут, как дверь в гостиной отворилась и вошла хозяйка,
дама весьма высокая, в чепце с лентами, перекрашенными домашнею
краскою. Вошла она степенно, держа голову прямо, как пальма.

— Это моя Феодулия Ивановна! — сказал Собакевич.

Чичиков подошел к ручке Феодулии Ивановны, которую она почти впихнула
ему в губы, причем он имел случай заметить, что руки были вымыты
огуречным рассолом.

— Душенька, рекомендую тебе, — продолжал Собакевич, — Павел Иванович
— Чичиков! У губернатора и почтмейстера имел честь познакомиться.

Феодулия Ивановна попросила садиться, сказавши тоже: «Прошу!» — и
сделав движение головою, подобно актрисам, представляющим королев.
Затем она уселась на диване, накрылась своим мериносовым платком и уже
не двигнула более ни глазом, ни бровью.

Чичиков опять поднял глаза вверх и опять увидел Канари с толстыми
ляжками и нескончаемыми усами, Бобелину и дрозда в клетке.

Почти в течение целых пяти минут все хранили молчание; раздавался
только стук, производимый носом дрозда о дерево деревянной клетки, на
дне которой удил он хлебные зернышки. Чичиков еще раз окинул комнату,
и все, что в ней ни было, — все было прочно, неуклюже в высочайшей
степени и имело какое-то странное сходство с самим хозяином дома; в
углу гостиной стояло пузатое ореховое бюро на пренелепых четырех
ногах, совершенный медведь. Стол, кресла, стулья — все было самого
тяжелого и беспокойного свойства, — словом, каждый предмет, каждый
стул, казалось, говорил: «И я тоже Собакевич!» или: «И я тоже очень
похож на Собакевича!»

— Мы об вас вспоминали у председателя палаты, у Ивана Григорьевича, —
— сказал наконец Чичиков, видя, что никто не располагается начинать
— разговора, — в прошедший четверг. Очень приятно провели там время.

— Да, я не был тогда у председателя, — отвечал Собакевич.

— А прекрасный человек!

— Кто такой? — сказал Собакевич, глядя на угол печи.

— Председатель.

— Ну, может быть, это вам так показалось: он только что масон, а такой
— дурак, какого свет не производил.

Чичиков немного озадачился таким отчасти резким определением, но
потом, поправившись, продолжал:

— Конечно, всякий человек не без слабостей, но зато губернатор какой
— превосходный человек!

— Губернатор превосходный человек?

— Да, не правда ли?

— Первый разбойник в мире!

— Как, губернатор разбойник? — сказал Чичиков и совершенно не мог
— понять, как губернатор мог попасть в разбойники. — Признаюсь, этого
— я бы никак не подумал, — продолжал он. — Но позвольте, однако же,
— заметить: поступки его совершенно не такие, напротив, скорее даже
— мягкости в нем много. — Тут он привел в доказательство даже
— кошельки, вышитые его собственными руками, и отозвался с похвалою об
— ласковом выражении лица его.

— И лицо разбойничье! — сказал Собакевич. — Дайте ему только нож да
— выпустите его на большую дорогу — зарежет, за копейку зарежет! Он да
— еще вице-губернатор — это Гога и Магога!

«Нет, он с ними не в ладах, — подумал про себя Чичиков. — А вот
«заговорю я с ним о полицеймейстере: он, кажется, друг его».

— Впрочем, что до меня, — сказал он, — мне, признаюсь, более всех
— нравится полицеймейстер. Какой-то этакой характер прямой, открытый;
— в лице видно что-то простосердечное.

— Мошенник! — сказал Собакевич очень хладнокровно, — продаст, обманет,
— еще и пообедает с вами! Я их знаю всех: это всё мошенники, весь
— город там такой: мошенник на мошеннике сидит и мошенником погоняет.
— Все христопродавцы. Один там только и есть порядочный человек:
— прокурор; да и тот, если сказать правду, свинья.

После таких похвальных, хотя несколько кратких биографий Чичиков
увидел, что о других чиновниках нечего упоминать и вспомнил, что
Собакевич не любил ни о ком хорошо отзываться.

— Что ж, душенька, пойдем обедать, — сказала Собакевичу его супруга.

— Прошу! — сказал Собакевич.

Засим, подошевши к столу, где была закуска, гость и хозяин выпили как
следует по рюмке водки, закусили, как закусывает вся пространная
Россия по городам и деревням, то есть всякими соленостями и иными
возбуждающими благодатями, и потекли все в столовую; впереди их, как
плавный гусь, понеслась хозяйка. Небольшой стол был накрыт на четыре
прибора. На четвертое место явилась очень скоро, трудно сказать
утвердительно, кто такая, дама или девица, родственница, домоводка или
просто проживающая в доме: что-то без чепца, около тридцати лет, в
пестром платке. Есть лица, которые существуют на свете не как предмет,
а как посторонние крапинки или пятнышки на предмете. Сидят они на том
же месте, одинаково держат голову, их почти готов принять за мебель и
думаешь, что отроду еще не выходило слово из таких уст; а где-нибудь в
девичьей или в кладовой окажется просто: ого-го!

— Щи, моя душа, сегодня очень хороши! — сказал Собакевич, хлебнувши
— щей и отваливши себе с блюда огромный кусок няни, известного блюда,
— которое подается к щам и состоит из бараньего желудка, начиненного
— гречневой кашей, мозгом и ножками. — Эдакой няни, — продолжал он,
— обратившись к Чичикову, — вы не будете есть в городе, там вам черт
— знает что подадут!

— У губернатора, однако ж, недурен стол, — сказал Чичиков.

— Да знаете ли, из чего это все готовится? вы есть не станете, когда
— узнаете.

— Не знаю, как приготовляется, об этом я не могу судить, но свиные
— котлеты и разварная рыба были превосходны.

— Это вам так показалось. Ведь я знаю, что они на рынке покупают.
— Купит вон тот каналья повар, что выучился у француза, кота, обдерет
— его, да и подает на стол вместо зайца.

— Фу! какую ты неприятность говоришь, — сказала супруга Собакевича.

— А что ж, душенька, так у них делается, я не виноват, так у них у
— всех делается. Все что ни есть ненужного, что Акулька у нас бросает,
— с позволения сказать, в помойную лохань, они его в суп! да в суп!
— туда его!

— Ты за столом всегда эдакое расскажешь! — возразила опять супруга
— Собакевича.

— Что ж, душа моя, — сказал Собакевич, — если б я сам это делал, но я
— тебе прямо в глаза скажу, что я гадостей не стану есть. Мне лягушку
— хоть сахаром облепи, не возьму ее в рот, и устрицы тоже не возьму: я
— знаю, на что устрица похожа. Возьмите барана, — продолжал он,
— обращаясь к Чичикову, — это бараний бок с кашей! Это не те фрикасе,
— что делаются на барских кухнях из баранины, какая суток по четыре на
— рынке валяется! Это все выдумали доктора немцы да французы, я бы их
— перевешал за это! Выдумали диету, лечить голодом! Что у них немецкая
— жидкостная натура, так они воображают, что и с русским желудком
— сладят! Нет, это все не то, это всё выдумки, это всё… — Здесь
— Собакевич даже сердито покачал головою. — Толкуют: просвещенье,
— просвещенье, а это просвещенье — фук! Сказал бы и другое слово, да
— вот только что за столом неприлично. У меня не так. У меня когда
— свинина — всю свинью давай на стол, баранина — всего барана тащи,
— гусь — всего гуся! Лучше я съем двух блюд, да съем в меру, как душа
— требует. — Собакевич подтвердил это делом: он опрокинул половину
— бараньего бока к себе на тарелку, съел все, обгрыз, обсосал до
— последней косточки.

«Да, — подумал Чичиков, — у этого губа не дура».

— У меня не так, — говорил Собакевич, вытирая салфеткою руки, — у меня
— не так, как у какого-нибудь Плюшкина: восемьсот душ имеет, а живет и
— обедает хуже моего пастуха!

— Кто такой этот Плюшкин? — спросил Чичиков.

— Мошенник, — отвечал Собакевич. — Такой скряга, какого вообразитъ
— трудно. В тюрьме колодники лучше живут, чем он: всех людей переморил
— голодом.

— Вправду! — подхватил с участием Чичиков. — И вы говорите, что у
— него, точно, люди умирают в большом количестве?

— Как мухи мрут.

— Неужели как мухи! А позвольте спросить, как далеко живет он от вас?

— В пяти верстах.

— В пяти верстах! — воскликнул Чичиков и даже почувствовал небольшое
— сердечное биение. — Но если выехать из ваших ворот, это будет
— направо или налево?

— Я вам даже не советую дороги знать к этой собаке! — сказал
— Собакевич. — Извинительней сходить в какое-нибудь непристойное
— место, чем к нему.

— Нет, я спросил не для каких-либо, а потому только, что интересуюсь
— познанием всякого рода мест, — отвечал на это Чичиков.

За бараньим боком последовали ватрушки, из которых каждая была гораздо
больше тарелки, потом индюк ростом в теленка, набитый всяким добром:
яйцами, рисом, печенками и невесть чем, что все ложилось комом в
желудке. Этим обед и кончился; но когда встали из-за стола, Чичиков
почувствовал в себе тяжести на целый пуд больше. Пошли в гостиную, где
уже очутилось на блюдечке варенье — ни груша, ни слива, ни иная ягода,
до которого, впрочем, не дотронулись ни гость, ни хозяин. Хозяйка
вышла, с тем чтобы накласть его и на другие блюдечки. Воспользовавшись
ее отсутствием, Чичиков обратился к Собакевичу, который, лежа в
креслах, только покряхтывал после такого сытного обеда и издавал ртом
какие-то невнятные звуки, крестясь и закрывая поминутно его рукою.
Чичиков обратился к нему с такими словами:

— Я хотел было поговорить с вами об одном дельце.

— Вот еще варенье, — сказала хозяйка, возвращаясь с блюдечком, —
— редька, варенная в меду!

— А вот мы его после! — сказал Собакевич. — Ты ступай теперь в свою
— комнату, мы с Павлом Ивановичем скинем фраки, маленько приотдохнем!

Хозяйка уже изъявила было готовность послать за пуховиками и
подушками, но хозяин сказал: «Ничего, мы отдохнем в креслах», — и
хозяйка ушла.

Собакевич слегка принагнул голову, приготовляясь слышать, в чем было
дельце.

Чичиков начал как-то очень отдаленно, коснулся вообще всего русского
государства и отозвался с большою похвалою об его пространстве,
сказал, что даже самая древняя римская монархия не была так велика, и
иностранцы справедливо удивляются… Собакевич все слушал, наклонивши
голову. И что по существующим положениям этого государства, в славе
которому нет равного, ревизские души, окончивши жизненное поприще,
числятся, однако ж, до подачи новой ревизской сказки наравне с живыми,
чтоб таким образом не обременить присутственные места множеством
мелочных и бесполезных справок и не увеличить сложность и без того уже
весьма сложного государственного механизма… Собакевич все слушал,
наклонивши голову, — и что, однако же, при всей справедливости этой
меры она бывает отчасти тягостна для многих владельцев, обязывая их
взносить подати так, как бы за живой предмет, и что он, чувствуя
уважение личное к нему, готов бы даже отчасти принять на себя эту
действительно тяжелую обязанность. Насчет главного предмета Чичиков
выразился очень осторожно: никак не назвал души умершими, а только
несуществующими.

Собакевич слушал все по-прежнему, нагнувши голову, и хоть бы что-
нибудь похожее на выражение показалось на лице его. Казалось, в этом
теле совсем не было души, или она у него была, но вовсе не там, где
следует, а, как у бессмертного кощея, где-то за горами и закрыта такою
толстою скорлупою, что все, что ни ворочалось на дне ее, не
производило решительно никакого потрясения на поверхности

— Итак?.. — сказал Чичиков, ожидая не без некоторого волнения ответа.

— Вам нужно мертвых душ? — спросил Собакевич очень просто, без
— малейшего удивления, как бы речь шла о хлебе.

— Да, — отвечал Чичиков и опять смягчил выражение, прибавивши: —
— несуществующих.

— Найдутся, почему не быть… — сказал Собакевич.

— А если найдутся, то вам, без сомнения… будет приятно от них
— избавиться?

— Извольте, я готов продать, — сказал Собакевич, уже несколько
— приподнявши голову и смекнувши, что покупщик, верно, должен иметь
— здесь какую-нибудь выгоду.

«Черт возьми, — подумал Чичиков про себя, — этот уж продает прежде,
«чем я заикнулся!» — и проговорил вслух:

— А, например, как же цена? хотя, впрочем, это такой предмет… что о
— цене даже странно…

— Да чтобы не запрашивать с вас лишнего, по сту рублей за штуку! —
— сказал Собакевич.

— По сту! — вскричал Чичиков, разинув рот и поглядевши ему в самые
— глаза, не зная, сам ли он ослышался, или язык Собакевича по своей
— тяжелой натуре, не так поворотившись, брякнул вместо одного другое
— слово.

— Что ж, разве это для вас дорого? — произнес Собакевич и потом
— прибавил: — А какая бы, однако ж, ваша цена?

— Моя цена! Мы, верно, как-нибудь ошиблись или не понимаем друг друга,
— позабыли, в чем состоит предмет. Я полагаю с своей стороны, положа
— на руку на сердце: по восьми гривен за душу, это самая красная ценз!

— Эк куда хватили — по восьми гривенок!

— Что ж, по моему суждению, как я думаю, больше нельзя.

— Ведь я продаю не лапти.

— Однако ж согласитесь сами: ведь это тоже и не люди.

— Так вы думаете, сыщете такого дурака, который бы вам продал по
— двугривенному ревизскую душу?

— Но позвольте: зачем вы их называете ревизскими, ведь души-то самые
— давно уже умерли, остался один неосязаемый чувствами звук. Впрочем,
— чтобы не входить в дальнейшие разговоры по этой части, по полтора
— рубли, извольте, дам, а больше не могу.

— Стыдно вам и говорить такую сумму! вы торгуйтесь, говорите настоящую
— цену!

— Не могу, Михаил Семенович, поверьте моей совести, не могу: чего уж
— невозможно сделать, того невозможно сделать, — говорил Чичиков,
— однако ж по полтинке еще прибавил.

— Да чего вы скупитесь? — сказал Собакевич. — Право, недорого! Другой
— мошенник обманет вас, продаст вам дрянь, а не души; а у меня что
— ядреный орех, все на отбор: не мастеровой, так иной какой-нибудь
— здоровый мужик. Вы рассмотрите: вот, например, каретник Михеев! ведь
— больше никаких экипажей и не делал, как только рессорные. И не то,
— как бывает московская работа, что на один час, — прочность такая,
— сам и обобьет, и лаком покроет!

Чичиков открыл рот, с тем чтобы заметить, что Михеева, однако же,
давно нет на свете; но Собакевич вошел, как говорится, в самую силу
речи, откуда взялась рысь и дар слова:

— А Пробка Степан, плотник? я голову прозакладую, если вы где сыщете
— такого мужика. Ведь что за силища была! Служи он в гвардии, ему бы
— бог знает что дали, трех аршин с вершком ростом!

Чичиков опять хотел заметить, что и Пробки нет на свете; но
Собакевича, как видно, пронесло: полились такие потоки речей, что
только нужно было слушать:

— Милушкин, кирпичник! мог поставить печь в каком угодно доме. Максим
— Телятников, сапожник: что шилом кольнет, то и сапоги, что сапоги, то
— и спасибо, и хоть бы в рот хмельного. А Еремей Сорокоплёхин! да этот
— мужик один станет за всех, в Москве торговал, одного оброку приносил
— по пятисот рублей. Ведь вот какой народ! Это не то, что вам продаст
— какой-нибудь Плюшкин.

— Но позвольте, — сказал наконец Чичиков, изумленный таким обильным
— наводнением речей, которым, казалось, и конца не было, — зачем вы
— исчисляете все их качества, ведь в них толку теперь нет никакого,
— ведь это все народ мертвый. Мертвым телом хоть забор подпирай,
— говорит пословица.

— Да, конечно, мертвые, — сказал Собакевич, как бы одумавшись и
— припомнив, что они в самом деле были уже мертвые, а потом прибавил:
— — Впрочем, и то сказать что из этих людей, которые числятся теперь
— живущими? Что это за люди? мухи, а не люди.

— Да все же они существуют, а это ведь мечта.

— Ну нет, не мечта! Я вам доложу, каков был Михеев, так вы таких людей
— не сыщете: машинища такая, что в эту комнату не войдет; нет, это не
— мечта! А в плечищах у него была такая силища, какой нет у лошади;
— хотел бы а знать, где бы вы в другом месте нашли такую мечту!

Последние слова он уже сказал, обратившись к висевшим на стене
портретам Багратиона и Колокотрони, как обыкновенно случается с
разговаривающими, когда один из них вдруг, неизвестно почему,
обратится не к тому лицу, к которому относятся слова, а к какому-
нибудь нечаянно пришедшему третьему, даже вовсе незнакомому, от
которого знает, что не услышит ни ответа, ни мнения, ни подтверждения,
но на которого, однако ж, так устремит взгляд, как будто призывает его
в посредники; и несколько смешавшийся в первую минуту незнакомец не
знает, отвечать ли ему на то дело, о котором ничего не слышал, или так
постоять, соблюдши надлежащее приличие, и потом уже уйти прочь.

— Нет, больше двух рублей я не могу дать, — сказал Чичиков.

— Извольте, чтоб не претендовали на меня, что дорого запрашиваю и не
— хочу сделать вам никакого одолжения, извольте — по семидесяти пяти
— рублей за душу, только ассигнациями, право только для знакомства!

«Что он в самом деле, — подумал про себя Чичиков, — за дурака, что ли,
«принимает меня?» — и прибавил потом вслух:

— Мне странно, право: кажется, между нами происходит какое-то
— театральное представление или комедия, иначе я не могу себе
— объяснить… Вы, кажется, человек довольно умный, владеете сведениями
— образованности. Ведь предмет просто фу-фу. Что ж он стоит? кому
— нужен?

— Да вот вы же покупаете, стало быть нужен.

Здесь Чичиков закусил губу и не нашелся, что отвечать. Он стал было
говорить про какие-то обстоятельства фамильные и семейственные, но
Собакевич отвечал просто:

— Мне не нужно знать, какие у вас отношения; я в дела фамильные не
— мешаюсь, это ваше дело. Вам понадобились души, я и продаю вам, и
— будете раскаиваться, что не купили.

— Два рублика, — сказал Чичиков.

— Эк, право, затвердила сорока Якова одно про всякого, как говорит
— пословица; как наладили на два, так не хотите с них и съехать. Вы
— давайте настоящую цену!

«Ну, уж черт его побери, — подумал про себя Чичиков, — по полтине ему
«прибавлю, собаке, на орехи!»

— Извольте, по полтине прибавлю.

— Ну, извольте, и я вам скажу тоже мое последнее слово: пятьдесят
— рублей! Право, убыток себе, дешевле нигде не купите такого хорошего
— народа!

«Экой кулак!» — сказал про себя Чичиков и потом продолжал вслух с
«некоторою досадою:

— Да что в самом деле… как будто точно сурьезное дело; да я в другом
— месте нипочем возьму. Еще мне всякий с охотой сбудет их, чтобы
— только поскорей избавиться. Дурак разве станет держать их при себе и
— платить за них подати!

— Но знаете ли, что такого рода покупки, я это говорю между нами, по
— дружбе, не всегда позволительны, и расскажи я или кто иной — такому
— человеку не будет никакой доверенности относительно контрактов или
— вступления в какие-нибудь выгодные обязательства.

«Вишь, куды метит, подлец!» — подумал Чичиков и тут же произнес с
«самым хладнокровным видом:

— Как вы себе хотите, я покупаю не для какой-либо надобности, как вы
— думаете, а так, по наклонности собственных мыслей. Два с полтиною не
— хотите — прощайте!

«Его не собьешь, неподатлив!» — подумал Собакевич.

— Ну, бог с вами, давайте по тридцати и берите их себе!

— Нет, я вижу, вы не хотите продать, прощайте!

— Позвольте, позвольте! — сказал Собакевич, не выпуская его руки и
— наступив ему на ногу, ибо герой наш позабыл поберечься, в наказанье
— за что должен был зашипеть и подскочить на одной ноге.

— Прошу прощенья! я, кажется, вас побеспокоил. Пожалуйте, садитесь
— сюда! Прошу! — Здесь он усадил его в кресла с некоторою даже
— ловкостию, как такой медведь, который уже побывал в руках, умеет и
— перевертываться, и делать разные штуки на вопросы: «А покажи, Миша,
— как бабы парятся» или: «А как, Миша, малые ребята горох крадут?»

— Право, я напрасно время трачу, мне нужно спешить.

— Посидите одну минуточку, я вам сейчас скажу одно приятное для вас
— слово. — Тут Собакевич подсел поближе и сказал ему тихо на ухо, как
— будто секрет: — Хотите угол?

— То есть двадцать пять рублей? Ни, ни, ни, даже четверти угла не дам,
— копейки не прибавлю.

Собакевич замолчал. Чичиков тоже замолчал. Минуты две длилось
молчание. Багратион с орлиным носом глядел со стены чрезвычайно
внимательно на эту покупку.

— Какая ж ваша будет последняя цена? — сказал наконец Собакевич.

— Два с полтиною.

— Право у вас душа человеческая все равно что пареная репа. Уж хоть по
— три рубли дайте!

— Не могу.

— Ну, нечего с вами делать, извольте! Убыток, да нрав такой собачий:
— не могу не доставить удовольствия ближнему. Ведь, я чай, нужно и
— купчую совершить, чтоб все было в порядке.

— Разумеется.

— Ну вот то-то же, нужно будет ехать в город.

Так совершилось дело. Оба решили, что завтра же быть в городе и
управиться с купчей крепостью. Чичиков попросил списочка крестьян.
Собакевич согласился охотно и тут же, подошед к бюро, собственноручно
принялся выписывать всех не только поименно, но даже с означением
похвальных качеств.

А Чичиков от нечего делать занялся, находясь позади рассматриваньем
всего просторного его оклада. Как взглянул он на его спину, широкую,
как у вятских приземистых лошадей, и на ноги его, походившие на
чугунные тумбы, которые ставят на тротуарах, не мог не воскликнуть
внутренно: «Эк наградил-то тебя бог! вот уж точно, как говорят,
неладно скроен, да крепко сшит!.. Родился ли ты уж так медведем, или
омедведила тебя захолустная жизнь, хлебные посевы, возня с мужиками, и
ты чрез них сделался то, что называют человек-кулак? Но нет: я думаю,
ты все был бы тот же, хотя бы даже воспитали тебя по моде, пустили бы
в ход и жил бы ты в Петербурге, а не в захолустье. Вся разница в том,
что теперь ты упишешь полбараньего бока с кашей, закусивши ватрушкою в
тарелку, а тогда бы ты ел какие-нибудь котлетки с трюфелями. Да вот
теперь у тебя под властью мужики: ты с ними в ладу и, конечно, их не
обидишь, потому что они твои, тебе же будет хуже; а тогда бы у тебя
были чиновники, которых бы ты сильно пощелкивал, смекнувши, что они не
твои же крепостные, или грабил бы ты казну! Нет, кто уж кулак, тому не
разогнуться в ладонь! А разогни кулаку один или два пальца, выдет еще
хуже. Попробуй он слегка верхушек какой-нибудь науки, даст он знать
потом, занявши место повиднее всем тем, которые в самом деле узнали
какую-нибудь науку. Да еще, пожалуй, скажет потом: „Дай-ка себя
покажу!“ Да такое выдумает мудрое постановление, что многим придется
солоно… Эх, если бы все кулаки!..»

— Готова записка, — сказал Собакевич, оборотившись.

— Готова? Пожалуйте ее сюда! — Он пробежал ее глазами и подивился
— аккуратности и точности: не только было обстоятельно прописано
— ремесло, звание, лета и семейное состояние, но даже на полях
— находились особенные отметки насчет поведения, трезвости, — словом,
— любо было глядеть.

— Теперь пожалуйте же задаточек, — сказал Собакевич.

— К чему же вам задаточек? Вы получите в городе за одним разом все
— деньги.

— Все, знаете, так уж водится, — возразил Собакевич.

— Не знаю, как вам дать, я не взял с собою денег. Да, вот десять
— рублей есть.

— Что же десять! Дайте по крайней мере хоть пятьдесят!

Чичиков стал было отговариваться, что нет; но Собакевич так сказал
утвердительно, что у него есть деньги, что он вынул еще бумажку,
сказавши:

— Пожалуй, вот вам еще пятнадцать, итого двадцать. Пожалуйте только
— расписку.

— Да на что ж вам расписка?

— Все, знаете, лучше расписку. Не ровен час, все может случиться.

— Хорошо, дайте же сюда деньги!

— На что ж деньги? У меня вот они в руке! как только напишете
— расписку, в ту же минуту

— Да позвольте, как же мне писать расписку? прежде нужно видеть
— деньги.

Чичиков выпустил из рук бумажки Собакевичу, который, приблизившись к
столу и накрывши их пальцами левой руки, другою написал на лоскутке
бумаги, что задаток двадцать пять рублей государственными ассигнациями
за проданные души получил сполна. Написавши записку, он пересмотрел
еще раз ассигнации.

— Бумажка-то старенькая! — произнес он, рассматривая одну из них на
— свете, — немножко разорвана, ну да между приятелями нечего на это
— глядеть.

«Кулак, кулак! — подумал про себя Чичиков, — да еще и бестия в
«придачу!»

— А женского пола не хотите?

— Нет, благодарю.

— Я бы недорого и взял. Для знакомства по рублику за штуку.

— Нет, в женском поле не нуждаюсь.

— Ну, когда не нуждаетесь, так нечего и говорить. На вкусы нет закона:
— кто любит попа, а кто попадью, говорит пословица.

— Еще я хотел вас попросить, чтобы эта сделка осталась между нами, —
— говорил Чичиков, прощаясь.

— Да уж само собою разумеется. Третьего сюда нечего мешать; что по
— искренности происходит между короткими друзьями, то должно остаться
— во взаимной их дружбе. Прощайте! Благодарю, что посетили; прошу и
— впредь не забывать: коли выберется свободный часик, приезжайте
— пообедать, время провести. Может быть, опять случится услужить чем-
— нибудь друг другу.

«Да, как бы не так! — думал про себя Чичиков, садясь. в бричку. — По
«два с полтиною содрал за мертвую душу, чертов кулак!»

Он был недоволен поведением Собакевича. Все-таки, как бы то ни было,
человек знакомый, и у губернатора, и у полицеймейстера видались, а
поступил как бы совершенно чужой, за дрянь взял деньги! Когда бричка
выехала со двора, он оглянулся назад и увидел, что Собакевич все еще
стоял на крыльце и, как казалось, приглядывался, желая знать, куда
гость поедет.

— Подлец, до сих пор еще стоит! — проговорил он сквозь зубы и велел
— Селифану, поворотивши к крестьянским избам, отъехать таким образом,
— чтобы нельзя было видеть экипажа со стороны господского двора. Ему
— хотелось заехать к Плюшкину, у которого, по словам Собакевича, люди
— умирали, как мухи, но не хотелось, чтобы Собакевич знал про это.
— Когда бричка была уже на конце деревни, он подозвал к себе первого
— мужика, который, попавши где-то на дороге претолстое бревно, тащил
— его на плече, подобно неутомимому муравью, к себе в избу.

— Эй, борода! а как проехать отсюда к Плюшкину, так чтоб не мимо
— господского дома?

Мужик, казалось, затруднился сим вопросом.

— Что ж, не знаешь?

— Нет, барин, не знаю.

— Эх, ты! А и седым волосом еще подернуло! скрягу Плюшкина не знаешь,
— того, что плохо кормит людей?

— А! заплатанной, заплатанной! — вскрикнул мужик.

Было им прибавлено и существительное к слову «заплатанной», очень
удачное, но неупотребительное в светском разговоре, а потому мы его
пропустим. Впрочем, можно догадываться, что оно выражено было очень
метко, потому что Чичиков, хотя мужик давно уже пропал из виду и много
уехали вперед, однако ж все еще усмехался, сидя в бричке. Выражается
сильно российский народ! и если наградит кого словцом, то пойдет оно
ему в род и потомство, утащит он его с собою и на службу, и в
отставку, и в Петербург, и на край света. И как уж потом ни хитри и ни
облагораживай свое прозвище, хоть заставь пишущих людишек выводить его
за наемную плату от древнекняжеского рода, ничто не поможет: каркнет
само за себя прозвище во все свое воронье горло и скажет ясно, откуда
вылетела птица. Произнесенное метко, все равно что писанное, не
вырубливается топором. А уж куды бывает метко все то, что вышло из
глубины Руси, где нет ни немецких, ни чухонских, ни всяких иных
племен, а всё сам-самородок, живой и бойкий русский ум, что не лезет
за словом в карман, не высиживает его, как наседка цыплят, а
влепливает сразу, как пашпорт на вечную носку, и нечего прибавлять уже
потом, какой у тебя нос или губы, — одной чертой обрисован ты с ног до
головы!

Как несметное множество церквей, монастырей с куполами, главами,
крестами, рассыпано на святой, благочестивой Руси, так несметное
множество племен, поколений, народов толпится, пестреет и мечется по
лицу земли. И всякий народ, носящий в себе залог сил, полный творящих
способностей души, своей яркой особенности и других даров нога,
своеобразно отличился каждый своим собственным словом, которым,
выражая какой ни есть предмет, отражает в выраженье его часть
собственного своего характера. Сердцеведением и мудрым познаньем жизни
отзовется слово британца; легким щеголем блеснет и разлетится
недолговечное слово француза; затейливо придумает свое, не всякому
доступное, умно-худощавое слово немец; но нет слова, которое было бы
так замашисто, бойко так вырвалось бы из-под самого сердца, так бы
кипело и животрепетало, как метко сказанное русское слово.

EOT;

    /*
    *** START: FULL LICENSE ***

    Creative Commons Legal Code

    Attribution-ShareAlike 3.0 Unported


    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE
    LEGAL SERVICES. DISTRIBUTION OF THIS LICENSE DOES NOT CREATE AN
    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS
    INFORMATION ON AN "AS-IS" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES
    REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR
    DAMAGES RESULTING FROM ITS USE. License

    THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS
    CREATIVE COMMONS PUBLIC LICENSE ("CCPL" OR "LICENSE"). THE WORK IS
    PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE
    WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS
    PROHIBITED.

    BY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND
    AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS
    LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU
    THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH
    TERMS AND CONDITIONS.

    1. Definitions

    "Adaptation" means a work based upon the Work, or upon the Work and
    other pre-existing works, such as a translation, adaptation,
    derivative work, arrangement of music or other alterations of a
    literary or artistic work, or phonogram or performance and includes
    cinematographic adaptations or any other form in which the Work may be
    recast, transformed, or adapted including in any form recognizably
    derived from the original, except that a work that constitutes a
    Collection will not be considered an Adaptation for the purpose of
    this License. For the avoidance of doubt, where the Work is a musical
    work, performance or phonogram, the synchronization of the Work in
    timed-relation with a moving image ("synching") will be considered an
    Adaptation for the purpose of this License. "Collection" means a
    collection of literary or artistic works, such as encyclopedias and
    anthologies, or performances, phonograms or broadcasts, or other works
    or subject matter other than works listed in Section 1(f) below,
    which, by reason of the selection and arrangement of their contents,
    constitute intellectual creations, in which the Work is included in
    its entirety in unmodified form along with one or more other
    contributions, each constituting separate and independent works in
    themselves, which together are assembled into a collective whole. A
    work that constitutes a Collection will not be considered an
    Adaptation (as defined below) for the purposes of this License.
    "Creative Commons Compatible License" means a license that is listed
    at http://creativecommons.org/compatiblelicenses that has been
    approved by Creative Commons as being essentially equivalent to this
    License, including, at a minimum, because that license: (i) contains
    terms that have the same purpose, meaning and effect as the License
    Elements of this License; and, (ii) explicitly permits the relicensing
    of adaptations of works made available under that license under this
    License or a Creative Commons jurisdiction license with the same
    License Elements as this License. "Distribute" means to make available
    to the public the original and copies of the Work or Adaptation, as
    appropriate, through sale or other transfer of ownership. "License
    Elements" means the following high-level license attributes as
    selected by Licensor and indicated in the title of this License:
    Attribution, ShareAlike. "Licensor" means the individual, individuals,
    entity or entities that offer(s) the Work under the terms of this
    License. "Original Author" means, in the case of a literary or
    artistic work, the individual, individuals, entity or entities who
    created the Work or if no individual or entity can be identified, the
    publisher; and in addition (i) in the case of a performance the
    actors, singers, musicians, dancers, and other persons who act, sing,
    deliver, declaim, play in, interpret or otherwise perform literary or
    artistic works or expressions of folklore; (ii) in the case of a
    phonogram the producer being the person or legal entity who first
    fixes the sounds of a performance or other sounds; and, (iii) in the
    case of broadcasts, the organization that transmits the broadcast.
    "Work" means the literary and/or artistic work offered under the terms
    of this License including without limitation any production in the
    literary, scientific and artistic domain, whatever may be the mode or
    form of its expression including digital form, such as a book,
    pamphlet and other writing; a lecture, address, sermon or other work
    of the same nature; a dramatic or dramatico-musical work; a
    choreographic work or entertainment in dumb show; a musical
    composition with or without words; a cinematographic work to which are
    assimilated works expressed by a process analogous to cinematography;
    a work of drawing, painting, architecture, sculpture, engraving or
    lithography; a photographic work to which are assimilated works
    expressed by a process analogous to photography; a work of applied
    art; an illustration, map, plan, sketch or three-dimensional work
    relative to geography, topography, architecture or science; a
    performance; a broadcast; a phonogram; a compilation of data to the
    extent it is protected as a copyrightable work; or a work performed by
    a variety or circus performer to the extent it is not otherwise
    considered a literary or artistic work. "You" means an individual or
    entity exercising rights under this License who has not previously
    violated the terms of this License with respect to the Work, or who
    has received express permission from the Licensor to exercise rights
    under this License despite a previous violation. "Publicly Perform"
    means to perform public recitations of the Work and to communicate to
    the public those public recitations, by any means or process,
    including by wire or wireless means or public digital performances; to
    make available to the public Works in such a way that members of the
    public may access these Works from a place and at a place individually
    chosen by them; to perform the Work to the public by any means or
    process and the communication to the public of the performances of the
    Work, including by public digital performance; to broadcast and
    rebroadcast the Work by any means including signs, sounds or images.
    "Reproduce" means to make copies of the Work by any means including
    without limitation by sound or visual recordings and the right of
    fixation and reproducing fixations of the Work, including storage of a
    protected performance or phonogram in digital form or other electronic
    medium. 2. Fair Dealing Rights. Nothing in this License is intended to
    reduce, limit, or restrict any uses free from copyright or rights
    arising from limitations or exceptions that are provided for in
    connection with the copyright protection under copyright law or other
    applicable laws.

    3. License Grant. Subject to the terms and conditions of this License,
    Licensor hereby grants You a worldwide, royalty-free, non-exclusive,
    perpetual (for the duration of the applicable copyright) license to
    exercise the rights in the Work as stated below:

    to Reproduce the Work, to incorporate the Work into one or more
    Collections, and to Reproduce the Work as incorporated in the
    Collections; to create and Reproduce Adaptations provided that any
    such Adaptation, including any translation in any medium, takes
    reasonable steps to clearly label, demarcate or otherwise identify
    that changes were made to the original Work. For example, a
    translation could be marked "The original work was translated from
    English to Spanish," or a modification could indicate "The original
    work has been modified."; to Distribute and Publicly Perform the Work
    including as incorporated in Collections; and, to Distribute and
    Publicly Perform Adaptations. For the avoidance of doubt:

    Non-waivable Compulsory License Schemes. In those jurisdictions in
    which the right to collect royalties through any statutory or
    compulsory licensing scheme cannot be waived, the Licensor reserves
    the exclusive right to collect such royalties for any exercise by You
    of the rights granted under this License; Waivable Compulsory License
    Schemes. In those jurisdictions in which the right to collect
    royalties through any statutory or compulsory licensing scheme can be
    waived, the Licensor waives the exclusive right to collect such
    royalties for any exercise by You of the rights granted under this
    License; and, Voluntary License Schemes. The Licensor waives the right
    to collect royalties, whether individually or, in the event that the
    Licensor is a member of a collecting society that administers
    voluntary licensing schemes, via that society, from any exercise by
    You of the rights granted under this License. The above rights may be
    exercised in all media and formats whether now known or hereafter
    devised. The above rights include the right to make such modifications
    as are technically necessary to exercise the rights in other media and
    formats. Subject to Section 8(f), all rights not expressly granted by
    Licensor are hereby reserved.

    4. Restrictions. The license granted in Section 3 above is expressly
    made subject to and limited by the following restrictions:

    You may Distribute or Publicly Perform the Work only under the terms
    of this License. You must include a copy of, or the Uniform Resource
    Identifier (URI) for, this License with every copy of the Work You
    Distribute or Publicly Perform. You may not offer or impose any terms
    on the Work that restrict the terms of this License or the ability of
    the recipient of the Work to exercise the rights granted to that
    recipient under the terms of the License. You may not sublicense the
    Work. You must keep intact all notices that refer to this License and
    to the disclaimer of warranties with every copy of the Work You
    Distribute or Publicly Perform. When You Distribute or Publicly
    Perform the Work, You may not impose any effective technological
    measures on the Work that restrict the ability of a recipient of the
    Work from You to exercise the rights granted to that recipient under
    the terms of the License. This Section 4(a) applies to the Work as
    incorporated in a Collection, but this does not require the Collection
    apart from the Work itself to be made subject to the terms of this
    License. If You create a Collection, upon notice from any Licensor You
    must, to the extent practicable, remove from the Collection any credit
    as required by Section 4(c), as requested. If You create an
    Adaptation, upon notice from any Licensor You must, to the extent
    practicable, remove from the Adaptation any credit as required by
    Section 4(c), as requested. You may Distribute or Publicly Perform an
    Adaptation only under the terms of: (i) this License; (ii) a later
    version of this License with the same License Elements as this
    License; (iii) a Creative Commons jurisdiction license (either this or
    a later license version) that contains the same License Elements as
    this License (e.g., Attribution-ShareAlike 3.0 US)); (iv) a Creative
    Commons Compatible License. If you license the Adaptation under one of
    the licenses mentioned in (iv), you must comply with the terms of that
    license. If you license the Adaptation under the terms of any of the
    licenses mentioned in (i), (ii) or (iii) (the "Applicable License"),
    you must comply with the terms of the Applicable License generally and
    the following provisions: (I) You must include a copy of, or the URI
    for, the Applicable License with every copy of each Adaptation You
    Distribute or Publicly Perform; (II) You may not offer or impose any
    terms on the Adaptation that restrict the terms of the Applicable
    License or the ability of the recipient of the Adaptation to exercise
    the rights granted to that recipient under the terms of the Applicable
    License; (III) You must keep intact all notices that refer to the
    Applicable License and to the disclaimer of warranties with every copy
    of the Work as included in the Adaptation You Distribute or Publicly
    Perform; (IV) when You Distribute or Publicly Perform the Adaptation,
    You may not impose any effective technological measures on the
    Adaptation that restrict the ability of a recipient of the Adaptation
    from You to exercise the rights granted to that recipient under the
    terms of the Applicable License. This Section 4(b) applies to the
    Adaptation as incorporated in a Collection, but this does not require
    the Collection apart from the Adaptation itself to be made subject to
    the terms of the Applicable License. If You Distribute, or Publicly
    Perform the Work or any Adaptations or Collections, You must, unless a
    request has been made pursuant to Section 4(a), keep intact all
    copyright notices for the Work and provide, reasonable to the medium
    or means You are utilizing: (i) the name of the Original Author (or
    pseudonym, if applicable) if supplied, and/or if the Original Author
    and/or Licensor designate another party or parties (e.g., a sponsor
    institute, publishing entity, journal) for attribution ("Attribution
    Parties") in Licensor's copyright notice, terms of service or by other
    reasonable means, the name of such party or parties; (ii) the title of
    the Work if supplied; (iii) to the extent reasonably practicable, the
    URI, if any, that Licensor specifies to be associated with the Work,
    unless such URI does not refer to the copyright notice or licensing
    information for the Work; and (iv) , consistent with Ssection 3(b), in
    the case of an Adaptation, a credit identifying the use of the Work in
    the Adaptation (e.g., "French translation of the Work by Original
    Author," or "Screenplay based on original Work by Original Author").
    The credit required by this Section 4(c) may be implemented in any
    reasonable manner; provided, however, that in the case of a Adaptation
    or Collection, at a minimum such credit will appear, if a credit for
    all contributing authors of the Adaptation or Collection appears, then
    as part of these credits and in a manner at least as prominent as the
    credits for the other contributing authors. For the avoidance of
    doubt, You may only use the credit required by this Section for the
    purpose of attribution in the manner set out above and, by exercising
    Your rights under this License, You may not implicitly or explicitly
    assert or imply any connection with, sponsorship or endorsement by the
    Original Author, Licensor and/or Attribution Parties, as appropriate,
    of You or Your use of the Work, without the separate, express prior
    written permission of the Original Author, Licensor and/or Attribution
    Parties. Except as otherwise agreed in writing by the Licensor or as
    may be otherwise permitted by applicable law, if You Reproduce,
    Distribute or Publicly Perform the Work either by itself or as part of
    any Adaptations or Collections, You must not distort, mutilate, modify
    or take other derogatory action in relation to the Work which would be
    prejudicial to the Original Author's honor or reputation. Licensor
    agrees that in those jurisdictions (e.g. Japan), in which any exercise
    of the right granted in Section 3(b) of this License (the right to
    make Adaptations) would be deemed to be a distortion, mutilation,
    modification or other derogatory action prejudicial to the Original
    Author's honor and reputation, the Licensor will waive or not assert,
    as appropriate, this Section, to the fullest extent permitted by the
    applicable national law, to enable You to reasonably exercise Your
    right under Section 3(b) of this License (right to make Adaptations)
    but not otherwise. 5. Representations, Warranties and Disclaimer

    UNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING,
    LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR
    WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED,
    STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF
    TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE,
    NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY,
    OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE.
    SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES,
    SO SUCH EXCLUSION MAY NOT APPLY TO YOU.

    6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY
    APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY
    LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR
    EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK,
    EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.

    7. Termination

    This License and the rights granted hereunder will terminate
    automatically upon any breach by You of the terms of this License.
    Individuals or entities who have received Adaptations or Collections
    from You under this License, however, will not have their licenses
    terminated provided such individuals or entities remain in full
    compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will
    survive any termination of this License. Subject to the above terms
    and conditions, the license granted here is perpetual (for the
    duration of the applicable copyright in the Work). Notwithstanding the
    above, Licensor reserves the right to release the Work under different
    license terms or to stop distributing the Work at any time; provided,
    however that any such election will not serve to withdraw this License
    (or any other license that has been, or is required to be, granted
    under the terms of this License), and this License will continue in
    full force and effect unless terminated as stated above. 8.
    Miscellaneous

    Each time You Distribute or Publicly Perform the Work or a Collection,
    the Licensor offers to the recipient a license to the Work on the same
    terms and conditions as the license granted to You under this License.
    Each time You Distribute or Publicly Perform an Adaptation, Licensor
    offers to the recipient a license to the original Work on the same
    terms and conditions as the license granted to You under this License.
    If any provision of this License is invalid or unenforceable under
    applicable law, it shall not affect the validity or enforceability of
    the remainder of the terms of this License, and without further action
    by the parties to this agreement, such provision shall be reformed to
    the minimum extent necessary to make such provision valid and
    enforceable. No term or provision of this License shall be deemed
    waived and no breach consented to unless such waiver or consent shall
    be in writing and signed by the party to be charged with such waiver
    or consent. This License constitutes the entire agreement between the
    parties with respect to the Work licensed here. There are no
    understandings, agreements or representations with respect to the Work
    not specified here. Licensor shall not be bound by any additional
    provisions that may appear in any communication from You. This License
    may not be modified without the mutual written agreement of the
    Licensor and You. The rights granted under, and the subject matter
    referenced, in this License were drafted utilizing the terminology of
    the Berne Convention for the Protection of Literary and Artistic Works
    (as amended on September 28, 1979), the Rome Convention of 1961, the
    WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms
    Treaty of 1996 and the Universal Copyright Convention (as revised on
    July 24, 1971). These rights and subject matter take effect in the
    relevant jurisdiction in which the License terms are sought to be
    enforced according to the corresponding provisions of the
    implementation of those treaty provisions in the applicable national
    law. If the standard suite of rights granted under applicable
    copyright law includes additional rights not granted under this
    License, such additional rights are deemed to be included in the
    License; this License is not intended to restrict the license of any
    rights under applicable law. Creative Commons Notice

    Creative Commons is not a party to this License, and makes no warranty
    whatsoever in connection with the Work. Creative Commons will not be
    liable to You or any party on any legal theory for any damages
    whatsoever, including without limitation any general, special,
    incidental or consequential damages arising in connection to this
    license. Notwithstanding the foregoing two (2) sentences, if Creative
    Commons has expressly identified itself as the Licensor hereunder, it
    shall have all rights and obligations of Licensor.

    Except for the limited purpose of indicating to the public that the
    Work is licensed under the CCPL, Creative Commons does not authorize
    the use by either party of the trademark "Creative Commons" or any
    related trademark or logo of Creative Commons without the prior
    written consent of Creative Commons. Any permitted use will be in
    compliance with Creative Commons' then-current trademark usage
    guidelines, as may be published on its website or otherwise made
    available upon request from time to time. For the avoidance of doubt,
    this trademark restriction does not form part of the License.

    Creative Commons may be contacted at http://creativecommons.org/.

    */
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      <?php

namespace Faker\Provider\sk_SK;

class Address extends \Faker\Provider\Address
{

    protected static $cityName = array(
        'Ábelová', 'Abovce', 'Abrahám', 'Abrahámovce', 'Abrahámovce', 'Abramová', 'Abranovce', 'Adamovské Kochanovce', 'Adidovce', 'Alekšince',
        'Andovce', 'Andrejová', 'Ardanovce', 'Ardovo', 'Arnutovce', 'Báb', 'Babie', 'Babín', 'Babiná', 'Babindol', 'Babinec', 'Bacúch', 'Bacúrov',
        'Báč', 'Bačka', 'Bačkov', 'Bačkovík', 'Bádice', 'Badín', 'Baďan', 'Báhoň', 'Bajany', 'Bajč', 'Bajerov', 'Bajerovce', 'Bajka', 'Bajtava',
        'Baka', 'Baláže', 'Baldovce', 'Balog nad Ipľom', 'Baloň', 'Banka', 'Bánov', 'Bánovce nad Bebravou', 'Bánovce nad Ondavou', 'Banská Belá',
        'Banská Bystrica', 'Banská Štiavnica', 'Banské', 'Banský Studenec', 'Baňa', 'Bara', 'Barca', 'Bardejov', 'Bardoňovo', 'Bartošova Lehôtka',
        'Bartošovce', 'Baška', 'Baškovce', 'Baškovce', 'Bašovce', 'Batizovce', 'Bátka', 'Bátorová', 'Bátorove Kosihy', 'Bátovce', 'Beckov',
        'Beharovce', 'Becherov', 'Belá', 'Belá', 'Belá-Dulice', 'Belá nad Cirochou', 'Beladice', 'Belejovce', 'Belín', 'Belina', 'Belince',
        'Bellova Ves', 'Beloveža', 'Beluj', 'Beluša', 'Belža', 'Beniakovce', 'Benice', 'Benkovce', 'Beňadiková', 'Beňadikovce', 'Beňadovo',
        'Beňatina', 'Beňuš', 'Bernolákovo', 'Bertotovce', 'Beša', 'Beša', 'Bešeňov', 'Bešeňová', 'Betlanovce', 'Betliar', 'Bežovce', 'Bidovce',
        'Biel', 'Bielovce', 'Biely Kostol', 'Bijacovce', 'Bílkove Humence', 'Bíňa', 'Bíňovce', 'Biskupice', 'Biskupová', 'Bitarová', 'Blahová',
        'Blatná na Ostrove', 'Blatná Polianka', 'Blatné', 'Blatné Remety', 'Blatné Revištia', 'Blatnica', 'Blažice', 'Blažovce', 'Blesovce',
        'Blhovce', 'Bobot', 'Bobrov', 'Bobrovček', 'Bobrovec', 'Bobrovník', 'Bočiar', 'Bodíky', 'Bodiná', 'Bodorová', 'Bodovce', 'Bodružal',
        'Bodza', 'Bodzianske Lúky', 'Bogliarka', 'Bohdanovce', 'Bohdanovce nad Trnavou', 'Boheľov', 'Bohunice', 'Bohunice', 'Bohúňovo', 'Bojná',
        'Bojnice', 'Bojničky', 'Boldog', 'Boleráz', 'Bolešov', 'Boliarov', 'Boľ', 'Boľkovce', 'Borcová', 'Borčany', 'Borčice', 'Borinka', 'Borová',
        'Borovce', 'Borský Mikuláš', 'Borský Svätý Jur', 'Borša', 'Bory', 'Bošáca', 'Bošany', 'Bottovo', 'Boťany', 'Bôrka', 'Bracovce', 'Branč',
        'Branovo', 'Bratislava', 'Braväcovo', 'Brdárka', 'Brehov', 'Brehy', 'Brekov', 'Brestov', 'Brestov', 'Brestov nad Laborcom', 'Brestovany',
        'Brestovec', 'Brestovec', 'Bretejovce', 'Bretka', 'Breza', 'Brezany', 'Brezina', 'Breziny', 'Breznica', 'Breznička', 'Breznička', 'Brezno',
        'Brezolupy', 'Brezov', 'Brezová pod Bradlom', 'Brezovec', 'Brezovica', 'Brezovica', 'Brezovička', 'Brezovka', 'Brežany', 'Brhlovce',
        'Brieštie', 'Brodské', 'Brodzany', 'Brunovce', 'Brusnica', 'Brusník', 'Brusno', 'Brutovce', 'Bruty', 'Brvnište', 'Brzotín', 'Buclovany',
        'Búč', 'Bučany', 'Budča', 'Budikovany', 'Budimír', 'Budiná', 'Budince', 'Budiš', 'Budkovce', 'Budmerice', 'Buglovce', 'Buková', 'Bukovce',
        'Bukovec', 'Bukovec', 'Bukovina', 'Bulhary', 'Bunetice', 'Bunkovce', 'Bušince', 'Bušovce', 'Buzica', 'Buzitka', 'Bystrá', 'Bystrá',
        'Bystrany', 'Bystré', 'Bystričany', 'Bystrička', 'Byšta', 'Bytča', 'Bzenica', 'Bzenov', 'Bzince pod Javorinou', 'Bziny', 'Bzovík',
        'Bzovská Lehôtka', 'Bžany', 'Cabaj-Čápor', 'Cabov', 'Cakov', 'Cejkov', 'Cernina', 'Cerová', 'Cerovo', 'Cestice', 'Cífer', 'Cigeľ',
        'Cigeľka', 'Cigla', 'Cimenná', 'Cinobaňa', 'Čab', 'Čabalovce', 'Čabiny', 'Čabradský Vrbovok', 'Čadca', 'Čachtice', 'Čajkov', 'Čaka',
        'Čakajovce', 'Čakanovce', 'Čakanovce', 'Čakany', 'Čaklov', 'Čalovec', 'Čamovce', 'Čaňa', 'Čaradice', 'Čáry', 'Častá', 'Častkov',
        'Častkovce', 'Čata', 'Čataj', 'Čavoj', 'Čebovce', 'Čečehov', 'Čečejovce', 'Čechy', 'Čechynce', 'Čekovce', 'Čeláre', 'Čelkova Lehota',
        'Čelovce', 'Čelovce', 'Čeľadice', 'Čeľadince', 'Čeľovce', 'Čenkovce', 'Čerenčany', 'Čereňany', 'Čerhov', 'Čerín', 'Čermany', 'Černík',
        'Černina', 'Černochov', 'Čertižné', 'Červená Voda', 'Červenica', 'Červenica pri Sabinove', 'Červeník', 'Červený Hrádok', 'Červený Kameň',
        'Červený Kláštor', 'Červeňany', 'České Brezovo', 'Čičarovce', 'Čičava', 'Čičmany', 'Číčov', 'Čierna', 'Čierna Lehota', 'Čierna Lehota',
        'Čierna nad Tisou', 'Čierna Voda', 'Čierne', 'Čierne Kľačany', 'Čierne nad Topľou', 'Čierne Pole', 'Čierny Balog', 'Čierny Brod',
        'Čierny Potok', 'Čifáre', 'Čiližská Radvaň', 'Čimhová', 'Čirč', 'Číž', 'Čižatice', 'Čoltovo', 'Čremošné', 'Čučma', 'Čukalovce',
        'Dačov Lom', 'Daletice', 'Danišovce', 'Dargov', 'Davidov', 'Debraď', 'Dedačov', 'Dedina Mládeže', 'Dedinka', 'Dedinky', 'Dechtice',
        'Dekýš', 'Demandice', 'Demänovská Dolina', 'Demjata', 'Detrík', 'Detva', 'Detvianska Huta', 'Devičany', 'Devičie', 'Dežerice',
        'Diaková', 'Diakovce', 'Diviacka Nová Ves', 'Diviaky nad Nitricou', 'Divín', 'Divina', 'Divinka', 'Dlhá', 'Dlhá nad Kysucou',
        'Dlhá nad Oravou', 'Dlhá nad Váhom', 'Dlhá Ves', 'Dlhé Klčovo', 'Dlhé nad Cirochou', 'Dlhé Pole', 'Dlhé Stráže', 'Dlhoňa', 'Dlžín',
        'Dobrá', 'Dobrá Niva', 'Dobrá Voda', 'Dobroč', 'Dobrohošť', 'Dobroslava', 'Dobšiná', 'Dohňany', 'Dojč', 'Dolinka', 'Dolná Breznica',
        'Dolná Krupá', 'Dolná Lehota', 'Dolná Mariková', 'Dolná Mičiná', 'Dolná Poruba', 'Dolná Seč', 'Dolná Streda', 'Dolná Strehová',
        'Dolná Súča', 'Dolná Tižina', 'Dolná Trnávka', 'Dolná Ves', 'Dolná Ždaňa', 'Dolné Dubové', 'Dolné Kočkovce', 'Dolné Lefantovce',
        'Dolné Lovčice', 'Dolné Mladonice', 'Dolné Naštice', 'Dolné Obdokovce', 'Dolné Orešany', 'Dolné Otrokovce', 'Dolné Plachtince',
        'Dolné Saliby', 'Dolné Semerovce', 'Dolné Srnie', 'Dolné Strháre', 'Dolné Trhovište', 'Dolné Vestenice', 'Dolné Zahorany',
        'Dolné Zelenice', 'Dolný Badín', 'Dolný Bar', 'Dolný Harmanec', 'Dolný Hričov', 'Dolný Chotár', 'Dolný Kalník', 'Dolný Kubín',
        'Dolný Lieskov', 'Dolný Lopašov', 'Dolný Ohaj', 'Dolný Pial', 'Dolný Štál', 'Dolný Vadičov', 'Doľany', 'Doľany', 'Domadice',
        'Domaníky', 'Domaniža', 'Domaňovce', 'Donovaly', 'Drábsko', 'Drahňov', 'Drahovce', 'Dravce', 'Dražice', 'Dražkovce', 'Drážovce',
        'Drienčany', 'Drienica', 'Drienov', 'Drienovec', 'Drienovo', 'Drienovská Nová Ves', 'Drietoma', 'Drnava', 'Drňa', 'Družstevná pri Hornáde',
        'Drženice', 'Držkovce', 'Dubinné', 'Dubnica nad Váhom', 'Dubnička', 'Dubník', 'Dubno', 'Dubodiel', 'Dubová', 'Dubová', 'Dubovany',
        'Dubovce', 'Dubové', 'Dubové', 'Dubovec', 'Dubovica', 'Dúbrava', 'Dúbrava', 'Dúbrava', 'Dúbravica', 'Dúbravka', 'Dúbravy', 'Ducové',
        'Dudince', 'Dukovce', 'Dulov', 'Dulova Ves', 'Dulovce', 'Dulovo', 'Dunajská Lužná', 'Dunajov', 'Dunajská Streda', 'Dunajský Klátov',
        'Duplín', 'Dvorany nad Nitrou', 'Dvorec', 'Dvorianky', 'Dvorníky', 'Dvorníky-Včeláre', 'Dvory nad Žitavou', 'Ďačov', 'Ďanová',
        'Ďapalovce', 'Ďubákovo', 'Ďurčiná', 'Ďurďoš', 'Ďurďošík', 'Ďurďové', 'Ďurkov', 'Ďurková', 'Ďurkovce', 'Egreš', 'Fačkov', 'Falkušovce',
        'Farná', 'Fekišovce', 'Figa', 'Fijaš', 'Fiľakovo', 'Fiľakovské Kováče', 'Fintice', 'Folkušová', 'Forbasy', 'Frička', 'Fričkovce',
        'Fričovce', 'Fulianka', 'Gabčíkovo', 'Gaboltov', 'Gajary', 'Galanta', 'Galovany', 'Gánovce', 'Gáň', 'Gbelce', 'Gbely', 'Gbeľany',
        'Geča', 'Gelnica', 'Gemer', 'Gemerček', 'Gemerská Hôrka', 'Gemerská Panica', 'Gemerská Poloma', 'Gemerská Ves', 'Gemerské Dechtáre',
        'Gemerské Michalovce', 'Gemerské Teplice', 'Gemerský Jablonec', 'Gemerský Sad', 'Geraltov', 'Gerlachov', 'Gerlachov', 'Giglovce',
        'Giraltovce', 'Girovce', 'Glabušovce', 'Gočaltovo', 'Gočovo', 'Golianovo', 'Gortva', 'Gôtovany', 'Granč-Petrovce', 'Gregorova Vieska',
        'Gregorovce', 'Gribov', 'Gruzovce', 'Gyňov', 'Habovka', 'Habura', 'Hačava', 'Háj', 'Háj', 'Hajná Nová Ves', 'Hajnáčka', 'Hájske',
        'Hajtovka', 'Haláčovce', 'Halič', 'Haligovce', 'Haluzice', 'Hamuliakovo', 'Handlová', 'Hanigovce', 'Haniska', 'Haniska', 'Hanková',
        'Hankovce', 'Hankovce', 'Hanušovce nad Topľou', 'Harakovce', 'Harhaj', 'Harichovce', 'Harmanec', 'Hatalov', 'Hatné', 'Havaj', 'Havka',
        'Havranec', 'Hažín', 'Hažín nad Cirochou', 'Hažlín', 'Helcmanovce', 'Heľpa', 'Henckovce', 'Henclová', 'Hencovce', 'Hendrichovce',
        'Herľany', 'Hermanovce', 'Hermanovce nad Topľou', 'Hertník', 'Hervartov', 'Hiadeľ', 'Hincovce', 'Hladovka', 'Hlboké', 'Hlboké nad Váhom',
        'Hliník nad Hronom', 'Hlinné', 'Hlivištia', 'Hlohovec', 'Hniezdne', 'Hnilčík', 'Hnilec', 'Hnojné', 'Hnúšťa', 'Hodejov', 'Hodejovec',
        'Hodkovce', 'Hodruša-Hámre', 'Hokovce', 'Holčíkovce', 'Holiare', 'Holice', 'Holíč', 'Holiša', 'Holumnica', 'Honce', 'Hontianska Vrbica',
        'Hontianske Moravce', 'Hontianske Nemce', 'Hontianske Tesáre', 'Hontianske Trsťany', 'Horná Breznica', 'Horná Kráľová', 'Horná Krupá',
        'Horná Lehota', 'Horná Lehota', 'Horná Mariková', 'Horná Mičiná', 'Horná Poruba', 'Horná Potôň', 'Horná Seč', 'Horná Streda',
        'Horná Strehová', 'Horná Súča', 'Horná Štubňa', 'Horná Ves', 'Horná Ves', 'Horná Ždaňa', 'Horné Dubové', 'Horné Hámre', 'Horné Chlebany',
        'Horné Lefantovce', 'Horné Mladonice', 'Horné Mýto', 'Horné Naštice', 'Horné Obdokovce', 'Horné Orešany', 'Horné Otrokovce',
        'Horné Plachtince', 'Horné Pršany', 'Horné Saliby', 'Horné Semerovce', 'Horné Srnie', 'Horné Strháre', 'Horné Štitáre', 'Horné Trhovište',
        'Horné Turovce', 'Horné Vestenice', 'Horné Zahorany', 'Horné Zelenice', 'Horný Badín', 'Horný Bar', 'Horný Hričov', 'Horný Kalník',
        'Horný Lieskov', 'Horný Pial', 'Horný Tisovník', 'Horný Vadičov', 'Horňa', 'Horňany', 'Horovce', 'Horovce', 'Hoste', 'Hostice',
        'Hostie', 'Hostišovce', 'Hostovice', 'Hosťová', 'Hosťovce', 'Hosťovce', 'Hozelec', 'Hôrka', 'Hôrka nad Váhom', 'Hôrky', 'Hrabičov',
        'Hrabkov', 'Hrabová Roztoka', 'Hrabovčík', 'Hrabovec', 'Hrabovec nad Laborcom', 'Hrabovka', 'Hrabské', 'Hrabušice', 'Hradisko',
        'Hradište', 'Hradište', 'Hradište pod Vrátnom', 'Hrádok', 'Hrachovište', 'Hrachovo', 'Hraničné', 'Hranovnica', 'Hraň', 'Hrašné',
        'Hrašovík', 'Hrčeľ', 'Hrhov', 'Hriadky', 'Hričovské Podhradie', 'Hriňová', 'Hrišovce', 'Hrkovce', 'Hrlica', 'Hrnčiarovce nad Parnou',
        'Hrnčiarska Ves', 'Hrnčiarske Zalužany', 'Hrochoť', 'Hromoš', 'Hronec', 'Hronovce', 'Hronsek', 'Hronská Breznica', 'Hronská Dúbrava',
        'Hronské Kľačany', 'Hronské Kosihy', 'Hronský Beňadik', 'Hrubá Borša', 'Hruboňovo', 'Hrubov', 'Hrubý Šúr', 'Hrušov', 'Hrušov',
        'Hrušovany', 'Hrušovo', 'Hruštín', 'Hubice', 'Hubina', 'Hubošovce', 'Hubová', 'Hubovo', 'Hucín', 'Hudcovce', 'Hul', 'Humenné',
        'Huncovce', 'Hunkovce', 'Hurbanova Ves', 'Hurbanovo', 'Husák', 'Husiná', 'Hutka', 'Huty', 'Hviezdoslavov', 'Hvozdnica', 'Hybe',
        'Hýľov', 'Chanava', 'Chlebnice', 'Chlmec', 'Chľaba', 'Chmeľnica', 'Chmeľov', 'Chmeľová', 'Chmeľovec', 'Chminianska Nová Ves',
        'Chminianske Jakubovany', 'Chmiňany', 'Choča', 'Chocholná-Velčice', 'Choňkovce', 'Chorvátsky Grob', 'Chorváty', 'Chotča', 'Chotín',
        'Chrabrany', 'Chrámec', 'Chrastince', 'Chrastné', 'Chrasť nad Hornádom', 'Chrenovec-Brusno', 'Chropov', 'Chrťany', 'Chtelnica',
        'Chudá Lehota', 'Chvalová', 'Chvojnica', 'Chvojnica', 'Chynorany', 'Chyžné', 'Igram', 'Ihľany', 'Ihráč', 'Ilava', 'Iliašovce', 'Ilija',
        'Imeľ', 'Inovce', 'Iňa', 'Iňačovce', 'Ipeľské Predmostie', 'Ipeľské Úľany', 'Ipeľský Sokolec', 'Istebné', 'Ivachnová', 'Ivančiná',
        'Ivanice', 'Ivanka pri Dunaji', 'Ivanka pri Nitre', 'Ivanovce', 'Iža', 'Ižipovce', 'Ižkovce', 'Jablonec', 'Jablonica', 'Jablonka',
        'Jablonov', 'Jablonov nad Turňou', 'Jablonové', 'Jablonové', 'Jabloň', 'Jabloňovce', 'Jacovce', 'Jahodná', 'Jaklovce', 'Jakovany',
        'Jakubany', 'Jakubov', 'Jakubova Voľa', 'Jakubovany', 'Jakubovany', 'Jakušovce', 'Jalová', 'Jalovec', 'Jalovec', 'Jalšové', 'Jalšovík',
        'Jamník', 'Jamník', 'Janice', 'Janík', 'Janíky', 'Jankovce', 'Janov', 'Janova Lehota', 'Janovce', 'Jánovce', 'Jánovce', 'Janovík',
        'Jarabá', 'Jarabina', 'Jarok', 'Jarovnice', 'Jasenica', 'Jasenie', 'Jasenov', 'Jasenov', 'Jasenová', 'Jasenovce', 'Jasenové', 'Jasenovo',
        'Jaslovské Bohunice', 'Jasov', 'Jasová', 'Jastrabá', 'Jastrabie nad Topľou', 'Jastrabie pri Michalovciach', 'Jatov', 'Javorina',
        'Jazernica', 'Jedlinka', 'Jedľové Kostoľany', 'Jelenec', 'Jelka', 'Jelšava', 'Jelšovce', 'Jelšovec', 'Jenkovce', 'Jesenské', 'Jesenské',
        'Jestice', 'Ješkova Ves', 'Jezersko', 'Jovice', 'Jovsa', 'Jur nad Hronom', 'Jurkova Voľa', 'Jurová', 'Jurské', 'Juskova Voľa', 'Kačanov',
        'Kajal', 'Kalameny', 'Kalinkovo', 'Kalinov', 'Kalinovo', 'Kalná nad Hronom', 'Kalná Roztoka', 'Kálnica', 'Kalnište', 'Kalonda', 'Kalša',
        'Kaloša', 'Kaluža', 'Kaľamenová', 'Kaľava', 'Kamanová', 'Kamenec pod Vtáčnikom', 'Kamenica', 'Kamenica nad Cirochou', 'Kamenica nad Hronom',
        'Kameničany', 'Kameničná', 'Kamenín', 'Kamenná Poruba', 'Kamenná Poruba', 'Kamenné Kosihy', 'Kamenný Most', 'Kameňany', 'Kamienka',
        'Kamienka', 'Kanianka', 'Kapince', 'Kapišová', 'Kaplna', 'Kapušany', 'Kapušianske Kľačany', 'Karlová', 'Karná', 'Kašov', 'Kátlovce',
        'Kátov', 'Kazimír', 'Kecerovce', 'Kecerovský Lipovec', 'Kečkovce', 'Kečovo', 'Kechnec', 'Kendice', 'Kesovce', 'Keť', 'Kežmarok', 'Kiarov',
        'Kladzany', 'Klasov', 'Kláštor pod Znievom', 'Klátova Nová Ves', 'Klčov', 'Klenov', 'Klenová', 'Klenovec', 'Kleňany', 'Klieština', 'Klin',
        'Klin nad Bodrogom', 'Klížska Nemá', 'Klokoč', 'Klokočov', 'Klokočov', 'Klubina', 'Kluknava', 'Kľačany', 'Kľače', 'Kľačno', 'Kľak',
        'Kľúčovec', 'Kľušov', 'Kmeťovo', 'Kobeliarovo', 'Kobylnice', 'Kobyly', 'Koceľovce', 'Kociha', 'Kocurany', 'Kočín-Lančár', 'Kočovce',
        'Kochanovce', 'Kochanovce', 'Kojatice', 'Kojšov', 'Kokava nad Rimavicou', 'Kokošovce', 'Kokšov-Bakša', 'Kolačkov', 'Kolačno', 'Koláre',
        'Kolárovice', 'Kolárovo', 'Kolbasov', 'Kolbovce', 'Kolibabovce', 'Kolinovce', 'Kolíňany', 'Kolonica', 'Kolta', 'Komárany', 'Komárno',
        'Komárov', 'Komárovce', 'Komjatice', 'Komjatná', 'Komoča', 'Koniarovce', 'Konrádovce', 'Konská', 'Konská', 'Koňuš', 'Kopčany', 'Kopernica',
        'Koplotovce', 'Koprivnica', 'Kordíky', 'Korejovce', 'Korňa', 'Koromľa', 'Korunková', 'Korytárky', 'Korytné', 'Kosihovce',
        'Kosihy nad Ipľom', 'Kosorín', 'Kostolec', 'Kostolište', 'Kostolná pri Dunaji', 'Kostolná Ves', 'Kostolná-Záriečie', 'Kostolné',
        'Kostolné Kračany', 'Kostoľany nad Hornádom', 'Kostoľany pod Tribečom', 'Koš', 'Košariská', 'Košarovce', 'Košeca', 'Košecké Podhradie',
        'Košice', 'Košická Belá', 'Košická Polianka', 'Košické Oľšany', 'Košický Klečenov', 'Koškovce', 'Košolná', 'Košúty', 'Košťany nad Turcom',
        'Kotešová', 'Kotmanová', 'Kotrčiná Lúčka', 'Kováčová', 'Kováčová', 'Kováčovce', 'Koválov', 'Koválovec', 'Kovarce', 'Kozárovce', 'Kozelník',
        'Kozí Vrbovok', 'Kožany', 'Kožuchov', 'Kožuchovce', 'Kračúnovce', 'Krahule', 'Krajná Bystrá', 'Krajná Poľana', 'Krajná Porúbka', 'Krajné',
        'Krajné Čierno', 'Krakovany', 'Králiky', 'Kráľ', 'Kráľov Brod', 'Kráľova Lehota', 'Kráľová nad Váhom', 'Kráľová pri Senci', 'Kraľovany',
        'Kráľovce', 'Kráľovce-Krnišov', 'Kráľovičove Kračany', 'Kráľovský Chlmec', 'Kraskovo', 'Krásna Lúka', 'Krásna Ves', 'Krásno',
        'Krásno nad Kysucou', 'Krásnohorská Dlhá Lúka', 'Krásnohorské Podhradie', 'Krásnovce', 'Krásny Brod', 'Krasňany', 'Kravany', 'Kravany',
        'Kravany nad Dunajom', 'Krčava', 'Kremná', 'Kremnica', 'Kremnické Bane', 'Kristy', 'Krišľovce', 'Krišovská Liesková', 'Krivá', 'Krivany',
        'Kriváň', 'Krivé', 'Krivoklát', 'Krivosúd-Bodovka', 'Kríže', 'Krížová Ves', 'Krížovany', 'Križovany nad Dudváhom', 'Krná', 'Krnča',
        'Krokava', 'Krompachy', 'Krpeľany', 'Krškany', 'Krtovce', 'Kručov', 'Krupina', 'Krušetnica', 'Krušinec', 'Krušovce', 'Kružlov', 'Kružlová',
        'Kružná', 'Kružno', 'Kšinná', 'Kubáňovo', 'Kučín', 'Kučín', 'Kuchyňa', 'Kuklov', 'Kuková', 'Kukučínov', 'Kunerad', 'Kunešov',
        'Kunova Teplica', 'Kuraľany', 'Kurima', 'Kurimany', 'Kurimka', 'Kurov', 'Kusín', 'Kútniky', 'Kúty', 'Kuzmice', 'Kuzmice', 'Kvačany',
        'Kvačany', 'Kvakovce', 'Kvašov', 'Kvetoslavov', 'Kyjatice', 'Kyjov', 'Kynceľová', 'Kysak', 'Kyselica', 'Kysta', 'Kysucké Nové Mesto',
        'Kysucký Lieskovec', 'Láb', 'Lackov', 'Lacková', 'Lackovce', 'Lada', 'Ladce', 'Ladice', 'Ladmovce', 'Ladomerská Vieska', 'Ladomirov',
        'Ladomirová', 'Ladzany', 'Lakšárska Nová Ves', 'Lascov', 'Laskár', 'Lastomír', 'Lastovce', 'Laškovce', 'Látky', 'Lazany', 'Lazisko',
        'Lazy pod Makytou', 'Lažany', 'Lednica', 'Lednické Rovne', 'Legnava', 'Lehnice', 'Lehota', 'Lehota nad Rimavicou', 'Lehota pod Vtáčnikom',
        'Lehôtka', 'Lehôtka pod Brehmi', 'Lechnica', 'Lekárovce', 'Leles', 'Leľa', 'Lemešany', 'Lenartov', 'Lenartovce', 'Lendak', 'Lenka',
        'Lentvora', 'Leopoldov', 'Lesenice', 'Lesíček', 'Lesné', 'Lesnica', 'Leštiny', 'Lešť (vojenský obvod)', 'Letanovce', 'Letničie',
        'Leváre', 'Levice', 'Levkuška', 'Levoča', 'Ležiachov', 'Libichava', 'Licince', 'Ličartovce', 'Liesek', 'Lieskovany', 'Lieskovec',
        'Lieskovec', 'Liešno', 'Liešťany', 'Lietava', 'Lietavská Lúčka', 'Lietavská Svinná-Babkov', 'Likavka', 'Limbach', 'Lipany', 'Lipník',
        'Lipníky', 'Lipová', 'Lipová', 'Lipovany', 'Lipovce', 'Lipové', 'Lipovec', 'Lipovec', 'Lipovník', 'Lipovník', 'Liptovská Anna',
        'Liptovská Kokava', 'Liptovská Lúžna', 'Liptovská Osada', 'Liptovská Porúbka', 'Liptovská Sielnica', 'Liptovská Štiavnica',
        'Liptovská Teplá', 'Liptovská Teplička', 'Liptovské Beharovce', 'Liptovské Kľačany', 'Liptovské Matiašovce', 'Liptovské Revúce',
        'Liptovské Sliače', 'Liptovský Hrádok', 'Liptovský Ján', 'Liptovský Michal', 'Liptovský Mikuláš', 'Liptovský Ondrej', 'Liptovský Peter',
        'Liptovský Trnovec', 'Lisková', 'Lišov', 'Litava', 'Litmanová', 'Livina', 'Livinské Opatovce', 'Livov', 'Livovská Huta', 'Lodno',
        'Lok', 'Lokca', 'Lom nad Rimavicou', 'Lomná', 'Lomné', 'Lomnička', 'Lontov', 'Lopašov', 'Lopúchov', 'Lopušné Pažite', 'Lošonec',
        'Lovce', 'Lovča', 'Lovčica-Trubín', 'Lovinobaňa', 'Lozorno', 'Ložín', 'Lubeník', 'Lubina', 'Lúč na Ostrove', 'Lučatín', 'Lučenec',
        'Lúčina', 'Lučivná', 'Lúčka', 'Lúčka', 'Lúčka', 'Lúčka', 'Lúčky', 'Lúčky', 'Lúčky', 'Lúčnica nad Žitavou', 'Ludanice', 'Ludrová',
        'Luhyňa', 'Lúka', 'Lukačovce', 'Lukáčovce', 'Lukavica', 'Lukavica', 'Lukov', 'Lukovištia', 'Lúky', 'Lula', 'Lupoč', 'Lutila', 'Lutiše',
        'Lužany', 'Lužany pri Topli', 'Lužianky', 'Lysá pod Makytou', 'Lysica', 'Ľubá', 'Ľubela', 'Ľubica', 'Ľubietová', 'Ľubiša', 'Ľubochňa',
        'Ľuboreč', 'Ľuboriečka', 'Ľubotice', 'Ľubotín', 'Ľubovec', 'Ľudovítová', 'Ľutina', 'Ľutov', 'Macov', 'Mad', 'Madunice', 'Magnezitovce',
        'Machulince', 'Majcichov', 'Majere', 'Majerovce', 'Makov', 'Makovce', 'Malá Čalomija', 'Malá Čausa', 'Malá Čierna', 'Malá Domaša',
        'Malá Franková', 'Malá Hradná', 'Malá Ida', 'Malá Lehota', 'Malá Lodina', 'Malá Mača', 'Malá nad Hronom', 'Malá Poľana', 'Malá Tŕňa',
        'Malacky', 'Malachov', 'Málaš', 'Malatiná', 'Malatíny', 'Malcov', 'Malčice', 'Malé Borové', 'Malé Dvorníky', 'Malé Chyndice',
        'Malé Hoste', 'Malé Kosihy', 'Malé Kozmálovce', 'Malé Kršteňany', 'Malé Lednice', 'Malé Leváre', 'Malé Ludince', 'Malé Ozorovce',
        'Malé Raškovce', 'Malé Ripňany', 'Malé Straciny', 'Malé Trakany', 'Malé Uherce', 'Malé Vozokany', 'Malé Zálužie', 'Malé Zlievce',
        'Málinec', 'Malinová', 'Malinovo', 'Malužiná', 'Malý Cetín', 'Malý Čepčín', 'Malý Horeš', 'Malý Kamenec', 'Malý Krtíš', 'Malý Lapáš',
        'Malý Lipník', 'Malý Slavkov', 'Malý Slivník', 'Malý Šariš', 'Malženice', 'Mankovce', 'Maňa', 'Marcelová', 'Margecany', 'Marhaň',
        'Marianka', 'Markovce', 'Markuška', 'Markušovce', 'Maršová-Rašov', 'Martin', 'Martin nad Žitavou', 'Martinček', 'Martinová', 'Martovce',
        'Mašková', 'Maškovce', 'Matejovce nad Hornádom', 'Matiaška', 'Matiašovce', 'Matovce', 'Matúškovo', 'Matysová', 'Maťovské Vojkovce',
        'Medovarce', 'Medvedie', 'Medveďov', 'Medzany', 'Medzev', 'Medzianky', 'Medzibrod', 'Medzibrodie nad Oravou', 'Medzilaborce',
        'Melčice-Lieskové', 'Melek', 'Meliata', 'Mengusovce', 'Merašice', 'Merník', 'Mestečko', 'Mestisko', 'Mičakovce', 'Mierovo', 'Miezgovce',
        'Michajlov', 'Michal na Ostrove', 'Michal nad Žitavou', 'Michalková', 'Michalok', 'Michalová', 'Michalovce', 'Michaľany', 'Miklušovce',
        'Miková', 'Mikulášová', 'Mikušovce', 'Mikušovce', 'Milhosť', 'Miloslavov', 'Milpoš', 'Miňovce', 'Mirkovce', 'Miroľa', 'Mládzovo',
        'Mlynárovce', 'Mlynčeky', 'Mlynica', 'Mlynky', 'Mníchova Lehota', 'Mníšek nad Hnilcom', 'Mníšek nad Popradom', 'Moča', 'Močenok',
        'Močiar', 'Modra', 'Modra nad Cirochou', 'Modrany', 'Modrová', 'Modrovka', 'Modrý Kameň', 'Mojmírovce', 'Mojš', 'Mojtín', 'Mojzesovo',
        'Mokrá Lúka', 'Mokrance', 'Mokroluh', 'Mokrý Háj', 'Moldava nad Bodvou', 'Moravany', 'Moravany nad Váhom', 'Moravské Lieskové',
        'Moravský Svätý Ján', 'Most pri Bratislave', 'Mostová', 'Moškovec', 'Mošovce', 'Moštenica', 'Mošurov', 'Motešice', 'Motyčky', 'Môlča',
        'Mrázovce', 'Mučín', 'Mudroňovo', 'Mudrovce', 'Muľa', 'Muráň', 'Muránska Dlhá Lúka', 'Muránska Huta', 'Muránska Lehota',
        'Muránska Zdychava', 'Mútne', 'Mužla', 'Myjava', 'Myslina', 'Mýtna', 'Mýtne Ludany', 'Mýto pod Ďumbierom', 'Nacina Ves', 'Nadlice',
        'Naháč', 'Nálepkovo', 'Námestovo', 'Nána', 'Nandraž', 'Necpaly', 'Nedanovce', 'Nedašovce', 'Neded', 'Nededza', 'Nedožery-Brezany',
        'Nechválova Polianka', 'Nemce', 'Nemcovce', 'Nemcovce', 'Nemčice', 'Nemčiňany', 'Nemecká', 'Nemečky', 'Nemešany', 'Nemšová', 'Nenince',
        'Neporadza', 'Neporadza', 'Nesvady', 'Nesluša', 'Neverice', 'Nevidzany', 'Nevidzany', 'Nevoľné', 'Nezbudská Lúčka', 'Nimnica', 'Nitra',
        'Nitra nad Ipľom', 'Nitrianska Blatnica', 'Nitrianska Streda', 'Nitrianske Hrnčiarovce', 'Nitrianske Pravno', 'Nitrianske Rudno',
        'Nitrianske Sučany', 'Nitrica', 'Nižná', 'Nižná', 'Nižná Boca', 'Nižná Hutka', 'Nižná Jablonka', 'Nižná Jedľová', 'Nižná Kamenica',
        'Nižná Myšľa', 'Nižná Olšava', 'Nižná Pisaná', 'Nižná Polianka', 'Nižná Rybnica', 'Nižná Sitnica', 'Nižná Slaná', 'Nižná Voľa',
        'Nižné Ladičkovce', 'Nižné Nemecké', 'Nižné Repaše', 'Nižné Ružbachy', 'Nižný Čaj', 'Nižný Hrabovec', 'Nižný Hrušov', 'Nižný Klátov',
        'Nižný Komárnik', 'Nižný Kručov', 'Nižný Lánec', 'Nižný Mirošov', 'Nižný Orlík', 'Nižný Skálnik', 'Nižný Slavkov', 'Nižný Tvarožec',
        'Nižný Žipov', 'Nolčovo', 'Norovce', 'Nová Baňa', 'Nová Bašta', 'Nová Bošáca', 'Nová Bystrica', 'Nová Dedina', 'Nová Dedinka',
        'Nová Dubnica', 'Nová Kelča', 'Nová Lehota', 'Nová Lesná', 'Nová Ľubovňa', 'Nová Polhora', 'Nová Polianka', 'Nová Sedlica', 'Nová Ves',
        'Nová Ves nad Váhom', 'Nová Ves nad Žitavou', 'Nová Vieska', 'Nováčany', 'Nováky', 'Nové Hony', 'Nové Mesto nad Váhom', 'Nové Sady',
        'Nové Zámky', 'Novosad', 'Novoť', 'Nový Ruskov', 'Nový Salaš', 'Nový Svet', 'Nový Tekov', 'Nový Život', 'Nýrovce', 'Ňagov', 'Ňárad',
        'Obeckov', 'Obid', 'Obišovce', 'Oborín', 'Obručné', 'Obyce', 'Očkov', 'Očová', 'Odorín', 'Ohrady', 'Ohradzany', 'Ochodnica', 'Ochtiná',
        'Okoč', 'Okoličná na Ostrove', 'Okrúhle', 'Okružná', 'Olcnava', 'Olejníkov', 'Olešná', 'Olováry', 'Olšovany', 'Oľdza', 'Oľka', 'Oľšavce',
        'Oľšavica', 'Oľšavka', 'Oľšavka', 'Oľšinkov', 'Oľšov', 'Omastiná', 'Omšenie', 'Ondavka', 'Ondavské Matiašovce', 'Ondrašovce', 'Ondrašová',
        'Ondrejovce', 'Opátka', 'Opatovce', 'Opatovce nad Nitrou', 'Opatovská Nová Ves', 'Opava', 'Opiná', 'Opoj', 'Oponice', 'Oravce', 'Orávka',
        'Oravská Jasenica', 'Oravská Lesná', 'Oravská Polhora', 'Oravská Poruba', 'Oravský Biely Potok', 'Oravský Podzámok', 'Ordzovany', 'Orechová',
        'Orechová Potôň', 'Oravské Veselé', 'Oreské', 'Oreské', 'Orešany', 'Orlov', 'Orovnica', 'Ortuťová', 'Osádka', 'Osadné', 'Osikov', 'Oslany',
        'Osrblie', 'Ostrá Lúka', 'Ostratice', 'Ostrov', 'Ostrov', 'Ostrovany', 'Ostrý Grúň', 'Osturňa', 'Osuské', 'Oščadnica', 'Otrhánky', 'Otročok',
        'Ovčiarsko', 'Ovčie', 'Ozdín', 'Ožďany', 'Pača', 'Padáň', 'Padarovce', 'Pakostov', 'Palárikovo', 'Palín', 'Palota', 'Panické Dravce',
        'Paňa', 'Paňovce', 'Papín', 'Papradno', 'Parchovany', 'Parihuzovce', 'Párnica', 'Partizánska Ľupča', 'Partizánske', 'Pastovce', 'Pastuchov',
        'Pašková', 'Paština Závada', 'Pata', 'Pataš', 'Patince', 'Pavčina Lehota', 'Pavlice', 'Pavlová', 'Pavlova Ves', 'Pavlovce', 'Pavlovce',
        'Pavlovce nad Uhom', 'Pavľany', 'Pažiť', 'Pčoliné', 'Pečenice', 'Pečeňady', 'Pečeňany', 'Pečovská Nová Ves', 'Peder', 'Perín-Chym',
        'Pernek', 'Petkovce', 'Petrikovce', 'Petrová', 'Petrova Lehota', 'Petrova Ves', 'Petrovany', 'Petrovce', 'Petrovce', 'Petrovce',
        'Petrovce nad Laborcom', 'Petrovice', 'Petrovo', 'Pezinok', 'Piešťany', 'Pichne', 'Píla', 'Píla', 'Píla', 'Pinciná', 'Pinkovce',
        'Piskorovce', 'Pitelová', 'Plášťovce', 'Plavé Vozokany', 'Plavecké Podhradie', 'Plavecký Mikuláš', 'Plavecký Peter', 'Plavecký Štvrtok',
        'Plaveč', 'Plavnica', 'Plechotice', 'Pleš', 'Plešivec', 'Plevník-Drienové', 'Pliešovce', 'Ploské', 'Ploské', 'Pobedim', 'Počarová',
        'Počúvadlo', 'Podbiel', 'Podbranč', 'Podbrezová', 'Podhájska', 'Podhorany', 'Podhorany', 'Podhorany', 'Podhorie', 'Podhorie', 'Podhoroď',
        'Podhradie', 'Podhradie', 'Podhradie', 'Podhradík', 'Podkonice', 'Podkriváň', 'Podkylava', 'Podlužany', 'Podlužany', 'Podolie',
        'Podolínec', 'Podrečany', 'Podskalie', 'Podtureň', 'Podvysoká', 'Podzámčok', 'Pohorelá', 'Pohranice', 'Pohronská Polhora',
        'Pohronský Bukovec', 'Pohronský Ruskov', 'Pochabany', 'Pokryváč', 'Poliakovce', 'Polianka', 'Polichno', 'Polina', 'Poloma', 'Polomka',
        'Poltár', 'Poluvsie', 'Poľanovce', 'Poľany', 'Poľný Kesov', 'Pongrácovce', 'Poniky', 'Poprad', 'Poproč', 'Poproč', 'Popudinské Močidľany',
        'Poráč', 'Poriadie', 'Porostov', 'Poruba', 'Poruba pod Vihorlatom', 'Porúbka', 'Porúbka', 'Porúbka', 'Porúbka', 'Poša', 'Potok',
        'Potok', 'Potoky', 'Potôčky', 'Potônske Lúky', 'Potvorice', 'Považany', 'Považská Bystrica', 'Povina', 'Povoda', 'Povrazník', 'Pozba',
        'Pozdišovce', 'Pôtor', 'Praha', 'Prakovce', 'Prašice', 'Prašník', 'Pravenec', 'Pravica', 'Pravotice', 'Práznovce', 'Prečín', 'Predajná',
        'Predmier', 'Prenčov', 'Preseľany', 'Prestavlky', 'Prešov', 'Príbelce', 'Pribeník', 'Pribeta', 'Pribiš', 'Príbovce', 'Pribylina',
        'Priechod', 'Priekopa', 'Priepasné', 'Prietrž', 'Prietržka', 'Prievaly', 'Prievidza', 'Prihradzany', 'Príkra', 'Príslop', 'Prituľany',
        'Proč', 'Prochot', 'Prosačov', 'Prosiek', 'Prša', 'Pruské', 'Prusy', 'Pružina', 'Pstriná', 'Ptičie', 'Ptrukša', 'Pucov', 'Púchov',
        'Pukanec', 'Pusté Čemerné', 'Pusté Pole', 'Pusté Sady', 'Pusté Úľany', 'Pušovce', 'Rabča', 'Rabčice', 'Rad', 'Radatice', 'Radava',
        'Radimov', 'Radnovce', 'Radobica', 'Radoľa', 'Radoma', 'Radošina', 'Radošovce', 'Radošovce', 'Radôstka', 'Radvanovce',
        'Radvaň nad Dunajom', 'Radvaň nad Laborcom', 'Radzovce', 'Rafajovce', 'Rajčany', 'Rajec', 'Rajecká Lesná', 'Rajecké Teplice',
        'Rákoš', 'Rákoš', 'Raková', 'Rakovčík', 'Rakovec nad Ondavou', 'Rakovice', 'Rakovnica', 'Rakovo', 'Rakša', 'Rakúsy', 'Rakytník',
        'Rankovce', 'Rapovce', 'Raslavice', 'Rastislavice', 'Rašice', 'Ratka', 'Ratková', 'Ratkovce', 'Ratkovo', 'Ratkovská Lehota',
        'Ratkovská Suchá', 'Ratkovské Bystré', 'Ratnovce', 'Ratvaj', 'Ráztočno', 'Ráztoka', 'Ražňany', 'Reca', 'Regetovka', 'Rejdová',
        'Reľov', 'Remeniny', 'Remetské Hámre', 'Renčišov', 'Repejov', 'Repište', 'Rešica', 'Rešov', 'Revúca', 'Revúcka Lehota', 'Riečka',
        'Riečka', 'Richnava', 'Richvald', 'Rimavská Baňa', 'Rimavská Seč', 'Rimavská Sobota', 'Rimavské Brezovo', 'Rimavské Janovce',
        'Rimavské Zalužany', 'Rišňovce', 'Rohov', 'Rohovce', 'Rohožník', 'Rohožník', 'Rochovce', 'Rokycany', 'Rokytov', 'Rokytov pri Humennom',
        'Rokytovce', 'Rosina', 'Roškovce', 'Roštár', 'Rovensko', 'Rovinka', 'Rovné', 'Rovné', 'Rovné', 'Rovňany', 'Rozhanovce', 'Rozložná',
        'Roztoky', 'Rožkovany', 'Rožňava', 'Rožňavské Bystré', 'Rúbaň', 'Rudina', 'Rudinka', 'Rudinská', 'Rudlov', 'Rudná', 'Rudnianska Lehota',
        'Rudník', 'Rudník', 'Rudno', 'Rudno nad Hronom', 'Rudňany', 'Rumanová', 'Rumince', 'Runina', 'Ruská', 'Ruská Bystrá', 'Ruská Kajňa',
        'Ruská Nová Ves', 'Ruská Poruba', 'Ruská Volová', 'Ruská Voľa', 'Ruská Voľa nad Popradom', 'Ruskov', 'Ruskovce', 'Ruskovce',
        'Ruský Hrabovec', 'Ruský Potok', 'Ružiná', 'Ružindol', 'Ružomberok', 'Rybany', 'Rybky', 'Rybník', 'Rybník', 'Rykynčice', 'Sabinov',
        'Sačurov', 'Sedlice', 'Sádočné', 'Sady nad Torysou', 'Salka', 'Santovka', 'Sap', 'Sása', 'Sása', 'Sasinkovo', 'Sazdice', 'Sebedín-Bečov',
        'Sebedražie', 'Sebechleby', 'Seč', 'Sečianky', 'Sečovce', 'Sečovská Polianka', 'Sedliacka Dubová', 'Sedliská', 'Sedmerovec', 'Sejkov',
        'Sekule', 'Selce', 'Selce', 'Selce', 'Selec', 'Selice', 'Seľany', 'Semerovo', 'Senec', 'Seniakovce', 'Senica', 'Senné', 'Senné', 'Senohrad',
        'Seňa', 'Sereď', 'Sielnica', 'Sihelné', 'Sihla', 'Sikenica', 'Sikenička', 'Siladice', 'Silica', 'Silická Brezová', 'Silická Jablonica',
        'Sirk', 'Sirník', 'Skačany', 'Skalica', 'Skalité', 'Skalka nad Váhom', 'Skároš', 'Skerešovo', 'Sklabiná', 'Sklabinský Podzámok',
        'Sklabiňa', 'Sklené', 'Sklené Teplice', 'Skrabské', 'Skýcov', 'Sládkovičovo', 'Slančík', 'Slanec', 'Slanská Huta', 'Slanské Nové Mesto',
        'Slaská', 'Slatina', 'Slatina nad Bebravou', 'Slatinka nad Bebravou', 'Slatinské Lazy', 'Slatvina', 'Slavec', 'Slavkovce', 'Slavnica',
        'Slavoška', 'Slavošovce', 'Slepčany', 'Sliač', 'Sliepkovce', 'Slizké', 'Slivník', 'Slopná', 'Slovany', 'Slovenská Kajňa', 'Slovenská Ľupča',
        'Slovenská Nová Ves', 'Slovenská Ves', 'Slovenská Volová', 'Slovenské Ďarmoty', 'Slovenské Kľačany', 'Slovenské Krivé',
        'Slovenské Nové Mesto', 'Slovenské Pravno', 'Slovenský Grob', 'Slovinky', 'Sľažany', 'Smilno', 'Smižany', 'Smolenice', 'Smolinské',
        'Smolnícka Huta', 'Smolník', 'Smrdáky', 'Smrečany', 'Snakov', 'Snežnica', 'Snina', 'Socovce', 'Soblahov', 'Soboš', 'Sobotište',
        'Sobrance', 'Sokolce', 'Sokolovce', 'Sokoľ', 'Sokoľany', 'Solčany', 'Solčianky', 'Sološnica', 'Soľ', 'Soľnička', 'Soľník', 'Somotor',
        'Sopkovce', 'Spišská Belá', 'Spišská Nová Ves', 'Spišská Stará Ves', 'Spišská Teplica', 'Spišské Bystré', 'Spišské Hanušovce',
        'Spišské Podhradie', 'Spišské Tomášovce', 'Spišské Vlachy', 'Spišský Hrhov', 'Spišský Hrušov', 'Spišský Štiavnik', 'Spišský Štvrtok',
        'Stakčín', 'Stakčínska Roztoka', 'Stanča', 'Stankovany', 'Stankovce', 'Stará Bašta', 'Stará Bystrica', 'Stará Halič', 'Stará Huta',
        'Stará Kremnička', 'Stará Lehota', 'Stará Lesná', 'Stará Ľubovňa', 'Stará Myjava', 'Stará Turá', 'Stará Voda', 'Staré', 'Staré Hory',
        'Starina', 'Starý Hrádok', 'Starý Tekov', 'Staškov', 'Staškovce', 'Stebnícka Huta', 'Stebník', 'Stožok', 'Stráne pod Tatrami', 'Stránska',
        'Stránske', 'Stráňany', 'Stráňavy', 'Stratená', 'Stráža', 'Strážne', 'Strážske', 'Strečno', 'Streda nad Bodrogom', 'Stredné Plachtince',
        'Strekov', 'Strelníky', 'Stretava', 'Stretavka', 'Streženice', 'Strihovce', 'Stročín', 'Stropkov', 'Studená', 'Studenec', 'Studienka',
        'Stuľany', 'Stupava', 'Stupné', 'Sučany', 'Sudince', 'Súdovce', 'Suchá Dolina', 'Suchá Hora', 'Suchá nad Parnou', 'Sucháň', 'Suché',
        'Suché Brezovo', 'Suchohrad', 'Sukov', 'Sulín', 'Súlovce', 'Súľov-Hradná', 'Sušany', 'Sútor', 'Svätá Mária', 'Svätoplukovo', 'Svätuš',
        'Svätuše', 'Svätý Anton', 'Svätý Jur', 'Svätý Kríž', 'Svätý Peter', 'Svederník', 'Sverepec', 'Sveržov', 'Svetlice', 'Svidnička', 'Svidník',
        'Svinia', 'Svinica', 'Svinice', 'Svinná', 'Svit', 'Svodín', 'Svrbice', 'Svrčinovec', 'Šahy', 'Šajdíkove Humence', 'Šalgovce', 'Šalgočka',
        'Šalov', 'Šaľa', 'Šambron', 'Šamorín', 'Šamudovce', 'Šandal', 'Šarbov', 'Šarišská Poruba', 'Šarišská Trstená', 'Šarišské Bohdanovce',
        'Šarišské Čierne', 'Šarišské Dravce', 'Šarišské Jastrabie', 'Šarišské Michaľany', 'Šarišské Sokolovce', 'Šarišský Štiavnik', 'Šarkan',
        'Šarovce', 'Šašová', 'Šaštín-Stráže', 'Šávoľ', 'Šelpice', 'Šemetkovce', 'Šemša', 'Šenkvice', 'Šiatorská Bukovinka', 'Šiba', 'Šíd',
        'Šimonovce', 'Šindliar', 'Šintava', 'Šípkov', 'Šípkové', 'Širákov', 'Širkovce', 'Široké', 'Šišov', 'Šivetice', 'Šmigovec', 'Šoltýska',
        'Šoporňa', 'Špačince', 'Špania Dolina', 'Španie Pole', 'Šrobárová', 'Štefanov', 'Štefanov nad Oravou', 'Štefanová', 'Štefanovce',
        'Štefanovce', 'Štefanovičová', 'Štefurov', 'Šterusy', 'Štiavnické Bane', 'Štiavnička', 'Štiavnik', 'Štitáre', 'Štítnik', 'Štós', 'Štôla',
        'Štrba', 'Štrkovec', 'Štúrovo', 'Štvrtok', 'Štvrtok na Ostrove', 'Šuja', 'Šuľa', 'Šumiac', 'Šuňava', 'Šurany', 'Šurianky', 'Šurice',
        'Šúrovce', 'Šútovo', 'Šútovce', 'Švábovce', 'Švedlár', 'Švošov', 'Tachty', 'Tajná', 'Tajov', 'Tarnov', 'Tatranská Javorina', 'Tašuľa',
        'Tehla', 'Tekolďany', 'Tekovská Breznica', 'Tekovské Lužany', 'Tekovské Nemce', 'Tekovský Hrádok', 'Telgárt', 'Telince', 'Temeš',
        'Teplička', 'Teplička nad Váhom', 'Tepličky', 'Teplý Vrch', 'Terany', 'Terchová', 'Teriakovce', 'Terňa', 'Tesáre', 'Tesárske Mlyňany',
        'Tešedíkovo', 'Tibava', 'Tichý Potok', 'Timoradza', 'Tisinec', 'Tisovec', 'Tlmače', 'Točnica', 'Tokajík', 'Tomášikovo', 'Tomášov',
        'Tomášovce', 'Tomášovce', 'Topoľa', 'Topoľčany', 'Topoľčianky', 'Topoľnica', 'Topoľníky', 'Topoľovka', 'Toporec', 'Tornaľa', 'Torysa',
        'Torysky', 'Tovarné', 'Tovarnianska Polianka', 'Tovarníky', 'Tôň', 'Trakovice', 'Trávnica', 'Trávnik', 'Trebatice', 'Trebejov',
        'Trebeľovce', 'Trebichava', 'Trebišov', 'Trebostovo', 'Trebušovce', 'Trenč', 'Trenčianska Teplá', 'Trenčianska Turná',
        'Trenčianske Bohuslavice', 'Trenčianske Jastrabie', 'Trenčianske Mitice', 'Trenčianske Stankovce', 'Trenčianske Teplice', 'Trenčín',
        'Trhová Hradská', 'Trhovište', 'Trnava', 'Trnavá Hora', 'Trnava pri Laborci', 'Trnávka', 'Trnávka', 'Trnkov', 'Trnovec',
        'Trnovec nad Váhom', 'Trnovo', 'Tročany', 'Trpín', 'Trstená', 'Trstená na Ostrove', 'Trstené', 'Trstené pri Hornáde', 'Trstice',
        'Trstín', 'Trsťany', 'Tŕnie', 'Tuhár', 'Tuhrina', 'Tuchyňa', 'Tulčík', 'Tupá', 'Turá', 'Turany', 'Turany nad Ondavou', 'Turcovce',
        'Turček', 'Turčianky', 'Turčianska Štiavnička', 'Turčianske Jaseno', 'Turčianske Kľačany', 'Turčianske Teplice', 'Turčiansky Ďur',
        'Turčiansky Peter', 'Turčok', 'Turecká', 'Tureň', 'Turie', 'Turík', 'Turnianska Nová Ves', 'Turňa nad Bodvou', 'Turová', 'Turzovka',
        'Tušice', 'Tušická Nová Ves', 'Tužina', 'Tvarožná', 'Tvrdomestice', 'Tvrdošín', 'Tvrdošovce', 'Ťapešovo', 'Ubľa', 'Úbrež', 'Udavské',
        'Udiča', 'Údol', 'Uhliská', 'Úhorná', 'Uhorská Ves', 'Uhorské', 'Uhrovec', 'Uhrovské Podhradie', 'Ulič', 'Uličské Krivé', 'Uloža',
        'Úľany nad Žitavou', 'Unín', 'Uňatín', 'Urmince', 'Utekáč', 'Uzovce', 'Uzovská Panica', 'Uzovské Pekľany', 'Uzovský Šalgov', 'Vaďovce',
        'Vagrinec', 'Váhovce', 'Vajkovce', 'Valaliky', 'Valaská', 'Valaská Belá', 'Valaská Dubová', 'Valaškovce (vojenský obvod)', 'Valča',
        'Valentovce', 'Valice', 'Valkovce', 'Vaľkovňa', 'Vaniškovce', 'Vápeník', 'Varadka', 'Varechovce', 'Varhaňovce', 'Varín', 'Vasiľov',
        'Vavrečka', 'Vavrinec', 'Vavrišovo', 'Važec', 'Včelince', 'Večelkov', 'Vechec', 'Velčice', 'Veličná', 'Velušovce', 'Veľaty',
        'Veľká Čalomija', 'Veľká Čausa', 'Veľká Čierna', 'Veľká Dolina', 'Veľká Franková', 'Veľká Hradná', 'Veľká Ida', 'Veľká Lehota',
        'Veľká Lesná', 'Veľká Lodina', 'Veľká Lomnica', 'Veľká Lúka', 'Veľká Mača', 'Veľká nad Ipľom', 'Veľká Paka', 'Veľká Tŕňa',
        'Veľká Ves', 'Veľká Ves nad Ipľom', 'Veľké Bierovce', 'Veľké Blahovo', 'Veľké Borové', 'Veľké Dravce', 'Veľké Držkovce', 'Veľké Dvorany',
        'Veľké Dvorníky', 'Veľké Hoste', 'Veľké Chlievany', 'Veľké Chyndice', 'Veľké Kapušany', 'Veľké Kosihy', 'Veľké Kostoľany',
        'Veľké Kozmálovce', 'Veľké Kršteňany', 'Veľké Leváre', 'Veľké Lovce', 'Veľké Ludince', 'Veľké Orvište', 'Veľké Ozorovce',
        'Veľké Pole', 'Veľké Raškovce', 'Veľké Revištia', 'Veľké Ripňany', 'Veľké Rovné', 'Veľké Slemence', 'Veľké Straciny',
        'Veľké Teriakovce', 'Veľké Trakany', 'Veľké Turovce', 'Veľké Uherce', 'Veľké Úľany', 'Veľké Vozokany',
        'Veľké Zálužie', 'Veľké Zlievce', 'Veľkrop', 'Veľký Biel', 'Veľký Blh', 'Veľký Cetín', 'Veľký Čepčín', 'Veľký Ďur', 'Veľký Folkmar',
        'Veľký Grob', 'Veľký Horeš', 'Veľký Kamenec', 'Veľký Klíž', 'Veľký Krtíš', 'Veľký Kýr', 'Veľký Lapáš', 'Veľký Lipník', 'Veľký Lom',
        'Veľký Meder', 'Veľký Slavkov', 'Veľký Slivník', 'Veľký Šariš', 'Veľopolie', 'Vernár', 'Veselé', 'Veterná Poruba', 'Vidiná', 'Vieska',
        'Vieska', 'Vieska nad Žitavou', 'Vígľaš', 'Vígľašská Huta-Kalinka', 'Vikartovce', 'Vinica', 'Viničky', 'Viničné', 'Vinné', 'Vinodol',
        'Vinohrady nad Váhom', 'Vinosady', 'Virt', 'Vislanka', 'Vislava', 'Visolaje', 'Višňov', 'Višňové', 'Višňové', 'Vištuk', 'Vitanová',
        'Vítkovce', 'Víťaz', 'Víťazovce', 'Vlača', 'Vladiča', 'Vlachovo', 'Vlachy', 'Vlčany', 'Vlčkovce', 'Vlkanová', 'Vlkas', 'Vlková',
        'Vlkovce', 'Vlky', 'Voderady', 'Vojany', 'Vojčice', 'Vojka', 'Vojka nad Dunajom', 'Vojkovce', 'Vojnatina', 'Vojňany', 'Vojtovce',
        'Volica', 'Volkovce', 'Voľa', 'Voznica', 'Vozokany', 'Vozokany', 'Vráble', 'Vrádište', 'Vrakúň', 'Vranov nad Topľou', 'Vrbnica',
        'Vrbov', 'Vrbovce', 'Vrbová nad Váhom', 'Vrbové', 'Vrbovka', 'Vrchteplá', 'Vrícko', 'Vršatské Podhradie', 'Vrútky', 'Vtáčkovce',
        'Výborná', 'Výčapy-Opatovce', 'Vydrany', 'Vydrná', 'Vydrník', 'Vyhne', 'Východná', 'Výrava', 'Vysočany', 'Vysoká', 'Vysoká',
        'Vysoká nad Kysucou', 'Vysoká nad Uhom', 'Vysoká pri Morave', 'Vysoké Tatry', 'Vyškovce', 'Vyškovce nad Ipľom', 'Vyšná Boca',
        'Vyšná Hutka', 'Vyšná Jablonka', 'Vyšná Jedľová', 'Vyšná Kamenica', 'Vyšná Myšľa', 'Vyšná Olšava', 'Vyšná Pisaná', 'Vyšná Polianka',
        'Vyšná Rybnica', 'Vyšná Sitnica', 'Vyšná Slaná', 'Vyšná Šebastová', 'Vyšná Voľa', 'Vyšné Ladičkovce', 'Vyšné nad Hronom', 'Vyšné Nemecké',
        'Vyšné Remety', 'Vyšné Repaše', 'Vyšné Ružbachy', 'Vyšné Valice', 'Vyšný Čaj', 'Vyšný Hrabovec', 'Vyšný Hrušov', 'Vyšný Kazimír',
        'Vyšný Klátov', 'Vyšný Komárnik', 'Vyšný Kručov', 'Vyšný Kubín', 'Vyšný Medzev', 'Vyšný Mirošov', 'Vyšný Orlík', 'Vyšný Skálnik',
        'Vyšný Slavkov', 'Vyšný Tvarožec', 'Vyšný Žipov', 'Zábiedovo', 'Záborie', 'Záborské', 'Zádiel', 'Zádor', 'Záhor', 'Záhorce', 'Záhorie',
        'Záhorská Ves', 'Záhradné', 'Zacharovce', 'Zákamenné', 'Zákopčie', 'Zalaba', 'Zálesie', 'Zálesie', 'Zalužice', 'Zamarovce', 'Zámutov',
        'Záriečie', 'Záskalie', 'Zatín', 'Závada', 'Závada', 'Závada', 'Závadka', 'Závadka', 'Závadka', 'Zavar', 'Závažná Poruba', 'Závod',
        'Zázrivá', 'Zbehňov', 'Zbehy', 'Zboj', 'Zbojné', 'Zborov', 'Zborov nad Bystricou', 'Zbrojníky', 'Zbudská Belá', 'Zbudské Dlhé', 'Zbudza',
        'Zbyňov', 'Zeleneč', 'Zemianska Olča', 'Zemianske Kostoľany', 'Zemianske Podhradie', 'Zemianske Sady', 'Zemiansky Vrbovok', 'Zemné',
        'Zemplín', 'Zemplínska Nová Ves', 'Zemplínska Široká', 'Zemplínska Teplica', 'Zemplínske Hámre', 'Zemplínske Hradište',
        'Zemplínske Jastrabie', 'Zemplínske Kopčany', 'Zemplínsky Branč', 'Zlatá Baňa', 'Zlatá Idka', 'Zlaté', 'Zlaté Klasy', 'Zlaté Moravce',
        'Zlatná na Ostrove', 'Zlatník', 'Zlatníky', 'Zlatno', 'Zlatno', 'Zliechov', 'Zohor', 'Zombor', 'Zubák', 'Zuberec', 'Zubné',
        'Zubrohlava', 'Zvolen', 'Zvolenská Slatina', 'Zvončín', 'Žabokreky', 'Žabokreky nad Nitrou', 'Žakarovce', 'Žakovce', 'Žalobín',
        'Žarnov', 'Žarnovica', 'Žaškov', 'Žbince', 'Ždaňa', 'Ždiar', 'Žehňa', 'Žehra', 'Železná Breznica', 'Železník', 'Želiezovce',
        'Želmanovce', 'Želovce', 'Žemberovce', 'Žemliare', 'Žiar', 'Žiar', 'Žiar nad Hronom', 'Žibritov', 'Žihárec', 'Žikava', 'Žilina',
        'Žíp', 'Žipov', 'Žirany', 'Žitavany', 'Žitavce', 'Žitná-Radiša', 'Žlkovce', 'Župčany', 'Župkov'
    );

    protected static $buildingNumber = array('#####', '####', '###');
    protected static $streetSuffix = array(
        'Alley','Avenue','Branch','Bridge','Brook','Brooks','Burg','Burgs','Bypass','Camp','Canyon','Cape','Causeway','Center','Centers','Circle','Circles','Cliff','Cliffs','Club','Common','Corner','Corners','Course','Court','Courts','Cove','Coves','Creek','Crescent','Crest','Crossing','Crossroad','Curve','Dale','Dam','Divide','Drive','Drive','Drives','Estate','Estates','Expressway','Extension','Extensions','Fall','Falls','Ferry','Field','Fields','Flat','Flats','Ford','Fords','Forest','Forge','Forges','Fork','Forks','Fort','Freeway','Garden','Gardens','Gateway','Glen','Glens','Green','Greens','Grove','Groves','Harbor','Harbors','Haven','Heights','Highway','Hill','Hills','Hollow','Inlet','Inlet','Island','Island','Islands','Islands','Isle','Isle','Junction','Junctions','Key','Keys','Knoll','Knolls','Lake','Lakes','Land','Landing','Lane','Light','Lights','Loaf','Lock','Locks','Locks','Lodge','Lodge','Loop','Mall','Manor','Manors','Meadow','Meadows','Mews','Mill','Mills','Mission','Mission','Motorway','Mount','Mountain','Mountain','Mountains','Mountains','Neck','Orchard','Oval','Overpass','Park','Parks','Parkway','Parkways','Pass','Passage','Path','Pike','Pine','Pines','Place','Plain','Plains','Plains','Plaza','Plaza','Point','Points','Port','Port','Ports','Ports','Prairie','Prairie','Radial','Ramp','Ranch','Rapid','Rapids','Rest','Ridge','Ridges','River','Road','Road','Roads','Roads','Route','Row','Rue','Run','Shoal','Shoals','Shore','Shores','Skyway','Spring','Springs','Springs','Spur','Spurs','Square','Square','Squares','Squares','Station','Station','Stravenue','Stravenue','Stream','Stream','Street','Street','Streets','Summit','Summit','Terrace','Throughway','Trace','Track','Trafficway','Trail','Trail','Tunnel','Tunnel','Turnpike','Turnpike','Underpass','Union','Unions','Valley','Valleys','Via','Viaduct','View','Views','Village','Village','Villages','Ville','Vista','Vista','Walk','Walks','Wall','Way','Ways','Well','Wells'
    );
    protected static $postcode = array('### ##');

    protected static $country = array(
        'Afganistan', 'Albánsko', 'Alžírsko', 'Andorra', 'Angola', 'Antigua a Barbuda', 'Argentína', 'Arménsko', 'Austrália', 'Azerbajdžan',
        'Bahamy', 'Bahrajn', 'Bangladéš', 'Barbados', 'Belgicko', 'Belize', 'Benin', 'Bhután', 'Bielorusko', 'Bolívia', 'Bosna a Hercegovina',
        'Botswana', 'Brazília', 'Brunej', 'Bulharsko', 'Burkina', 'Burundi', 'Cyprus', 'Čad', 'Česko', 'Čierna Hora', 'Čile', 'Čína', 'Dánsko',
        'Dominika', 'Dominikánska republika', 'Džibutsko', 'Egypt', 'Ekvádor', 'Eritrea', 'Estónsko', 'Etiópia', 'Fidži', 'Filipíny', 'Fínsko',
        'Francúzsko', 'Gabon', 'Gambia', 'Ghana', 'Grécko', 'Grenada', 'Gruzínsko', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti',
        'Holandsko', 'Honduras', 'Chorvátsko', 'India', 'Indonézia', 'Irak', 'Irán', 'Írsko', 'Island', 'Izrael', 'Jamajka', 'Japonsko', 'Jemen',
        'Jordánsko', 'Južná Afrika', 'Južný Sudán', 'Kambodža', 'Kamerun', 'Kanada', 'Kapverdy', 'Katar', 'Kazachstan', 'Keňa', 'Kirgizsko',
        'Kiribati', 'Kolumbia', 'Komory', 'Kongo', 'Konžská demokratická republika', 'Kórejská ľudovodemokratická republika', 'Kórejská republika',
        'Kostarika', 'Kuba', 'Kuvajt', 'Laos', 'Lesotho', 'Libanon', 'Libéria', 'Líbya', 'Lichtenštajnsko', 'Litva', 'Lotyšsko', 'Luxembursko',
        'Macedónsko', 'Madagaskar', 'Maďarsko', 'Malajzia', 'Malawi', 'Maldivy', 'Mali', 'Malta', 'Maroko', 'Marshallove ostrovy', 'Maurícius',
        'Mauritánia', 'Mexiko', 'Mikronézia', 'Mjanmarsko', 'Moldavsko', 'Monako', 'Mongolsko', 'Mozambik', 'Namíbia', 'Nemecko', 'Nepál', 'Niger',
        'Nigéria', 'Nikaragua', 'Nórsko', 'Nový Zéland', 'Omán', 'Pakistan', 'Palau', 'Palestína', 'Panama', 'Papua-Nová Guinea', 'Paraguaj', 'Peru',
        'Pobrežie Slonoviny', 'Poľsko', 'Portugalsko', 'Rakúsko', 'Rovníková Guinea', 'Rumunsko', 'Rusko', 'Rwanda', 'Salvádor', 'Samoa',
        'San Maríno', 'Saudská Arábia', 'Senegal', 'Seychely', 'Sierra Leone', 'Singapur', 'Slovinsko', 'Somálsko', 'Spojené arabské emiráty',
        'Spojené kráľovstvo', 'Spojené štáty', 'Srbsko', 'Srí Lanka', 'Stredoafrická republika', 'Sudán', 'Surinam', 'Svätá Lucia',
        'Svätý Krištof a Nevis', 'Svätý Tomáš a Princov ostrov', 'Svätý Vincent a Grenadíny', 'Svazijsko', 'Sýria', 'Šalamúnove ostrovy',
        'Španielsko', 'Švajčiarsko', 'Švédsko', 'Tadžikistan', 'Taliansko', 'Tanzánia', 'Thajsko', 'Togo', 'Tonga', 'Trinidad a Tobago',
        'Tunisko', 'Turecko', 'Turkménsko', 'Tuvalu', 'Uganda', 'Ukrajina', 'Uruguaj', 'Uzbekistan', 'Vanuatu', 'Vatikán', 'Venezuela', 'Vietnam',
        'Východný Timor', 'Zambia', 'Zimbabwe', 'Zvrchovaný vojenský špitálsky rád sv. Jána Jeruzalemského z Ródu a Malty'
    );
    protected static $cityFormats = array(
        '{{cityName}}'
    );
    protected static $streetNameFormats = array(
        '{{firstName}} {{streetSuffix}}',
        '{{lastName}} {{streetSuffix}}'
    );
    protected static $streetAddressFormats = array(
        '{{streetName}} {{buildingNumber}}'
    );

    protected static $addressFormats = array(
        '{{streetAddress}}\n {{postcode}}\n {{city}}',
    );

    public static function cityName()
    {
        return static::randomElement(static::$cityName);
    }
}
                                                                                                                                                                                                                                                          <?php

namespace Faker\Provider\sk_SK;

class Company extends \Faker\Provider\Company
{
    protected static $formats = array(
        '{{lastName}} {{companySuffix}}',
        '{{lastName}}-{{lastName}}',
        '{{lastName}}, {{lastName}} and {{lastName}}'
    );

    protected static $catchPhraseWords = array(
        array(
            'Adaptívne', 'Automatické', 'Vyvážené', 'Obchodný-sústredený', 'centralizované', 'Cloned', 'kompatibilné', 'nastaviteľný', 'Cross-group', 'Cross-platform', 'zákazníka zamerané', 'Prispôsobiteľné', 'Decentralizované', 'De-inžinierstva', 'prenesenú', 'Digitálne', 'distribuované', 'Rôzne', 'Down veľkosti', 'Rozšírený', 'Celopodnikové ', ' Ergonomická', 'Expanded', 'Rozšírené', 'Plne konfigurovateľné', 'Funkcia na báze', 'Základný', 'Perspektívne', 'inovatívne', 'integrované', 'Intuitívne', 'Inverzný', 'Povinne monitorovaná', 'Multi-prešitia', 'multi-laterálne', 'Viacvrstvová', 'Viacvrstvová', 'Sieťová', 'Objektovo založená', 'Open-architektúru', 'Open-source', 'Operatívny', 'Optimalizované', 'Voliteľný', 'Organické', 'Organizovaná', 'Trvalé', 'Polarizované', 'Preventívne', 'Aktívne', 'Na zisk zameraná', 'Hlboká', 'programovateľný', 'progresívne', 'verejného kľúča', 'kvalita zamerané', 'reaktívne', 'Rekonštruované', 'Znížená', 'Právo veľké', 'robustné', 'Bezpečné', 'Jednoduchšie', 'Prepínanie', 'Synchronizované', 'synergický', 'spojil', 'tím-orientovaná', 'Univerzálne', 'Užívateľsky prívetivý', 'Univerzálne', 'Virtuálne', 'Vizionárske',
        ),
        array(
            'kontrola', 'analýzu', 'asymetrický', 'asynchrónne', 'prístup orientovaný', 'pozadí', 'na šírku pásma, monitorovať', 'obojsmerná', 'rozštiepené', 'jasne myslenie', 'klient-driven', 'klient-server', 'koherentné', 'súdržnosti', 'kompozitné', 'kontextový', 'kontextovo založená', 'obsah na báze', 'oddaný', 'dopytom', 'učebný', 'riadiace', 'diskrétne', 'dynamická', 'posilnenie', 'zahŕňajúci', 'manažér', 'explicitné', 'vyžaruje', 'odolné proti chybám', 'popredia', 'čerstvé myslenia', 'Globálne', 'heuristický', 'homogénna', 'ľudských zdrojov', 'hybridný', 'pôsobivých', 'čiastkové', 'nehmotnej', 'interaktívny', 'stredné', 'miestna', 'logistické', 'maximálny', 'metodickú', 'kritické', 'mobil', 'modulárny', 'motivuje', 'multimediálny', 'multi-štát', 'multi-tasking', 'národný', 'založená na skutočných potrebách', 'neutrálny', 'objektovo orientovaný', 'optimálnu', 'optimalizácia', 'radikálne', 'v reálnom čase', 'vzájomná', 'regionálne', 'citlivý', 'škálovateľné', 'stredné', 'zameriavalo na hľadanie riešenia', 'stabilný', 'statické', 'systematické', 'systémové', 'systém-hodný', 'hmotná', 'terciárny', 'prechodné', 'jednotný', 'pridaná hodnota', 'dobre modulovaný'
        ),
        array(
            'schopnosť', 'prístup', 'algoritmus', 'aliancie', 'analyzátor', 'aplikácie', 'prístup', 'architektúra', 'archív', 'pole', 'postoj', 'referenčné', 'schopnosť', 'kapacita', 'výzva', 'okruh', 'spolupráca', 'zložitosť', 'koncept', 'konglomerát', 'pohotovostný', 'jadro', 'databáza', 'sklad dát', 'definície', 'emulácia', 'kódovanie', 'šifrovanie', 'extranet', 'firmware', 'flexibilita', 'počasia', 'rám', 'rámec', 'funkcie', 'funkcie', 'hardware', 'help-desk', 'hierarchie', 'húb', 'vykonávanie', 'infraštruktúra', 'iniciatíva', 'inštalácia', 'rozhranie', 'encyklopédia', 'pákový efekt', 'metodika', 'migrácia', 'model', 'moderátor', 'kontrola', 'moratórium', 'neurónové-siete', 'paradigma', 'paralelné', 'politika', 'portál', 'produkt', 'produktivita', 'projekt', 'projekcie', 'protokol', 'služba', 'softvér', 'riešenie', 'normalizácie', 'stratégia', 'štruktúra', 'úspech', 'nadstavba', 'pomoc', 'synergia', 'priepustnosť', 'časovom horizonte', 'sadu nástrojov', 'využitie', 'web', 'pracovná sila'
        )
    );

    protected static $bsWords = array(
        array(
            'implement', 'utilize', 'integrate', 'streamline', 'optimize', 'evolve', 'transform', 'embrace', 'enable', 'orchestrate', 'leverage', 'reinvent', 'aggregate', 'architect', 'enhance', 'incentivize', 'morph', 'empower', 'envisioneer', 'monetize', 'harness', 'facilitate', 'seize', 'disintermediate', 'synergize', 'strategize', 'deploy', 'brand', 'grow', 'target', 'syndicate', 'synthesize', 'deliver', 'mesh', 'incubate', 'engage', 'maximize', 'benchmark', 'expedite', 'reintermediate', 'whiteboard', 'visualize', 'repurpose', 'innovate', 'scale', 'unleash', 'drive', 'extend', 'engineer', 'revolutionize', 'generate', 'exploit', 'transition', 'e-enable', 'iterate', 'cultivate', 'matrix', 'productize', 'redefine', 'recontextualize'
        ),
        array(
            'clicks-and-mortar', 'value-added', 'vertical', 'proactive', 'robust', 'revolutionary', 'scalable', 'leading-edge', 'innovative', 'intuitive', 'strategic', 'e-business', 'mission-critical', 'sticky', 'one-to-one', '24/7', 'end-to-end', 'global', 'B2B', 'B2C', 'granular', 'frictionless', 'virtual', 'viral', 'dynamic', '24/365', 'best-of-breed', 'killer', 'magnetic', 'bleeding-edge', 'web-enabled', 'interactive', 'dot-com', 'sexy', 'back-end', 'real-time', 'efficient', 'front-end', 'distributed', 'seamless', 'extensible', 'turn-key', 'world-class', 'open-source', 'cross-platform', 'cross-media', 'synergistic', 'bricks-and-clicks', 'out-of-the-box', 'enterprise', 'integrated', 'impactful', 'wireless', 'transparent', 'next-generation', 'cutting-edge', 'user-centric', 'visionary', 'customized', 'ubiquitous', 'plug-and-play', 'collaborative', 'compelling', 'holistic', 'rich'
        ),
        array(
            'synergies', 'web-readiness', 'paradigms', 'markets', 'partnerships', 'infrastructures', 'platforms', 'initiatives', 'channels', 'eyeballs', 'communities', 'ROI', 'solutions', 'e-tailers', 'e-services', 'action-items', 'portals', 'niches', 'technologies', 'content', 'vortals', 'supply-chains', 'convergence', 'relationships', 'architectures', 'interfaces', 'e-markets', 'e-commerce', 'systems', 'bandwidth', 'infomediaries', 'models', 'mindshare', 'deliverables', 'users', 'schemas', 'networks', 'applications', 'metrics', 'e-business', 'functionalities', 'experiences', 'webservices', 'methodologies'
        )
    );

    protected static $companySuffix = array('s.r.o.', 'a.s.', 'v.o.s.');

    /**
     * @example 'Robust full-range hub'
     */
    public function catchPhrase()
    {
        $result = array();
        foreach (static::$catchPhraseWords as &$word) {
            $result[] = static::randomElement($word);
        }

        return join($result, ' ');
    }

    /**
     * @example 'integrate extensible convergence'
     */
    public function bs()
    {
        $result = array();
        foreach (static::$bsWords as &$word) {
            $result[] = static::randomElement($word);
        }

        return join($result, ' ');
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      <?php

namespace Faker\Provider\sk_SK;

class Person extends \Faker\Provider\Person
{
    protected static $lastNameFormat = array(
        '{{lastNameMale}}',
        '{{lastNameFemale}}',
    );

    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastNameMale}}',
        '{{firstNameMale}} {{lastNameMale}}',
        '{{firstNameMale}} {{lastNameMale}}',
        '{{firstNameMale}} {{lastNameMale}}',
        '{{titleMale}} {{firstNameMale}} {{lastNameMale}}',
        '{{titleMale}} {{firstNameMale}} {{lastNameMale}} {{suffix}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastNameFemale}}',
        '{{firstNameFemale}} {{lastNameFemale}}',
        '{{firstNameFemale}} {{lastNameFemale}}',
        '{{firstNameFemale}} {{lastNameFemale}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastNameFemale}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastNameFemale}} {{suffix}}'
    );

    protected static $firstNameMale = array(
        'Drahoslav', 'Severín', 'Alexej', 'Ernest', 'Rastislav', 'Radovan', 'Dobroslav', 'Dalibor', 'Vincent', 'Miloš', 'Timotej', 'Gejza', 'Bohuš',
        'Alfonz', 'Gašpar', 'Emil', 'Erik', 'Blažej', 'Zdenko', 'Dezider', 'Arpád', 'Valentín', 'Pravoslav', 'Jaromír', 'Roman', 'Matej', 'Frederik',
        'Viktor', 'Alexander', 'Radomír', 'Albín', 'Bohumil', 'Kazimír', 'Fridrich', 'Radoslav', 'Tomáš', 'Alan', 'Branislav', 'Bruno', 'Gregor',
        'Vlastimil', 'Boleslav', 'Eduard', 'Jozef', 'Víťazoslav', 'Blahoslav', 'Beňadik', 'Adrián', 'Gabriel', 'Marián', 'Emanuel', 'Miroslav',
        'Benjamín', 'Hugo', 'Richard', 'Izidor', 'Zoltán', 'Albert', 'Igor', 'Július', 'Aleš', 'Fedor', 'Rudolf', 'Valér', 'Marcel', 'Ervín',
        'Slavomír', 'Vojtech', 'Juraj', 'Marek', 'Jaroslav', 'Žigmund', 'Florián', 'Roland', 'Pankrác', 'Servác', 'Bonifác', 'Svetozár', 'Bernard',
        'Júlia', 'Urban', 'Dušan', 'Viliam', 'Ferdinand', 'Norbert', 'Róbert', 'Medard', 'Zlatko', 'Anton', 'Vasil', 'Vít', 'Adolf', 'Vratislav',
        'Alfréd', 'Alojz', 'Ján', 'Tadeáš', 'Ladislav', 'Peter', 'Pavol', 'Miloslav', 'Prokop', 'Cyril', 'Metod', 'Patrik', 'Oliver', 'Ivan',
        'Kamil', 'Henrich', 'Drahomír', 'Bohuslav', 'Iľja', 'Daniel', 'Vladimír', 'Jakub', 'Krištof', 'Ignác', 'Gustáv', 'Jerguš', 'Dominik',
        'Oskar', 'Vavrinec', 'Ľubomír', 'Mojmír', 'Leonard', 'Tichomír', 'Filip', 'Bartolomej', 'Ľudovít', 'Samuel', 'Augustín', 'Belo', 'Oleg',
        'Bystrík', 'Ctibor', 'Ľudomil', 'Konštantín', 'Ľuboslav', 'Matúš', 'Móric', 'Ľuboš', 'Ľubor', 'Vladislav', 'Cyprián', 'Václav', 'Michal',
        'Jarolím', 'Arnold', 'Levoslav', 'František', 'Dionýz', 'Maximilián', 'Koloman', 'Boris', 'Lukáš', 'Kristián', 'Vendelín', 'Sergej',
        'Aurel', 'Demeter', 'Denis', 'Hubert', 'Karol', 'Imrich', 'René', 'Bohumír', 'Teodor', 'Tibor', 'Maroš', 'Martin', 'Svätopluk', 'Stanislav',
        'Leopold', 'Eugen', 'Félix', 'Klement', 'Kornel', 'Milan', 'Vratko', 'Ondrej', 'Andrej', 'Edmund', 'Oldrich', 'Oto', 'Mikuláš', 'Ambróz',
        'Radúz', 'Bohdan', 'Adam', 'Štefan', 'Dávid', 'Silvester'

    );

    protected static $firstNameFemale = array(
        'Alexandra', 'Karina', 'Daniela', 'Andrea', 'Antónia', 'Bohuslava', 'Dáša', 'Malvína', 'Kristína', 'Nataša', 'Bohdana', 'Drahomíra',
        'Sára', 'Zora', 'Tamara', 'Ema', 'Tatiana', 'Erika', 'Veronika', 'Agáta', 'Dorota', 'Vanda', 'Zoja', 'Gabriela', 'Perla', 'Ida', 'Liana',
        'Miloslava', 'Vlasta', 'Lívia', 'Eleonóra', 'Etela', 'Romana', 'Zlatica', 'Anežka', 'Bohumila', 'Františka', 'Angela', 'Matilda',
        'Svetlana', 'Ľubica', 'Alena', 'Soňa', 'Vieroslava', 'Zita', 'Miroslava', 'Irena', 'Milena', 'Estera', 'Justína', 'Dana', 'Danica',
        'Jela', 'Jaroslava', 'Jarmila', 'Lea', 'Anastázia', 'Galina', 'Lesana', 'Hermína', 'Monika', 'Ingrida', 'Viktória', 'Blažena', 'Žofia',
        'Sofia', 'Gizela', 'Viola', 'Gertrúda', 'Zina', 'Júlia', 'Juliana', 'Želmíra', 'Ela', 'Vanesa', 'Iveta', 'Vilma', 'Petronela', 'Žaneta',
        'Xénia', 'Karolína', 'Lenka', 'Laura', 'Stanislava', 'Margaréta', 'Dobroslava', 'Blanka', 'Valéria', 'Paulína', 'Sidónia', 'Adriána',
        'Beáta', 'Petra', 'Melánia', 'Diana', 'Berta', 'Patrícia', 'Lujza', 'Amália', 'Milota', 'Nina', 'Margita', 'Kamila', 'Dušana', 'Magdaléna',
        'Oľga', 'Anna', 'Hana', 'Božena', 'Marta', 'Libuša', 'Božidara', 'Dominika', 'Hortenzia', 'Jozefína', 'Štefánia', 'Ľubomíra', 'Zuzana',
        'Darina', 'Marcela', 'Milica', 'Elena', 'Helena', 'Lýdia', 'Anabela', 'Jana', 'Silvia', 'Nikola', 'Ružena', 'Nora', 'Drahoslava', 'Linda',
        'Melinda', 'Rebeka', 'Rozália', 'Regína', 'Alica', 'Marianna', 'Miriama', 'Martina', 'Mária', 'Jolana', 'Ľudomila', 'Ľudmila', 'Olympia',
        'Eugénia', 'Ľuboslava', 'Zdenka', 'Edita', 'Michaela', 'Stela', 'Viera', 'Natália', 'Eliška', 'Brigita', 'Valentína', 'Terézia', 'Vladimíra',
        'Hedviga', 'Uršuľa', 'Alojza', 'Kvetoslava', 'Sabína', 'Dobromila', 'Klára', 'Simona', 'Aurélia', 'Denisa', 'Renáta', 'Irma', 'Agnesa',
        'Klaudia', 'Alžbeta', 'Elvíra', 'Cecília', 'Emília', 'Katarína', 'Henrieta', 'Bibiána', 'Barbora', 'Marína', 'Izabela', 'Hilda', 'Otília',
        'Lucia', 'Branislava', 'Bronislava', 'Ivica', 'Albína', 'Kornélia', 'Sláva', 'Slávka', 'Judita', 'Dagmara', 'Adela', 'Nadežda', 'Eva',
        'Filoména', 'Ivana', 'Milada'

    );

    protected static $lastNameMale = array(
        'Sloboda', 'Novotný', 'Kučera', 'Veselý', 'Horák', 'Marek', 'Pokorný', 'Král', 'Růžička', 'Zeman', 'Kolár', 'Urban', 'Bartoš', 'Vlček',
        'Polák', 'Kopecký', 'Konečný', 'Malý', 'Holub', 'Abrahám', 'Adam', 'Adamec', 'Almáši', 'Anderle', 'Antal', 'Babka', 'Bahna', 'Bahno',
        'Bajnok', 'Balaša', 'Balog', 'Balogh', 'Baláž', 'Baran', 'Baranka', 'Bartovič', 'Bartoš', 'Bača', 'Beck', 'Beihofner', 'Bella', 'Beran',
        'Bernolák', 'Beňo', 'Bicek', 'Bielik', 'Biringer', 'Blaho', 'Bondra', 'Bosák', 'Boška', 'Brezina', 'Bugár', 'Buš', 'Chalupka', 'Chudík',
        'Cyprich', 'Cíger', 'Dacej', 'Danko', 'Debnár', 'Dej', 'Dekýš', 'Doležal', 'Dostál', 'Dočolomanský', 'Drajna', 'Droppa', 'Dubovský',
        'Dudek', 'Dula', 'Dulla', 'Dusík', 'Dvonč', 'Dzurjanin', 'Dávid', 'Fabian', 'Fabián', 'Fajnor', 'Farkašovský', 'Feldek', 'Fico', 'Filc',
        'Filip', 'Finka', 'Ftorek', 'Galis', 'Gallo', 'Gašpar', 'Gašparovič', 'Gocník', 'Golonka', 'Greguš', 'Grznár', 'Hablák', 'Habšuda',
        'Haluška', 'Halák', 'Hanko', 'Hanzal', 'Hanzel', 'Hanzel', 'Haščák', 'Heretik', 'Hečko', 'Hečková', 'Hlaváček', 'Hlinka', 'Hochschorner',
        'Holub', 'Holuby', 'Horváth', 'Hossa', 'Hraško', 'Hric', 'Hrmo', 'Hrušovský', 'Huba', 'Hudáček', 'Hála', 'Ihnačák', 'Janoška', 'Jantošovič',
        'Janík', 'Jonata', 'Jurina', 'Jurinová', 'Jurík', 'Jáni', 'Jánošík', 'Kaliský', 'Karul', 'Karvaš', 'Keníž', 'Klapka', 'Klaus', 'Kolník',
        'Konstantinidis', 'Korec', 'Kostrec', 'Kováč', 'Kováčik', 'Koza', 'Kubík', 'Kučera', 'Labuda', 'Langoš', 'Lepšík', 'Lexa', 'Lintner',
        'Lubina', 'Lukáč', 'Lupták', 'Líška', 'Majeský', 'Malachovský', 'Malíšek', 'Marián', 'Masaryk', 'Maslo', 'Matiaško', 'Medveď', 'Menyhért',
        'Mečiar', 'Mečíř', 'Mikloško', 'Mikulík', 'Mikuš', 'Mikúš', 'Mišík', 'Mojžiš', 'Mokroš', 'Molnár', 'Moravčík', 'Musil', 'Mydlo', 'Nagy',
        'Nemec', 'Neruda', 'Nezval', 'Nitra', 'Novák', 'Nábělek', 'Němec', 'Obšut', 'Otčenáš', 'Pauko', 'Pavlikovský', 'Pavúk', 'Pašek', 'Paška',
        'Paško', 'Pelikán', 'Petrovický', 'Petruška', 'Plch', 'Podhradská', 'Podkonický', 'Poliak', 'Procházka', 'Puskás', 'Puškáš', 'Raši',
        'Repiský', 'Riszdorfer', 'Romančík', 'Rozenberg', 'Rus', 'Ružička', 'Rúfus', 'Růžička', 'Samson', 'Sedliak', 'Senko', 'Sidor', 'Sklenka',
        'Skutecký', 'Slašťan', 'Sloboda', 'Slobodník', 'Slota', 'Slovák', 'Smrek', 'Stodola', 'Straka', 'Szabó', 'Sámel', 'Sýkora', 'Tatar',
        'Tatarka', 'Tatár', 'Tatárka', 'Timko', 'Tiso', 'Tomeček', 'Truben', 'Turčok', 'Tóth', 'Uram', 'Urblík', 'Vajcík', 'Valent', 'Valuška',
        'Varga', 'Vašíček', 'Vesel', 'Vico', 'Višňovský', 'Vydarený', 'Weiss', 'Zima', 'Zimka', 'Zipser', 'Zátopek', 'Zúbrik', 'Čaplovič',
        'Čarnogurský', 'Čierny', 'Ďaďo', 'Ďurica', 'Ďuriš', 'Šimonovič', 'Škriniar', 'Šouc', 'Šoustal', 'Štefan', 'Štefanka', 'Šulc', 'Šurka',
        'Švehla', 'Šťastný'

    );

    protected static $lastNameFemale = array(
        'Slobodová', 'Novotná', 'Čierna', 'Kučerová', 'Veselá', 'Krajčíová', 'Nemcová', 'Králová', 'Růžičková', 'Fialová', 'Zemanová',
        'Kolárová', 'Kováčová', 'Vlčková', 'Poláková', 'Kopecká', 'Šimková', 'Konečná', 'Malá', 'Holubová', 'Staneková', 'Šťastná',
        'Vargová', 'Tóthová', 'Horváthová', 'Balážová', 'Szabová', 'Molnárová', 'Balogová', 'Lukáčová', 'Vícenová', 'Ringlóciová', 'Popovičová',
        'Hulmanová', 'Zelenayová', 'Fingerlandová', 'Králiková', 'Kapustová', 'Hantuchová', 'Holéczyová', 'Butvínová', 'Oslejová', 'Radičová', 'Sárová',
        'Sobotková', 'Kažimírová', 'Plšková', 'Jakubová', 'Šindlerová', 'Ondrejková', 'Slobodníková', 'Sadloňová', 'Černá', 'Nosková',
        'Virčíková', 'Taliánová', 'Čuntalová', 'Oťapková', 'Zuzulová', 'Godolová', 'Gonová', 'Jančová', 'Kocúrová', 'Svobodová', 'Oravcová', 'Muráriková',
        'Holubová', 'Kubáňová', 'Ondrišová', 'Šoltisová', 'Molnárová', 'Rezníčková', 'Dubníčková', 'Karolčíková', 'Máliková', 'Malíková', 'Litajová',
        'Kolrusová', 'Košíková', 'Kušnírová', 'Kravjarová', 'Hotová', 'Hajzerová', 'Ferjenčíková', 'Senková', 'Adamcová', 'Pirošová', 'Šimonová',
        'Finková', 'Hrdá', 'Murčová'
    );

    protected static $title = array(
        'Bc.', 'Ing.', 'MUDr.', 'MVDr.', 'Mgr.', 'JUDr.', 'PhDr.', 'RNDr.', 'doc.', 'Dr.', 'BcA.', 'ICDr.', 'Ing.', 'Ing. arch.', 'JUDr.',
        'Mgr. art.', 'MSDr.', 'PaedDr.', 'PharmDr.', 'PhDr.', 'PhMr.', 'RNDr.', 'RSDr.', 'ThDr.', 'ThLic.', 'prof.', 'Dr. h. c.'
    );

    private static $suffix = array(
        'CSc.', 'DrSc.', 'DSc.', 'Ph.D.', 'Th.D.'
    );

    public function title($gender = null)
    {
        return static::titleMale();
    }

    /**
     * replaced by specific unisex slovakian title
     */
    public static function titleMale()
    {
        return static::randomElement(static::$title);
    }

    /**
     * replaced by specific unisex slovakian title
     */
    public static function titleFemale()
    {
        return static::titleMale();
    }

    /**
     * @param string|null $gender 'male', 'female' or null for any
     * @example 'Novotný'
     */
    public function lastName($gender = null)
    {
        if ($gender === static::GENDER_MALE) {
            return static::lastNameMale();
        } elseif ($gender === static::GENDER_FEMALE) {
            return static::lastNameFemale();
        }

        return $this->generator->parse(static::randomElement(static::$lastNameFormat));
    }

    public static function lastNameMale()
    {
        return static::randomElement(static::$lastNameMale);
    }

    public static function lastNameFemale()
    {
        return static::randomElement(static::$lastNameFemale);
    }

    /**
     * @example 'PhD'
     */
    public static function suffix()
    {
        return static::randomElement(static::$suffix);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           <?php

namespace Faker\Provider\sl_SI;

class Address extends \Faker\Provider\Address
{

    /**
     * @link http://www.rtvslo.si/strani/abecedni-seznam-obcin/3103
     **/
    protected static $city = array(
        'Ajdovščina', 'Apače', 'Beltinci', 'Benedikt', 'Bistrica ob Sotli', 'Bled', 'Bloke', 'Bohinj', 'Borovnica', 'Bovec',
        'Braslovče', 'Brda', 'Brezovica', 'Brežice', 'Cankova', 'Celje', 'Cerklje na Gorenjskem', 'Cerknica', 'Cerkno',
        'Cerkvenjak', 'Cirkulane', 'Destrnik', 'Divača', 'Dobje', 'Dobrepolje', 'Dobrna', 'Dobrova - Polhov Gradec', 'Dobrovnik',
        'Dol pri Ljubljani', 'Dolenjske Toplice', 'Domžale', 'Dornava', 'Dravograd', 'Duplek', 'Gorenja vas - Poljane',
        'Gorišnica', 'Gorje', 'Gornja Radgona', 'Gornji Grad', 'Gornji Petrovci', 'Grad', 'Grosuplje', 'Hajdina', 'Hodoš',
        'Horjul', 'Hoče - Slivnica', 'Hrastnik', 'Hrpelje - Kozina', 'Idrija', 'Ig', 'Ilirska Bistrica', 'Ivančna Gorica',
        'Izola', 'Jesenice', 'Jezersko', 'Juršinci', 'Kamnik', 'Kanal ob Soči', 'Kidričevo', 'Kobarid', 'Kobilje', 'Komen',
        'Komenda', 'Koper', 'Kostanjevica na Krki', 'Kostel', 'Kozje', 'Kočevje', 'Kranj', 'Kranjska Gora', 'Križevci', 'Krško',
        'Kungota', 'Kuzma', 'Laško', 'Lenart', 'Lendava', 'Litija', 'Ljubljana', 'Ljubno', 'Ljutomer', 'Log - Dragomer', 'Logatec',
        'Lovrenc na Pohorju', 'Loška Dolina', 'Loški Potok', 'Lukovica', 'Luče', 'Majšperk', 'Makole', 'Maribor', 'Markovci',
        'Medvode', 'Mengeš', 'Metlika', 'Mežica', 'Miklavž na Dravskem polju', 'Miren - Kostanjevica', 'Mirna Peč', 'Mislinja',
        'Mokronog - Trebelno', 'Moravske Toplice', 'Moravče', 'Mozirje', 'Murska Sobota', 'Muta', 'Naklo', 'Nazarje', 'Nova Gorica',
        'Novo mesto', 'Odranci', 'Oplotnica', 'Ormož', 'Osilnica', 'Pesnica', 'Piran', 'Pivka', 'Podlehnik', 'Podvelka',
        'Podčetrtek', 'Poljčane', 'Polzela', 'Postojna', 'Prebold', 'Preddvor', 'Prevalje', 'Ptuj', 'Puconci', 'Radenci', 'Radeče',
        'Radlje ob Dravi', 'Radovljica', 'Ravne na Koroškem', 'Razkrižje', 'Rače - Fram', 'Renče - Vogrsko', 'Rečica ob Savinji',
        'Ribnica na Pohorju', 'Ribnica', 'Rogatec', 'Rogaška Slatina', 'Rogašovci', 'Ruše', 'Selnica ob Dravi', 'Semič', 'Sevnica',
        'Sežana', 'Slovenj Gradec', 'Slovenska Bistrica', 'Slovenske Konjice', 'Sodražica', 'Solčava', 'Središče ob Dravi', 'Starše',
        'Straža', 'Sveta Ana', 'Sveta Trojica v Slovenskih goricah', 'Sveti Andraž v Slovenskih goricah', 'Sveti Jurij ob Ščavnici',
        'Sveti Jurij v Slovenskih goricah', 'Sveti Tomaž', 'Tabor', 'Tišina', 'Tolmin', 'Trbovlje', 'Trebnje', 'Trnovska vas',
        'Trzin', 'Tržič', 'Turnišče', 'Velenje', 'Velika Polana', 'Velike Lašče', 'Veržej', 'Videm', 'Vipava', 'Vitanje', 'Vodice',
        'Vojnik', 'Vransko', 'Vrhnika', 'Vuzenica', 'Zagorje ob Savi', 'Zavrč', 'Zreče', 'Črenšovci', 'Črna na Koroškem', 'Črnomelj',
        'Šalovci', 'Šempeter - Vrtojba', 'Šentilj', 'Šentjernej', 'Šentjur', 'Šentrupert', 'Šenčur', 'Škocjan', 'Škofja Loka',
        'Škofljica', 'Šmarje pri Jelšah', 'Šmarješke Toplice', 'Šmartno ob Paki', 'Šmartno pri Litiji', 'Šoštanj', 'Štore', 'Žalec',
        'Železniki', 'Žetale', 'Žiri', 'Žirovnica', 'Žužemberk'
    );

    protected static $buildingNumber = array('1##', '##', '##', '##', '##', '#');

    protected static $postcode = array('###0');

    /**
     * Most common street names in Slovenia
     *
     * @link http://www.stat.si/krajevnaimena/pregledi_ulice_najpogostejse.asp
     * @link http://www.stat.si/KrajevnaImena/pregledi_naselja_najpogostejsa.asp
     */
    protected static $street = array(
        'Šolska ulica', 'Prešernova ulica', 'Cankarjeva ulica', 'Vrtna ulica', 'Gregorčičeva ulica', 'Kajuhova ulica', 'Prečna ulica',
        'Levstikova ulica', 'Trubarjeva ulica', 'Mladinska ulica', 'Gubčeva ulica', 'Ljubljanska cesta', 'Partizanska ulica', 'Maistrova ulica',
        'Rožna ulica', 'Bevkova ulica', 'Jurčičeva ulica', 'Župančičeva ulica', 'Kolodvorska ulica', 'Partizanska cesta', 'Gasilska ulica',
        'Kidričeva ulica', 'Aškerčeva ulica', 'Kratka ulica', 'Nova ulica', 'Obrtniška ulica', 'Tomšičeva ulica', 'Cvetlična ulica',
        'Mariborska cesta', 'Ob potoku', 'Trg svobode', 'Ulica talcev', 'Kettejeva ulica', 'Kosovelova ulica', 'Finžgarjeva ulica', 'Ob gozdu',
        'Stara cesta', 'Vegova ulica', 'Prežihova ulica', 'Sončna ulica',

        'Gradišče', 'Pristava', 'Brezje', 'Dolenja vas', 'Potok', 'Ravne',
        'Brdo', 'Dobrava', 'Draga', 'Javorje', 'Kal', 'Laze', 'Log', 'Planina', 'Podkraj', 'Selce', 'Trnovec', 'Bistrica', 'Gorenja vas',
        'Gorica', 'Lipa', 'Nova vas', 'Podgora', 'Podgorje', 'Podgrad', 'Ponikve', 'Sela', 'Selo', 'Škocjan', 'Vrh'
    );

    /**
     * @link http://sl.wikipedia.org/wiki/Seznam_suverenih_držav
     */
    protected static $country = array(
        'Afganistan', 'Albanija', 'Alžirija', 'Andora', 'Angola', 'Antigva in Barbuda', 'Argentina', 'Armenija', 'Avstralija', 'Avstrija',
        'Azerbajdžan', 'Bahami', 'Bahrajn', 'Bangladeš', 'Barbados', 'Belgija', 'Belize', 'Belorusija', 'Benin', 'Bocvana', 'Bolgarija',
        'Bolivija', 'Bosna in Hercegovina', 'Brazilija', 'Brunej', 'Burkina Faso', 'Burundi', 'Butan', 'Ciper', 'Čad', 'Češka', 'Čile',
        'Črna gora', 'Danska', 'Dominika', 'Dominikanska republika', 'Džibuti', 'Egipt', 'Ekvador', 'Ekvatorialna Gvineja', 'Eritreja',
        'Estonija', 'Etiopija', 'Fidži', 'Filipini', 'Finska', 'Francija', 'Gabon', 'Gambija', 'Gana', 'Grčija', 'Grenada', 'Gruzija',
        'Gvajana', 'Gvatemala', 'Gvineja', 'Gvineja Bissau', 'Haiti', 'Honduras', 'Hrvaška', 'Indija', 'Indonezija', 'Irak', 'Iran', 'Irska',
        'Islandija', 'Italija', 'Izrael', 'Jamajka', 'Japonska', 'Jemen', 'Jordanija', 'Južna Afrika', 'Južna Koreja', 'Kambodža', 'Kamerun',
        'Kanada', 'Katar', 'Kazahstan', 'Kenija', 'Kirgizistan', 'Kiribati', 'Kitajska', 'Kolumbija', 'Komori', 'Kongo', 'Demokratična republika Kongo',
        'Kostarika', 'Kuba', 'Kuvajt', 'Laos', 'Latvija', 'Lesoto', 'Libanon', 'Liberija', 'Libija', 'Lihtenštajn', 'Litva', 'Luksemburg', 'Madagaskar',
        'Madžarska', 'Makedonija', 'Malavi', 'Maldivi', 'Malezija', 'Mali', 'Malta', 'Maroko', 'Marshallovi otoki', 'Mauritius', 'Mavretanija', 'Mehika',
        'Mikronezija', 'Mjanmar', 'Moldavija', 'Monako', 'Mongolija', 'Mozambik', 'Namibija', 'Nauru', 'Nemčija', 'Nepal', 'Niger', 'Nigerija',
        'Nikaragva', 'Nizozemska', 'Norveška', 'Nova Zelandija', 'Oman', 'Pakistan', 'Palau', 'Panama', 'Papua Nova Gvineja', 'Paragvaj', 'Peru',
        'Poljska', 'Portugalska', 'Romunija', 'Ruanda', 'Rusija', 'Saint Kitts in Nevis', 'Saint Lucia', 'Saint Vincent in Grenadine',
        'Salomonovi otoki', 'Salvador', 'San Marino', 'Sao Tome in Principe', 'Saudova Arabija', 'Sejšeli', 'Senegal', 'Severna Koreja', 'Sierra Leone',
        'Singapur', 'Sirija', 'Slonokoščena obala', 'Slovaška', 'Slovenija', 'Somalija', 'Srbija', 'Srednjeafriška republika', 'Sudan', 'Surinam',
        'Svazi', 'Španija', 'Šrilanka', 'Švedska', 'Švica', 'Tadžikistan', 'Tajska', 'Tajvan', 'Tanzanija', 'Togo', 'Tonga', 'Trinidad in Tobago',
        'Tunizija', 'Turčija', 'Turkmenistan', 'Tuvalu', 'Uganda', 'Ukrajina', 'Urugvaj', 'Uzbekistan', 'Vanuatu', 'Vatikan', 'Velika Britanija',
        'Venezuela', 'Vietnam', 'Vzhodni Timor', 'Zahodna Samoa', 'Zambija', 'Združene države Amerike', 'Združeni arabski emirati',
        'Zelenortski otoki', 'Zimbabve'
    );

    protected static $cityFormats = array(
        '{{cityName}}'
    );

    protected static $streetAddressFormats = array(
        '{{streetName}} {{buildingNumber}}'
    );

    protected static $addressFormats = array(
        '{{streetAddress}}\n {{postcode}}\n {{cityName}}',
    );

    public static function cityName()
    {
        return static::randomElement(static::$city);
    }

    public function streetName()
    {
        return static::randomElement(static::$street);
    }
}
                                                             <?php

namespace Faker\Provider\sl_SI;

class Person extends \Faker\Provider\Person
{

    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{title}} {{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{title}} {{firstNameFemale}} {{lastName}}',
    );

    /**
     * @link http://www.stat.si/imena_top_imena_spol.asp?r=True
     * @link http://www.stat.si/doc/vsebina/05/imena/TOPIMENA_SI.xlsx
     */
    protected static $firstNameMale = array(
        'Adam', 'Adolf', 'Albert', 'Albin', 'Aleks', 'Aleksandar', 'Aleksander', 'Aleksej', 'Alen',
        'Alex', 'Aleš', 'Aljaž', 'Aljoša', 'Alojz', 'Alojzij', 'Andraž', 'Andrej', 'Anej', 'Anton',
        'Anže', 'Avgust', 'Ažbe', 'Benjamin', 'Bernard', 'Bine', 'Blaž', 'Bogdan', 'Bogomir',
        'Bojan', 'Bor', 'Boris', 'Borut', 'Boštjan', 'Božidar', 'Branko', 'Brin', 'Bruno', 'Ciril',
        'Cvetko', 'Damijan', 'Damir', 'Damjan', 'Daniel', 'Danijel', 'Danilo', 'Darko', 'David',
        'Davor', 'Davorin', 'Dejan', 'Denis', 'Domen', 'Dominik', 'Dragan', 'Drago', 'Dušan',
        'Edin', 'Edvard', 'Elvis', 'Emil', 'Enej', 'Erazem', 'Erik', 'Ernest', 'Ervin',
        'Ferdinand', 'Filip', 'Franc', 'Franci', 'Franjo', 'Frančišek', 'Gaber', 'Gabriel', 'Gal',
        'Gašper', 'Goran', 'Gorazd', 'Grega', 'Gregor', 'Hasan', 'Ian', 'Ignac', 'Igor', 'Ivan',
        'Ivo', 'Izak', 'Izidor', 'Iztok', 'Jaka', 'Jakob', 'Jan', 'Janez', 'Jani', 'Janko',
        'Jasmin', 'Jaša', 'Jernej', 'Jon', 'Josip', 'Joško', 'Jošt', 'Jože', 'Jožef', 'Jure',
        'Jurij', 'Karel', 'Karl', 'Kevin', 'Klemen', 'Kristijan', 'Kristjan', 'Ladislav', 'Lan',
        'Lenart', 'Leon', 'Leopold', 'Liam', 'Lovro', 'Ludvik', 'Luka', 'Lukas', 'Mai', 'Maj',
        'Maks', 'Maksimiljan', 'Marcel', 'Marijan', 'Mario', 'Marjan', 'Mark', 'Marko', 'Martin',
        'Matej', 'Matevž', 'Matic', 'Matija', 'Matjaž', 'Max', 'Metod', 'Miha', 'Mihael', 'Milan',
        'Miloš', 'Miran', 'Mirko', 'Miro', 'Miroslav', 'Mirsad', 'Mitja', 'Mladen', 'Nace', 'Nal',
        'Nejc', 'Nenad', 'Nik', 'Niko', 'Nikola', 'Nikolaj', 'Nino', 'Oskar', 'Ožbej', 'Patrik',
        'Pavel', 'Petar', 'Peter', 'Primož', 'Rado', 'Radovan', 'Rafael', 'Rajko', 'Renato',
        'Rene', 'Robert', 'Rok', 'Roman', 'Rudi', 'Rudolf', 'Samir', 'Samo', 'Sandi', 'Saša',
        'Sašo', 'Sebastijan', 'Sebastjan', 'Senad', 'Sergej', 'Silvester', 'Silvo', 'Simon',
        'Slavko', 'Slobodan', 'Srečko', 'Stanislav', 'Stanko', 'Staš', 'Stjepan', 'Stojan', 'Svit',
        'Tadej', 'Tai', 'Taj', 'Tarik', 'Teo', 'Tevž', 'Tian', 'Tilen', 'Tim', 'Timotej', 'Tine',
        'Tjaš', 'Tomaž', 'Tomislav', 'Tristan', 'Urban', 'Uroš', 'Val', 'Valentin', 'Valter',
        'Vid', 'Viktor', 'Viljem', 'Vincenc', 'Vinko', 'Vito', 'Vladimir', 'Vlado', 'Vojko',
        'Zdenko', 'Zdravko', 'Zlatko', 'Zoran', 'Zvonko', 'Štefan', 'Žak', 'Žan', 'Željko', 'Žiga'
    );

    /**
     * @link http://www.stat.si/imena_top_imena_spol.asp?r=True
     * @link http://www.stat.si/doc/vsebina/05/imena/TOPIMENA_SI.xlsx
     */
    protected static $firstNameFemale = array(
        'Ajda', 'Ajla', 'Albina', 'Aleksandra', 'Alenka', 'Alina', 'Alja', 'Alojzija', 'Amalija',
        'Ana Marija', 'Ana', 'Andreja', 'Andrejka', 'Aneja', 'Angela', 'Anica', 'Anika', 'Anita',
        'Anja', 'Anka', 'Antonija', 'Barbara', 'Bernarda', 'Blanka', 'Bojana', 'Branka', 'Breda',
        'Brigita', 'Brina', 'Cecilija', 'Cvetka', 'Damjana', 'Danica', 'Daniela', 'Danijela',
        'Darinka', 'Darja', 'Daša', 'Doroteja', 'Dragica', 'Dušanka', 'Ela', 'Elena', 'Elizabeta',
        'Ella', 'Ema', 'Emilija', 'Erika', 'Erna', 'Eva', 'Frančiška', 'Gabrijela', 'Gaja',
        'Gloria', 'Gordana', 'Hana', 'Hedvika', 'Helena', 'Hermina', 'Ida', 'Ines', 'Inja',
        'Irena', 'Iris', 'Irma', 'Iva', 'Ivana', 'Ivanka', 'Ivica', 'Iza', 'Izabela', 'Jana',
        'Janja', 'Jasmina', 'Jasna', 'Jelena', 'Jelka', 'Jerca', 'Jerneja', 'Jolanda', 'Jožefa',
        'Jožica', 'Julia', 'Julija', 'Julijana', 'Justina', 'Kaja', 'Karin', 'Karmen', 'Karolina',
        'Katarina', 'Katja', 'Kiara', 'Kim', 'Klara', 'Klavdija', 'Kristina', 'Ksenija', 'Lana',
        'Lara', 'Larisa', 'Laura', 'Lea', 'Leja', 'Lejla', 'Lia', 'Lidija', 'Lili', 'Lilijana',
        'Liljana', 'Lina', 'Liza', 'Ljubica', 'Ljudmila', 'Loti', 'Lucija', 'Luna', 'Magda',
        'Magdalena', 'Maja', 'Majda', 'Manca', 'Marica', 'Marija', 'Marijana', 'Marina', 'Marinka',
        'Marjana', 'Marjanca', 'Marjeta', 'Marjetka', 'Marta', 'Martina', 'Maruša', 'Mateja',
        'Matilda', 'Maša', 'Melita', 'Meta', 'Metka', 'Mia', 'Mihaela', 'Mija', 'Mila', 'Milena',
        'Milica', 'Milka', 'Mira', 'Mirjam', 'Mirjana', 'Miroslava', 'Mojca', 'Monika', 'Nada',
        'Nadja', 'Naja', 'Nastja', 'Natalija', 'Nataša', 'Neja', 'Neli', 'Nevenka', 'Neža', 'Nika',
        'Nikolina', 'Nina', 'Nives', 'Nuša', 'Olga', 'Patricija', 'Pavla', 'Petra', 'Pia', 'Pika',
        'Polona', 'Polonca', 'Rebeka', 'Renata', 'Romana', 'Rozalija', 'Sabina', 'Sandra', 'Sanja',
        'Sara', 'Saša', 'Silva', 'Simona', 'Slavica', 'Slavka', 'Sofia', 'Sofija', 'Sonja',
        'Stanislava', 'Stanka', 'Stela', 'Suzana', 'Tadeja', 'Taja', 'Tajda', 'Tamara', 'Tanja',
        'Tara', 'Tatjana', 'Tea', 'Teja', 'Terezija', 'Tia', 'Tiana', 'Tija', 'Tina', 'Tinkara',
        'Tisa', 'Tjaša', 'Ula', 'Urša', 'Urška', 'Valentina', 'Valerija', 'Vanja', 'Vera',
        'Veronika', 'Vesna', 'Vida', 'Viktorija', 'Vita', 'Vlasta', 'Zala', 'Zara', 'Zarja',
        'Zdenka', 'Zlatka', 'Zofija', 'Zoja', 'Zora', 'Zvonka', 'Špela', 'Štefanija', 'Štefka',
        'Žana', 'Živa'
    );

    /**
     * @link http://www.stat.si/imena_top_priimki.asp?r=True
     */
    protected static $lastName = array(
        'Ambrožič', 'Babič', 'Bajc', 'Bergant', 'Bevc', 'Bezjak', 'Bizjak', 'Blatnik', 'Blažič',
        'Bogataj', 'Božič', 'Bregar', 'Breznik', 'Bukovec', 'Cerar', 'Cvetko', 'Debeljak',
        'Demšar', 'Dolenc', 'Dolinar', 'Dolinšek', 'Erjavec', 'Eržen', 'Filipič', 'Fras', 'Furlan',
        'Gajšek', 'Godec', 'Golob', 'Gomboc', 'Gorenc', 'Gorjup', 'Gregorič', 'Hafner', 'Hodžić',
        'Horvat', 'Hozjan', 'Hočevar', 'Hren', 'Hribar', 'Hribernik', 'Hrovat', 'Humar', 'Ilić',
        'Ivančič', 'Jamnik', 'Janežič', 'Jarc', 'Javornik', 'Jazbec', 'Jelen', 'Jenko', 'Jereb',
        'Jerič', 'Jerman', 'Jovanović', 'Jug', 'Kalan', 'Kastelic', 'Kaučič', 'Kavčič',
        'Klemenčič', 'Knez', 'Kobal', 'Kocjančič', 'Kodrič', 'Kokalj', 'Kokol', 'Kolar', 'Kolarič',
        'Kolenc', 'Koren', 'Korošec', 'Kos', 'Kosi', 'Kotnik', 'Kovač', 'Kovačević', 'Kovačič',
        'Kočevar', 'Košir', 'Koželj', 'Krajnc', 'Kralj', 'Kramar', 'Kramberger', 'Kranjc',
        'Kranjec', 'Kristan', 'Krivec', 'Kuhar', 'Kumer', 'Lah', 'Lavrič', 'Lazar', 'Leban',
        'Lebar', 'Lesjak', 'Leskovar', 'Lešnik', 'Likar', 'Logar', 'Majcen', 'Marković',
        'Markovič', 'Marolt', 'Mavrič', 'Maček', 'Medved', 'Meglič', 'Mihelič', 'Miklavčič',
        'Mlakar', 'Mlinar', 'Mlinarič', 'Mohorič', 'Močnik', 'Mrak', 'Nemec', 'Nikolić', 'Novak',
        'Oblak', 'Pavlin', 'Pavlič', 'Perko', 'Petek', 'Petrič', 'Petrović', 'Petrovič', 'Pečnik',
        'Pintar', 'Pintarič', 'Pirc', 'Pirnat', 'Podgoršek', 'Pogačar', 'Pogačnik', 'Popović',
        'Potočnik', 'Povše', 'Primožič', 'Pušnik', 'Rajh', 'Ramšak', 'Resnik', 'Ribič', 'Rozman',
        'Rožič', 'Rožman', 'Rupnik', 'Rus', 'Rutar', 'Savić', 'Sever', 'Simonič', 'Sitar', 'Skok',
        'Smrekar', 'Stopar', 'Sušnik', 'Tavčar', 'Tomažič', 'Tomšič', 'Toplak', 'Tratnik', 'Trček',
        'Turk', 'Uršič', 'Vidic', 'Vidmar', 'Vidovič', 'Vodopivec', 'Volk', 'Vovk', 'Zadravec',
        'Zajc', 'Zakrajšek', 'Zalar', 'Zalokar', 'Založnik', 'Zemljič', 'Zorko', 'Zorman', 'Zupan',
        'Zupanc', 'Zupančič', 'Zver', 'Čeh', 'Černe', 'Čuk', 'Šinkovec', 'Škof', 'Šmid',
        'Štrukelj', 'Šuštar', 'Žagar', 'Železnik', 'Žibert', 'Žižek', 'Žnidaršič'
    );

    protected static $title = array(
        'dr.', 'mag.', 'inž.', 'univ. dipl.', 'dipl.', 'univ. dipl. inž.', 'dipl. inž.', 'prof.', 'akad.', 'dr. med.', 'spec.'
    );

    /**
     * replaced by specific unisex slovenian title
     */
    public function title($gender = null)
    {
        return static::randomElement(static::$title);
    }

    /**
     * @param string|null $gender 'male', 'female' or null for any
     * @example 'Novak'
     */
    public function lastName($gender = null)
    {
        return static::randomElement(static::$lastName);
    }

    public static function lastNameMale()
    {
        return static::lastName();
    }

    public static function lastNameFemale()
    {
        return static::lastName();
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               INDX( 	 Gfm            (   h  �           h                T     ` L          cS	�ok�H*@�ok�H*@�ok�cS	�ok�                        m s _ M Y n t [     ` L          H*@�ok�f�H�ok�f�H�ok�H*@�ok�                        n b _ N O n t a     ` L          f�H�ok�0j�ok�0j�ok�f�H�ok�                        n e _ N P n t f     ` L          0j�ok����ok����ok�0j�ok�                        n l _ B E n t n     ` L          ld�ok��%b�ok��%b�ok�ld�ok�                       n l _ N L n t      h X          :*��ok� Uze��h~��<�:*��ok� 0      �-               P a y m e n t . p h p      h V          ����ok� Uze��ʀ��<�����ok�       E              
 P e r s o n . p h p        p `          ���ok� Uze��ʀ��<����ok�                      P h o n e N u m b e r . p h p w     ` L          ��f�ok�:q��ok�:q��ok���f�ok�                        p l _ P L p h      ` L          �԰�ok�����ok�����ok��԰�ok�                       p t _ B R p h �     ` L          ���ok�C��ok�C��ok����ok�                        p t _ P T p h �     ` L          ���ok���8�ok���8�ok����ok�                        r o _ M D p h �     ` L          �;�ok�RBa�ok�RBa�ok��;�ok�                        r o _ R O p h �     ` L          RBa�ok�K'�ok�K'�ok�RBa�ok�                        r u _ R U p h �     ` L          n��ok��<�ok��<�ok�n��ok�                        s k _ S K p  �     ` L          c�>�ok����ok����ok�c�>�ok�                        s l _ S I p h �     h V          �H��ok�9��ok�9��ok��H��ok�                       
 s r _ C y r l _ R S   �     h V          ,o��ok�9m��ok�9m��ok�,o��ok�                       
 s r _ L a t n _ R S   �     ` L          ;���ok�f'��ok�f'��ok�;���ok�                        s r _ R S p h �     ` L          ����ok�����ok�����ok�����ok�                        s v _ S E p h      h R         c���ok� Uze��-���<�c���ok�        �               T e x t . p h p       �     ` L          ����ok�g�ok�g�ok�����ok�                        t h _ T H g e �     ` L          �s�ok�JP�ok�JP�ok��s�ok�                        t r _ T R g e �     ` L          j�R�ok�V1��ok�V1��ok�j�R�ok�                        u k _ U A g e      p \          P��ok� Uze������<�P��ok�        �               U s e r A g e n t . p h p          h R          ���ok� Uze����<����ok�       �               U u i d . p h p       �     ` L          4���ok�Ҹ��ok�Ҹ��ok�4���ok�                        v i _ V N     �     ` L          +��ok��"�ok��"�ok�+��ok�                        z h _ C N     �     ` L          ({$�ok�[xb�ok�[xb�ok�({$�ok�                        z h _ T W                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                <?php

namespace Faker\Provider\sr_Cyrl_RS;

class Address extends \Faker\Provider\Address
{
    protected static $postcode = array('#####');

    protected static $streetPrefix = array(
        'Булевар',
    );

    protected static $street = array(
        'Краља Милана', 'Цара Душана', 'Николе Тесле', 'Михајла Пупина', 'Николе Пашића',
    );

    protected static $streetNameFormats = array(
        '{{street}}',
        '{{streetPrefix}} {{street}}',
    );

    protected static $streetAddressFormats = array(
        '{{streetName}} {{buildingNumber}}',
    );

    protected static $cityFormats = array(
        '{{cityName}}',
    );

    /**
     * @link http://sr.wikipedia.org/wiki/%D0%93%D1%80%D0%B0%D0%B4%D0%BE%D0%B2%D0%B8_%D1%83_%D0%A1%D1%80%D0%B1%D0%B8%D1%98%D0%B8
     */
    protected static $cityNames = array(
        'Београд', 'Ваљево', 'Врање', 'Зајечар', 'Зрењанин', 'Јагодина', 'Крагујевац', 'Краљево', 'Крушевац', 'Лесковац', 'Лозница', 'Ниш', 'Нови Пазар', 'Нови Сад', 'Панчево', 'Пожаревац', 'Приштина', 'Смедерево', 'Сомбор', 'Сремска Митровица', 'Суботица', 'Ужице', 'Чачак', 'Шабац',
    );

    /**
     * @link https://github.com/umpirsky/country-list/blob/master/country/cldr/sr_Cyrl/country.php
     */
    protected static $country = array(
        'Острво Асенсион', 'Андора', 'Уједињени Арапски Емирати', 'Авганистан', 'Антигве и Барбуда', 'Ангвила', 'Албанија', 'Арменија', 'Холандски Антили', 'Ангола', 'Антарктик', 'Аргентина', 'Америчка Самоа', 'Аустрија', 'Аустралија', 'Аруба', 'Аландска острва', 'Азербејџан', 'Босна и Херцеговина', 'Барбадос', 'Бангладеш', 'Белгија', 'Буркина Фасо', 'Бугарска', 'Бахреин', 'Бурунди', 'Бенин', 'Свети Бартоломеј', 'Бермуда', 'Брунеј', 'Боливија', 'Бразил', 'Бахами', 'Бутан', 'Буве Острва', 'Боцвана', 'Белорусија', 'Белизе', 'Канада', 'Кокос (Келинг) Острва', 'Конго - Киншаса', 'Централно Афричка Република', 'Конго - Бразавил', 'Швајцарска', 'Обала Слоноваче', 'Кукова Острва', 'Чиле', 'Камерун', 'Кина', 'Колумбија', 'Острво Клипертон', 'Костарика', 'Србија и Црна Гора', 'Куба', 'Капе Верде', 'Божићна острва', 'Кипар', 'Чешка', 'Немачка', 'Дијего Гарсија', 'Џибути', 'Данска', 'Доминика', 'Доминиканска Република', 'Алжир', 'Сеута и Мелиља', 'Еквадор', 'Естонија', 'Египат', 'Западна Сахара', 'Еритреја', 'Шпанија', 'Етиопија', 'Европска Унија', 'Финска', 'Фиџи', 'Фолкландска Острва', 'Микронезија', 'Фарска Острва', 'Француска', 'Габон', 'Велика Британија', 'Гренада', 'Грузија', 'Француска Гвајана', 'Гурнси', 'Гана', 'Гибралтар', 'Гренланд', 'Гамбија', 'Гвинеја', 'Гваделупе', 'Екваторијална Гвинеја', 'Грчка', 'Јужна Џорџија и Јужна Сендвич Острва', 'Гватемала', 'Гуам', 'Гвинеја-Бисао', 'Гвајана', 'Хонг Конг С. А. Р. Кина', 'Херд и Мекдоналд Острва', 'Хондурас', 'Хрватска', 'Хаити', 'Мађарска', 'Канарска острва', 'Индонезија', 'Ирска', 'Израел', 'Острво Ман', 'Индија', 'Британска територија у Индијском океану', 'Ирак', 'Иран', 'Исланд', 'Италија', 'Џерси', 'Јамајка', 'Јордан', 'Јапан', 'Кенија', 'Киргизстан', 'Камбоџа', 'Кирибати', 'Коморска Острва', 'Сент Китс и Невис', 'Северна Кореја', 'Јужна Кореја', 'Кувајт', 'Кајманска Острва', 'Казахстан', 'Лаос', 'Либан', 'Сент Луција', 'Лихтенштајн', 'Шри Ланка', 'Либерија', 'Лесото', 'Литванија', 'Луксембург', 'Летонија', 'Либија', 'Мароко', 'Монако', 'Молдавија', 'Црна Гора', 'Сент Мартин', 'Мадагаскар', 'Маршалска Острва', 'Македонија', 'Мали', 'Мијанмар [Бурма]', 'Монголија', 'Макао С. А. Р. Кина', 'Северна Маријанска Острва', 'Мартиник', 'Мауританија', 'Монсерат', 'Малта', 'Маурицијус', 'Малдиви', 'Малави', 'Мексико', 'Малезија', 'Мозамбик', 'Намибија', 'Нова Каледонија', 'Нигер', 'Норфолк Острво', 'Нигерија', 'Никарагва', 'Холандија', 'Норвешка', 'Непал', 'Науру', 'Ниуе', 'Нови Зеланд', 'Оман', 'Панама', 'Перу', 'Француска Полинезија', 'Папуа Нова Гвинеја', 'Филипини', 'Пакистан', 'Пољска', 'Сен Пјер и Микелон', 'Питкерн', 'Порто Рико', 'Палестинске територије', 'Португал', 'Палау', 'Парагвај', 'Катар', 'Остала океанија', 'Реинион', 'Румунија', 'Србија', 'Русија', 'Руанда', 'Саудијска Арабија', 'Соломонска Острва', 'Сејшели', 'Судан', 'Шведска', 'Сингапур', 'Света Јелена', 'Словенија', 'Свалбард и Јанмајен Острва', 'Словачка', 'Сијера Леоне', 'Сан Марино', 'Сенегал', 'Сомалија', 'Суринам', 'Сао Томе и Принципе', 'Салвадор', 'Сирија', 'Свазиленд', 'Тристан да Куња', 'Туркс и Кајкос Острва', 'Чад', 'Француске Јужне Територије', 'Того', 'Тајланд', 'Таџикистан', 'Токелау', 'Источни Тимор', 'Туркменистан', 'Тунис', 'Тонга', 'Турска', 'Тринидад и Тобаго', 'Тувалу', 'Тајван', 'Танзанија', 'Украјина', 'Уганда', 'Мања удаљена острва САД', 'Сједињене Америчке Државе', 'Уругвај', 'Узбекистан', 'Ватикан', 'Сент Винсент и Гренадини', 'Венецуела', 'Британска Девичанска Острва', 'С.А.Д. Девичанска Острва', 'Вијетнам', 'Вануату', 'Валис и Футуна Острва', 'Самоа', 'Јемен', 'Мајоте', 'Јужноафричка Република', 'Замбија', 'Зимбабве',
    );

    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }

    public static function street()
    {
        return static::randomElement(static::$street);
    }

    public function cityName()
    {
        return static::randomElement(static::$cityNames);
    }
}
                                                                                                                                                                                                                                                                             <?php

namespace Faker\Provider\sr_Cyrl_RS;

class Person extends \Faker\Provider\Person
{
    /**
     * @link http://sr.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%B0%D0%BA_%D1%81%D1%80%D0%BF%D1%81%D0%BA%D0%B8%D1%85_%D0%B8%D0%BC%D0%B5%D0%BD%D0%B0
     */
    protected static $firstNameMale = array(
        'Александар', 'Бобан', 'Бранислав', 'Владимир', 'Владислав', 'Горан', 'Далибор', 'Данило', 'Дејан', 'Драган', 'Душан', 'Живко', 'Зоран',
        'Иван', 'Иво', 'Константин', 'Лука', 'Максим', 'Мартин', 'Милан', 'Милко', 'Милош', 'Мирослав', 'Миша', 'Раде',
        'Саша', 'Слободан', 'Срђан', 'Станислав', 'Филип',
        // below are unknown gender firstnames
        'Ђенадије', 'Ђоко', 'Ђорђе', 'Ђорђије', 'Ђорђо', 'Ђука', 'Ђукан', 'Ђура', 'Ђурашин', 'Ђурађ', 'Ђурисав', 'Ђурисава', 'Ђурица',
        'Ђурко', 'Ђуро', 'Ђурђа', 'Ђурђе', 'Ђурђевка', 'Ђурђица', 'Ђурђија', 'Јаблан', 'Јаворка', 'Јаворко', 'Јагода', 'Јагодинка',
        'Јагош', 'Јадранка', 'Јадранко', 'Јаков', 'Јакша', 'Јана', 'Јандре', 'Јандрија', 'Јанићије', 'Јанко', 'Јановка', 'Јанча',
        'Јарослав', 'Јасен', 'Јасенко', 'Јасмина', 'Јасминка', 'Јасна', 'Јања', 'Јевдокија', 'Јеврем', 'Јевросима', 'Јевта', 'Јевтан',
        'Јевтимије', 'Јевто', 'Језда', 'Јездимир', 'Јека', 'Јела', 'Јелача', 'Јелашин', 'Јелен', 'Јелена', 'Јеленка', 'Јеленко',
        'Јелисава', 'Јелисавета', 'Јелисавка', 'Јелисије', 'Јелица', 'Јелка', 'Јеремија', 'Јерко', 'Јеротије', 'Јефимија', 'Јеша', 'Јова',
        'Јован', 'Јованка', 'Јовица', 'Јовиша', 'Јовка', 'Јовко', 'Јово', 'Јоко', 'Јоксим', 'Јоргованка', 'Јордан', 'Јорданка',
        'Јосиф', 'Југомир', 'Југослав', 'Југољуб', 'Јулија', 'Јулијан', 'Јулијана', 'Јулка', 'Јуноша', 'Јуриша', 'Јустин', 'Љепава',
        'Љепосава', 'Љиља', 'Љиљан', 'Љиљана', 'Љуба', 'Љубан', 'Љубен', 'Љубенко', 'Љубивоје', 'Љубинка', 'Љубинко', 'Љубисав',
        'Љубислав', 'Љубица', 'Љубиша', 'Љубо', 'Љубобрат', 'Љубодраг', 'Љубомир', 'Љубомирка', 'Љубосава', 'Љубоја', 'Љубоје', 'Љупка',
        'Његомир', 'Његомирка', 'Његослава', 'Његош', 'Ћерана', 'Ћира', 'Ћирило', 'Ћирко', 'Ћиро', 'Ћирјак', 'Авакум', 'Аврам',
        'Агница', 'Агнија', 'Адам', 'Аделина', 'Аксентије', 'Алекса', 'Александрон', 'Алексеј', 'Алексија', 'Алексије', 'Алимпије', 'Ана',
        'Анастасија', 'Анда', 'Андреј', 'Андреја', 'Андрија', 'Андријана', 'Андријаш', 'Аница', 'Анка', 'Анкица', 'Антоније', 'Анђа',
        'Анђела', 'Анђелија', 'Анђелка', 'Анђелко', 'Аранђел', 'Арса', 'Арсен', 'Арсеније', 'Арсо', 'Атанасије', 'Атанацко', 'Аћим',
        'Балша', 'Бане', 'Батрић', 'Бајко', 'Бајо', 'Бајчета', 'Берисав', 'Берислав', 'Бериша', 'Берко', 'Бисенија', 'Бисерка',
        'Бисерко', 'Биљан', 'Благица', 'Благиња', 'Благомир', 'Благота', 'Благојa', 'Благоје', 'Блажа', 'Блажен', 'Блаженка', 'Блажо',
        'Блашко', 'Богдан', 'Богдана', 'Богданка', 'Богељ', 'Богиша', 'Богић', 'Богобој', 'Богосав', 'Богослав', 'Богоје', 'Богољуб',
        'Божа', 'Божана', 'Божидар', 'Божидарка', 'Божин', 'Божинка', 'Божица', 'Божићко', 'Божо', 'Боин', 'Боица', 'Бора',
        'Боривој', 'Боривоје', 'Борис', 'Борисав', 'Борислав', 'Борислава', 'Бориславка', 'Бориша', 'Борка', 'Борко', 'Боро', 'Бороје',
        'Борјана', 'Борјанка', 'Боса', 'Босиљка', 'Бошко', 'Бојан', 'Бојана', 'Бојко', 'Бојо', 'Бојчета', 'Бранивој', 'Бранивоје',
        'Бранимир', 'Бранислава', 'Бранка', 'Бранкица', 'Бранко', 'Брано', 'Братимир', 'Братислав', 'Братислава', 'Братован', 'Братољуб', 'Брајан',
        'Брајица', 'Брнча', 'Будимир', 'Будимирка', 'Будимка', 'Будисав', 'Будислав', 'Валерија', 'Варвара', 'Васа', 'Василија', 'Василије',
        'Василка', 'Васиљ', 'Васиљка', 'Васко', 'Васкрсија', 'Васкрсије', 'Васо', 'Васоје', 'Вајо', 'Вања', 'Векослав', 'Велибор',
        'Велиборка', 'Велизар', 'Велимир', 'Велинка', 'Велисав', 'Велисава', 'Величко', 'Велиша', 'Вера', 'Веран', 'Верица', 'Верка',
        'Вероника', 'Верослава', 'Верољуб', 'Весела', 'Веселин', 'Веселинка', 'Веско', 'Весна', 'Вељко', 'Вид', 'Вида', 'Видак',
        'Видан', 'Видач', 'Виден', 'Видосав', 'Видосава', 'Видоја', 'Видоје', 'Видојка', 'Видојко', 'Виктор', 'Викторија', 'Вилотије',
        'Виолета', 'Витка', 'Витко', 'Витомир', 'Витомирка', 'Вишеслав', 'Вишеслава', 'Вишња', 'Вићан', 'Вићентије', 'Владан', 'Владана',
        'Владанка', 'Владе', 'Владета', 'Владимирка', 'Владисав', 'Владислава', 'Владица', 'Владо', 'Владоје', 'Владун', 'Влаислав', 'Власије',
        'Власта', 'Властимир', 'Властимирка', 'Влатка', 'Влатко', 'Влашко', 'Влајко', 'Воица', 'Војдраг', 'Војимир', 'Војин', 'Војислав',
        'Војислава', 'Војка', 'Војкан', 'Војко', 'Вранеш', 'Вугдраг', 'Вузман', 'Вуило', 'Вуин', 'Вуица', 'Вук', 'Вукадин',
        'Вукало', 'Вукан', 'Вукана', 'Вукас', 'Вукац', 'Вукач', 'Вукашин', 'Вукајло', 'Вукаљ', 'Вукеља', 'Вукица', 'Вукић',
        'Вукман', 'Вукмир', 'Вукмира', 'Вукмиљ', 'Вуко', 'Вуковоје', 'Вукола', 'Вукоман', 'Вукомир', 'Вукосав', 'Вукосава', 'Вукослав',
        'Вукота', 'Вукоје', 'Вукојица', 'Вуксан', 'Вукша', 'Вуле', 'Вулета', 'Вунко', 'Вуча', 'Вучан', 'Вучен', 'Вучета',
        'Вучина', 'Вучић', 'Вучко', 'Вујадин', 'Вујадинка', 'Вујак', 'Вујан', 'Вујана', 'Вујета', 'Вујка', 'Вујко', 'Вујо',
        'Вујчета', 'Вујчин', 'Вјекослав', 'Гавра', 'Гаврила', 'Гаврилка', 'Гаврило', 'Гача', 'Гаја', 'Гајин', 'Гајо', 'Гвозден',
        'Гвозденија', 'Гвозденко', 'Генадије', 'Георгина', 'Георгије', 'Герасим', 'Герман', 'Глигорије', 'Глиша', 'Глишо', 'Годеч', 'Годомир',
        'Голуб', 'Горана', 'Горанка', 'Гордан', 'Гордана', 'Горица', 'Горчин', 'Горјана', 'Госпава', 'Гостимир', 'Гостољуб', 'Гојко',
        'Градета', 'Градимир', 'Градиша', 'Гргур', 'Грдан', 'Григорије', 'Гријак', 'Грозда', 'Гроздан', 'Гроздана', 'Грубан', 'Грубац',
        'Грубач', 'Грубета', 'Грубеша', 'Грубиша', 'Груја', 'Грујица', 'Грујо', 'Дабижив', 'Дабиша', 'Дабо', 'Давид', 'Даворка',
        'Далиборка', 'Дамјан', 'Дамјанка', 'Дамљан', 'Дамљанка', 'Дана', 'Дане', 'Даница', 'Данијел', 'Данка', 'Данко', 'Данојла',
        'Данчул', 'Дара', 'Даринка', 'Дарио', 'Дарије', 'Даријо', 'Дарко', 'Дарјан', 'Дафина', 'Даша', 'Дева', 'Деса',
        'Десанка', 'Десимир', 'Деспина', 'Деспиња', 'Деспот', 'Дејана', 'Дивна', 'Дикосава', 'Димитрије', 'Димчо', 'Дмитар', 'Дмитра',
        'Добрашин', 'Добривој', 'Добривоје', 'Добрила', 'Добрило', 'Добринка', 'Добринко', 'Добрица', 'Добрија', 'Добровук', 'Добросав', 'Доброслав',
        'Докна', 'Доко', 'Доротеј', 'Доротеја', 'Доситеј', 'Достана', 'Дојчило', 'Дојчин', 'Драга', 'Драгаш', 'Драгица', 'Драгиша',
        'Драгија', 'Драгиња', 'Драгић', 'Драго', 'Драгобрат', 'Драгован', 'Драгоман', 'Драгомир', 'Драгомира', 'Драгорад', 'Драгосав', 'Драгослав',
        'Драгослава', 'Драгош', 'Драгоја', 'Драгоје', 'Драгојла', 'Драгојло', 'Драгољуб', 'Драгутин', 'Дража', 'Дражета', 'Дражо', 'Драило',
        'Дракша', 'Драшко', 'Дрена', 'Дренка', 'Дрина', 'Дринка', 'Дубравац', 'Дубравка', 'Дубравко', 'Дука', 'Дукадин', 'Душанка',
        'Душица', 'Душка', 'Душко', 'Дујак', 'Дуња', 'Ева', 'Евгенија', 'Евгеније', 'Евдокија', 'Евица', 'Емил', 'Емилија',
        'Емилијан', 'Емилије', 'Ерак', 'Жаклина', 'Жанка', 'Жарко', 'Желимир', 'Желимирка', 'Жељана', 'Жељка', 'Жељко', 'Жива',
        'Живадин', 'Живадинка', 'Живан', 'Живана', 'Живанка', 'Живанко', 'Живица', 'Живка', 'Живодарка', 'Живомир', 'Живорад', 'Живоратка',
        'Живослава', 'Живославка', 'Живота', 'Живојин', 'Живољуб', 'Жика', 'Жикица', 'Житомир', 'Завида', 'Завиша', 'Зага', 'Загорка',
        'Зарија', 'Зарије', 'Захарије', 'Звездан', 'Звездана', 'Звездодраг', 'Звездослав', 'Звонимир', 'Звонка', 'Звонко', 'Звјездан', 'Звјездана',
        'Здравиша', 'Здравко', 'Злата', 'Златан', 'Златана', 'Златибор', 'Златица', 'Златија', 'Златко', 'Златомир', 'Златомирка', 'Златосав',
        'Златоје', 'Зора', 'Зорана', 'Зорислава', 'Зорица', 'Зорка', 'Зринка', 'Зринко', 'Ива', 'Иваниш', 'Иванка', 'Ивица',
        'Ивка', 'Ивко', 'Ивона', 'Игор', 'Игњат', 'Игњатије', 'Иконија', 'Илинка', 'Илија', 'Исаило', 'Исаија', 'Исак',
        'Исидор', 'Исидора', 'Кадивка', 'Кажимир', 'Казимир', 'Казимира', 'Каменко', 'Касија', 'Ката', 'Катарина', 'Катица', 'Кипријан',
        'Кирило', 'Кована', 'Ковина', 'Ковиљка', 'Ковиљко', 'Козма', 'Кокан', 'Комнен', 'Комненија', 'Корнелије', 'Косана', 'Косара',
        'Косовка', 'Коста', 'Костадин', 'Костадинка', 'Коча', 'Коштана', 'Којадин', 'Којадинка', 'Којчин', 'Крагуј', 'Краисава', 'Красимир',
        'Красоје', 'Крајислав', 'Крајчин', 'Крсман', 'Крсманија', 'Крста', 'Крстан', 'Крстана', 'Крстивоје', 'Крстина', 'Крсто', 'Крунислав',
        'Крунослава', 'Ксенија', 'Кузман', 'Кумодраг', 'Лабуд', 'Лаза', 'Лазар', 'Лазо', 'Лака', 'Лакета', 'Лако', 'Лале',
        'Лана', 'Лара', 'Латинка', 'Лежимир', 'Лела', 'Лена', 'Ленка', 'Леонида', 'Леонора', 'Лепа', 'Лепомир', 'Лепосава',
        'Лепослав', 'Лепоје', 'Лидија', 'Лиза', 'Лила', 'Лилијана', 'Лозан', 'Луна', 'Луча', 'Лучија', 'Лујо', 'Маврен',
        'Малета', 'Малеш', 'Малина', 'Малинка', 'Манда', 'Мандуша', 'Мане', 'Манојло', 'Мара', 'Маринка', 'Маринко', 'Марица',
        'Марко', 'Марта', 'Марјан', 'Матеј', 'Матеја', 'Матија', 'Матијаш', 'Мато', 'Машан', 'Машко', 'Маја', 'Мајда',
        'Медак', 'Мила', 'Миладин', 'Миладија', 'Милак', 'Милана', 'Миланка', 'Миланко', 'Милат', 'Милаш', 'Милашин', 'Миле',
        'Милева', 'Милен', 'Миленко', 'Милентије', 'Милеса', 'Милета', 'Милеш', 'Миливој', 'Миливоје', 'Милин', 'Милина', 'Милинко',
        'Милисав', 'Милисава', 'Милисавка', 'Милија', 'Милијан', 'Милијана', 'Милијаш', 'Милић', 'Милка', 'Милкица', 'Мило', 'Милован',
        'Миломир', 'Милорад', 'Милосав', 'Милосава', 'Милосавка', 'Милоја', 'Милоје', 'Милојица', 'Милојка', 'Милојко', 'Милтен', 'Милука',
        'Милун', 'Милунка', 'Милутин', 'Милуш', 'Милуша', 'Миодраг', 'Миомир', 'Миомирка', 'Мира', 'Мирен', 'Мирка', 'Мирко',
        'Миро', 'Миросав', 'Миросава', 'Мирољуб', 'Мирчета', 'Мирјана', 'Митар', 'Митра', 'Михаило', 'Михајло', 'Мишко', 'Мишо',
        'Мишљен', 'Мија', 'Мијаило', 'Мијак', 'Мијан', 'Мијана', 'Мијат', 'Мијо', 'Мијобрат', 'Мијушко', 'Миљ', 'Миља',
        'Миљан', 'Миљен', 'Миљка', 'Миљко', 'Миљојко', 'Миљурко', 'Мића', 'Мићан', 'Мићо', 'Младен', 'Млађан', 'Млађен',
        'Момир', 'Момчило', 'Мојсило', 'Мркша', 'Мрђан', 'Мрђен', 'Нада', 'Надежда', 'Надица', 'Наталија', 'Наум', 'Нађа',
        'Најда', 'Најдан', 'Небојша', 'Невен', 'Невена', 'Невенка', 'Невенко', 'Негован', 'Негомир', 'Неда', 'Недељка', 'Недељко',
        'Немања', 'Ненад', 'Нестор', 'Нешко', 'Неђељка', 'Неђељко', 'Никашин', 'Никодим', 'Никодије', 'Никола', 'Николета', 'Николија',
        'Никша', 'Нина', 'Нинко', 'Нино', 'Нинослав', 'Нишава', 'Нићифор', 'Новак', 'Новица', 'Новиша', 'Новка', 'Новко',
        'Ново', 'Обрад', 'Обрадин', 'Обрадинка', 'Обрен', 'Обренија', 'Обренко', 'Обретен', 'Огњан', 'Огњана', 'Огњен', 'Озрен',
        'Озриша', 'Олга', 'Оливер', 'Оливера', 'Остоја', 'Оља', 'Пава', 'Павија', 'Павић', 'Павко', 'Павле', 'Павлија',
        'Павлић', 'Пантелија', 'Паун', 'Пауна', 'Пелагија', 'Пера', 'Перица', 'Периша', 'Перо', 'Перса', 'Персида', 'Перун',
        'Перунко', 'Петак', 'Петар', 'Петко', 'Петош', 'Петоје', 'Петра', 'Петрашин', 'Петрија', 'Петроније', 'Пејак', 'Пејо',
        'Плавша', 'Познан', 'Познана', 'Првослав', 'Предраг', 'Прерад', 'Прибић', 'Продан', 'Продана', 'Прокопије', 'Пунан', 'Пуниша',
        'Пуреш', 'Пурко', 'Пуро', 'Рада', 'Радак', 'Радан', 'Радана', 'Радас', 'Радашин', 'Раден', 'Раденко', 'Радета',
        'Радивој', 'Радивоје', 'Радин', 'Радинка', 'Радинко', 'Радисав', 'Радица', 'Радич', 'Радиша', 'Радман', 'Радмила', 'Радмило',
        'Радна', 'Радоба', 'Радобуд', 'Радован', 'Радовац', 'Радоман', 'Радомир', 'Радосав', 'Радослав', 'Радослава', 'Радота', 'Радош',
        'Радоја', 'Радоје', 'Радојица', 'Радојка', 'Радојко', 'Радојло', 'Радоња', 'Радука', 'Радукан', 'Радул', 'Радула', 'Радулин',
        'Радун', 'Радунка', 'Радусин', 'Раин', 'Раица', 'Раич', 'Раичко', 'Рален', 'Ралета', 'Ранисав', 'Ранка', 'Ранко',
        'Раосав', 'Растислав', 'Растко', 'Ратибор', 'Ратко', 'Ратомир', 'Рафаило', 'Рацко', 'Рачета', 'Рашко', 'Рађен', 'Рајак',
        'Рајан', 'Рајка', 'Рајко', 'Рајна', 'Рајчета', 'Рекула', 'Ресан', 'Реља', 'Риста', 'Ристан', 'Ристивоје', 'Ристо',
        'Родољуб', 'Роксанда', 'Роса', 'Ружа', 'Ружица', 'Сава', 'Савка', 'Савко', 'Саво', 'Саздана', 'Самуило', 'Сандра',
        'Сара', 'Сања', 'Светибор', 'Светислав', 'Светислава', 'Светозар', 'Светолик', 'Светомир', 'Светорад', 'Светољуб', 'Свјетлана', 'Секана',
        'Секула', 'Селак', 'Сима', 'Симана', 'Симеон', 'Симеун', 'Симеуна', 'Симка', 'Симо', 'Симон', 'Симонида', 'Синиша',
        'Синђа', 'Синђел', 'Скоросав', 'Скоросава', 'Славен', 'Славенко', 'Славица', 'Славиша', 'Славка', 'Славко', 'Славна', 'Славо',
        'Славомир', 'Славојка', 'Славољуб', 'Славуј', 'Сладоје', 'Слађан', 'Слађана', 'Слободанка', 'Смиља', 'Смиљан', 'Смиљана', 'Смиљка',
        'Смиљко', 'Смољан', 'Смољана', 'Смољка', 'Снежана', 'Сока', 'Соко', 'Софија', 'Спасенија', 'Спасоја', 'Спасоје', 'Спиридон',
        'Споменка', 'Србислав', 'Србијанка', 'Србослав', 'Србољуб', 'Срдан', 'Средоја', 'Средоје', 'Сретен', 'Сретко', 'Срећан', 'Срећко',
        'Срђа', 'Стака', 'Стамена', 'Стаменка', 'Стаменко', 'Стана', 'Станава', 'Станача', 'Станимир', 'Станисав', 'Станисава', 'Станислава',
        'Станица', 'Станиша', 'Станија', 'Станка', 'Станко', 'Станоја', 'Станоје', 'Станојка', 'Станојко', 'Станојла', 'Станојло', 'Сташа',
        'Стајка', 'Стеван', 'Стевица', 'Стево', 'Степан', 'Стефан', 'Стоин', 'Стоисава', 'Стоић', 'Стоја', 'Стојадин', 'Стојак',
        'Стојан', 'Стојана', 'Стојанка', 'Стојка', 'Стојко', 'Стојмен', 'Стојна', 'Стојша', 'Страиња', 'Страхиња', 'Стјепан', 'Сузана',
        'Сњежана', 'Тадеј', 'Тадија', 'Танасије', 'Танацко', 'Танкоса', 'Танкосава', 'Тара', 'Татомир', 'Татјана', 'Тајана', 'Твртко',
        'Теа', 'Теодор', 'Теодосије', 'Теофил', 'Тешан', 'Тимотије', 'Тихомир', 'Тијана', 'Тодор', 'Тодора', 'Тома', 'Томанија',
        'Томаш', 'Томислав', 'Томица', 'Томо', 'Топлица', 'Трајан', 'Трајко', 'Тривун', 'Трипко', 'Трипун', 'Трифун', 'Трпко',
        'Убавка', 'Угљеша', 'Умиљен', 'Уна', 'Урош', 'Утешен', 'Утјешен', 'Фема', 'Хвалимир', 'Хвалислав', 'Хранимир', 'Хранислав',
        'Хранислава', 'Храниша', 'Храстимир', 'Христијан', 'Христослав', 'Цвета', 'Цветин', 'Цветко', 'Цветош', 'Цветоје', 'Цвејан', 'Цвико',
        'Цвијан', 'Цвијета', 'Цвијетин', 'Цвјетко', 'Цвјетош', 'Цвјетоје', 'Цурко', 'Чарна', 'Часлав', 'Чедомир', 'Чубрило', 'Шакота',
        'Шале', 'Шана', 'Шуменко', 'Шутан',
    );

    protected static $firstNameFemale = array(
       'Јована', 'Александра', 'Ангелина', 'Антонина', 'Биљана', 'Влада', 'Драгана', 'Екатерина', 'Елена', 'Здравка', 'Златка', 'Ивана', 'Ирена',
        'Ирина', 'Кристина', 'Лола', 'Марина', 'Марија', 'Маша', 'Милена', 'Милица', 'Мирослава', 'Миљана', 'Наташа', 'Светлана',
        'Соња', 'Тамара', 'Тања', 'Теодора',
        // below are unknown gender firstnames
        'Ђенадије', 'Ђоко', 'Ђорђе', 'Ђорђије', 'Ђорђо', 'Ђука', 'Ђукан', 'Ђура', 'Ђурашин', 'Ђурађ', 'Ђурисав', 'Ђурисава', 'Ђурица',
        'Ђурко', 'Ђуро', 'Ђурђа', 'Ђурђе', 'Ђурђевка', 'Ђурђица', 'Ђурђија', 'Јаблан', 'Јаворка', 'Јаворко', 'Јагода', 'Јагодинка',
        'Јагош', 'Јадранка', 'Јадранко', 'Јаков', 'Јакша', 'Јана', 'Јандре', 'Јандрија', 'Јанићије', 'Јанко', 'Јановка', 'Јанча',
        'Јарослав', 'Јасен', 'Јасенко', 'Јасмина', 'Јасминка', 'Јасна', 'Јања', 'Јевдокија', 'Јеврем', 'Јевросима', 'Јевта', 'Јевтан',
        'Јевтимије', 'Јевто', 'Језда', 'Јездимир', 'Јека', 'Јела', 'Јелача', 'Јелашин', 'Јелен', 'Јелена', 'Јеленка', 'Јеленко',
        'Јелисава', 'Јелисавета', 'Јелисавка', 'Јелисије', 'Јелица', 'Јелка', 'Јеремија', 'Јерко', 'Јеротије', 'Јефимија', 'Јеша', 'Јова',
        'Јован', 'Јованка', 'Јовица', 'Јовиша', 'Јовка', 'Јовко', 'Јово', 'Јоко', 'Јоксим', 'Јоргованка', 'Јордан', 'Јорданка',
        'Јосиф', 'Југомир', 'Југослав', 'Југољуб', 'Јулија', 'Јулијан', 'Јулијана', 'Јулка', 'Јуноша', 'Јуриша', 'Јустин', 'Љепава',
        'Љепосава', 'Љиља', 'Љиљан', 'Љиљана', 'Љуба', 'Љубан', 'Љубен', 'Љубенко', 'Љубивоје', 'Љубинка', 'Љубинко', 'Љубисав',
        'Љубислав', 'Љубица', 'Љубиша', 'Љубо', 'Љубобрат', 'Љубодраг', 'Љубомир', 'Љубомирка', 'Љубосава', 'Љубоја', 'Љубоје', 'Љупка',
        'Његомир', 'Његомирка', 'Његослава', 'Његош', 'Ћерана', 'Ћира', 'Ћирило', 'Ћирко', 'Ћиро', 'Ћирјак', 'Авакум', 'Аврам',
        'Агница', 'Агнија', 'Адам', 'Аделина', 'Аксентије', 'Алекса', 'Александрон', 'Алексеј', 'Алексија', 'Алексије', 'Алимпије', 'Ана',
        'Анастасија', 'Анда', 'Андреј', 'Андреја', 'Андрија', 'Андријана', 'Андријаш', 'Аница', 'Анка', 'Анкица', 'Антоније', 'Анђа',
        'Анђела', 'Анђелија', 'Анђелка', 'Анђелко', 'Аранђел', 'Арса', 'Арсен', 'Арсеније', 'Арсо', 'Атанасије', 'Атанацко', 'Аћим',
        'Балша', 'Бане', 'Батрић', 'Бајко', 'Бајо', 'Бајчета', 'Берисав', 'Берислав', 'Бериша', 'Берко', 'Бисенија', 'Бисерка',
        'Бисерко', 'Биљан', 'Благица', 'Благиња', 'Благомир', 'Благота', 'Благојa', 'Благоје', 'Блажа', 'Блажен', 'Блаженка', 'Блажо',
        'Блашко', 'Богдан', 'Богдана', 'Богданка', 'Богељ', 'Богиша', 'Богић', 'Богобој', 'Богосав', 'Богослав', 'Богоје', 'Богољуб',
        'Божа', 'Божана', 'Божидар', 'Божидарка', 'Божин', 'Божинка', 'Божица', 'Божићко', 'Божо', 'Боин', 'Боица', 'Бора',
        'Боривој', 'Боривоје', 'Борис', 'Борисав', 'Борислав', 'Борислава', 'Бориславка', 'Бориша', 'Борка', 'Борко', 'Боро', 'Бороје',
        'Борјана', 'Борјанка', 'Боса', 'Босиљка', 'Бошко', 'Бојан', 'Бојана', 'Бојко', 'Бојо', 'Бојчета', 'Бранивој', 'Бранивоје',
        'Бранимир', 'Бранислава', 'Бранка', 'Бранкица', 'Бранко', 'Брано', 'Братимир', 'Братислав', 'Братислава', 'Братован', 'Братољуб', 'Брајан',
        'Брајица', 'Брнча', 'Будимир', 'Будимирка', 'Будимка', 'Будисав', 'Будислав', 'Валерија', 'Варвара', 'Васа', 'Василија', 'Василије',
        'Василка', 'Васиљ', 'Васиљка', 'Васко', 'Васкрсија', 'Васкрсије', 'Васо', 'Васоје', 'Вајо', 'Вања', 'Векослав', 'Велибор',
        'Велиборка', 'Велизар', 'Велимир', 'Велинка', 'Велисав', 'Велисава', 'Величко', 'Велиша', 'Вера', 'Веран', 'Верица', 'Верка',
        'Вероника', 'Верослава', 'Верољуб', 'Весела', 'Веселин', 'Веселинка', 'Веско', 'Весна', 'Вељко', 'Вид', 'Вида', 'Видак',
        'Видан', 'Видач', 'Виден', 'Видосав', 'Видосава', 'Видоја', 'Видоје', 'Видојка', 'Видојко', 'Виктор', 'Викторија', 'Вилотије',
        'Виолета', 'Витка', 'Витко', 'Витомир', 'Витомирка', 'Вишеслав', 'Вишеслава', 'Вишња', 'Вићан', 'Вићентије', 'Владан', 'Владана',
        'Владанка', 'Владе', 'Владета', 'Владимирка', 'Владисав', 'Владислава', 'Владица', 'Владо', 'Владоје', 'Владун', 'Влаислав', 'Власије',
        'Власта', 'Властимир', 'Властимирка', 'Влатка', 'Влатко', 'Влашко', 'Влајко', 'Воица', 'Војдраг', 'Војимир', 'Војин', 'Војислав',
        'Војислава', 'Војка', 'Војкан', 'Војко', 'Вранеш', 'Вугдраг', 'Вузман', 'Вуило', 'Вуин', 'Вуица', 'Вук', 'Вукадин',
        'Вукало', 'Вукан', 'Вукана', 'Вукас', 'Вукац', 'Вукач', 'Вукашин', 'Вукајло', 'Вукаљ', 'Вукеља', 'Вукица', 'Вукић',
        'Вукман', 'Вукмир', 'Вукмира', 'Вукмиљ', 'Вуко', 'Вуковоје', 'Вукола', 'Вукоман', 'Вукомир', 'Вукосав', 'Вукосава', 'Вукослав',
        'Вукота', 'Вукоје', 'Вукојица', 'Вуксан', 'Вукша', 'Вуле', 'Вулета', 'Вунко', 'Вуча', 'Вучан', 'Вучен', 'Вучета',
        'Вучина', 'Вучић', 'Вучко', 'Вујадин', 'Вујадинка', 'Вујак', 'Вујан', 'Вујана', 'Вујета', 'Вујка', 'Вујко', 'Вујо',
        'Вујчета', 'Вујчин', 'Вјекослав', 'Гавра', 'Гаврила', 'Гаврилка', 'Гаврило', 'Гача', 'Гаја', 'Гајин', 'Гајо', 'Гвозден',
        'Гвозденија', 'Гвозденко', 'Генадије', 'Георгина', 'Георгије', 'Герасим', 'Герман', 'Глигорије', 'Глиша', 'Глишо', 'Годеч', 'Годомир',
        'Голуб', 'Горана', 'Горанка', 'Гордан', 'Гордана', 'Горица', 'Горчин', 'Горјана', 'Госпава', 'Гостимир', 'Гостољуб', 'Гојко',
        'Градета', 'Градимир', 'Градиша', 'Гргур', 'Грдан', 'Григорије', 'Гријак', 'Грозда', 'Гроздан', 'Гроздана', 'Грубан', 'Грубац',
        'Грубач', 'Грубета', 'Грубеша', 'Грубиша', 'Груја', 'Грујица', 'Грујо', 'Дабижив', 'Дабиша', 'Дабо', 'Давид', 'Даворка',
        'Далиборка', 'Дамјан', 'Дамјанка', 'Дамљан', 'Дамљанка', 'Дана', 'Дане', 'Даница', 'Данијел', 'Данка', 'Данко', 'Данојла',
        'Данчул', 'Дара', 'Даринка', 'Дарио', 'Дарије', 'Даријо', 'Дарко', 'Дарјан', 'Дафина', 'Даша', 'Дева', 'Деса',
        'Десанка', 'Десимир', 'Деспина', 'Деспиња', 'Деспот', 'Дејана', 'Дивна', 'Дикосава', 'Димитрије', 'Димчо', 'Дмитар', 'Дмитра',
        'Добрашин', 'Добривој', 'Добривоје', 'Добрила', 'Добрило', 'Добринка', 'Добринко', 'Добрица', 'Добрија', 'Добровук', 'Добросав', 'Доброслав',
        'Докна', 'Доко', 'Доротеј', 'Доротеја', 'Доситеј', 'Достана', 'Дојчило', 'Дојчин', 'Драга', 'Драгаш', 'Драгица', 'Драгиша',
        'Драгија', 'Драгиња', 'Драгић', 'Драго', 'Драгобрат', 'Драгован', 'Драгоман', 'Драгомир', 'Драгомира', 'Драгорад', 'Драгосав', 'Драгослав',
        'Драгослава', 'Драгош', 'Драгоја', 'Драгоје', 'Драгојла', 'Драгојло', 'Драгољуб', 'Драгутин', 'Дража', 'Дражета', 'Дражо', 'Драило',
        'Дракша', 'Драшко', 'Дрена', 'Дренка', 'Дрина', 'Дринка', 'Дубравац', 'Дубравка', 'Дубравко', 'Дука', 'Дукадин', 'Душанка',
        'Душица', 'Душка', 'Душко', 'Дујак', 'Дуња', 'Ева', 'Евгенија', 'Евгеније', 'Евдокија', 'Евица', 'Емил', 'Емилија',
        'Емилијан', 'Емилије', 'Ерак', 'Жаклина', 'Жанка', 'Жарко', 'Желимир', 'Желимирка', 'Жељана', 'Жељка', 'Жељко', 'Жива',
        'Живадин', 'Живадинка', 'Живан', 'Живана', 'Живанка', 'Живанко', 'Живица', 'Живка', 'Живодарка', 'Живомир', 'Живорад', 'Живоратка',
        'Живослава', 'Живославка', 'Живота', 'Живојин', 'Живољуб', 'Жика', 'Жикица', 'Житомир', 'Завида', 'Завиша', 'Зага', 'Загорка',
        'Зарија', 'Зарије', 'Захарије', 'Звездан', 'Звездана', 'Звездодраг', 'Звездослав', 'Звонимир', 'Звонка', 'Звонко', 'Звјездан', 'Звјездана',
        'Здравиша', 'Здравко', 'Злата', 'Златан', 'Златана', 'Златибор', 'Златица', 'Златија', 'Златко', 'Златомир', 'Златомирка', 'Златосав',
        'Златоје', 'Зора', 'Зорана', 'Зорислава', 'Зорица', 'Зорка', 'Зринка', 'Зринко', 'Ива', 'Иваниш', 'Иванка', 'Ивица',
        'Ивка', 'Ивко', 'Ивона', 'Игор', 'Игњат', 'Игњатије', 'Иконија', 'Илинка', 'Илија', 'Исаило', 'Исаија', 'Исак',
        'Исидор', 'Исидора', 'Кадивка', 'Кажимир', 'Казимир', 'Казимира', 'Каменко', 'Касија', 'Ката', 'Катарина', 'Катица', 'Кипријан',
        'Кирило', 'Кована', 'Ковина', 'Ковиљка', 'Ковиљко', 'Козма', 'Кокан', 'Комнен', 'Комненија', 'Корнелије', 'Косана', 'Косара',
        'Косовка', 'Коста', 'Костадин', 'Костадинка', 'Коча', 'Коштана', 'Којадин', 'Којадинка', 'Којчин', 'Крагуј', 'Краисава', 'Красимир',
        'Красоје', 'Крајислав', 'Крајчин', 'Крсман', 'Крсманија', 'Крста', 'Крстан', 'Крстана', 'Крстивоје', 'Крстина', 'Крсто', 'Крунислав',
        'Крунослава', 'Ксенија', 'Кузман', 'Кумодраг', 'Лабуд', 'Лаза', 'Лазар', 'Лазо', 'Лака', 'Лакета', 'Лако', 'Лале',
        'Лана', 'Лара', 'Латинка', 'Лежимир', 'Лела', 'Лена', 'Ленка', 'Леонида', 'Леонора', 'Лепа', 'Лепомир', 'Лепосава',
        'Лепослав', 'Лепоје', 'Лидија', 'Лиза', 'Лила', 'Лилијана', 'Лозан', 'Луна', 'Луча', 'Лучија', 'Лујо', 'Маврен',
        'Малета', 'Малеш', 'Малина', 'Малинка', 'Манда', 'Мандуша', 'Мане', 'Манојло', 'Мара', 'Маринка', 'Маринко', 'Марица',
        'Марко', 'Марта', 'Марјан', 'Матеј', 'Матеја', 'Матија', 'Матијаш', 'Мато', 'Машан', 'Машко', 'Маја', 'Мајда',
        'Медак', 'Мила', 'Миладин', 'Миладија', 'Милак', 'Милана', 'Миланка', 'Миланко', 'Милат', 'Милаш', 'Милашин', 'Миле',
        'Милева', 'Милен', 'Миленко', 'Милентије', 'Милеса', 'Милета', 'Милеш', 'Миливој', 'Миливоје', 'Милин', 'Милина', 'Милинко',
        'Милисав', 'Милисава', 'Милисавка', 'Милија', 'Милијан', 'Милијана', 'Милијаш', 'Милић', 'Милка', 'Милкица', 'Мило', 'Милован',
        'Миломир', 'Милорад', 'Милосав', 'Милосава', 'Милосавка', 'Милоја', 'Милоје', 'Милојица', 'Милојка', 'Милојко', 'Милтен', 'Милука',
        'Милун', 'Милунка', 'Милутин', 'Милуш', 'Милуша', 'Миодраг', 'Миомир', 'Миомирка', 'Мира', 'Мирен', 'Мирка', 'Мирко',
        'Миро', 'Миросав', 'Миросава', 'Мирољуб', 'Мирчета', 'Мирјана', 'Митар', 'Митра', 'Михаило', 'Михајло', 'Мишко', 'Мишо',
        'Мишљен', 'Мија', 'Мијаило', 'Мијак', 'Мијан', 'Мијана', 'Мијат', 'Мијо', 'Мијобрат', 'Мијушко', 'Миљ', 'Миља',
        'Миљан', 'Миљен', 'Миљка', 'Миљко', 'Миљојко', 'Миљурко', 'Мића', 'Мићан', 'Мићо', 'Младен', 'Млађан', 'Млађен',
        'Момир', 'Момчило', 'Мојсило', 'Мркша', 'Мрђан', 'Мрђен', 'Нада', 'Надежда', 'Надица', 'Наталија', 'Наум', 'Нађа',
        'Најда', 'Најдан', 'Небојша', 'Невен', 'Невена', 'Невенка', 'Невенко', 'Негован', 'Негомир', 'Неда', 'Недељка', 'Недељко',
        'Немања', 'Ненад', 'Нестор', 'Нешко', 'Неђељка', 'Неђељко', 'Никашин', 'Никодим', 'Никодије', 'Никола', 'Николета', 'Николија',
        'Никша', 'Нина', 'Нинко', 'Нино', 'Нинослав', 'Нишава', 'Нићифор', 'Новак', 'Новица', 'Новиша', 'Новка', 'Новко',
        'Ново', 'Обрад', 'Обрадин', 'Обрадинка', 'Обрен', 'Обренија', 'Обренко', 'Обретен', 'Огњан', 'Огњана', 'Огњен', 'Озрен',
        'Озриша', 'Олга', 'Оливер', 'Оливера', 'Остоја', 'Оља', 'Пава', 'Павија', 'Павић', 'Павко', 'Павле', 'Павлија',
        'Павлић', 'Пантелија', 'Паун', 'Пауна', 'Пелагија', 'Пера', 'Перица', 'Периша', 'Перо', 'Перса', 'Персида', 'Перун',
        'Перунко', 'Петак', 'Петар', 'Петко', 'Петош', 'Петоје', 'Петра', 'Петрашин', 'Петрија', 'Петроније', 'Пејак', 'Пејо',
        'Плавша', 'Познан', 'Познана', 'Првослав', 'Предраг', 'Прерад', 'Прибић', 'Продан', 'Продана', 'Прокопије', 'Пунан', 'Пуниша',
        'Пуреш', 'Пурко', 'Пуро', 'Рада', 'Радак', 'Радан', 'Радана', 'Радас', 'Радашин', 'Раден', 'Раденко', 'Радета',
        'Радивој', 'Радивоје', 'Радин', 'Радинка', 'Радинко', 'Радисав', 'Радица', 'Радич', 'Радиша', 'Радман', 'Радмила', 'Радмило',
        'Радна', 'Радоба', 'Радобуд', 'Радован', 'Радовац', 'Радоман', 'Радомир', 'Радосав', 'Радослав', 'Радослава', 'Радота', 'Радош',
        'Радоја', 'Радоје', 'Радојица', 'Радојка', 'Радојко', 'Радојло', 'Радоња', 'Радука', 'Радукан', 'Радул', 'Радула', 'Радулин',
        'Радун', 'Радунка', 'Радусин', 'Раин', 'Раица', 'Раич', 'Раичко', 'Рален', 'Ралета', 'Ранисав', 'Ранка', 'Ранко',
        'Раосав', 'Растислав', 'Растко', 'Ратибор', 'Ратко', 'Ратомир', 'Рафаило', 'Рацко', 'Рачета', 'Рашко', 'Рађен', 'Рајак',
        'Рајан', 'Рајка', 'Рајко', 'Рајна', 'Рајчета', 'Рекула', 'Ресан', 'Реља', 'Риста', 'Ристан', 'Ристивоје', 'Ристо',
        'Родољуб', 'Роксанда', 'Роса', 'Ружа', 'Ружица', 'Сава', 'Савка', 'Савко', 'Саво', 'Саздана', 'Самуило', 'Сандра',
        'Сара', 'Сања', 'Светибор', 'Светислав', 'Светислава', 'Светозар', 'Светолик', 'Светомир', 'Светорад', 'Светољуб', 'Свјетлана', 'Секана',
        'Секула', 'Селак', 'Сима', 'Симана', 'Симеон', 'Симеун', 'Симеуна', 'Симка', 'Симо', 'Симон', 'Симонида', 'Синиша',
        'Синђа', 'Синђел', 'Скоросав', 'Скоросава', 'Славен', 'Славенко', 'Славица', 'Славиша', 'Славка', 'Славко', 'Славна', 'Славо',
        'Славомир', 'Славојка', 'Славољуб', 'Славуј', 'Сладоје', 'Слађан', 'Слађана', 'Слободанка', 'Смиља', 'Смиљан', 'Смиљана', 'Смиљка',
        'Смиљко', 'Смољан', 'Смољана', 'Смољка', 'Снежана', 'Сока', 'Соко', 'Софија', 'Спасенија', 'Спасоја', 'Спасоје', 'Спиридон',
        'Споменка', 'Србислав', 'Србијанка', 'Србослав', 'Србољуб', 'Срдан', 'Средоја', 'Средоје', 'Сретен', 'Сретко', 'Срећан', 'Срећко',
        'Срђа', 'Стака', 'Стамена', 'Стаменка', 'Стаменко', 'Стана', 'Станава', 'Станача', 'Станимир', 'Станисав', 'Станисава', 'Станислава',
        'Станица', 'Станиша', 'Станија', 'Станка', 'Станко', 'Станоја', 'Станоје', 'Станојка', 'Станојко', 'Станојла', 'Станојло', 'Сташа',
        'Стајка', 'Стеван', 'Стевица', 'Стево', 'Степан', 'Стефан', 'Стоин', 'Стоисава', 'Стоић', 'Стоја', 'Стојадин', 'Стојак',
        'Стојан', 'Стојана', 'Стојанка', 'Стојка', 'Стојко', 'Стојмен', 'Стојна', 'Стојша', 'Страиња', 'Страхиња', 'Стјепан', 'Сузана',
        'Сњежана', 'Тадеј', 'Тадија', 'Танасије', 'Танацко', 'Танкоса', 'Танкосава', 'Тара', 'Татомир', 'Татјана', 'Тајана', 'Твртко',
        'Теа', 'Теодор', 'Теодосије', 'Теофил', 'Тешан', 'Тимотије', 'Тихомир', 'Тијана', 'Тодор', 'Тодора', 'Тома', 'Томанија',
        'Томаш', 'Томислав', 'Томица', 'Томо', 'Топлица', 'Трајан', 'Трајко', 'Тривун', 'Трипко', 'Трипун', 'Трифун', 'Трпко',
        'Убавка', 'Угљеша', 'Умиљен', 'Уна', 'Урош', 'Утешен', 'Утјешен', 'Фема', 'Хвалимир', 'Хвалислав', 'Хранимир', 'Хранислав',
        'Хранислава', 'Храниша', 'Храстимир', 'Христијан', 'Христослав', 'Цвета', 'Цветин', 'Цветко', 'Цветош', 'Цветоје', 'Цвејан', 'Цвико',
        'Цвијан', 'Цвијета', 'Цвијетин', 'Цвјетко', 'Цвјетош', 'Цвјетоје', 'Цурко', 'Чарна', 'Часлав', 'Чедомир', 'Чубрило', 'Шакота',
        'Шале', 'Шана', 'Шуменко', 'Шутан',
    );

    /**
     * @link http://sr.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%B0%D0%BA_%D1%81%D1%80%D0%BF%D1%81%D0%BA%D0%B8%D1%85_%D0%BF%D1%80%D0%B5%D0%B7%D0%B8%D0%BC%D0%B5%D0%BD%D0%B0_%D1%81%D0%B0_%D0%BD%D0%B0%D1%81%D1%82%D0%B0%D0%B2%D0%BA%D0%BE%D0%BC_-%D0%B8%D1%9B
     */
    protected static $lastName = array(
        'Абаџић', 'Абдулић', 'Абрамић', 'Авалић', 'Авдулић', 'Аврић', 'Агуридић', 'Адамић', 'Азарић', 'Ајдачић', 'Ајдучић', 'Аксентић', 'Аксић', 'Алавантић', 'Аладић', 'Аларгић', 'Албијанић', 'Александрић', 'Алексендрић', 'Алексић', 'Алимпић', 'Аличић', 'Аљанчић', 'Амиџић', 'Ананић', 'Андић', 'Андрејић', 'Андријанић', 'Андрић', 'Андробић', 'Анђелић', 'Анђић', 'Анђушић', 'Анић', 'Аничић', 'Анкић', 'Анојчић', 'Анокић', 'Антић', 'Антонић', 'Анушић', 'Апелић', 'Апић', 'Арамбашић', 'Ардалић', 'Арсенић', 'Арсић', 'Атлагић', 'Аћимић', 'Аћић', 'Ацић', 'Ачић', 'Аџић', 'Ашкрабић', 'Ашћерић', 'Бабарогић', 'Бабић', 'Баварчић', 'Бавељић', 'Бадрић', 'Бајагић', 'Бајандић', 'Бајић', 'Бајичић', 'Бајкић', 'Бајчетић', 'Бајчић', 'Бакић', 'Балетић', 'Балотић', 'Балтић', 'Балшић', 'Банзић', 'Банић', 'Бантулић', 'Бањалић', 'Баралић', 'Барић', 'Баришић', 'Барошевчић', 'Басарић', 'Бастајић', 'Басташић', 'Батавељић', 'Батинић', 'Батножић', 'Баћић', 'Бацетић', 'Бачић', 'Бачкулић', 'Башић', 'Баштић', 'Бебић', 'Бегенишић', 'Бежанић', 'Бекчић', 'Беланчић', 'Белић', 'Белогрлић', 'Белодедић', 'Белонић', 'Бељић', 'Бендић', 'Берилажић', 'Берић', 'Беседић', 'Бесједић', 'Биберчић', 'Биберџић', 'Бибић', 'Бижић', 'Бизетић', 'Бизумић', 'Бијанић', 'Бијелић', 'Бијелонић', 'Билибајкић', 'Билић', 'Билкић', 'Биљић', 'Биљурић', 'Бинић', 'Биришић', 'Бисенић', 'Бисерић', 'Бисерчић', 'Бисић', 'Бјекић', 'Бјелетић', 'Бјелинић', 'Бјелић', 'Бјеличић', 'Бјелкић', 'Бјеловитић', 'Бјелогрлић', 'Бјелонић', 'Бјелотомић', 'Благић', 'Благотић', 'Блажарић', 'Блажетић', 'Блажић', 'Блатешић', 'Блендић', 'Блесић', 'Блечић', 'Блешић', 'Боберић', 'Бобић', 'Бобушић', 'Богатић', 'Богданић', 'Богетић', 'Богић', 'Богичић', 'Бодирогић', 'Бодирожић', 'Бодић', 'Бодрожић', 'Божанић', 'Божикић', 'Божић', 'Божичић', 'Бојадић', 'Бојанић', 'Бојић', 'Бојичић', 'Бојкић', 'Бојчетић', 'Бојчић', 'Боканић', 'Бокоњић', 'Болић', 'Болтић', 'Бољанић', 'Бонтић', 'Бонџић', 'Бонџулић', 'Борикић', 'Борић', 'Боричић', 'Боришић', 'Борјанић', 'Борокић', 'Боротић', 'Борчић', 'Босанчић', 'Босиљкић', 'Босиљчић', 'Босиорчић', 'Босиочић', 'Босић', 'Боснић', 'Боторић', 'Боцић', 'Боцокић', 'Бошњачић', 'Боштрунић', 'Брадарић', 'Брадић', 'Брадоњић', 'Брајић', 'Бралетић', 'Бралић', 'Бралушић', 'Бранчић', 'Братић', 'Братоножић', 'Брашић', 'Брдарић', 'Брежанчић', 'Брезић', 'Брекић', 'Брзић', 'Брисић', 'Брканлић', 'Бркић', 'Брндушић', 'Бродалић', 'Бродић', 'Броћић', 'Бруић', 'Брујић', 'Брукић', 'Бубић', 'Бубоњић', 'Бугарчић', 'Будалић', 'Будимкић', 'Будимчић', 'Будинчић', 'Будић', 'Будишић', 'Буднић', 'Будурић', 'Бузаретић', 'Бујагић', 'Бујандрић', 'Бујић', 'Бујишић', 'Бујуклић', 'Буказић', 'Буквић', 'Букелић', 'Буковчић', 'Букоњић', 'Букумирић', 'Букушић', 'Булајић', 'Булић', 'Буљубашић', 'Буљугић', 'Бумбић', 'Бунарџић', 'Бунић', 'Бунчић', 'Бургић', 'Бурић', 'Бурлић', 'Бусанчић', 'Буцкић', 'Бучић', 'Бушетић', 'Бушић', 'Вагић', 'Вагурић', 'Вајић', 'Вајкарић', 'Вакичић', 'Ванушић', 'Варагић', 'Вараклић', 'Вардалић', 'Варјачић', 'Варничић', 'Васелић', 'Василић', 'Васић', 'Вашалић', 'Векић', 'Велетић', 'Великић', 'Величић', 'Велишић', 'Вељанчић', 'Вељић', 'Вемић', 'Вербић', 'Вербункић', 'Вергић', 'Верић', 'Веркић', 'Веселић', 'Веселичић', 'Весић', 'Веснић', 'Видарић', 'Видачић', 'Видеканић', 'Видић', 'Вилендечић', 'Вилотић', 'Винокић', 'Винчић', 'Виорикић', 'Витакић', 'Витолић', 'Вићентић', 'Вишић', 'Владетић', 'Владић', 'Владичић', 'Владушић', 'Влајић', 'Влајнић', 'Влајчић', 'Влакетић', 'Власинић', 'Власоњић', 'Властић', 'Влачић', 'Влашкалић', 'Војичић', 'Војкић', 'Војчић', 'Воргић', 'Воркапић', 'Воћкић', 'Воштинић', 'Воштић', 'Вранић', 'Вранчић', 'Вратоњић', 'Врачарић', 'Врекић', 'Врећић', 'Врзић', 'Вртунић', 'Вругић', 'Вујанић', 'Вујанушић', 'Вујачић', 'Вујетић', 'Вујинић', 'Вујисић', 'Вујић', 'Вујичић', 'Вујнић', 'Вујчетић', 'Вуканић', 'Вукелић', 'Вукић', 'Вукоичић', 'Вукојичић', 'Вукојчић', 'Вуколић', 'Вукоманчић', 'Вукосавић', 'Вукотић', 'Вукшић', 'Вулетић', 'Вулешић', 'Вуликић', 'Вулић', 'Вулишић', 'Вуцелић', 'Вучелић', 'Вучендић', 'Вученић', 'Вучетић', 'Вучинић', 'Вучић', 'Гаварић', 'Гавранић', 'Гавранчић', 'Гаврић', 'Гагић', 'Гагричић', 'Гајанић', 'Гајетић', 'Гајић', 'Гајичић', 'Гајтанић', 'Галетић', 'Галић', 'Галонић', 'Галоњић', 'Гамбелић', 'Гарачић', 'Гардић', 'Гарић', 'Гаротић', 'Гатарић', 'Гачић', 'Гаџић', 'Гашић', 'Гвозденић', 'Гвоздић', 'Гвоић', 'Гвојић', 'Генчић', 'Герзић', 'Гиздавић', 'Гилић', 'Главендекић', 'Главинић', 'Главонић', 'Главоњић', 'Главчић', 'Гламочић', 'Гледић', 'Глежнић', 'Глибетић', 'Глигић', 'Глигорић', 'Глигурић', 'Глинтић', 'Глишић', 'Глогињић', 'Гломазић', 'Глувајић', 'Глумичић', 'Гмизић', 'Гњатић', 'Гобељић', 'Гогић', 'Гојгић', 'Гонцић', 'Горанић', 'Горанчић', 'Горданић', 'Гордић', 'Гороњић', 'Госпавић', 'Гостић', 'Гостојић', 'Гоцић', 'Гошњић', 'Грабић', 'Грабовчић', 'Градић', 'Грамић', 'Грандић', 'Гранолић', 'Гранулић', 'Граонић', 'Грашић', 'Грбић', 'Гречић', 'Гркинић', 'Грозданић', 'Гроздић', 'Гроканић', 'Громилић', 'Грубачић', 'Грубетић', 'Грубешић', 'Грубић', 'Грубишић', 'Грубјешић', 'Грубљешић', 'Грубнић', 'Гружанић', 'Грујанић', 'Грујић', 'Грујичић', 'Грумић', 'Губеринић', 'Гудурић', 'Гужвић', 'Гујаничић', 'Гурешић', 'Гуцонић', 'Гуџулић', 'Гушић', 'Дабарчић', 'Дабетић', 'Дабић', 'Давинић', 'Дајић', 'Дајлић', 'Дамјанић', 'Дангић', 'Дангубић', 'Даничић', 'Данојлић', 'Дардић', 'Дафунић', 'Дачић', 'Двокић', 'Дворанчић', 'Дворнић', 'Дебелногић', 'Девеџић', 'Дедић', 'Дејанић', 'Делић', 'Демић', 'Демоњић', 'Денић', 'Денкић', 'Денчић', 'Дерајић', 'Деретић', 'Дерикоњић', 'Дероњић', 'Десанчић', 'Деспенић', 'Деспинић', 'Деспић', 'Деурић', 'Дешић', 'Дивић', 'Дивнић', 'Дивчић', 'Дикић', 'Диклић', 'Дикосавић', 'Диманић', 'Димитрић', 'Димић', 'Димкић', 'Димчић', 'Динић', 'Динкић', 'Динчић', 'Дискић', 'Дичић', 'Добранић', 'Добратић', 'Добрић', 'Добричић', 'Довијанић', 'Доганџић', 'Догањић', 'Додић', 'Докић', 'Докнић', 'Долинић', 'Дончић', 'Доронтић', 'Достанић', 'Достић', 'Достичић', 'Дотлић', 'Дравић', 'Драганић', 'Драгинчић', 'Драгић', 'Драгишић', 'Драгољић', 'Драгоњић', 'Драгославић', 'Драготић', 'Драгушић', 'Дражић', 'Драјић', 'Дракулић', 'Драмлић', 'Дрангић', 'Драшкић', 'Дрезгић', 'Дрекић', 'Дренић', 'Дринић', 'Дринчић', 'Дружетић', 'Друлић', 'Дрчелић', 'Дубајић', 'Дубачкић', 'Дубоњић', 'Дугалић', 'Дугић', 'Дугоњић', 'Дудић', 'Дукић', 'Думањић', 'Думељић', 'Думитрикић', 'Думнић', 'Думонић', 'Дунчић', 'Дуњић', 'Дуроњић', 'Дучић', 'Душанић', 'Ђајић', 'Ђакушић', 'Ђапић', 'Ђекић', 'Ђелић', 'Ђелкапић', 'Ђенадић', 'Ђенисић', 'Ђенић', 'Ђерић', 'Ђикић', 'Ђинђић', 'Ђокић', 'Ђорђић', 'Ђорић', 'Ђузић', 'Ђујић', 'Ђукарић', 'Ђукелић', 'Ђукетић', 'Ђукић', 'Ђукнић', 'Ђурагић', 'Ђуракић', 'Ђурђић', 'Ђуретић', 'Ђурић', 'Ђуричић', 'Ђуришић', 'Ђуркић', 'Ђусић', 'Евђенић', 'Егарић', 'Егерић', 'Егић', 'Екмечић', 'Екмеџић', 'Ергић', 'Еремић', 'Ерић', 'Ерлетић', 'Ерчић', 'Жагрић', 'Жарић', 'Жаркић', 'Жепинић', 'Жеравић', 'Жеравчић', 'Жерајић', 'Жестић', 'Живанић', 'Живанкић', 'Живић', 'Животић', 'Жигић', 'Жижић', 'Жикелић', 'Жикић', 'Жилетић', 'Жилић', 'Жмирић', 'Жмукић', 'Жмурић', 'Жугић', 'Жунић', 'Жутић', 'Жутобрадић', 'Забурнић', 'Завишић', 'Загорчић', 'Закић', 'Запукић', 'Зарадић', 'Зарић', 'Затежић', 'Захарић', 'Збиљић', 'Звекић', 'Звиздић', 'Здравић', 'Здујић', 'Зебић', 'Зекавичић', 'Зекић', 'Зелић', 'Зимоњић', 'Зинаић', 'Зинајић', 'Зисић', 'Зјајић', 'Зјалић', 'Зјачић', 'Златић', 'Зличић', 'Зловарић', 'Зојкић', 'Зокић', 'Золотић', 'Зорбић', 'Зорић', 'Зоричић', 'Зоркић', 'Зракић', 'Зрилић', 'Зрнић', 'Зубић', 'Зурнић', 'Ибрић', 'Иванић', 'Ивантић', 'Иванчић', 'Ивезић', 'Иветић', 'Ивић', 'Ивичић', 'Ивуцић', 'Игић', 'Игњатић', 'Игњић', 'Ијачић', 'Икић', 'Иконић', 'Илибашић', 'Илијић', 'Иликић', 'Илинчић', 'Илисић', 'Илић', 'Иличић', 'Илкић', 'Инђић', 'Ирић', 'Ичелић', 'Јабланчић', 'Јаворић', 'Јагличић', 'Јагодић', 'Јакић', 'Јакишић', 'Јаконић', 'Јакшић', 'Јалић', 'Јандрић', 'Јаникић', 'Јанић', 'Јаничић', 'Јанкелић', 'Јанкић', 'Јанојкић', 'Јанчић', 'Јанчурић', 'Јањић', 'Јањушић', 'Јарић', 'Јаснић', 'Јашић', 'Јевдоксић', 'Јевђенић', 'Јеверичић', 'Јевић', 'Јеврић', 'Јевтић', 'Јегдић', 'Јездић', 'Језеркић', 'Јелачић', 'Јелашић', 'Јеленић', 'Јелесић', 'Јеликић', 'Јелисавчић', 'Јелисић', 'Јелић', 'Јеличић', 'Јелушић', 'Јенић', 'Јергић', 'Јеремић', 'Јеринић', 'Јеринкић', 'Јеросимић', 'Јеротић', 'Јерчић', 'Јесретић', 'Јестротић', 'Јефтенић', 'Јефтић', 'Јечменић', 'Јешић', 'Јовакарић', 'Јовандић', 'Јованетић', 'Јованић', 'Јованкић', 'Јованчић', 'Јоваџић', 'Јовелић', 'Јовељић', 'Јоветић', 'Јовешић', 'Јовикић', 'Јовић', 'Јовичић', 'Јовишић', 'Јовкић', 'Јовонић', 'Јовчић', 'Јозић', 'Јојић', 'Јојчић', 'Јокић', 'Јокичић', 'Јоксић', 'Јолић', 'Јоникић', 'Јонић', 'Јоничић', 'Јонкић', 'Јонтић', 'Јончић', 'Јоргић', 'Јоргонић', 'Јосић', 'Јоцић', 'Јузбашић', 'Јукић', 'Јунгић', 'Јуришић', 'Јушкић', 'Кавалић', 'Кајганић', 'Калабић', 'Калајић', 'Калајџић', 'Календић', 'Каленић', 'Калинић', 'Камперелић', 'Кандић', 'Канлић', 'Кањерић', 'Каравидић', 'Карагић', 'Карајчић', 'Караклајић', 'Каралеић', 'Каралејић', 'Каралић', 'Карапанџић', 'Каратошић', 'Караулић', 'Караџић', 'Карић', 'Каришић', 'Карличић', 'Катанић', 'Катић', 'Каћурић', 'Качаниклић', 'Кашерић', 'Квргић', 'Кендришић', 'Кентрић', 'Кепић', 'Кесић', 'Кечкић', 'Кијачић', 'Кимчетић', 'Киселчић', 'Китанић', 'Китић', 'Китоњић', 'Кичић', 'Клевернић', 'Клепић', 'Клинић', 'Клипић', 'Клисарић', 'Клисурић', 'Кличарић', 'Кљајић', 'Кљакић', 'Кнежић', 'Кованушић', 'Кованџић', 'Коварбашић', 'Ковачић', 'Ковинић', 'Ковинчић', 'Ковјанић', 'Ковјенић', 'Ковљенић', 'Козић', 'Којанић', 'Којић', 'Којичић', 'Којчић', 'Којунџић', 'Колавчић', 'Коларић', 'Колачарић', 'Количић', 'Колунџић', 'Кољанчић', 'Комадинић', 'Комарчић', 'Комленић', 'Комненић', 'Кондић', 'Контић', 'Концулић', 'Коњикушић', 'Кораксић', 'Кордић', 'Коругић', 'Коружић', 'Косанић', 'Косић', 'Коснић', 'Косорић', 'Костић', 'Котарлић', 'Котлајић', 'Кочић', 'Коџопељић', 'Кошарић', 'Кошпић', 'Кошутић', 'Краварушић', 'Кравић', 'Крагић', 'Краинчанић', 'Крантић', 'Красавчић', 'Красић', 'Крезић', 'Крејић', 'Кремић', 'Кремоњић', 'Крестић', 'Кривошић', 'Кркељић', 'Кркић', 'Кркобабић', 'Крнетић', 'Крњајић', 'Крњеушић', 'Кромпић', 'Кротић', 'Крпић', 'Крсманић', 'Крсмић', 'Крстајић', 'Крстеканић', 'Крстинић', 'Крстић', 'Крстичић', 'Крстонић', 'Крстоношић', 'Кртинић', 'Крунић', 'Крушкоњић', 'Кршић', 'Кувељић', 'Кудрић', 'Кузмић', 'Кујавић', 'Кујачић', 'Кујунџић', 'Кукрић', 'Кулезић', 'Кулизић', 'Кулишић', 'Кулунџић', 'Куљанчић', 'Куљић', 'Кумрић', 'Курељушић', 'Курилић', 'Курсулић', 'Куруцић', 'Курчубић', 'Кусонић', 'Кусоњић', 'Кустурић', 'Кутлачић', 'Кутлешић', 'Кушић', 'Кушљић', 'Лаботић', 'Лаврнић', 'Лажетић', 'Лазендић', 'Лазетић', 'Лазић', 'Лазичић', 'Лазукић', 'Лајшић', 'Лакетић', 'Лакић', 'Лалић', 'Ламбић', 'Лапчић', 'Ластић', 'Латинчић', 'Лебурић', 'Лежаић', 'Лежајић', 'Леканић', 'Лекић', 'Лемаић', 'Лемајић', 'Лепосавић', 'Лесендрић', 'Лечић', 'Лештарић', 'Лијескић', 'Ликодрић', 'Ликушић', 'Лилић', 'Липовчић', 'Лисичић', 'Лишанчић', 'Ловрић', 'Лозанић', 'Лојаничић', 'Лолић', 'Ломић', 'Лопандић', 'Лубардић', 'Лубинић', 'Лубурић', 'Лугоњић', 'Лужаић', 'Лужајић', 'Лукајић', 'Лукачић', 'Лукендић', 'Лукић', 'Лукичић', 'Лунић', 'Луткић', 'Лучић', 'Љамић', 'Љеганушић', 'Љотић', 'Љубанић', 'Љубић', 'Љубичић', 'Љубишић', 'Љушић', 'Љушкић', 'Маглић', 'Мајкић', 'Макарић', 'Макивић', 'Макрагић', 'Максић', 'Малавразић', 'Малбашић', 'Маленчић', 'Малетић', 'Малешић', 'Малинић', 'Малишић', 'Малобабић', 'Малушић', 'Маљугић', 'Маљчић', 'Мандарић', 'Мандинић', 'Мандић', 'Мандушић', 'Манић', 'Манчић', 'Мањенчић', 'Маравић', 'Маринчић', 'Марић', 'Маричић', 'Маркагић', 'Маркелић', 'Маркељић', 'Маркулић', 'Мародић', 'Мартић', 'Марунић', 'Марункић', 'Марушић', 'Марчетић', 'Марчић', 'Масалушић', 'Масларић', 'Маслић', 'Масловарић', 'Матаругић', 'Матејић', 'Матерић', 'Матић', 'Матичић', 'Матушић', 'Маћешић', 'Маћић', 'Мачић', 'Мачкић', 'Мачужић', 'Машић', 'Медић', 'Медурић', 'Мектић', 'Месулић', 'Мијалчић', 'Мијанић', 'Мијачић', 'Мијић', 'Мијуцић', 'Микарић', 'Микелић', 'Микетић', 'Микић', 'Микичић', 'Микоњић', 'Микулић', 'Миладић', 'Милакић', 'Милачић', 'Милекић', 'Миленић', 'Милетић', 'Милеуснић', 'Милешић', 'Милијић', 'Миликић', 'Миликшић', 'Милинић', 'Милинчић', 'Милисавић', 'Миличић', 'Милић', 'Милишић', 'Милкић', 'Милоичић', 'Милојић', 'Милојичић', 'Милојкић', 'Милојчић', 'Милотић', 'Милунић', 'Милушић', 'Милчић', 'Миљанић', 'Миндић', 'Минић', 'Минчић', 'Миовчић', 'Миоданић', 'Мионић', 'Миражић', 'Мирић', 'Мирјанић', 'Миркић', 'Миросавић', 'Мирчетић', 'Мирчић', 'Мисојчић', 'Митић', 'Митранић', 'Митреканић', 'Митрић', 'Митрушић', 'Мићић', 'Михаљчић', 'Михољчић', 'Мишељић', 'Мишић', 'Мишкић', 'Мишурић', 'Младић', 'Млаџић', 'Мојсић', 'Мокрић', 'Момић', 'Морачић', 'Моретић', 'Мороквашић', 'Мотичић', 'Мракић', 'Мрачић', 'Мрдић', 'Мркић', 'Мркоњић', 'Мркушић', 'Мркшић', 'Мудринић', 'Мудрић', 'Мунишић', 'Мурганић', 'Мутавџић', 'Мутибарић', 'Мучибабић', 'Мушикић', 'Навалушић', 'Наградић', 'Нагулић', 'Надашкић', 'Најдић', 'Најкић', 'Накаламић', 'Накић', 'Наранчић', 'Наранџић', 'Настасић', 'Настић', 'Небригић', 'Невајдић', 'Невенић', 'Негоицић', 'Нединић', 'Недић', 'Некић', 'Немањић', 'Ненадић', 'Ненић', 'Неоричић', 'Нешић', 'Никезић', 'Никетић', 'Никитић', 'Николетић', 'Николешић', 'Николић', 'Николчић', 'Никшић', 'Нинић', 'Нинчић', 'Ничић', 'Нишавић', 'Нишић', 'Новалушић', 'Новарлић', 'Новачикић', 'Новић', 'Новичић', 'Новчић', 'Ножинић', 'Нојкић', 'Његић', 'Његрић', 'Њежић', 'Обренић', 'Одавић', 'Озимић', 'Ојданић', 'Ојкић', 'Окетић', 'Околић', 'Окулић', 'Оларић', 'Олић', 'Олујић', 'Ољачић', 'Опалић', 'Опарушић', 'Опачић', 'Оприкић', 'Опрић', 'Оприцић', 'Ораовчић', 'Орландић', 'Орлић', 'Осмајлић', 'Остојић', 'Оцокољић', 'Оџић', 'Павић', 'Павичић', 'Павлекић', 'Павличић', 'Павчић', 'Падић', 'Пајагић', 'Пајић', 'Пајичић', 'Пајкић', 'Пајтић', 'Палалић', 'Палангетић', 'Палигорић', 'Палић', 'Панинчић', 'Панић', 'Панишић', 'Пантелић', 'Пантић', 'Панчић', 'Панџић', 'Папић', 'Папрић', 'Папулић', 'Параментић', 'Параушић', 'Париводић', 'Парлић', 'Паројчић', 'Патрногић', 'Паунић', 'Пашић', 'Пејић', 'Пејичић', 'Пејушић', 'Пејчић', 'Пелагић', 'Пендић', 'Пенезић', 'Пенчић', 'Пепић', 'Перенић', 'Перић', 'Перичић', 'Перишић', 'Перјаничић', 'Перкић', 'Перотић', 'Перуничић', 'Перчић', 'Петканић', 'Петрикић', 'Петрић', 'Петричић', 'Петронић', 'Петрушић', 'Пеулић', 'Пецић', 'Печеничић', 'Пешић', 'Пикић', 'Пилиндавић', 'Пиљагић', 'Пиперчић', 'Пириватрић', 'Пирић', 'Писарић', 'Питулић', 'Пјанић', 'Пјевић', 'Плавић', 'Плавкић', 'Плављанић', 'Плавшић', 'Плазинић', 'Планинчић', 'Планић', 'Платанић', 'Плачић', 'Племић', 'Плескоњић', 'Плећић', 'Плинтић', 'Плиснић', 'Плоскић', 'Плочић', 'Пљакић', 'Пљеваљчић', 'Побулић', 'Подинић', 'Подрашчић', 'Подрић', 'Познанић', 'Познић', 'Појкић', 'Полић', 'Поломчић', 'Полугић', 'Поњавић', 'Поп Лазић', 'Попадић', 'Попарић', 'Попчић', 'Потребић', 'Поштић', 'Правдић', 'Пражић', 'Предић', 'Прекић', 'Прелић', 'Прендић', 'Прешић', 'Пржић', 'Прибић', 'Прибишић', 'Пригодић', 'Пријић', 'Прикић', 'Пришић', 'Проданић', 'Прокић', 'Прокопић', 'Пролић', 'Протић', 'Прошић', 'Пругинић', 'Прунић', 'Пршендић', 'Пуалић', 'Пувалић', 'Пувачић', 'Пударић', 'Пунишић', 'Пурешић', 'Пурић', 'Пуришић', 'Пуслојић', 'Пушељић', 'Равилић', 'Раданчић', 'Радељић', 'Радетић', 'Радешић', 'Радивојшић', 'Радикић', 'Радисавић', 'Радић', 'Радичић', 'Радишић', 'Раднић', 'Радоичић', 'Радојичић', 'Радојкић', 'Радојчић', 'Радонић', 'Радоњић', 'Радосавкић', 'Радотић', 'Радукић', 'Радулић', 'Радуљчић', 'Радуцић', 'Радушић', 'Разуменић', 'Раилић', 'Раичић', 'Рајачић', 'Рајић', 'Рајичић', 'Рајлић', 'Рајчетић', 'Рајчић', 'Рајшић', 'Ракезић', 'Ракетић', 'Ракинић', 'Ракитић', 'Ракић', 'Раконић', 'Ралетић', 'Ралић', 'Раљић', 'Рамић', 'Ранђић', 'Ранисавић', 'Ранкић', 'Ранчић', 'Раонић', 'Рапаић', 'Рапајић', 'Расулић', 'Раткелић', 'Раулић', 'Рацић', 'Рачић', 'Рашетић', 'Рашић', 'Рашљић', 'Регодић', 'Регулић', 'Рекалић', 'Рељић', 'Реметић', 'Рендулић', 'Репашић', 'Ресимић', 'Реџић', 'Рибарић', 'Рибошкић', 'Риђошић', 'Ризнић', 'Ринчић', 'Рисимић', 'Ристанић', 'Ристић', 'Рмандић', 'Рнић', 'Рогић', 'Роглић', 'Рогоњић', 'Рогулић', 'Родић', 'Розгић', 'Роквић', 'Рокнић', 'Роксандић', 'Роксић', 'Рољић', 'Романић', 'Ромић', 'Росић', 'Рошкић', 'Рувидић', 'Рудић', 'Рудоњић', 'Ружић', 'Ружичић', 'Ружојчић', 'Руменић', 'Рундић', 'Руњајић', 'Русалић', 'Рутешић', 'Рутонић', 'Рушкић', 'Сабљић', 'Савандић', 'Саватић', 'Савелић', 'Савељић', 'Савић', 'Савичић', 'Савкић', 'Савурдић', 'Савчић', 'Салатић', 'Самарџић', 'Сандић', 'Сапардић', 'Сарамандић', 'Сарић', 'Сатарић', 'Светличић', 'Свиларић', 'Својић', 'Секанић', 'Секулић', 'Селенић', 'Сендрић', 'Сенић', 'Сеничић', 'Сентић', 'Сетенчић', 'Сибинкић', 'Сибинчић', 'Сикимић', 'Симанић', 'Симендић', 'Симетић', 'Симић', 'Симурдић', 'Синђелић', 'Синђић', 'Синкић', 'Ситничић', 'Сјеничић', 'Скакић', 'Скелић', 'Скенџић', 'Скерлић', 'Скокић', 'Скочајић', 'Скочић', 'Скробић', 'Скулић', 'Славић', 'Славнић', 'Сладић', 'Словић', 'Смилић', 'Смиљанић', 'Смиљић', 'Смиљкић', 'Смољанић', 'Смрекић', 'Соврлић', 'Совтић', 'Сојкић', 'Сокић', 'Сокнић', 'Солдатић', 'Сорајић', 'Соскић', 'Софијанић', 'Софранић', 'Софренић', 'Софронић', 'Спаић', 'Спакић', 'Спарић', 'Спасенић', 'Спасић', 'Спенчић', 'Сперлић', 'Спирић', 'Спремић', 'Спужић', 'Средић', 'Сретић', 'Ставрић', 'Стајић', 'Стајкић', 'Стајчић', 'Стајшић', 'Стакић', 'Стакушић', 'Стаматић', 'Стамболић', 'Стаменић', 'Стаменчић', 'Станарчић', 'Станетић', 'Станикић', 'Станисавић', 'Станић', 'Станичић', 'Станишић', 'Станкић', 'Становчић', 'Станојчић', 'Станушић', 'Станчетић', 'Станчић', 'Сташић', 'Стевандић', 'Стеванетић', 'Стеванић', 'Стевелић', 'Стевић', 'Стевчић', 'Стегић', 'Стегњаић', 'Стегњајић', 'Стекић', 'Стељић', 'Степандић', 'Степанић', 'Степић', 'Стијачић', 'Стијепић', 'Стикић', 'Стјепић', 'Стожинић', 'Стојанић', 'Стојанкић', 'Стојанчић', 'Стојачић', 'Стојић', 'Стојичић', 'Стојкић', 'Стојнић', 'Стојчић', 'Стојшић', 'Стоканић', 'Стокић', 'Столић', 'Стопарић', 'Стопић', 'Стошић', 'Страјнић', 'Страхинић', 'Страхињић', 'Стринић', 'Суботић', 'Сувајџић', 'Суменић', 'Сунарић', 'Сурлић', 'Суручић', 'Тадић', 'Тајсић', 'Таминџић', 'Танасић', 'Танић', 'Танкосић', 'Танчић', 'Тарабић', 'Тасић', 'Татишић', 'Тврдишић', 'Теодосић', 'Тепић', 'Тепшић', 'Терзић', 'Теслић', 'Тешанић', 'Тешанкић', 'Тешендић', 'Тешинић', 'Тешић', 'Тијанић', 'Тимилић', 'Тимотић', 'Тирић', 'Тирнанић', 'Тмушић', 'Товаришић', 'Тодић', 'Тодорић', 'Тодосић', 'Тојић', 'Токалић', 'Тољагић', 'Томанић', 'Томецић', 'Томинчић', 'Томић', 'Томичић', 'Томоњић', 'Томчић', 'Тонтић', 'Тончић', 'Топић', 'Топличић', 'Тополић', 'Тоскић', 'Тошанић', 'Тошић', 'Траворић', 'Трапарић', 'Тренчић', 'Тривалић', 'Тривић', 'Тривунић', 'Тривунчић', 'Тријић', 'Трикић', 'Триндић', 'Трипић', 'Трифуњагић', 'Тришић', 'Трмчић', 'Трнинић', 'Трнић', 'Трошић', 'Трубајић', 'Трудић', 'Трујић', 'Трујкић', 'Тубоњић', 'Тукелић', 'Тумарић', 'Тупајић', 'Турајлић', 'Турнић', 'Турудић', 'Турунчић', 'Тутић', 'Туторић', 'Тутулић', 'Туфегџић', 'Туцић', 'Ћајић', 'Ћалић', 'Ћатић', 'Ћебић', 'Ћелић', 'Ћеранић', 'Ћипранић', 'Ћирић', 'Ћирјанић', 'Ћојбашић', 'Ћопић', 'Ћорић', 'Ћосић', 'Ћуић', 'Ћујић', 'Ћупић', 'Ћурдић', 'Ћурић', 'Ћурчић', 'Ћушић', 'Убавић', 'Убавкић', 'Увалић', 'Уверић', 'Угљешић', 'Угринић', 'Угринчић', 'Угричић', 'Удовичић', 'Удовчић', 'Умељић', 'Уметић', 'Умиљендић', 'Уршикић', 'Устић', 'Утвић', 'Ушендић', 'Фаркић', 'Фатић', 'Фемић', 'Филипић', 'Фотирић', 'Фотић', 'Фртунић', 'Хаџи Антић', 'Хаџи Јованчић', 'Хаџи Николић', 'Хаџи Ристић', 'Хаџи Танчић', 'Хаџић', 'Хинић', 'Христић', 'Цајић', 'Цакић', 'Царић', 'Царичић', 'Цвејић', 'Цветић', 'Цвијетић', 'Цвијић', 'Цвикић', 'Цвишић', 'Ценић', 'Ценкић', 'Цивишић', 'Циврић', 'Циглић', 'Циклушић', 'Цицварић', 'Цмиљанић', 'Цмолић', 'Цонић', 'Црновчић', 'Цуканић', 'Цукић', 'Цупарић', 'Чабрић', 'Чавић', 'Чајић', 'Чаленић', 'Чалић', 'Чамагић', 'Чантрић', 'Чапрњић', 'Чарапић', 'Чарнић', 'Чвокић', 'Чворић', 'Челекетић', 'Чемерикић', 'Чечарић', 'Чивчић', 'Чикарић', 'Чикић', 'Чиплић', 'Чипчић', 'Чичић', 'Чковрић', 'Чобелић', 'Чобељић', 'Човић', 'Чојић', 'Чојчић', 'Чоланић', 'Чолић', 'Чомић', 'Чонкић', 'Чоњагић', 'Чорбић', 'Чотрић', 'Чочурић', 'Чубрић', 'Чудић', 'Чукарић', 'Чукић', 'Чумић', 'Чупељић', 'Чуперкић', 'Чупић', 'Чутурић', 'Џаврић', 'Џајић', 'Џамбић', 'Џаџић', 'Џелебџић', 'Џикић', 'Џинић', 'Џодић', 'Џомбић', 'Џомић', 'Џонић', 'Шакић', 'Шакотић', 'Шалинић', 'Шаматић', 'Шантић', 'Шапић', 'Шапонић', 'Шапоњић', 'Шапурић', 'Шаранчић', 'Шарић', 'Шаркић', 'Шароњић', 'Шашић', 'Швабић', 'Шеварлић', 'Шевић', 'Шевкушић', 'Шестић', 'Шибалић', 'Шијакињић', 'Шијачић', 'Шиканић', 'Шикањић', 'Шимшић', 'Шипетић', 'Шишић', 'Шкобић', 'Шкодрић', 'Шкондрић', 'Шкорић', 'Шкрбић', 'Шкребић', 'Шкулић', 'Шкундрић', 'Шљапић', 'Шљивић', 'Шљукић', 'Шмигић', 'Шобајић', 'Шобачић', 'Шоргић', 'Шошкић', 'Шпирић', 'Штакић', 'Штулић', 'Шубакић', 'Шубарић', 'Шубић', 'Шулеић', 'Шулејић', 'Шулетић', 'Шулкић', 'Шулубурић', 'Шуљагић', 'Шуматић', 'Шундерић', 'Шункић', 'Шуњеварић', 'Шутуљић', 'Шушић', 'Шушулић',
    );
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           <?php

namespace Faker\Provider\sr_Latn_RS;

class Address extends \Faker\Provider\Address
{
    protected static $postcode = array('#####');

    protected static $streetPrefix = array(
        'Bulevar',
    );

    protected static $street = array(
        'Kralja Milana', 'Cara Dušana', 'Nikole Tesle', 'Mihajla Pupina', 'Nikole Pašića',
    );

    protected static $streetNameFormats = array(
        '{{street}}',
        '{{streetPrefix}} {{street}}',
    );

    protected static $streetAddressFormats = array(
        '{{streetName}} {{buildingNumber}}',
    );

    protected static $cityFormats = array(
        '{{cityName}}',
    );

    /**
     * @link http://sr.wikipedia.org/sr-el/%D0%93%D1%80%D0%B0%D0%B4_%D1%83_%D0%A1%D1%80%D0%B1%D0%B8%D1%98%D0%B8
     */
    protected static $cityNames = array(
        'Beograd', 'Valjevo', 'Vranje', 'Zaječar', 'Zrenjanin', 'Jagodina', 'Kragujevac', 'Kraljevo', 'Kruševac', 'Leskovac', 'Loznica', 'Niš', 'Novi Pazar', 'Novi Sad', 'Pančevo', 'Požarevac', 'Priština', 'Smederevo', 'Sombor', 'Sremska Mitrovica', 'Subotica', 'Užice', 'Čačak', 'Šabac',
    );

    /**
     * @link https://github.com/umpirsky/country-list/blob/master/country/cldr/sr_Latn/country.php
     */
    protected static $country = array(
        'Ostrvo Asension', 'Andora', 'Ujedinjeni Arapski Emirati', 'Avganistan', 'Antigva i Barbuda', 'Angvila', 'Albanija', 'Armenija', 'Holandski Antili', 'Angola', 'Antarktika', 'Argentina', 'Američka Samoa', 'Austrija', 'Australija', 'Aruba', 'Alandska ostrva', 'Azerbejdžan', 'Bosna i Hercegovina', 'Barbados', 'Bangladeš', 'Belgija', 'Burkina Faso', 'Bugarska', 'Bahrein', 'Burundi', 'Benin', 'Sv. Bartolomej', 'Bermuda', 'Brunej', 'Bolivija', 'Brazil', 'Bahami', 'Butan', 'Buve Ostrva', 'Bocvana', 'Belorusija', 'Belise', 'Kanada', 'Kokos (Keling) Ostrva', 'Demokratska Republika Kongo', 'Centralno Afrička Republika', 'Kongo', 'Švajcarska', 'Obala Slonovače', 'Kukova Ostrva', 'Čile', 'Kamerun', 'Kina', 'Kolumbija', 'Ostrvo Kliperton', 'Kostarika', 'Srbija i Crna Gora', 'Kuba', 'Kape Verde', 'Božićna Ostrva', 'Kipar', 'Češka', 'Nemačka', 'Dijego Garsija', 'Džibuti', 'Danska', 'Dominika', 'Dominikanska Republika', 'Alžir', 'Seuta i Melilja', 'Ekvador', 'Estonija', 'Egipat', 'Zapadna Sahara', 'Eritreja', 'Španija', 'Etiopija', 'Evropska unija', 'Finska', 'Fidži', 'Folklandska Ostrva', 'Mikronezija', 'Farska Ostrva', 'Francuska', 'Gabon', 'Velika Britanija', 'Grenada', 'Gruzija', 'Francuska Gvajana', 'Gurnsi', 'Gana', 'Gibraltar', 'Grenland', 'Gambija', 'Gvineja', 'Gvadelupe', 'Ekvatorijalna Gvineja', 'Grčka', 'Južna Džordžija i Južna Sendvič Ostrva', 'Gvatemala', 'Guam', 'Gvineja-Bisao', 'Gvajana', 'Hong Kong (S. A. R. Kina)', 'Herd i Mekdonald Ostrva', 'Honduras', 'Hrvatska', 'Haiti', 'Mađarska', 'Kanarska ostrva', 'Indonezija', 'Irska', 'Izrael', 'Ostrvo Man', 'Indija', 'Britansko Indijska Okeanska Teritorija', 'Irak', 'Iran', 'Island', 'Italija', 'Džersi', 'Jamajka', 'Jordan', 'Japan', 'Kenija', 'Kirgizstan', 'Kambodža', 'Kiribati', 'Komorska Ostrva', 'Sent Kits i Nevis', 'Severna Koreja', 'Južna Koreja', 'Kuvajt', 'Kajmanska Ostrva', 'Kazahstan', 'Laos', 'Liban', 'Sent Lucija', 'Lihtenštajn', 'Šri Lanka', 'Liberija', 'Lesoto', 'Litvanija', 'Luksemburg', 'Letonija', 'Libija', 'Maroko', 'Monako', 'Moldavija', 'Crna Gora', 'Sv. Martin', 'Madagaskar', 'Maršalska Ostrva', 'Makedonija', 'Mali', 'Mijanmar', 'Mongolija', 'Makao (S. A. R. Kina)', 'Severna Marijanska Ostrva', 'Martinik', 'Mauritanija', 'Monserat', 'Malta', 'Mauricius', 'Maldivi', 'Malavi', 'Meksiko', 'Malezija', 'Mozambik', 'Namibija', 'Nova Kaledonija', 'Niger', 'Norfolk Ostrvo', 'Nigerija', 'Nikaragva', 'Holandija', 'Norveška', 'Nepal', 'Nauru', 'Niue', 'Novi Zeland', 'Oman', 'Panama', 'Peru', 'Francuska Polinezija', 'Papua Nova Gvineja', 'Filipini', 'Pakistan', 'Poljska', 'Sen Pjer i Mikelon', 'Pitcairn', 'Porto Riko', 'Palestinska Teritorija', 'Portugal', 'Palau', 'Paragvaj', 'Katar', 'Ostala okeanija', 'Rejunion', 'Rumunija', 'Srbija', 'Rusija', 'Ruanda', 'Saudijska Arabija', 'Solomonska Ostrva', 'Sejšeli', 'Sudan', 'Švedska', 'Singapur', 'Sveta Jelena', 'Slovenija', 'Svalbard i Janmajen Ostrva', 'Slovačka', 'Sijera Leone', 'San Marino', 'Senegal', 'Somalija', 'Surinam', 'Sao Tome i Principe', 'Salvador', 'Sirija', 'Svazilend', 'Tristan da Kunja', 'Turks i Kajkos Ostrva', 'Čad', 'Francuske Južne Teritorije', 'Togo', 'Tajland', 'Tadžikistan', 'Tokelau', 'Istočni Timor', 'Turkmenistan', 'Tunis', 'Tonga', 'Turska', 'Trinidad i Tobago', 'Tuvalu', 'Tajvan', 'Tanzanija', 'Ukrajina', 'Uganda', 'Manja Udaljena Ostrva SAD', 'Sjedinjene Američke Države', 'Urugvaj', 'Uzbekistan', 'Vatikan', 'Sent Vinsent i Grenadini', 'Venecuela', 'Britanska Devičanska Ostrva', 'S.A.D. Devičanska Ostrva', 'Vijetnam', 'Vanuatu', 'Valis i Futuna Ostrva', 'Samoa', 'Jemen', 'Majote', 'Južnoafrička Republika', 'Zambija', 'Zimbabve',
    );

    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }

    public static function street()
    {
        return static::randomElement(static::$street);
    }

    public function cityName()
    {
        return static::randomElement(static::$cityNames);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          <?php

namespace Faker\Provider\sr_Latn_RS;

class Person extends \Faker\Provider\Person
{
    /**
     * @link http://sr.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%B0%D0%BA_%D1%81%D1%80%D0%BF%D1%81%D0%BA%D0%B8%D1%85_%D0%B8%D0%BC%D0%B5%D0%BD%D0%B0
     */
    protected static $firstNameMale = array(
        'Adam', 'Aleksa', 'Aleksandar', 'Aleksej', 'Andrej', 'Andrija', 'Antonije', 'Arsen', 'Balša', 'Bane', 'Berko', 'Blagoja', 'Blaža',
        'Boban', 'Bogdan', 'Bojan', 'Bojo', 'Bora', 'Boris', 'Borislav', 'Borivoj', 'Boško', 'Božidar', 'Božo', 'Brajan',
        'Branislav', 'Branko', 'Brano', 'Dalibor', 'Damjan', 'Dane', 'Danijel', 'Danilo', 'Danko', 'Dario', 'Darko', 'David',
        'Dejan', 'Dragan', 'Drago', 'Dragomir', 'Dragoš', 'Dubravko', 'Dušan', 'Duško', 'Emil', 'Filip', 'German', 'Gojko',
        'Goran', 'Gordan', 'Grgur', 'Igor', 'Ilija', 'Isak', 'Ivan', 'Ivica', 'Ivo', 'Jadranko', 'Jakov', 'Jandre',
        'Janko', 'Jaroslav', 'Jasen', 'Jerko', 'Joko', 'Jordan', 'Jova', 'Jovan', 'Jovica', 'Jovo', 'Justin', 'Konstantin',
        'Kosta', 'Kostadin', 'Lazar', 'Luka', 'Luča', 'Maksim', 'Maleš', 'Marinko', 'Marjan', 'Marko', 'Martin', 'Matej',
        'Matija', 'Mato', 'Maša', 'Mihailo', 'Mihajlo', 'Mijo', 'Miladin', 'Milan', 'Milen', 'Milenko', 'Mileš', 'Milija',
        'Miljan', 'Milko', 'Milo', 'Miloje', 'Milorad', 'Miloš', 'Miodrag', 'Miomir', 'Mirko', 'Miro', 'Miroslav', 'Mićo',
        'Miško', 'Mladen', 'Nebojša', 'Nemanja', 'Nenad', 'Nestor', 'Neven', 'Nikola', 'Nino', 'Novak', 'Novo', 'Ognjen',
        'Oliver', 'Ozren', 'Perica', 'Pero', 'Petar', 'Petko', 'Predrag', 'Rade', 'Raden', 'Radenko', 'Radin', 'Radmilo',
        'Radomir', 'Radoslav', 'Radovan', 'Rajan', 'Rajko', 'Ranko', 'Rastislav', 'Resan', 'Risto', 'Sava', 'Saša', 'Simeon',
        'Simo', 'Simon', 'Siniša', 'Slaviša', 'Slavko', 'Slavoljub', 'Slavomir', 'Slobodan', 'Spasoje', 'Srećko', 'Stanimir', 'Stanislav',
        'Stanko', 'Stanoje', 'Stefan', 'Stepan', 'Stevan', 'Stevo', 'Stjepan', 'Strahinja', 'Svetislav', 'Tadej', 'Teodor', 'Tihomir',
        'Todor', 'Tomaš', 'Tomica', 'Tomislav', 'Tomo', 'Trpko', 'Uroš', 'Vasko', 'Velibor', 'Velimir', 'Veselin', 'Viktor',
        'Vlada', 'Vladan', 'Vladimir', 'Vladislav', 'Vlado', 'Vlastimir', 'Vlatko', 'Vuk', 'Vukan', 'Zdravko', 'Zlatko', 'Zoran',
        'Zvonimir', 'Zvonko', 'Ćirilo', 'Ćiro', 'Želimir', 'Željko',
        // below are unknown gender firstnames
        'Agnica', 'Agnija', 'Aksentije', 'Aleksandron', 'Aleksija', 'Aleksije', 'Alimpije', 'Anastasija', 'Andrijaš', 'Ankica', 'Anđa', 'Anđela', 'Anđelija',
        'Anđelka', 'Anđelko', 'Aranđel', 'Arsa', 'Arsenije', 'Arso', 'Atanacko', 'Atanasije', 'Avakum', 'Avram', 'Aćim', 'Bajko',
        'Bajo', 'Bajčeta', 'Batrić', 'Berisav', 'Berislav', 'Beriša', 'Biljan', 'Bisenija', 'Biserka', 'Biserko', 'Blagica', 'Blaginja',
        'Blagoje', 'Blagomir', 'Blagota', 'Blaško', 'Blažen', 'Blaženka', 'Blažo', 'Bogdana', 'Bogelj', 'Bogić', 'Bogiša', 'Bogoboj',
        'Bogoje', 'Bogoljub', 'Bogosav', 'Bogoslav', 'Boica', 'Boin', 'Bojko', 'Bojčeta', 'Borisav', 'Borislava', 'Borislavka', 'Borivoje',
        'Boriša', 'Borjanka', 'Borka', 'Borko', 'Boro', 'Boroje', 'Bosa', 'Bosiljka', 'Boža', 'Božana', 'Božica', 'Božidarka',
        'Božin', 'Božinka', 'Božićko', 'Brajica', 'Branimir', 'Branislava', 'Branivoj', 'Branivoje', 'Bratimir', 'Bratislav', 'Bratislava', 'Bratoljub',
        'Bratovan', 'Brnča', 'Budimir', 'Budimirka', 'Budimka', 'Budisav', 'Budislav', 'Curko', 'Cvejan', 'Cveta', 'Cvetin', 'Cvetko',
        'Cvetoje', 'Cvetoš', 'Cvijan', 'Cvijeta', 'Cvijetin', 'Cviko', 'Cvjetko', 'Cvjetoje', 'Cvjetoš', 'Dabiša', 'Dabiživ', 'Dabo',
        'Daliborka', 'Damjanka', 'Damljan', 'Damljanka', 'Danojla', 'Dančul', 'Darije', 'Darijo', 'Darinka', 'Darjan', 'Desanka', 'Desimir',
        'Despinja', 'Despot', 'Dikosava', 'Dimitrije', 'Dimčo', 'Divna', 'Dmitar', 'Dmitra', 'Dobrašin', 'Dobrica', 'Dobrija', 'Dobrila',
        'Dobrilo', 'Dobrinka', 'Dobrinko', 'Dobrivoj', 'Dobrivoje', 'Dobrosav', 'Dobroslav', 'Dobrovuk', 'Dojčilo', 'Dojčin', 'Dokna', 'Doko',
        'Dorotej', 'Doroteja', 'Dositej', 'Dostana', 'Draga', 'Dragaš', 'Dragija', 'Draginja', 'Dragić', 'Dragiša', 'Dragobrat', 'Dragoja',
        'Dragoje', 'Dragojla', 'Dragojlo', 'Dragoljub', 'Dragoman', 'Dragomira', 'Dragorad', 'Dragosav', 'Dragoslav', 'Dragoslava', 'Dragovan', 'Dragutin',
        'Drailo', 'Drakša', 'Draško', 'Draža', 'Dražeta', 'Dražo', 'Drena', 'Drenka', 'Drinka', 'Dubravac', 'Dubravka', 'Dujak',
        'Dukadin', 'Emilijan', 'Emilije', 'Erak', 'Evdokija', 'Evgenije', 'Fema', 'Gaja', 'Gajin', 'Gajo', 'Gavra', 'Gavrila',
        'Gavrilka', 'Gavrilo', 'Gača', 'Genadije', 'Georgije', 'Gerasim', 'Gligorije', 'Gliša', 'Glišo', 'Godeč', 'Godomir', 'Golub',
        'Goranka', 'Gorica', 'Gorjana', 'Gorčin', 'Gospava', 'Gostimir', 'Gostoljub', 'Gradeta', 'Gradimir', 'Gradiša', 'Grdan', 'Grigorije',
        'Grijak', 'Grozda', 'Grozdan', 'Grozdana', 'Grubac', 'Gruban', 'Grubač', 'Grubeta', 'Grubeša', 'Grubiša', 'Gruja', 'Grujica',
        'Grujo', 'Gvozden', 'Gvozdenija', 'Gvozdenko', 'Hranimir', 'Hranislav', 'Hranislava', 'Hraniša', 'Hrastimir', 'Hristijan', 'Hristoslav', 'Hvalimir',
        'Hvalislav', 'Ignjat', 'Ignjatije', 'Ikonija', 'Ilinka', 'Isaija', 'Isailo', 'Isidor', 'Ivaniš', 'Ivko', 'Jablan', 'Jagodinka',
        'Jagoš', 'Jakša', 'Jandrija', 'Janićije', 'Janovka', 'Jasenko', 'Javorka', 'Javorko', 'Jefimija', 'Jela', 'Jelača', 'Jelašin',
        'Jelen', 'Jelenka', 'Jelenko', 'Jelica', 'Jelisava', 'Jelisavka', 'Jelisije', 'Jeremija', 'Jerotije', 'Jevdokija', 'Jevrem', 'Jevrosima',
        'Jevta', 'Jevtan', 'Jevtimije', 'Jevto', 'Jezda', 'Jezdimir', 'Joksim', 'Jorgovanka', 'Josif', 'Joviša', 'Jovka', 'Jovko',
        'Jugoljub', 'Jugomir', 'Jugoslav', 'Julijan', 'Julka', 'Junoša', 'Juriša', 'Kadivka', 'Kamenko', 'Kasija', 'Kazimir', 'Kazimira',
        'Kažimir', 'Kiprijan', 'Kirilo', 'Kojadin', 'Kojadinka', 'Kojčin', 'Kokan', 'Komnen', 'Komnenija', 'Kornelije', 'Kosana', 'Kosara',
        'Kosovka', 'Kostadinka', 'Kovana', 'Koviljka', 'Koviljko', 'Kovina', 'Kozma', 'Koča', 'Koštana', 'Kraguj', 'Kraisava', 'Krajislav',
        'Krajčin', 'Krasimir', 'Krasoje', 'Krsman', 'Krsmanija', 'Krsta', 'Krstan', 'Krstana', 'Krstina', 'Krstivoje', 'Krsto', 'Krunislav',
        'Krunoslava', 'Ksenija', 'Kumodrag', 'Kuzman', 'Labud', 'Laka', 'Laketa', 'Lako', 'Latinka', 'Laza', 'Leonida', 'Lepa',
        'Lepoje', 'Lepomir', 'Leposava', 'Leposlav', 'Ležimir', 'Ljepava', 'Ljeposava', 'Ljilja', 'Ljiljan', 'Ljuban', 'Ljuben', 'Ljubenko',
        'Ljubinko', 'Ljubisav', 'Ljubislav', 'Ljubivoje', 'Ljubiša', 'Ljubo', 'Ljubobrat', 'Ljubodrag', 'Ljuboja', 'Ljuboje', 'Ljubomir', 'Ljubomirka',
        'Ljubosava', 'Lozan', 'Lujo', 'Manduša', 'Manojlo', 'Matijaš', 'Mavren', 'Mašan', 'Maško', 'Medak', 'Mijailo', 'Mijak',
        'Mijan', 'Mijana', 'Mijat', 'Mijobrat', 'Mijuško', 'Miladija', 'Milak', 'Milanko', 'Milat', 'Milaš', 'Milašin', 'Milentije',
        'Milesa', 'Mileta', 'Mileva', 'Milijan', 'Milijaš', 'Milina', 'Milinko', 'Milisav', 'Milisava', 'Milisavka', 'Milivoj', 'Milivoje',
        'Milić', 'Milj', 'Miljen', 'Miljka', 'Miljko', 'Miljojko', 'Miljurko', 'Milkica', 'Miloja', 'Milojica', 'Milojka', 'Milojko',
        'Milomir', 'Milosav', 'Milosava', 'Milosavka', 'Milovan', 'Milten', 'Miluka', 'Milun', 'Milunka', 'Milutin', 'Miluš', 'Miluša',
        'Miomirka', 'Miroljub', 'Mirosav', 'Mirosava', 'Mirčeta', 'Mitar', 'Mićan', 'Mišljen', 'Mlađan', 'Mlađen', 'Mojsilo', 'Momir',
        'Momčilo', 'Mrkša', 'Mrđan', 'Mrđen', 'Nadica', 'Najdan', 'Naum', 'Nedeljka', 'Nedeljko', 'Negomir', 'Negovan', 'Nevenko',
        'Neđeljka', 'Neđeljko', 'Neško', 'Nikašin', 'Nikodije', 'Nikodim', 'Nikolija', 'Nikša', 'Ninko', 'Ninoslav', 'Nićifor', 'Nišava',
        'Njegomir', 'Njegomirka', 'Njegoslava', 'Njegoš', 'Novica', 'Noviša', 'Novka', 'Novko', 'Obrad', 'Obradin', 'Obradinka', 'Obren',
        'Obrenija', 'Obrenko', 'Obreten', 'Ognjan', 'Ognjana', 'Olja', 'Ostoja', 'Ozriša', 'Pantelija', 'Paun', 'Pauna', 'Pava',
        'Pavija', 'Pavić', 'Pavko', 'Pavle', 'Pavlija', 'Pavlić', 'Pejak', 'Pejo', 'Pelagija', 'Pera', 'Periša', 'Persida',
        'Perun', 'Perunko', 'Petak', 'Petoje', 'Petoš', 'Petrašin', 'Petrija', 'Petronije', 'Plavša', 'Poznan', 'Poznana', 'Prerad',
        'Pribić', 'Prodan', 'Prodana', 'Prokopije', 'Prvoslav', 'Punan', 'Puniša', 'Pureš', 'Purko', 'Puro', 'Racko', 'Radak',
        'Radan', 'Radana', 'Radas', 'Radašin', 'Radeta', 'Radica', 'Radinka', 'Radinko', 'Radisav', 'Radivoj', 'Radivoje', 'Radič',
        'Radiša', 'Radman', 'Radna', 'Radoba', 'Radobud', 'Radoja', 'Radoje', 'Radojica', 'Radojko', 'Radojlo', 'Radoman', 'Radonja',
        'Radosav', 'Radoslava', 'Radota', 'Radovac', 'Radoš', 'Raduka', 'Radukan', 'Radul', 'Radula', 'Radulin', 'Radun', 'Radunka',
        'Radusin', 'Rafailo', 'Raica', 'Raič', 'Raičko', 'Rajak', 'Rajka', 'Rajna', 'Rajčeta', 'Ralen', 'Raleta', 'Ranisav',
        'Ranka', 'Raosav', 'Rastko', 'Ratibor', 'Ratko', 'Ratomir', 'Račeta', 'Rađen', 'Raško', 'Rekula', 'Relja', 'Rista',
        'Ristan', 'Ristivoje', 'Rodoljub', 'Roksanda', 'Samuilo', 'Savka', 'Savko', 'Savo', 'Sazdana', 'Sekana', 'Sekula', 'Selak',
        'Simana', 'Simeun', 'Simeuna', 'Simka', 'Simonida', 'Sinđa', 'Sinđel', 'Skorosav', 'Skorosava', 'Sladoje', 'Slaven', 'Slavenko',
        'Slavna', 'Slavo', 'Slavojka', 'Slavuj', 'Slađan', 'Slađana', 'Slobodanka', 'Smilja', 'Smiljan', 'Smiljana', 'Smiljka', 'Smiljko',
        'Smoljan', 'Smoljana', 'Smoljka', 'Soka', 'Soko', 'Spasenija', 'Spasoja', 'Spiridon', 'Spomenka', 'Srbijanka', 'Srbislav', 'Srboljub',
        'Srboslav', 'Srdan', 'Sredoja', 'Sredoje', 'Sreten', 'Sretko', 'Srećan', 'Srđa', 'Srđan', 'Stajka', 'Staka', 'Stamena',
        'Stamenka', 'Stamenko', 'Stanava', 'Stanača', 'Stanica', 'Stanija', 'Stanisav', 'Stanisava', 'Staniša', 'Stanoja', 'Stanojka', 'Stanojko',
        'Stanojla', 'Stanojlo', 'Staša', 'Stevica', 'Stoin', 'Stoisava', 'Stoić', 'Stoja', 'Stojadin', 'Stojak', 'Stojan', 'Stojana',
        'Stojanka', 'Stojka', 'Stojko', 'Stojmen', 'Stojna', 'Stojša', 'Strainja', 'Svetibor', 'Svetislava', 'Svetolik', 'Svetoljub', 'Svetomir',
        'Svetorad', 'Svetozar', 'Svjetlana', 'Tadija', 'Tanacko', 'Tanasije', 'Tankosa', 'Tankosava', 'Tatomir', 'Teodosije', 'Teofil', 'Tešan',
        'Timotije', 'Todora', 'Toma', 'Tomanija', 'Toplica', 'Trajan', 'Trajko', 'Trifun', 'Tripko', 'Tripun', 'Trivun', 'Tvrtko',
        'Ubavka', 'Uglješa', 'Umiljen', 'Utešen', 'Utješen', 'Vajo', 'Vasilija', 'Vasilije', 'Vasilj', 'Vasiljka', 'Vaskrsija', 'Vaskrsije',
        'Vasoje', 'Vekoslav', 'Veliborka', 'Velinka', 'Velisav', 'Velisava', 'Velizar', 'Veličko', 'Veljko', 'Veran', 'Veroljub', 'Veroslava',
        'Veselinka', 'Vesko', 'Vid', 'Vidak', 'Vidan', 'Vidač', 'Viden', 'Vidoja', 'Vidoje', 'Vidojka', 'Vidojko', 'Vidosav',
        'Vidosava', 'Vilotije', 'Vitka', 'Vitko', 'Vitomir', 'Vitomirka', 'Vićan', 'Vićentije', 'Višeslav', 'Višeslava', 'Vjekoslav', 'Vladana',
        'Vlade', 'Vladeta', 'Vladica', 'Vladimirka', 'Vladisav', 'Vladislava', 'Vladoje', 'Vladun', 'Vlaislav', 'Vlajko', 'Vlasije', 'Vlastimirka',
        'Vlatka', 'Vlaško', 'Voica', 'Vojdrag', 'Vojimir', 'Vojin', 'Vojislav', 'Vojislava', 'Vojka', 'Vojkan', 'Vojko', 'Vraneš',
        'Vugdrag', 'Vuica', 'Vuilo', 'Vuin', 'Vujadin', 'Vujadinka', 'Vujak', 'Vujan', 'Vujana', 'Vujeta', 'Vujka', 'Vujko',
        'Vujo', 'Vujčeta', 'Vujčin', 'Vukac', 'Vukadin', 'Vukajlo', 'Vukalj', 'Vukalo', 'Vukana', 'Vukas', 'Vukač', 'Vukašin',
        'Vukelja', 'Vukica', 'Vukić', 'Vukman', 'Vukmilj', 'Vukmir', 'Vukmira', 'Vuko', 'Vukoje', 'Vukojica', 'Vukola', 'Vukoman',
        'Vukomir', 'Vukosav', 'Vukosava', 'Vukoslav', 'Vukota', 'Vukovoje', 'Vuksan', 'Vukša', 'Vule', 'Vuleta', 'Vunko', 'Vuzman',
        'Vuča', 'Vučan', 'Vučen', 'Vučeta', 'Vučina', 'Vučić', 'Vučko', 'Zagorka', 'Zaharije', 'Zarija', 'Zarije', 'Zavida',
        'Zaviša', 'Zdraviša', 'Zlata', 'Zlatan', 'Zlatana', 'Zlatibor', 'Zlatica', 'Zlatija', 'Zlatoje', 'Zlatomir', 'Zlatomirka', 'Zlatosav',
        'Zorislava', 'Zorka', 'Zrinka', 'Zrinko', 'Zvezdan', 'Zvezdana', 'Zvezdodrag', 'Zvezdoslav', 'Zvjezdan', 'Zvjezdana', 'Zvonka', 'Ćerana',
        'Ćirjak', 'Ćirko', 'Čarna', 'Časlav', 'Čedomir', 'Čubrilo', 'Đenadije', 'Đoko', 'Đorđe', 'Đorđije', 'Đorđo', 'Đuka',
        'Đukan', 'Đura', 'Đurađ', 'Đurašin', 'Đurica', 'Đurisav', 'Đurisava', 'Đurko', 'Đuro', 'Đurđe', 'Đurđevka', 'Đurđica',
        'Đurđija', 'Šakota', 'Šale', 'Šumenko', 'Šutan', 'Žanka', 'Žarko', 'Želimirka', 'Željana', 'Žika', 'Žikica', 'Žitomir',
        'Živadin', 'Živadinka', 'Živan', 'Živana', 'Živanka', 'Živanko', 'Živica', 'Živka', 'Živko', 'Živodarka', 'Živojin', 'Živoljub',
        'Živomir', 'Živorad', 'Živoratka', 'Živoslava', 'Živoslavka', 'Života',
    );

    protected static $firstNameFemale = array(
        'Adelina', 'Aleksandra', 'Ana', 'Anda', 'Andreja', 'Andrijana', 'Angelina', 'Anica', 'Anka', 'Antonina', 'Biljana', 'Bogdanka', 'Bojana',
        'Borjana', 'Branka', 'Brankica', 'Dafina', 'Dana', 'Danica', 'Danka', 'Dara', 'Davorka', 'Daša', 'Dejana', 'Desa',
        'Despina', 'Deva', 'Dragana', 'Dragica', 'Drina', 'Duka', 'Dunja', 'Dušanka', 'Dušica', 'Duška', 'Ekaterina', 'Elena',
        'Emilija', 'Eva', 'Evgenija', 'Evica', 'Georgina', 'Gorana', 'Gordana', 'Irena', 'Irina', 'Isidora', 'Iva', 'Ivana',
        'Ivanka', 'Ivka', 'Ivona', 'Jadranka', 'Jagoda', 'Jana', 'Janja', 'Janča', 'Jasmina', 'Jasminka', 'Jasna', 'Jeka',
        'Jelena', 'Jelisaveta', 'Jelka', 'Ješa', 'Jordanka', 'Jovana', 'Jovanka', 'Julija', 'Julijana', 'Kata', 'Katarina', 'Katica',
        'Kristina', 'Lale', 'Lana', 'Lara', 'Lazo', 'Lela', 'Lena', 'Lenka', 'Leonora', 'Lidija', 'Lila', 'Lilijana',
        'Liza', 'Ljiljana', 'Ljuba', 'Ljubica', 'Ljubinka', 'Ljupka', 'Lola', 'Luna', 'Lučija', 'Maja', 'Majda', 'Maleta',
        'Malina', 'Malinka', 'Manda', 'Mane', 'Mara', 'Marica', 'Marija', 'Marina', 'Marinka', 'Marta', 'Mateja', 'Mija',
        'Mila', 'Milana', 'Milanka', 'Mile', 'Milena', 'Milica', 'Milijana', 'Milin', 'Milja', 'Miljana', 'Milka', 'Mira',
        'Miren', 'Mirjana', 'Mirka', 'Miroslava', 'Mitra', 'Mića', 'Miša', 'Mišo', 'Nada', 'Nadežda', 'Najda', 'Natalija',
        'Nataša', 'Nađa', 'Neda', 'Nevena', 'Nevenka', 'Nikoleta', 'Nina', 'Olga', 'Olivera', 'Persa', 'Petra', 'Rada',
        'Radmila', 'Radojka', 'Rain', 'Rosa', 'Ruža', 'Ružica', 'Sandra', 'Sanja', 'Sara', 'Sima', 'Slavica', 'Slavka',
        'Snežana', 'Snježana', 'Sofija', 'Sonja', 'Stana', 'Stanislava', 'Stanka', 'Suzana', 'Svetlana', 'Tajana', 'Tamara', 'Tanja',
        'Tara', 'Tatjana', 'Tea', 'Teodora', 'Tijana', 'Una', 'Valerija', 'Vanja', 'Varvara', 'Vasa', 'Vasilka', 'Vaso',
        'Veliša', 'Vera', 'Verica', 'Verka', 'Veronika', 'Vesela', 'Vesna', 'Vida', 'Viktorija', 'Violeta', 'Višnja', 'Vladanka',
        'Vlasta', 'Zaga', 'Zdravka', 'Zlatka', 'Zora', 'Zorana', 'Zorica', 'Ćira', 'Đurđa', 'Šana', 'Žaklina', 'Željka',
        'Živa',
        // below are unknown gender firstnames
        'Agnica', 'Agnija', 'Aksentije', 'Aleksandron', 'Aleksija', 'Aleksije', 'Alimpije', 'Anastasija', 'Andrijaš', 'Ankica', 'Anđa', 'Anđela', 'Anđelija',
        'Anđelka', 'Anđelko', 'Aranđel', 'Arsa', 'Arsenije', 'Arso', 'Atanacko', 'Atanasije', 'Avakum', 'Avram', 'Aćim', 'Bajko',
        'Bajo', 'Bajčeta', 'Batrić', 'Berisav', 'Berislav', 'Beriša', 'Biljan', 'Bisenija', 'Biserka', 'Biserko', 'Blagica', 'Blaginja',
        'Blagoje', 'Blagomir', 'Blagota', 'Blaško', 'Blažen', 'Blaženka', 'Blažo', 'Bogdana', 'Bogelj', 'Bogić', 'Bogiša', 'Bogoboj',
        'Bogoje', 'Bogoljub', 'Bogosav', 'Bogoslav', 'Boica', 'Boin', 'Bojko', 'Bojčeta', 'Borisav', 'Borislava', 'Borislavka', 'Borivoje',
        'Boriša', 'Borjanka', 'Borka', 'Borko', 'Boro', 'Boroje', 'Bosa', 'Bosiljka', 'Boža', 'Božana', 'Božica', 'Božidarka',
        'Božin', 'Božinka', 'Božićko', 'Brajica', 'Branimir', 'Branislava', 'Branivoj', 'Branivoje', 'Bratimir', 'Bratislav', 'Bratislava', 'Bratoljub',
        'Bratovan', 'Brnča', 'Budimir', 'Budimirka', 'Budimka', 'Budisav', 'Budislav', 'Curko', 'Cvejan', 'Cveta', 'Cvetin', 'Cvetko',
        'Cvetoje', 'Cvetoš', 'Cvijan', 'Cvijeta', 'Cvijetin', 'Cviko', 'Cvjetko', 'Cvjetoje', 'Cvjetoš', 'Dabiša', 'Dabiživ', 'Dabo',
        'Daliborka', 'Damjanka', 'Damljan', 'Damljanka', 'Danojla', 'Dančul', 'Darije', 'Darijo', 'Darinka', 'Darjan', 'Desanka', 'Desimir',
        'Despinja', 'Despot', 'Dikosava', 'Dimitrije', 'Dimčo', 'Divna', 'Dmitar', 'Dmitra', 'Dobrašin', 'Dobrica', 'Dobrija', 'Dobrila',
        'Dobrilo', 'Dobrinka', 'Dobrinko', 'Dobrivoj', 'Dobrivoje', 'Dobrosav', 'Dobroslav', 'Dobrovuk', 'Dojčilo', 'Dojčin', 'Dokna', 'Doko',
        'Dorotej', 'Doroteja', 'Dositej', 'Dostana', 'Draga', 'Dragaš', 'Dragija', 'Draginja', 'Dragić', 'Dragiša', 'Dragobrat', 'Dragoja',
        'Dragoje', 'Dragojla', 'Dragojlo', 'Dragoljub', 'Dragoman', 'Dragomira', 'Dragorad', 'Dragosav', 'Dragoslav', 'Dragoslava', 'Dragovan', 'Dragutin',
        'Drailo', 'Drakša', 'Draško', 'Draža', 'Dražeta', 'Dražo', 'Drena', 'Drenka', 'Drinka', 'Dubravac', 'Dubravka', 'Dujak',
        'Dukadin', 'Emilijan', 'Emilije', 'Erak', 'Evdokija', 'Evgenije', 'Fema', 'Gaja', 'Gajin', 'Gajo', 'Gavra', 'Gavrila',
        'Gavrilka', 'Gavrilo', 'Gača', 'Genadije', 'Georgije', 'Gerasim', 'Gligorije', 'Gliša', 'Glišo', 'Godeč', 'Godomir', 'Golub',
        'Goranka', 'Gorica', 'Gorjana', 'Gorčin', 'Gospava', 'Gostimir', 'Gostoljub', 'Gradeta', 'Gradimir', 'Gradiša', 'Grdan', 'Grigorije',
        'Grijak', 'Grozda', 'Grozdan', 'Grozdana', 'Grubac', 'Gruban', 'Grubač', 'Grubeta', 'Grubeša', 'Grubiša', 'Gruja', 'Grujica',
        'Grujo', 'Gvozden', 'Gvozdenija', 'Gvozdenko', 'Hranimir', 'Hranislav', 'Hranislava', 'Hraniša', 'Hrastimir', 'Hristijan', 'Hristoslav', 'Hvalimir',
        'Hvalislav', 'Ignjat', 'Ignjatije', 'Ikonija', 'Ilinka', 'Isaija', 'Isailo', 'Isidor', 'Ivaniš', 'Ivko', 'Jablan', 'Jagodinka',
        'Jagoš', 'Jakša', 'Jandrija', 'Janićije', 'Janovka', 'Jasenko', 'Javorka', 'Javorko', 'Jefimija', 'Jela', 'Jelača', 'Jelašin',
        'Jelen', 'Jelenka', 'Jelenko', 'Jelica', 'Jelisava', 'Jelisavka', 'Jelisije', 'Jeremija', 'Jerotije', 'Jevdokija', 'Jevrem', 'Jevrosima',
        'Jevta', 'Jevtan', 'Jevtimije', 'Jevto', 'Jezda', 'Jezdimir', 'Joksim', 'Jorgovanka', 'Josif', 'Joviša', 'Jovka', 'Jovko',
        'Jugoljub', 'Jugomir', 'Jugoslav', 'Julijan', 'Julka', 'Junoša', 'Juriša', 'Kadivka', 'Kamenko', 'Kasija', 'Kazimir', 'Kazimira',
        'Kažimir', 'Kiprijan', 'Kirilo', 'Kojadin', 'Kojadinka', 'Kojčin', 'Kokan', 'Komnen', 'Komnenija', 'Kornelije', 'Kosana', 'Kosara',
        'Kosovka', 'Kostadinka', 'Kovana', 'Koviljka', 'Koviljko', 'Kovina', 'Kozma', 'Koča', 'Koštana', 'Kraguj', 'Kraisava', 'Krajislav',
        'Krajčin', 'Krasimir', 'Krasoje', 'Krsman', 'Krsmanija', 'Krsta', 'Krstan', 'Krstana', 'Krstina', 'Krstivoje', 'Krsto', 'Krunislav',
        'Krunoslava', 'Ksenija', 'Kumodrag', 'Kuzman', 'Labud', 'Laka', 'Laketa', 'Lako', 'Latinka', 'Laza', 'Leonida', 'Lepa',
        'Lepoje', 'Lepomir', 'Leposava', 'Leposlav', 'Ležimir', 'Ljepava', 'Ljeposava', 'Ljilja', 'Ljiljan', 'Ljuban', 'Ljuben', 'Ljubenko',
        'Ljubinko', 'Ljubisav', 'Ljubislav', 'Ljubivoje', 'Ljubiša', 'Ljubo', 'Ljubobrat', 'Ljubodrag', 'Ljuboja', 'Ljuboje', 'Ljubomir', 'Ljubomirka',
        'Ljubosava', 'Lozan', 'Lujo', 'Manduša', 'Manojlo', 'Matijaš', 'Mavren', 'Mašan', 'Maško', 'Medak', 'Mijailo', 'Mijak',
        'Mijan', 'Mijana', 'Mijat', 'Mijobrat', 'Mijuško', 'Miladija', 'Milak', 'Milanko', 'Milat', 'Milaš', 'Milašin', 'Milentije',
        'Milesa', 'Mileta', 'Mileva', 'Milijan', 'Milijaš', 'Milina', 'Milinko', 'Milisav', 'Milisava', 'Milisavka', 'Milivoj', 'Milivoje',
        'Milić', 'Milj', 'Miljen', 'Miljka', 'Miljko', 'Miljojko', 'Miljurko', 'Milkica', 'Miloja', 'Milojica', 'Milojka', 'Milojko',
        'Milomir', 'Milosav', 'Milosava', 'Milosavka', 'Milovan', 'Milten', 'Miluka', 'Milun', 'Milunka', 'Milutin', 'Miluš', 'Miluša',
        'Miomirka', 'Miroljub', 'Mirosav', 'Mirosava', 'Mirčeta', 'Mitar', 'Mićan', 'Mišljen', 'Mlađan', 'Mlađen', 'Mojsilo', 'Momir',
        'Momčilo', 'Mrkša', 'Mrđan', 'Mrđen', 'Nadica', 'Najdan', 'Naum', 'Nedeljka', 'Nedeljko', 'Negomir', 'Negovan', 'Nevenko',
        'Neđeljka', 'Neđeljko', 'Neško', 'Nikašin', 'Nikodije', 'Nikodim', 'Nikolija', 'Nikša', 'Ninko', 'Ninoslav', 'Nićifor', 'Nišava',
        'Njegomir', 'Njegomirka', 'Njegoslava', 'Njegoš', 'Novica', 'Noviša', 'Novka', 'Novko', 'Obrad', 'Obradin', 'Obradinka', 'Obren',
        'Obrenija', 'Obrenko', 'Obreten', 'Ognjan', 'Ognjana', 'Olja', 'Ostoja', 'Ozriša', 'Pantelija', 'Paun', 'Pauna', 'Pava',
        'Pavija', 'Pavić', 'Pavko', 'Pavle', 'Pavlija', 'Pavlić', 'Pejak', 'Pejo', 'Pelagija', 'Pera', 'Periša', 'Persida',
        'Perun', 'Perunko', 'Petak', 'Petoje', 'Petoš', 'Petrašin', 'Petrija', 'Petronije', 'Plavša', 'Poznan', 'Poznana', 'Prerad',
        'Pribić', 'Prodan', 'Prodana', 'Prokopije', 'Prvoslav', 'Punan', 'Puniša', 'Pureš', 'Purko', 'Puro', 'Racko', 'Radak',
        'Radan', 'Radana', 'Radas', 'Radašin', 'Radeta', 'Radica', 'Radinka', 'Radinko', 'Radisav', 'Radivoj', 'Radivoje', 'Radič',
        'Radiša', 'Radman', 'Radna', 'Radoba', 'Radobud', 'Radoja', 'Radoje', 'Radojica', 'Radojko', 'Radojlo', 'Radoman', 'Radonja',
        'Radosav', 'Radoslava', 'Radota', 'Radovac', 'Radoš', 'Raduka', 'Radukan', 'Radul', 'Radula', 'Radulin', 'Radun', 'Radunka',
        'Radusin', 'Rafailo', 'Raica', 'Raič', 'Raičko', 'Rajak', 'Rajka', 'Rajna', 'Rajčeta', 'Ralen', 'Raleta', 'Ranisav',
        'Ranka', 'Raosav', 'Rastko', 'Ratibor', 'Ratko', 'Ratomir', 'Račeta', 'Rađen', 'Raško', 'Rekula', 'Relja', 'Rista',
        'Ristan', 'Ristivoje', 'Rodoljub', 'Roksanda', 'Samuilo', 'Savka', 'Savko', 'Savo', 'Sazdana', 'Sekana', 'Sekula', 'Selak',
        'Simana', 'Simeun', 'Simeuna', 'Simka', 'Simonida', 'Sinđa', 'Sinđel', 'Skorosav', 'Skorosava', 'Sladoje', 'Slaven', 'Slavenko',
        'Slavna', 'Slavo', 'Slavojka', 'Slavuj', 'Slađan', 'Slađana', 'Slobodanka', 'Smilja', 'Smiljan', 'Smiljana', 'Smiljka', 'Smiljko',
        'Smoljan', 'Smoljana', 'Smoljka', 'Soka', 'Soko', 'Spasenija', 'Spasoja', 'Spiridon', 'Spomenka', 'Srbijanka', 'Srbislav', 'Srboljub',
        'Srboslav', 'Srdan', 'Sredoja', 'Sredoje', 'Sreten', 'Sretko', 'Srećan', 'Srđa', 'Srđan', 'Stajka', 'Staka', 'Stamena',
        'Stamenka', 'Stamenko', 'Stanava', 'Stanača', 'Stanica', 'Stanija', 'Stanisav', 'Stanisava', 'Staniša', 'Stanoja', 'Stanojka', 'Stanojko',
        'Stanojla', 'Stanojlo', 'Staša', 'Stevica', 'Stoin', 'Stoisava', 'Stoić', 'Stoja', 'Stojadin', 'Stojak', 'Stojan', 'Stojana',
        'Stojanka', 'Stojka', 'Stojko', 'Stojmen', 'Stojna', 'Stojša', 'Strainja', 'Svetibor', 'Svetislava', 'Svetolik', 'Svetoljub', 'Svetomir',
        'Svetorad', 'Svetozar', 'Svjetlana', 'Tadija', 'Tanacko', 'Tanasije', 'Tankosa', 'Tankosava', 'Tatomir', 'Teodosije', 'Teofil', 'Tešan',
        'Timotije', 'Todora', 'Toma', 'Tomanija', 'Toplica', 'Trajan', 'Trajko', 'Trifun', 'Tripko', 'Tripun', 'Trivun', 'Tvrtko',
        'Ubavka', 'Uglješa', 'Umiljen', 'Utešen', 'Utješen', 'Vajo', 'Vasilija', 'Vasilije', 'Vasilj', 'Vasiljka', 'Vaskrsija', 'Vaskrsije',
        'Vasoje', 'Vekoslav', 'Veliborka', 'Velinka', 'Velisav', 'Velisava', 'Velizar', 'Veličko', 'Veljko', 'Veran', 'Veroljub', 'Veroslava',
        'Veselinka', 'Vesko', 'Vid', 'Vidak', 'Vidan', 'Vidač', 'Viden', 'Vidoja', 'Vidoje', 'Vidojka', 'Vidojko', 'Vidosav',
        'Vidosava', 'Vilotije', 'Vitka', 'Vitko', 'Vitomir', 'Vitomirka', 'Vićan', 'Vićentije', 'Višeslav', 'Višeslava', 'Vjekoslav', 'Vladana',
        'Vlade', 'Vladeta', 'Vladica', 'Vladimirka', 'Vladisav', 'Vladislava', 'Vladoje', 'Vladun', 'Vlaislav', 'Vlajko', 'Vlasije', 'Vlastimirka',
        'Vlatka', 'Vlaško', 'Voica', 'Vojdrag', 'Vojimir', 'Vojin', 'Vojislav', 'Vojislava', 'Vojka', 'Vojkan', 'Vojko', 'Vraneš',
        'Vugdrag', 'Vuica', 'Vuilo', 'Vuin', 'Vujadin', 'Vujadinka', 'Vujak', 'Vujan', 'Vujana', 'Vujeta', 'Vujka', 'Vujko',
        'Vujo', 'Vujčeta', 'Vujčin', 'Vukac', 'Vukadin', 'Vukajlo', 'Vukalj', 'Vukalo', 'Vukana', 'Vukas', 'Vukač', 'Vukašin',
        'Vukelja', 'Vukica', 'Vukić', 'Vukman', 'Vukmilj', 'Vukmir', 'Vukmira', 'Vuko', 'Vukoje', 'Vukojica', 'Vukola', 'Vukoman',
        'Vukomir', 'Vukosav', 'Vukosava', 'Vukoslav', 'Vukota', 'Vukovoje', 'Vuksan', 'Vukša', 'Vule', 'Vuleta', 'Vunko', 'Vuzman',
        'Vuča', 'Vučan', 'Vučen', 'Vučeta', 'Vučina', 'Vučić', 'Vučko', 'Zagorka', 'Zaharije', 'Zarija', 'Zarije', 'Zavida',
        'Zaviša', 'Zdraviša', 'Zlata', 'Zlatan', 'Zlatana', 'Zlatibor', 'Zlatica', 'Zlatija', 'Zlatoje', 'Zlatomir', 'Zlatomirka', 'Zlatosav',
        'Zorislava', 'Zorka', 'Zrinka', 'Zrinko', 'Zvezdan', 'Zvezdana', 'Zvezdodrag', 'Zvezdoslav', 'Zvjezdan', 'Zvjezdana', 'Zvonka', 'Ćerana',
        'Ćirjak', 'Ćirko', 'Čarna', 'Časlav', 'Čedomir', 'Čubrilo', 'Đenadije', 'Đoko', 'Đorđe', 'Đorđije', 'Đorđo', 'Đuka',
        'Đukan', 'Đura', 'Đurađ', 'Đurašin', 'Đurica', 'Đurisav', 'Đurisava', 'Đurko', 'Đuro', 'Đurđe', 'Đurđevka', 'Đurđica',
        'Đurđija', 'Šakota', 'Šale', 'Šumenko', 'Šutan', 'Žanka', 'Žarko', 'Želimirka', 'Željana', 'Žika', 'Žikica', 'Žitomir',
        'Živadin', 'Živadinka', 'Živan', 'Živana', 'Živanka', 'Živanko', 'Živica', 'Živka', 'Živko', 'Živodarka', 'Živojin', 'Živoljub',
        'Živomir', 'Živorad', 'Živoratka', 'Živoslava', 'Živoslavka', 'Života',
     );

    /**
     * @link http://sr.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%B0%D0%BA_%D1%81%D1%80%D0%BF%D1%81%D0%BA%D0%B8%D1%85_%D0%BF%D1%80%D0%B5%D0%B7%D0%B8%D0%BC%D0%B5%D0%BD%D0%B0_%D1%81%D0%B0_%D0%BD%D0%B0%D1%81%D1%82%D0%B0%D0%B2%D0%BA%D0%BE%D0%BC_-%D0%B8%D1%9B
     */
    protected static $lastName = array(
        'Abadžić', 'Abdulić', 'Abramić', 'Avalić', 'Avdulić', 'Avrić', 'Aguridić', 'Adamić', 'Azarić', 'Ajdačić', 'Ajdučić', 'Aksentić', 'Aksić', 'Alavantić', 'Aladić', 'Alargić', 'Albijanić', 'Aleksandrić', 'Aleksendrić', 'Aleksić', 'Alimpić', 'Aličić', 'Aljančić', 'Amidžić', 'Ananić', 'Andić', 'Andrejić', 'Andrijanić', 'Andrić', 'Androbić', 'Anđelić', 'Anđić', 'Anđušić', 'Anić', 'Aničić', 'Ankić', 'Anojčić', 'Anokić', 'Antić', 'Antonić', 'Anušić', 'Apelić', 'Apić', 'Arambašić', 'Ardalić', 'Arsenić', 'Arsić', 'Atlagić', 'Aćimić', 'Aćić', 'Acić', 'Ačić', 'Adžić', 'Aškrabić', 'Ašćerić', 'Babarogić', 'Babić', 'Bavarčić', 'Baveljić', 'Badrić', 'Bajagić', 'Bajandić', 'Bajić', 'Bajičić', 'Bajkić', 'Bajčetić', 'Bajčić', 'Bakić', 'Baletić', 'Balotić', 'Baltić', 'Balšić', 'Banzić', 'Banić', 'Bantulić', 'Banjalić', 'Baralić', 'Barić', 'Barišić', 'Baroševčić', 'Basarić', 'Bastajić', 'Bastašić', 'Bataveljić', 'Batinić', 'Batnožić', 'Baćić', 'Bacetić', 'Bačić', 'Bačkulić', 'Bašić', 'Baštić', 'Bebić', 'Begenišić', 'Bežanić', 'Bekčić', 'Belančić', 'Belić', 'Belogrlić', 'Belodedić', 'Belonić', 'Beljić', 'Bendić', 'Berilažić', 'Berić', 'Besedić', 'Besjedić', 'Biberčić', 'Biberdžić', 'Bibić', 'Bižić', 'Bizetić', 'Bizumić', 'Bijanić', 'Bijelić', 'Bijelonić', 'Bilibajkić', 'Bilić', 'Bilkić', 'Biljić', 'Biljurić', 'Binić', 'Birišić', 'Bisenić', 'Biserić', 'Biserčić', 'Bisić', 'Bjekić', 'Bjeletić', 'Bjelinić', 'Bjelić', 'Bjeličić', 'Bjelkić', 'Bjelovitić', 'Bjelogrlić', 'Bjelonić', 'Bjelotomić', 'Blagić', 'Blagotić', 'Blažarić', 'Blažetić', 'Blažić', 'Blatešić', 'Blendić', 'Blesić', 'Blečić', 'Blešić', 'Boberić', 'Bobić', 'Bobušić', 'Bogatić', 'Bogdanić', 'Bogetić', 'Bogić', 'Bogičić', 'Bodirogić', 'Bodirožić', 'Bodić', 'Bodrožić', 'Božanić', 'Božikić', 'Božić', 'Božičić', 'Bojadić', 'Bojanić', 'Bojić', 'Bojičić', 'Bojkić', 'Bojčetić', 'Bojčić', 'Bokanić', 'Bokonjić', 'Bolić', 'Boltić', 'Boljanić', 'Bontić', 'Bondžić', 'Bondžulić', 'Borikić', 'Borić', 'Boričić', 'Borišić', 'Borjanić', 'Borokić', 'Borotić', 'Borčić', 'Bosančić', 'Bosiljkić', 'Bosiljčić', 'Bosiorčić', 'Bosiočić', 'Bosić', 'Bosnić', 'Botorić', 'Bocić', 'Bocokić', 'Bošnjačić', 'Boštrunić', 'Bradarić', 'Bradić', 'Bradonjić', 'Brajić', 'Braletić', 'Bralić', 'Bralušić', 'Brančić', 'Bratić', 'Bratonožić', 'Brašić', 'Brdarić', 'Brežančić', 'Brezić', 'Brekić', 'Brzić', 'Brisić', 'Brkanlić', 'Brkić', 'Brndušić', 'Brodalić', 'Brodić', 'Broćić', 'Bruić', 'Brujić', 'Brukić', 'Bubić', 'Bubonjić', 'Bugarčić', 'Budalić', 'Budimkić', 'Budimčić', 'Budinčić', 'Budić', 'Budišić', 'Budnić', 'Budurić', 'Buzaretić', 'Bujagić', 'Bujandrić', 'Bujić', 'Bujišić', 'Bujuklić', 'Bukazić', 'Bukvić', 'Bukelić', 'Bukovčić', 'Bukonjić', 'Bukumirić', 'Bukušić', 'Bulajić', 'Bulić', 'Buljubašić', 'Buljugić', 'Bumbić', 'Bunardžić', 'Bunić', 'Bunčić', 'Burgić', 'Burić', 'Burlić', 'Busančić', 'Buckić', 'Bučić', 'Bušetić', 'Bušić', 'Vagić', 'Vagurić', 'Vajić', 'Vajkarić', 'Vakičić', 'Vanušić', 'Varagić', 'Varaklić', 'Vardalić', 'Varjačić', 'Varničić', 'Vaselić', 'Vasilić', 'Vasić', 'Vašalić', 'Vekić', 'Veletić', 'Velikić', 'Veličić', 'Velišić', 'Veljančić', 'Veljić', 'Vemić', 'Verbić', 'Verbunkić', 'Vergić', 'Verić', 'Verkić', 'Veselić', 'Veseličić', 'Vesić', 'Vesnić', 'Vidarić', 'Vidačić', 'Videkanić', 'Vidić', 'Vilendečić', 'Vilotić', 'Vinokić', 'Vinčić', 'Viorikić', 'Vitakić', 'Vitolić', 'Vićentić', 'Višić', 'Vladetić', 'Vladić', 'Vladičić', 'Vladušić', 'Vlajić', 'Vlajnić', 'Vlajčić', 'Vlaketić', 'Vlasinić', 'Vlasonjić', 'Vlastić', 'Vlačić', 'Vlaškalić', 'Vojičić', 'Vojkić', 'Vojčić', 'Vorgić', 'Vorkapić', 'Voćkić', 'Voštinić', 'Voštić', 'Vranić', 'Vrančić', 'Vratonjić', 'Vračarić', 'Vrekić', 'Vrećić', 'Vrzić', 'Vrtunić', 'Vrugić', 'Vujanić', 'Vujanušić', 'Vujačić', 'Vujetić', 'Vujinić', 'Vujisić', 'Vujić', 'Vujičić', 'Vujnić', 'Vujčetić', 'Vukanić', 'Vukelić', 'Vukić', 'Vukoičić', 'Vukojičić', 'Vukojčić', 'Vukolić', 'Vukomančić', 'Vukosavić', 'Vukotić', 'Vukšić', 'Vuletić', 'Vulešić', 'Vulikić', 'Vulić', 'Vulišić', 'Vucelić', 'Vučelić', 'Vučendić', 'Vučenić', 'Vučetić', 'Vučinić', 'Vučić', 'Gavarić', 'Gavranić', 'Gavrančić', 'Gavrić', 'Gagić', 'Gagričić', 'Gajanić', 'Gajetić', 'Gajić', 'Gajičić', 'Gajtanić', 'Galetić', 'Galić', 'Galonić', 'Galonjić', 'Gambelić', 'Garačić', 'Gardić', 'Garić', 'Garotić', 'Gatarić', 'Gačić', 'Gadžić', 'Gašić', 'Gvozdenić', 'Gvozdić', 'Gvoić', 'Gvojić', 'Genčić', 'Gerzić', 'Gizdavić', 'Gilić', 'Glavendekić', 'Glavinić', 'Glavonić', 'Glavonjić', 'Glavčić', 'Glamočić', 'Gledić', 'Gležnić', 'Glibetić', 'Gligić', 'Gligorić', 'Gligurić', 'Glintić', 'Glišić', 'Gloginjić', 'Glomazić', 'Gluvajić', 'Glumičić', 'Gmizić', 'Gnjatić', 'Gobeljić', 'Gogić', 'Gojgić', 'Goncić', 'Goranić', 'Gorančić', 'Gordanić', 'Gordić', 'Goronjić', 'Gospavić', 'Gostić', 'Gostojić', 'Gocić', 'Gošnjić', 'Grabić', 'Grabovčić', 'Gradić', 'Gramić', 'Grandić', 'Granolić', 'Granulić', 'Graonić', 'Grašić', 'Grbić', 'Grečić', 'Grkinić', 'Grozdanić', 'Grozdić', 'Grokanić', 'Gromilić', 'Grubačić', 'Grubetić', 'Grubešić', 'Grubić', 'Grubišić', 'Grubješić', 'Grublješić', 'Grubnić', 'Gružanić', 'Grujanić', 'Grujić', 'Grujičić', 'Grumić', 'Guberinić', 'Gudurić', 'Gužvić', 'Gujaničić', 'Gurešić', 'Guconić', 'Gudžulić', 'Gušić', 'Dabarčić', 'Dabetić', 'Dabić', 'Davinić', 'Dajić', 'Dajlić', 'Damjanić', 'Dangić', 'Dangubić', 'Daničić', 'Danojlić', 'Dardić', 'Dafunić', 'Dačić', 'Dvokić', 'Dvorančić', 'Dvornić', 'Debelnogić', 'Devedžić', 'Dedić', 'Dejanić', 'Delić', 'Demić', 'Demonjić', 'Denić', 'Denkić', 'Denčić', 'Derajić', 'Deretić', 'Derikonjić', 'Deronjić', 'Desančić', 'Despenić', 'Despinić', 'Despić', 'Deurić', 'Dešić', 'Divić', 'Divnić', 'Divčić', 'Dikić', 'Diklić', 'Dikosavić', 'Dimanić', 'Dimitrić', 'Dimić', 'Dimkić', 'Dimčić', 'Dinić', 'Dinkić', 'Dinčić', 'Diskić', 'Dičić', 'Dobranić', 'Dobratić', 'Dobrić', 'Dobričić', 'Dovijanić', 'Dogandžić', 'Doganjić', 'Dodić', 'Dokić', 'Doknić', 'Dolinić', 'Dončić', 'Dorontić', 'Dostanić', 'Dostić', 'Dostičić', 'Dotlić', 'Dravić', 'Draganić', 'Draginčić', 'Dragić', 'Dragišić', 'Dragoljić', 'Dragonjić', 'Dragoslavić', 'Dragotić', 'Dragušić', 'Dražić', 'Drajić', 'Drakulić', 'Dramlić', 'Drangić', 'Draškić', 'Drezgić', 'Drekić', 'Drenić', 'Drinić', 'Drinčić', 'Družetić', 'Drulić', 'Drčelić', 'Dubajić', 'Dubačkić', 'Dubonjić', 'Dugalić', 'Dugić', 'Dugonjić', 'Dudić', 'Dukić', 'Dumanjić', 'Dumeljić', 'Dumitrikić', 'Dumnić', 'Dumonić', 'Dunčić', 'Dunjić', 'Duronjić', 'Dučić', 'Dušanić', 'Đajić', 'Đakušić', 'Đapić', 'Đekić', 'Đelić', 'Đelkapić', 'Đenadić', 'Đenisić', 'Đenić', 'Đerić', 'Đikić', 'Đinđić', 'Đokić', 'Đorđić', 'Đorić', 'Đuzić', 'Đujić', 'Đukarić', 'Đukelić', 'Đuketić', 'Đukić', 'Đuknić', 'Đuragić', 'Đurakić', 'Đurđić', 'Đuretić', 'Đurić', 'Đuričić', 'Đurišić', 'Đurkić', 'Đusić', 'Evđenić', 'Egarić', 'Egerić', 'Egić', 'Ekmečić', 'Ekmedžić', 'Ergić', 'Eremić', 'Erić', 'Erletić', 'Erčić', 'Žagrić', 'Žarić', 'Žarkić', 'Žepinić', 'Žeravić', 'Žeravčić', 'Žerajić', 'Žestić', 'Živanić', 'Živankić', 'Živić', 'Životić', 'Žigić', 'Žižić', 'Žikelić', 'Žikić', 'Žiletić', 'Žilić', 'Žmirić', 'Žmukić', 'Žmurić', 'Žugić', 'Žunić', 'Žutić', 'Žutobradić', 'Zaburnić', 'Zavišić', 'Zagorčić', 'Zakić', 'Zapukić', 'Zaradić', 'Zarić', 'Zatežić', 'Zaharić', 'Zbiljić', 'Zvekić', 'Zvizdić', 'Zdravić', 'Zdujić', 'Zebić', 'Zekavičić', 'Zekić', 'Zelić', 'Zimonjić', 'Zinaić', 'Zinajić', 'Zisić', 'Zjajić', 'Zjalić', 'Zjačić', 'Zlatić', 'Zličić', 'Zlovarić', 'Zojkić', 'Zokić', 'Zolotić', 'Zorbić', 'Zorić', 'Zoričić', 'Zorkić', 'Zrakić', 'Zrilić', 'Zrnić', 'Zubić', 'Zurnić', 'Ibrić', 'Ivanić', 'Ivantić', 'Ivančić', 'Ivezić', 'Ivetić', 'Ivić', 'Ivičić', 'Ivucić', 'Igić', 'Ignjatić', 'Ignjić', 'Ijačić', 'Ikić', 'Ikonić', 'Ilibašić', 'Ilijić', 'Ilikić', 'Ilinčić', 'Ilisić', 'Ilić', 'Iličić', 'Ilkić', 'Inđić', 'Irić', 'Ičelić', 'Jablančić', 'Javorić', 'Jagličić', 'Jagodić', 'Jakić', 'Jakišić', 'Jakonić', 'Jakšić', 'Jalić', 'Jandrić', 'Janikić', 'Janić', 'Janičić', 'Jankelić', 'Jankić', 'Janojkić', 'Jančić', 'Jančurić', 'Janjić', 'Janjušić', 'Jarić', 'Jasnić', 'Jašić', 'Jevdoksić', 'Jevđenić', 'Jeveričić', 'Jević', 'Jevrić', 'Jevtić', 'Jegdić', 'Jezdić', 'Jezerkić', 'Jelačić', 'Jelašić', 'Jelenić', 'Jelesić', 'Jelikić', 'Jelisavčić', 'Jelisić', 'Jelić', 'Jeličić', 'Jelušić', 'Jenić', 'Jergić', 'Jeremić', 'Jerinić', 'Jerinkić', 'Jerosimić', 'Jerotić', 'Jerčić', 'Jesretić', 'Jestrotić', 'Jeftenić', 'Jeftić', 'Ječmenić', 'Ješić', 'Jovakarić', 'Jovandić', 'Jovanetić', 'Jovanić', 'Jovankić', 'Jovančić', 'Jovadžić', 'Jovelić', 'Joveljić', 'Jovetić', 'Jovešić', 'Jovikić', 'Jović', 'Jovičić', 'Jovišić', 'Jovkić', 'Jovonić', 'Jovčić', 'Jozić', 'Jojić', 'Jojčić', 'Jokić', 'Jokičić', 'Joksić', 'Jolić', 'Jonikić', 'Jonić', 'Joničić', 'Jonkić', 'Jontić', 'Jončić', 'Jorgić', 'Jorgonić', 'Josić', 'Jocić', 'Juzbašić', 'Jukić', 'Jungić', 'Jurišić', 'Juškić', 'Kavalić', 'Kajganić', 'Kalabić', 'Kalajić', 'Kalajdžić', 'Kalendić', 'Kalenić', 'Kalinić', 'Kamperelić', 'Kandić', 'Kanlić', 'Kanjerić', 'Karavidić', 'Karagić', 'Karajčić', 'Karaklajić', 'Karaleić', 'Karalejić', 'Karalić', 'Karapandžić', 'Karatošić', 'Karaulić', 'Karadžić', 'Karić', 'Karišić', 'Karličić', 'Katanić', 'Katić', 'Kaćurić', 'Kačaniklić', 'Kašerić', 'Kvrgić', 'Kendrišić', 'Kentrić', 'Kepić', 'Kesić', 'Kečkić', 'Kijačić', 'Kimčetić', 'Kiselčić', 'Kitanić', 'Kitić', 'Kitonjić', 'Kičić', 'Klevernić', 'Klepić', 'Klinić', 'Klipić', 'Klisarić', 'Klisurić', 'Kličarić', 'Kljajić', 'Kljakić', 'Knežić', 'Kovanušić', 'Kovandžić', 'Kovarbašić', 'Kovačić', 'Kovinić', 'Kovinčić', 'Kovjanić', 'Kovjenić', 'Kovljenić', 'Kozić', 'Kojanić', 'Kojić', 'Kojičić', 'Kojčić', 'Kojundžić', 'Kolavčić', 'Kolarić', 'Kolačarić', 'Količić', 'Kolundžić', 'Koljančić', 'Komadinić', 'Komarčić', 'Komlenić', 'Komnenić', 'Kondić', 'Kontić', 'Konculić', 'Konjikušić', 'Koraksić', 'Kordić', 'Korugić', 'Koružić', 'Kosanić', 'Kosić', 'Kosnić', 'Kosorić', 'Kostić', 'Kotarlić', 'Kotlajić', 'Kočić', 'Kodžopeljić', 'Košarić', 'Košpić', 'Košutić', 'Kravarušić', 'Kravić', 'Kragić', 'Krainčanić', 'Krantić', 'Krasavčić', 'Krasić', 'Krezić', 'Krejić', 'Kremić', 'Kremonjić', 'Krestić', 'Krivošić', 'Krkeljić', 'Krkić', 'Krkobabić', 'Krnetić', 'Krnjajić', 'Krnjeušić', 'Krompić', 'Krotić', 'Krpić', 'Krsmanić', 'Krsmić', 'Krstajić', 'Krstekanić', 'Krstinić', 'Krstić', 'Krstičić', 'Krstonić', 'Krstonošić', 'Krtinić', 'Krunić', 'Kruškonjić', 'Kršić', 'Kuveljić', 'Kudrić', 'Kuzmić', 'Kujavić', 'Kujačić', 'Kujundžić', 'Kukrić', 'Kulezić', 'Kulizić', 'Kulišić', 'Kulundžić', 'Kuljančić', 'Kuljić', 'Kumrić', 'Kureljušić', 'Kurilić', 'Kursulić', 'Kurucić', 'Kurčubić', 'Kusonić', 'Kusonjić', 'Kusturić', 'Kutlačić', 'Kutlešić', 'Kušić', 'Kušljić', 'Labotić', 'Lavrnić', 'Lažetić', 'Lazendić', 'Lazetić', 'Lazić', 'Lazičić', 'Lazukić', 'Lajšić', 'Laketić', 'Lakić', 'Lalić', 'Lambić', 'Lapčić', 'Lastić', 'Latinčić', 'Leburić', 'Ležaić', 'Ležajić', 'Lekanić', 'Lekić', 'Lemaić', 'Lemajić', 'Leposavić', 'Lesendrić', 'Lečić', 'Leštarić', 'Lijeskić', 'Likodrić', 'Likušić', 'Lilić', 'Lipovčić', 'Lisičić', 'Lišančić', 'Lovrić', 'Lozanić', 'Lojaničić', 'Lolić', 'Lomić', 'Lopandić', 'Lubardić', 'Lubinić', 'Luburić', 'Lugonjić', 'Lužaić', 'Lužajić', 'Lukajić', 'Lukačić', 'Lukendić', 'Lukić', 'Lukičić', 'Lunić', 'Lutkić', 'Lučić', 'Ljamić', 'Ljeganušić', 'Ljotić', 'Ljubanić', 'Ljubić', 'Ljubičić', 'Ljubišić', 'Ljušić', 'Ljuškić', 'Maglić', 'Majkić', 'Makarić', 'Makivić', 'Makragić', 'Maksić', 'Malavrazić', 'Malbašić', 'Malenčić', 'Maletić', 'Malešić', 'Malinić', 'Mališić', 'Malobabić', 'Malušić', 'Maljugić', 'Maljčić', 'Mandarić', 'Mandinić', 'Mandić', 'Mandušić', 'Manić', 'Mančić', 'Manjenčić', 'Maravić', 'Marinčić', 'Marić', 'Maričić', 'Markagić', 'Markelić', 'Markeljić', 'Markulić', 'Marodić', 'Martić', 'Marunić', 'Marunkić', 'Marušić', 'Marčetić', 'Marčić', 'Masalušić', 'Maslarić', 'Maslić', 'Maslovarić', 'Matarugić', 'Matejić', 'Materić', 'Matić', 'Matičić', 'Matušić', 'Maćešić', 'Maćić', 'Mačić', 'Mačkić', 'Mačužić', 'Mašić', 'Medić', 'Medurić', 'Mektić', 'Mesulić', 'Mijalčić', 'Mijanić', 'Mijačić', 'Mijić', 'Mijucić', 'Mikarić', 'Mikelić', 'Miketić', 'Mikić', 'Mikičić', 'Mikonjić', 'Mikulić', 'Miladić', 'Milakić', 'Milačić', 'Milekić', 'Milenić', 'Miletić', 'Mileusnić', 'Milešić', 'Milijić', 'Milikić', 'Milikšić', 'Milinić', 'Milinčić', 'Milisavić', 'Miličić', 'Milić', 'Milišić', 'Milkić', 'Miloičić', 'Milojić', 'Milojičić', 'Milojkić', 'Milojčić', 'Milotić', 'Milunić', 'Milušić', 'Milčić', 'Miljanić', 'Mindić', 'Minić', 'Minčić', 'Miovčić', 'Miodanić', 'Mionić', 'Miražić', 'Mirić', 'Mirjanić', 'Mirkić', 'Mirosavić', 'Mirčetić', 'Mirčić', 'Misojčić', 'Mitić', 'Mitranić', 'Mitrekanić', 'Mitrić', 'Mitrušić', 'Mićić', 'Mihaljčić', 'Miholjčić', 'Mišeljić', 'Mišić', 'Miškić', 'Mišurić', 'Mladić', 'Mladžić', 'Mojsić', 'Mokrić', 'Momić', 'Moračić', 'Moretić', 'Morokvašić', 'Motičić', 'Mrakić', 'Mračić', 'Mrdić', 'Mrkić', 'Mrkonjić', 'Mrkušić', 'Mrkšić', 'Mudrinić', 'Mudrić', 'Munišić', 'Murganić', 'Mutavdžić', 'Mutibarić', 'Mučibabić', 'Mušikić', 'Navalušić', 'Nagradić', 'Nagulić', 'Nadaškić', 'Najdić', 'Najkić', 'Nakalamić', 'Nakić', 'Narančić', 'Narandžić', 'Nastasić', 'Nastić', 'Nebrigić', 'Nevajdić', 'Nevenić', 'Negoicić', 'Nedinić', 'Nedić', 'Nekić', 'Nemanjić', 'Nenadić', 'Nenić', 'Neoričić', 'Nešić', 'Nikezić', 'Niketić', 'Nikitić', 'Nikoletić', 'Nikolešić', 'Nikolić', 'Nikolčić', 'Nikšić', 'Ninić', 'Ninčić', 'Ničić', 'Nišavić', 'Nišić', 'Novalušić', 'Novarlić', 'Novačikić', 'Nović', 'Novičić', 'Novčić', 'Nožinić', 'Nojkić', 'Njegić', 'Njegrić', 'Nježić', 'Obrenić', 'Odavić', 'Ozimić', 'Ojdanić', 'Ojkić', 'Oketić', 'Okolić', 'Okulić', 'Olarić', 'Olić', 'Olujić', 'Oljačić', 'Opalić', 'Oparušić', 'Opačić', 'Oprikić', 'Oprić', 'Opricić', 'Oraovčić', 'Orlandić', 'Orlić', 'Osmajlić', 'Ostojić', 'Ocokoljić', 'Odžić', 'Pavić', 'Pavičić', 'Pavlekić', 'Pavličić', 'Pavčić', 'Padić', 'Pajagić', 'Pajić', 'Pajičić', 'Pajkić', 'Pajtić', 'Palalić', 'Palangetić', 'Paligorić', 'Palić', 'Paninčić', 'Panić', 'Panišić', 'Pantelić', 'Pantić', 'Pančić', 'Pandžić', 'Papić', 'Paprić', 'Papulić', 'Paramentić', 'Paraušić', 'Parivodić', 'Parlić', 'Parojčić', 'Patrnogić', 'Paunić', 'Pašić', 'Pejić', 'Pejičić', 'Pejušić', 'Pejčić', 'Pelagić', 'Pendić', 'Penezić', 'Penčić', 'Pepić', 'Perenić', 'Perić', 'Peričić', 'Perišić', 'Perjaničić', 'Perkić', 'Perotić', 'Peruničić', 'Perčić', 'Petkanić', 'Petrikić', 'Petrić', 'Petričić', 'Petronić', 'Petrušić', 'Peulić', 'Pecić', 'Pečeničić', 'Pešić', 'Pikić', 'Pilindavić', 'Piljagić', 'Piperčić', 'Pirivatrić', 'Pirić', 'Pisarić', 'Pitulić', 'Pjanić', 'Pjević', 'Plavić', 'Plavkić', 'Plavljanić', 'Plavšić', 'Plazinić', 'Planinčić', 'Planić', 'Platanić', 'Plačić', 'Plemić', 'Pleskonjić', 'Plećić', 'Plintić', 'Plisnić', 'Ploskić', 'Pločić', 'Pljakić', 'Pljevaljčić', 'Pobulić', 'Podinić', 'Podraščić', 'Podrić', 'Poznanić', 'Poznić', 'Pojkić', 'Polić', 'Polomčić', 'Polugić', 'Ponjavić', 'Pop Lazić', 'Popadić', 'Poparić', 'Popčić', 'Potrebić', 'Poštić', 'Pravdić', 'Pražić', 'Predić', 'Prekić', 'Prelić', 'Prendić', 'Prešić', 'Pržić', 'Pribić', 'Pribišić', 'Prigodić', 'Prijić', 'Prikić', 'Prišić', 'Prodanić', 'Prokić', 'Prokopić', 'Prolić', 'Protić', 'Prošić', 'Pruginić', 'Prunić', 'Pršendić', 'Pualić', 'Puvalić', 'Puvačić', 'Pudarić', 'Punišić', 'Purešić', 'Purić', 'Purišić', 'Puslojić', 'Pušeljić', 'Ravilić', 'Radančić', 'Radeljić', 'Radetić', 'Radešić', 'Radivojšić', 'Radikić', 'Radisavić', 'Radić', 'Radičić', 'Radišić', 'Radnić', 'Radoičić', 'Radojičić', 'Radojkić', 'Radojčić', 'Radonić', 'Radonjić', 'Radosavkić', 'Radotić', 'Radukić', 'Radulić', 'Raduljčić', 'Raducić', 'Radušić', 'Razumenić', 'Railić', 'Raičić', 'Rajačić', 'Rajić', 'Rajičić', 'Rajlić', 'Rajčetić', 'Rajčić', 'Rajšić', 'Rakezić', 'Raketić', 'Rakinić', 'Rakitić', 'Rakić', 'Rakonić', 'Raletić', 'Ralić', 'Raljić', 'Ramić', 'Ranđić', 'Ranisavić', 'Rankić', 'Rančić', 'Raonić', 'Rapaić', 'Rapajić', 'Rasulić', 'Ratkelić', 'Raulić', 'Racić', 'Račić', 'Rašetić', 'Rašić', 'Rašljić', 'Regodić', 'Regulić', 'Rekalić', 'Reljić', 'Remetić', 'Rendulić', 'Repašić', 'Resimić', 'Redžić', 'Ribarić', 'Riboškić', 'Riđošić', 'Riznić', 'Rinčić', 'Risimić', 'Ristanić', 'Ristić', 'Rmandić', 'Rnić', 'Rogić', 'Roglić', 'Rogonjić', 'Rogulić', 'Rodić', 'Rozgić', 'Rokvić', 'Roknić', 'Roksandić', 'Roksić', 'Roljić', 'Romanić', 'Romić', 'Rosić', 'Roškić', 'Ruvidić', 'Rudić', 'Rudonjić', 'Ružić', 'Ružičić', 'Ružojčić', 'Rumenić', 'Rundić', 'Runjajić', 'Rusalić', 'Rutešić', 'Rutonić', 'Ruškić', 'Sabljić', 'Savandić', 'Savatić', 'Savelić', 'Saveljić', 'Savić', 'Savičić', 'Savkić', 'Savurdić', 'Savčić', 'Salatić', 'Samardžić', 'Sandić', 'Sapardić', 'Saramandić', 'Sarić', 'Satarić', 'Svetličić', 'Svilarić', 'Svojić', 'Sekanić', 'Sekulić', 'Selenić', 'Sendrić', 'Senić', 'Seničić', 'Sentić', 'Setenčić', 'Sibinkić', 'Sibinčić', 'Sikimić', 'Simanić', 'Simendić', 'Simetić', 'Simić', 'Simurdić', 'Sinđelić', 'Sinđić', 'Sinkić', 'Sitničić', 'Sjeničić', 'Skakić', 'Skelić', 'Skendžić', 'Skerlić', 'Skokić', 'Skočajić', 'Skočić', 'Skrobić', 'Skulić', 'Slavić', 'Slavnić', 'Sladić', 'Slović', 'Smilić', 'Smiljanić', 'Smiljić', 'Smiljkić', 'Smoljanić', 'Smrekić', 'Sovrlić', 'Sovtić', 'Sojkić', 'Sokić', 'Soknić', 'Soldatić', 'Sorajić', 'Soskić', 'Sofijanić', 'Sofranić', 'Sofrenić', 'Sofronić', 'Spaić', 'Spakić', 'Sparić', 'Spasenić', 'Spasić', 'Spenčić', 'Sperlić', 'Spirić', 'Spremić', 'Spužić', 'Sredić', 'Sretić', 'Stavrić', 'Stajić', 'Stajkić', 'Stajčić', 'Stajšić', 'Stakić', 'Stakušić', 'Stamatić', 'Stambolić', 'Stamenić', 'Stamenčić', 'Stanarčić', 'Stanetić', 'Stanikić', 'Stanisavić', 'Stanić', 'Staničić', 'Stanišić', 'Stankić', 'Stanovčić', 'Stanojčić', 'Stanušić', 'Stančetić', 'Stančić', 'Stašić', 'Stevandić', 'Stevanetić', 'Stevanić', 'Stevelić', 'Stević', 'Stevčić', 'Stegić', 'Stegnjaić', 'Stegnjajić', 'Stekić', 'Steljić', 'Stepandić', 'Stepanić', 'Stepić', 'Stijačić', 'Stijepić', 'Stikić', 'Stjepić', 'Stožinić', 'Stojanić', 'Stojankić', 'Stojančić', 'Stojačić', 'Stojić', 'Stojičić', 'Stojkić', 'Stojnić', 'Stojčić', 'Stojšić', 'Stokanić', 'Stokić', 'Stolić', 'Stoparić', 'Stopić', 'Stošić', 'Strajnić', 'Strahinić', 'Strahinjić', 'Strinić', 'Subotić', 'Suvajdžić', 'Sumenić', 'Sunarić', 'Surlić', 'Suručić', 'Tadić', 'Tajsić', 'Tamindžić', 'Tanasić', 'Tanić', 'Tankosić', 'Tančić', 'Tarabić', 'Tasić', 'Tatišić', 'Tvrdišić', 'Teodosić', 'Tepić', 'Tepšić', 'Terzić', 'Teslić', 'Tešanić', 'Tešankić', 'Tešendić', 'Tešinić', 'Tešić', 'Tijanić', 'Timilić', 'Timotić', 'Tirić', 'Tirnanić', 'Tmušić', 'Tovarišić', 'Todić', 'Todorić', 'Todosić', 'Tojić', 'Tokalić', 'Tol