�ბერილი თავადი გორავდა და, თუ ზაფხული იყო, ჭერში ბუზებსა სთვლიდა. ერთხელ ფრიად ღირსსაცნობი სჯა და ბაასი გამართეს. ეს იყო შუა ზაფხულის პაპანაქებაში, სადილ-წინ, როცა დარეჯანმა გაათავა ერთი ზემოხსენებულ-გვარი მოგზაურობა და თავში ტყაპუნი და ოფლში გაწუწული შემოვიდა ოთახში. ლუარსაბმა შეხედა, და დაინახა თუ არა, რომ ოფლი წურწურით ჩამოსდის წითელ ლოყებზედ, თავის გულში სთქვა სრულიად კმაყოფილმა: — კაი ოჯახის ბურჯია, კაი მადლიანი დედაკაცია გმადლობ, ჩემო გამჩენო, რომ ამისთანა შემახვედრე.
ესა სთქვა და კმაყოფილი თავისი უბრყვილო ბედისა გადატრიალდა ერთის გვერდიდამ მეორეზედ ღვთისა და კაცის მადლიერი თავადი. ეს გადატრიალება იმის ნიშანი იყო, რომ ლუარსაბს იამა რამე.
— სად იყავ, შენი ჭირიმე, — ჰკითხა მერე კნეინასა, — რომ ეგრე დაიღალე?
— როგორ თუ სადა, შენი ჭირიმე? ოჯახობაა, სახლია, კარია, თვალყურის ჭერა უნდა, შენ გენაცვალოს ჩემი თავი, — მიუგო კნეინამ.
— ეგრე, ჩემო დარეჯან, ეგრე გეთაყვანე! დედაკაცობაც ეგ არის და.
— მაშ? — მიუგო ქებით თავ-გაზვიადებულმა ცოლმა, — ესე უნდა თვალგაფაციცებული დასტრიალებდე მოსამსახურესა, თორემ ჭამის მეტს არას გააკეთებს. ბიჭებს მოვლა უნდა.
— მაშ, მაშ!
—ბევრმა არ იცის, როგორ მოეპყრას.
— მაშ, არ იცის, თორემ, რომ იცოდეს, კარგია, მაშ!
— ხანდისხან ტყუილ-უბრალოდაც უნდა დასტუქსო. რომ გამოლანძღო კიდეც, ცუდი არ იქნება. აი, მე გავლანძღავ კიდეც, გავუჯავრდები, დავტუქსავ, დავწყევლი, — სულ რისთვის? იმისთვის, რომ შიში და კრძალვა ჰქონდეს, თორემ შენი მტერი!..
— ოღონდაც, შენი მტერი!.. ოღონდაც!..
— ეს გლეხები არიან: გაქირ ვირსავით თუ ერთხელ შედგა, მერე, თუნდა შვინდის სახრით მისდგე, ფეხს ვერ გადაადგმევინებ, თუ ადრევე დატუქსული არა გყავს.
— ოღონდაც, დატუქსული უნდა გყვანდეს, — მიუგო ხელახლად თავის ცოლის სიბრძნისაგან გაოცებულმა ლუარსაბმა, — ოღონდაც, გაქირ ვირსავით შედგება.
— არა, გეთაყვა, ეს, რაცა ვთქვი, ტყუილია?
— ტყუილი რად იქნება? მართალია. შენოდენა დედაკაცს სიზმარიც დაეჯერება, — წამოროხა უთავბოლოდ ლუარსაბმა. თითონაც არ იცოდა „სიზმარი“ რისთვის ჩააკერა ლაპარაკში.
ორივე დაჩუმდნენ. ლუარსაბმა ჭერს მიაბჯინა თვალები; იქ ჯგუფად ისხდნენ ბუზები. დარეჯანმა მატყლის წინდის ქსოვა დაიწყო.
პატარა ხანს უკან ლუარსაბმა წამოიძახა:
— დარეჯან, აბა, თუ ჭკვიანი დედაკაცი ხარ, გამოიცან, ა იმ ფიცარზედ რამდენი ბუზი ზის?
— აბა სადა?
— აი, ჭერის ფიცარზედ.
თურმე, ნუ იტყვით, ამ სასაცილო ლუარსაბსა, დაჩუმებულნი რომ იყვნენ, იმ დროს ის ბუზები უთვლია! დარეჯანმა რა იცოდა.
— რამდენია? — სთქვა დარეჯანმა, — მაიცა, ჯერ დავთვალო.
— ეგრე ხომ მეც გამოვიცნობ. აბა ისე გამოიცან, კაცობა ის იქნება.
— ისე გამოვიცნო? მაშ კარგი, ოცდაათი იქნება.
— ოლოლო შენ, ვერ გამოიცან.
— მაშ რამდენია?
— რამდენია? გითხრა? არა, არ გეტყვი.
— სთქვი, თუ იცი, რაღა.
— თუ კაცი ვარ, ორმოცი უნდა იყოს. ოლოლო შენ, მე გამოვიცან.
— დიაღ, გამოიცან... დაგითვლია, როგორც იმ დღესა ჰქენი, ეგრე ხომ მეც გამოვიცნობ.
— შენც არ მამიკვდე, ის კარგი მამა არ წამიწყდეს, რომ არ დამითვლია.
— მაშ საიდამ იცი, რომ ორმოცია.
— საიდამ? იქიდამ, რომ გონება მაქვს.
— განა მე კი არა მაქვს გონება?
— შენც გაქვს, მაგრამ კაცის გონებასთან დედაკაცის გონება როგორ მოვა? მე ვარაუდით მივხვდი, რომ ორმოცია.
— რომ არ იყოს ორმოცი?
— ჯარიმა გადამახდევინე.
— მაშ დავთვალოთ.
დაიწყეს ცოლმა და ქმარმა ბუზების თვლა. გამოვიდა, რომ ორმოცდაათზედაც მეტი იყო.
— გამოიცნო?! — სთქვა ნიშნის მოგებით დარეჯანმა, — დიაღ, გამოიცნო, გონება აქვს ამ ჩემ ბატონს და იმიტომ გამოიცნო.
ლუარსაბს შერცხვა, ცოტად აირია.
— გაფრენილან, თორემ ორმოცი იყო, — სთქვა სულელმა თავის გასამართლებლად, — სწორედ გაფრენილან.
— უფრო კარგი, თუ გაფრენილან, უფრო ცოტა არ უნდა დარჩენილიყო? მანდ ორმოცდაათზედაც მეტი არის ეხლა.
ლუარსაბი გაიწურა, ეს რა წამოვროხეო, სთქვა გულშია.
რომ ჩააფუჩეჩოს თავისი მახეში გაბმა, კბილების კრაჭუნით, რომელსაც კნეინა ღიმილს ეძახდა, სთქვა:
— დალახვრა ღმერთმა — ეგ ვეღარ მოვიფიქრე, ბიჭოს!.. თითქო ოთხჯერ დავთვალე.
— აკი არ დამითვლიაო.
— შენგან არ მიკვირს! რომ არ დამეთვალა, სოლომონ ბრძენი ხომ არ ვიყავ, რომ ისე გამომეცნო. როგორ არ დავთვალე, აი დალახვრა ღმერთმა, — შემცდარვარ, თორემ გაჯობებდი, აი, ჩემო სულიკო! მე და ჩემმა ღმერთმა, გაჯობებდი.
სთქვა და გაცრუებული ლუარსაბი შაქარსავით გაუტკბილდა თავის ამ ჟამად გამარჯვებულს მეუღლესა.
— აკი არ დამითვლიაო, შე ეშმაკო, შენა! — მიატანა ღიმილითვე კნეინამა.
— ხომ გაგიტყდი, შენი კუჭისა, სხვა რა გინდა?
— შენი სიცოცხლე და ბედნიერება, ჩემო ტურფავ! რა უნდა მინდოდეს სხვა.
— დარეჯან!.. — უთხრა გულნატკენად და მორცხობით ლუარსაბმა, — დარეჯან!.. თუ გიყვარდე, ტურფას ნუ მეძახი.
— რატომ, შენი ჭირიმე? რატომ?
— ჩემოდენა კაცს არ უხდება, შენ გეთაყვანე: ტურფას პატარა გოშიას ეძახიან, ეგ ძაღლის სახელია, აბა რა კაცის საკადრისია ეგ სახელი?
— მაშ შენ ჩემი გოშია არა ხარ? არა ხარ განა? მე შენგან ეგ პირველად მესმის, — მიუგო გულამომჯდარად დარეჯანმა, რადგანაც ეგონა, გოშიაობაზედ რომ ხელი აიღოვო, სჩანს გულიც აუყრია ჩემზედაო.
ლუარსაბი მიხვდა, რომ გულიც ატკინა და ტყუილ-უბრალოდაც ატკინა, — და რომ ის გულაყრილობის ფიქრი გაუფანტოს, უთხრა კბილების კრაჭუნით:
— ჰო, გეთაყვა, ჰო, შენი გოშია ვარ, მაშ რა ვარ?
— პირწყლიანი დედაკაცი არა ყოფილა ეს დალოცვილისშვილი, — სთქვა თავის გულში ლუარსაბმა, — მოლექსესავით რა ლამაზად მოაწყო ჩემი გოშიობა... რა ენის პატრონია!.. როგორ იხერხა?!
თითონაც უნდოდა ერთი ამისთანა ალერსი მოეწყო რამ, მაგრამ, როცა ეს გაჭირება დაადგებოდა, თვალებში სულ ზურგიელი, თართის დოში, არტალა ნივრით და სხვა ამისთანა გაეჩხირებოდა ხოლმე. აბა ამ საგნებით რა ალერსს გამოხატავს კაცი? მაგრამ ლუარსაბმა მაინც კიდევ მოახერხა წყლიანი სიტყვა:
— შენ იცი, ჩემი რა ხარ? სულის წიწმატი, გულის ტარხუნა, გონების, აბა რა ვთქვა? — თუნდა მარილი იყოს. კარგად არ ვთქვი, ის კარგი და სახელოვანი მამა ნუ წაგიწყდება? კარგი მოწყობა არ იყო?
წამოროშა ესა და მხიარულობის ნიშნად დააკრაჭუნა კბილები თავის პირწყლიანობით აღტაცებულმა ლუარსაბმა. არც დარეჯანი დარჩა უსიამოვნოდ. ხშირად გაუტარებიათ ამ-რიგად დრო ჩვენს ცოლ-ქმარსა. ნეტავი იმათ, მკითხველო!..
III
ლუარსაბმაც კი იცოდა ბიჭების „დაწიოკება“, როგორც თითონ იტყოდა ხოლმე. მართალია, ცოტა ზანტი იყო, მაგრამ იმოდენა მამულ-დედულს მოვლა არ უნდოდა? ეს მამულის მზრუნველობა ძალას დაატანდა ხოლმე და წამოახტუნებდა ტახტიდამა. მაშინ უნდა გენახათ, რა ლამაზი იყო ჩვენი ლუარსაბი: ფეხშიშველა, ლურჯი კალმუხის ქუდით თავზედ, წითელ პერანგის და მის განუშორებელ ამხანაგის ანაბარას, გულგადაღეღილი, ფაშვიანი, ჩიბუხით ხელში მიგორდებოდა მოაჯირის გადასაყუდებელთან და გადასძახებდა ძილისაგან გაბოხებულ ხმითა თავის მოურავს დათოსა:
— დათო! ხორცი ხომ ჩამოიტანე ბაზრიდამ? (იმ სოფელში ბაზარიც გახლდათ).
— დიაღ, შენი ჭირიმე.
— რა ნაჭერია?
— ჩალაღაჯი.
— სამწვადედ?
— სუკი ვიშოვე, შენი ჭირიმე.
— ძვირფასი კაცია, — გაიფიქრებდა ხოლმე მადლიერი მებატონე, მერე დათოს ეტყოდა: — ბარაქალა, ჩემო დათო! თუ კაცმა დაივიწყა, ღმერთი არ დაივიწყებს ბატონის ერთგულობასა. ბარაქალა! შენ ჩემი მარჯვენა მკლავი ხარ, მაგარი მკლავი.
დათო თავს მოიფხანდა ხოლმე და უხეიროდ გაიღიმებდა ამგვარ ქებაზედა.
— მეზვრემ მწვანილი მოიტანა? — ჰკითხავდა კიდევ ბატონი.
— მოიტანა.
— ტარხუნა ხომ არის?
— გახლავს.
— კიტრი?
— კიტრიც გახლავს.
ლუარსაბს იამა. ტახტი რომ ყოფილიყო, ერთი ორჯერ მაინც გადატრიალ-გადმოტრიალდებოდა.
— მაშ სახლი სავსე ყოფილა, — სთქვა ბატონმა სიამოვნებით.
— როდისა გხლებიათ ნაკლული, შენი ჭირიმე, რომ ეხლა იყოს?..
— ეგრე, ჩემო დათო! ბატონის ოჯახის პატივი და სახელი ერთგულმა ყმამ ქვეყანას უნდა მოსდოს. ბარაქალა! თუნდ ნაკლული იყოს, უნდა სთქვა, რომ სავსეაო. შენ გამოცდილი კაცი ხარ, — ეს ყველაფერი იცი.
— ამოდენა კაცი შენს ხელში ვარ და როგორ არ მეცოდინება, შენი ჭირიმე!
— ეხლა ერთი ეს ვიკითხოთ, — სთქვა პატარა ხანს უკან მზრუნველმა მებატონემ, — ურმები გაისტუმრე?
— გავისტუმრე, შენი ჭირიმე! ეხლა თუნდ ორღობეებს იქნებიან გაცილებულნი.
— სად გაისტუმრე?
— ყანაში, შენი ჭირიმე!
— რამდენია?
— ოთხი საბატონო და ათი ბეგრისა.
— რატომ ბეგრისა ხუთმეტი არ არის?
— ხუთმეტი ჩვენ კაცებში თავის გაჩენაში არ შებმულან, შენი ჭირიმე, და დღეს საიდამ იქნებოდა!
— ხუთმეტი უნდა ყოფილიყო, ვეჟო! რატომ არ არის? მე არ ვიცი, ხუთმეტი უნდა ყოფილიყო. როგორ იქნება? ბატონს სამსახური უნდა, მაშ მე ბატონი აღარ ვყოფილვარ!.. გაგონილა!.. ფიე! ხუთმეტი უნდა ყოფილყო. მე ვუჩვენებ იმათ, რომ მე ბატონი ვარ და ისინი ყმები არიან.
მართლა-და ლუარსაბსა თავის დღეში ათის ურმის მეტი არ შეჰბმია და რაზედ გაწყრა ეგრე უწყალოდ? დათოსაც არ ესმოდა — ეს წყრომა რის ნიშანი იყო. გაუკვირდა და ბატონს ყურება დაუწყო, ხომ არ გაგიჟდაო. დიაღ, ლუარსაბი კი იქნება, რომ გაგიჟდეს!.. და თუ ტყუილ-უბრალოდ გაწყრა, მაგისი საბუთები სულ გოგრაში ჰქონდა. როგორც ამისი ძვირფასი კნეინა, ისე თითონაც ძალიანა ჰჩემობდა მოსამსახურეების და ყმის მოხმარებასა.
— გლეხკაცს ეგრე უნდა მოეპყრას ბატონიო, — იტყოდა ხოლმე ბრძენი თავადი, — ეგრე უნდაო, რომ ყოველ ცისმარა დღეს ეშინოდეს, თორემ, ღორის მკბენარსავით, რომ გლეხკაცი ფეხზედ დაისო, თავზედ აგაცოცდებაო. მაშ! შიში შეიქმს სიყვარულსაო.
ოღონდაც, ჩემო ლუარსაბ, ოღონდაც!
ის კი არ იცოდა ამ ბედნიერმა ადამიანმა, რომ უმიზეზო და ამგვარ ტყუილ-უბრალო აპილპილებაზედ გლეხებს სულ სხვა მსჯელობა და დასკვნა აქვთ ხოლმე. ეჰ, შენ რაც უნდა სთქვა, მკითხველო, და ამ ცოლ-ქმარს კი ეგონა, რომ თუ მუცელი მაძღარი აქვთ, ამ-გვარ ყმების მოხმარების ცოდნისაგან აქვთ.
ამისთანა სულელობას ჩვენი გულწრფელი თავადი ეძახდა ბიჭების „დაწიოკებასა“. დარწმუნებული იყო, რომ ეს „დაწიოკება“ ისე აუცილებლად საჭიროა ოჯახისათვის, როგორც სმა-ჭამა კაცისათვისა. ამიტომაც, რომ შემოვიდოდა ოთახში, თავის-თავის კმაყოფილებით ეტყოდა ხოლმე ცოლსა:
— ძლივს არ გავისტუმრე ურმები (ტყუილიც უყვარდა ჩვენს ლუარსაბსა), ძლივს! დალახვროს ღმერთმა გლეხკაცი! ვეჟო, მინამ თავს არ დაადგები და კარგად არ დასჭყივლებ, ხელს კი არ გასძრავს და. გაგონილა! მე რომ არ ვყოფილიყავ, ყანა მინდორში დაგვილპებოდა.
— ეგრე, შენი ჭირიმე, — გაუკეთებდა გულს და თავს უფრო მოაწონებდა დარეჯანი, — ეგრე უნდა. მას აქეთ, რაკი ევამ ადამი შეაცდინა, მას აქეთ ნაბძანებია ღვთისაგან, რომ ჩვენის ოფლით პური უნდა ვჭამოთ.
— ეგ თავადებზედ ხომ არ არის ნათქვამი, გლეხებზედ არის ნათქვამი, გლეხებზედ, — მიუგო ლუარსაბმა.
— მაშინ თავადები სად იქნებოდნენ?
— როგორ არა, იყვნენ: ჩვენი გვარი მაშინდელია.
— რას ამბობ? ისე ჰლაპარაკობ, ასე გგონია, არა იცოდე-რაო. მაშინ ადამის და ევას მეტი არავინა ყოფილა და ადამი თავის თავზედ თავადი ხომ არ იქნებოდა?
— მართლა, ეგ კი ვეღარ მოვიფიქრე. არა, გეთაყვანე, ის რა ხე იყო, იმათ რომ ხილი მოიპარეს?
— ხე ბოროტისა და კეთილისა.
— ეხლა აღარ არის იმისთანა ხე?
—როგორ არა: ამბობენ, რუსთ ხელმწიფის ბაღში ერთი ოქროს ოთახიაო, იმაში არის, სულ იაგუნდის ფოთლები ასხიაო.
— ზურმუხტისა იქნება, — გაუსწორა ლუარსაბმა.
— ჰო, მართლა, ზურმუხტისაა, ზურმუხტიც ხომ ფოთოლსავით მწვანეა: დიაღ, ზურმუხტისაა, სულ ალმასები და იაგუნდები ასხია ხილის მაგიერად.
— ნეტავი მაჭამა, აბა გემო იმაში იქნება.
— ძალიან კი მიგიშვებენ: ქვიშაზედ უმრავლესი ჯარი ახვევია თურმე.
— მაშ ხონთქარს როგორ მოუპარვინებია?
— აი როგორ: ერთი ფერია ყოფილა, ფერია არწივად გადაქცეულა, შეპარულა, მოუგლეჯია ერთი დიდი ალმასი, ჩაუყლაპავს და ისე გამოპარულა.
— წაუღია, წაუღია! რა ეშმაკი ყოფილა!
— მაშ, წაუღია. მერე დედოფალი შებძანებულა, უნახავს, რომ ერთი დიდი ალმასი აკლია, მაშინვე რუსთ ხელმწიფისთვის შეუტყობინებია. რუსთ ხელმწიფე მაშინვე მიმხვდარა, რომ ეს ხონთქრის საქმეა და ომი დაუწყია. ის ომი ხომ დღესაც არ გადაწყვეტილა.
— მაშ შერჩა, შერჩა?
— ვინ იცის? ჯერ ომი არ გათავებულა.
— ნეტავი მე მამეპარა.
— ხომ დაგარჩობდნენ.
— რომ არ შევატყობინებდი: ჩავყლაპავდი და მუცელს ხომ ვერ გამიჭრიდნენ.
— გაგიჭრიდნენ კი არა, მეტსაც გიზამდნენ.
— რა ეცოდინებოდათ, რომ მე მაქვს?
— შენი ჭირიმე, მკითხავს ვერ იშოვიდნენ, რომ ეკითხნათ.
— მართლა, ეგ აღარ მომაგონდა. დაიცა, რა გითხრა: ადამმა რომ შეჭამა, ის რაღა იქნა?
— კუნძულელ ხელმწიფეს ზღვაში ეპოვნა თურმე და იმასა აქვს.
— აბა, დახე ღვთის სამართალსა! მე მეპოვნა, უფრო მადლი არ იქნებოდა?
— მერე ვინ შეგარჩენდა? ორასი წელიწადია თურმე მაშრიყ-მაღრიბის ხელმწიფე სულ იმისათვის ებრძვის კუნძულელსა.
— აქამდინ ვერ წაართო?
— ვერა.
— პაი, პაი, პაი! ღონიერი არა ყოფილა ისიცა!..
— მე კი არ ვიცი, რომ ღონიერი ყოფილა!.. ხელმწიფე და უღონო გაგონილა!
— ერეკლე მეფე რომ ყოფილიყო ეხლა, ის კი უთუოდ წაართმევდა, დიდ ვაჟკაცს ამბობენ.
— ის, რასაკვირველია, წაართმევდა, მაგრამ სად არის?
— ცოდო არ არის, ის ეხლა მიწაში ლპებოდეს და შენი მაზლი დავით კი ცოცხალი იყოს!
— აბა, უყურე წუთის-სოფლის მუხანათობას! ეგ რა კიდევ, თამარ დედოფალი შავ მიწაში უნდა იყოს და შენი რძალი ელისაბედი კი მზეს უყურებდეს!
— აბა, წუთის-სოფლის ანგარიში ეგ არის და, — დაატანდა ლუარსაბი და ამოიოხრებდა, მერე ისე, რომ სანთელი წინ სდგომიყო, გააქრობდა.
დილით ლუარსაბი და მისი მეუღლე კნეინა დარეჯანი, რაკი მოიცლიდნენ იმ საუცხოვო ოჯახის მოვალეობისაგან — რომლის ნიმუშიც ზევით მოვიხსენიე, მიუჯდებოდნენ ჩაის და ერთი ლაზათიანად გაიბერებოდნენ თბილის წყლით, როგორც ამბობს ჩვენი გლეხკაცი. პატარა ხანს უკან, ორიოდ გონიერ ბაასის შემდეგ, თუნდ იმის მსგავსისა — როგორც ზემოხსენებულია, სადილობაც მოვიდოდა, ერთი მაშინ მიძღებოდნენ „ძველებურადა, ჩვენებურადა“, — და ლუარსაბი რაღაც დაღლილის სიამოვნებით წამოიძახებდა ხოლმე გულწრფელად: „გმადლობ შენ, უფალო, რათა განმაძღე მე“. ამას იტყოდა თუ არა და, გამოისახავდა პირჯვარსა, მსწრაფლ სუფრიდამ იქავ ტახტზედ გადაგორდებოდა და, სრულიად კმაყოფილი თავისის ცხოვრებისა, დაიკრავდა მუცელზედ ხელსა და იტყოდა რაღაც ტრაბახობითა: „მე თუ უსწავლელი ვარ, მე ვიცი... რა ჰქვიან... მე ვიცი, შიმშილით კუჭი მიდნება, დიაღ, მიდნება! ზედაც ემცნევა ჩემ სტომაქსა“. გამოსაცდელად ერთს კიდევ დაიკრავდა მუცელზედ ხელსა, თითქო სინჯავსო, კარგად არის გატენილი თუ არა, და რა ჰნახავდა, რომ კარგად არის, როგორც ცხენი დააკრაჭუნებდა კბილებს მეტის სიამოვნებისაგან: „დიაღ,— კიდევ იტყოდა, — ლუარსაბი უსწავლელი გახლავთ, იმიტომაც მშიერია“. სადილს შემდეგ ძილი, მერე ისევ გაღვიძება, მერე ისევ ჩაი, მერე ვახშამი, და ბოლოს ისევ ის სატრფიალო ძილი, — და ესრეთ ტკბილად და აუმღვრევლად მიდიოდა ამ ორთა უმანკო სულთა უბოროტო ცხოვრება ამ წუთის-სოფელში, რომელმაც ისე არაფერი არ იცოდა ამათის ვინაობისა, როგორც ამათ არა იცოდნენ-რა, ჭამა-სმის გარდა, ღვთისაგან განაჩენი ამ მუხანათის წუთის-სოფლისა.
IV
ამ ყოფაში და ჭკუის გონიერ ვარჯიშობაში გადიოდა დილა. როცა სადილს უკან ლაზათიანად გამოიძინებდნენ ცოლ-ქმარნი, როცა საღამოზედ ნიავი ფრთას გაშლიდა და ბაღჩის ღობის გრძლად გამოწოლილი ჩრდილი ეზოს მოადგებოდა, მაშინ კნეინა დარეჯანი ერთ ბალან-გაცვივნულ ხალიჩას ჩრდილში გააშლევინებდა და დაბრძანდებოდა ხოლმე თავმომწონე პატარძალივით თავდახურული, წარბებ-აჭიმული და გამოპრანჭული. ლუარსაბიც, თავის განუშორებელ ჩიბუხით ხელში, ჩამოვიდოდა — და ქოშებით შიშველ ფეხებზედ, ხშირად წითელ პერანგის ანაბარას და უფრო ხშირად ლურჯ კალმუხის დარბაისლურად ჩატეხილ ქუდით, ბოლთასა სცემდა გრილოშია.
საღამო ხანი — როგორც მოგეხსენებათ — ჩვენს სოფლებში და ნამეტნავად კახეთში სადარბაზო ხანია. რაც ეს რაღაც წყეული განათლება შემოვიდა ჩვენს ქვეყანაში, რასაკვირველია, — მეტად თუ ნაკლებ ეს საქებური ჩვენი ძველი ჩვეულებაც დაჩაგრა, ასე რომ ზოგიერთნი განათლებით გაჩარხულნი ეხლა ვიზიტობენ, თორემ უწინ კი საღამო ხანი დიდს პატივში იყო. ამიტომაც საღამოობით დარეჯანი ეგრე გამოიპრანჭებოდა ხოლმე და ასე იფიქრეთ — უკაცრავოდ კი არ ვიყო — საკურტუმესაც კი გაიკეთებდა. მაშინ, როდინდელ ამბავსაც მე ვწერ, ჯერ კრინოლინი არ იყო, — და თუნდ ყოფილიყო კიდენაც, იმ სოფლამდინ ვინ მიაღწევინებდა მაგ იუბკების მეუფესა. ყველამ კარგად იცის, რომ განათლება ფეხ-მძიმედ დადის, ნამეტნავად ჩვენში ასკინკილობს, და აბა იმ სოფელში ეგრე ჩქარა როგორ მიიტანდა სახელოვანს „ხაბარდასა“. სწორედ გითხრათ, ზოგიერთ სოფლის ორღობეებშიაც ვერ გაეტეოდა ეგ განათლებული კრინოლინი, თუნდ რომ მისულიყო კიდენაც.
— ქალბატონი ადღეგრძელა ღმერთმა, — უთხრა ერთხელ ერთმა ლამაზად მოყვანილმა გლეხის პატარძალმა, გრძელ კავების ქნევით და ცოტა ტუჩების პრანჭვითა.
— აი, ღმერთმა გაცოცხლოს, ჩემო ბაბალე!.. რასა იქ, ხომ კარგადა ხარ? — მოიკითხა თავის რიგზედ დარეჯანმა, მაგრამ ისე კი, რომ პატივი კნეინობისა სრულიად არ დაუმცირებია.
— რაღა რასა ვიქ, შენი კვნესამე! ჩვენებიანთ ვენახში ჩვენი კამეჩი შეპარულა, და მეველეებს დაუჭერიათ, ეხლა ორი დღეა ბაკში ჰყავთ დაჭერილი. ეხლა, შენი სახელის ჭირიმე, ამას გემუდარები, გვაპატივებინოთ, აგრემც ჩვენი ნათელ-მირონობა დღეგრძელობას მოგიმატებს, შენი კვნესამე!
— რა? მითამ გამოვაშვებინოთ?
— ჰო, შენმა მზემ, ეხლა ჩვენი ვედრება ეგ არის, ქალბატონო.
— როგორ იქნება, ჩემო ბაბალე? ეხლა, მართალია, შენ ჩემი ნათელ-მირონი ხარ, მაგრამ სოფელი აყაყანდება, ყველა მაგას მოჰყვება.
— აგრემც ღმერთი ბატონის თავს გიდღეგრძელებს, და მაშინ, როგორც გნებავთ, დამსაქმეთ. აი ეხლაც, შენი კვნესამე, ერთი გაბმა აბრეშუმი მოგართვი, ღმერთი და თქვენი წყალობა თუ კიდევ შეგვაძლებინებს — კიდევაც თქვენი ყურმოჭრილი ყმანი ვართ.
ბაბალემ ჯიბიდამ ამოიღო ერთი გაბმა აბრეშუმი და მიართო კნეინასა. კნეინამ გამოართო და ამოიდო ქვეშ, ზედაც დაატანა:
— ეგ რომ არა ყოფილიყო, განა ისე კი, რაც შემიძლიან, არ გაგირიგებდი! — ლუარსაბ! ლუარსაბ! — დაუძახა ქმარსა, რომელიც შორი-ახლო ბოლთასა სცემდა და ერთი-ორჯერ მსუნაგსავით მაცდურის თვალით გადმოჰხედა კიდეც მოხდენილ პატარძალსა.
ლუარსაბი მოვიდა.
— ქა! ბაბალეს კამეჩი მეველეებს დაუმწყვდევიათ და გემუდარება — გამოაშვებინო.
ლუარსაბმა შეხედა პატარძალსა, რომელმაც ჩვეულებისამებრ თავი იქით მიიბრუნა. ლუარსაბმა დააკრაჭუნა კიდეც თავისებურად კბილები სიამოვნების ნიშნად, მითამ-და სამაცდუროდ გაიღიმა.
— კამეჩიო!..
— ჰო, კამეჩი, — დაატანა დარეჯანმა, — აი ერთი გაბმა აბრეშუმიც მოგართვა.
— მაშ კარგი! დათო ბიჭო! დათო! — დაიყვირა ლუარსაბმა, — ჩადი და უზბაშს უთხარი, ჩემი ნათლიდედის კამეჩი ეხლავ გამოუშვას, თორემ იქაურობას სულ მტვერს ავადენ.
სთქვა, ერთი კიდევ მაცდურად დააკრაჭუნა კბილები, და გამარჯვებულსავით ამაყად წავიდა ისევ ბოლთის საცემლად.
— აი, აგრემც ღმერთი მაგაზედ უფრო მეტს დიდებას და პატივს მოგცემს, აგრემც გაგაპატიოსნოს ღმერთმა, და ერთი კაი ვაჟიშვილი მოგცეს და მე ძუძუ მაწოებინოს, შენი კვნესამე, შენი, ბატონო და ქალბატონო!
— ჰხედავ, — უთხრა დარეჯანმა, როცა ლუარსაბი წავიდა, — ჰხედავ, რა რისხვა შეუთვალა, იქაურობას სულ ააწიოკებს.
— დიდება აქვს, შენ გენაცვალე, და იმიტომ.
— ეგეც ხომ, მაგრამ ხმაც დიდი აქვს სოფელში გავარდნილი. აი, დავით, ჩემი მაზლი: იმას კაცად არავინ აგდებს.
— აბა, შენი კვნესამე, იმათ ფეხი სად მოუწვდებათ თქვენამდინ, ელისაბედიც მითამ თავადის-შვილის ცოლია და თქვენცა?
— ახლა იმასა ჰკითხე ზოგი, იმისთანა დიდი-კაცი აქ არავინ არის.
— უი, უწინამც დღე გაუქრება! გუშინ მეზობლიანთას გახლდი, იმათი გოგოც იქ მოვიდა. რაც იმან იმათზედ ილაპარაკა, ადამიანისაგან არ გაგონილა.
— რა, გეთაყვანე, რა! — ჰკითხა აჩქარებით და მოუთმენლად დარეჯანმა.
— რაღა რა? ისა, რომ საწყალ გოგოს თავისის თითებით მოგროვილის ფულით ერთი ჩითმერდინი უყიდნია, იმას უნახავს და წაურთმევია. ეხლა თურმე თავზედ იკრავს. გოგოს ცოდვით აღარა ვართ, ქალბატონის მზემა, ისე გულანატირად ჰლაპარაკობდა ბედშავი. მე ხომ თქვენის ფეხის ნატერფალიც არა ვარ, მაგრამ მაგას მეც ვითაკილებდი, მამა მიცხონდა!
— უი! უი! დახე იმას, იმ წყეულს! ამას იქით როგორღა ამბობს, რომ თავადის-შვილის ცოლი ვარო. წართმევა არაფერი, ეგ, რასაკვირველია, ქალბატონის ნებაა: გოგოც ჩემია და ჩითმერდინიც; მაგრამ გოგოს ჩითმერდინის თავზედ შემოკვრა კი სწორედ თავლაფის დასხმაა. კუმ ფეხი გამოჰყო, მეც ნახირ-ნახირო. აი, მეხი კი დაეცა. ისიც, ამას იქით, ჩვენში ერევა, თავადის-შვილის ცოლი ვარო! სხვა არა უთქვამს-რა გოგოსა?
— სხვა არა მოუხსენებია-რა.
— ნუ დამიმალავ, ჩემო ბაბალე! ხომ იცი მე შენი მწყალობელი ვარ, თუ უთქვამს კიდევ რამე — მითხარი.
— არაფერი არ უთქვამს, მამი-ჩემის ცხონებამ, თორემ, რომ ეთქვა, რად დაგიმალავთ.
— რა ვიცი? იქნება გეშინოდეს-მეთქი.
— თქვენისთანა მწყალობელი რომ კაცს სადმე ეგულებოდეს, იქ ვიღასი უნდა ეშინოდეს.
— მეც ეგ უნდა მეთქვა, ჩემო ბაბალე!
— მართალია, გლეხები გახლავართ, მაგრამ ჩვენც გვესმის ეგენი. ვისი უნდა მეშინოდეს, თქვენ აქა მყევხართ!
— მაშ სხვა არა უთქვამს-რა?
— არა უთქვამს-რა, აგრემც ჩემზედ მიწა ნუ გენახოთ.
— იტყოდა.
— ის ერთი დედის-ერთა შვილი არ დამიმიწდეს, არა უთქვამს-რა.
— მართლა, შენი შვილი რასა იქს? — ჰკითხა მერე დარეჯანმა, რომ ვერა გახდა-რა.
— რაღა როგორ არის, შენი კვნესამე, ქალბატონო! ავად შენი მტერი გვყვანდეს, ავად მე ისა მყავს. რა არ ვუყავი: ბალახებში არ ვაბანე, არ შევალოცვინე, შანები არ შევაბი, მაგრამ ვერაფერმა ვერ უშველა, აგრემც არა ეშველოს-რა შენს მტერსა! თქვენთანაც კი მომასწავლეს, ვითამც თქვენ უებარი ლოცვა იცოდეთ, — მიშველეთ რამე, აგრემც მაგიერს ღმერთი გადაგიხდით.
— მე მარტო შაკიკის ლოცვა ვიცი და დასუნთქვილისა. განა შენი შვილის სენი — შაკიკია?
— ჰო, თქვენმა მზემ, შაკიკი გახლავთ. ლამის თავი გაუხეთქოს.
— გოგო, ლამაზისეულო! — დაიყვირა კნეინამ, — წადი, საწერკალამი და ქაღალდი, ქეჩის ქვეშ რომ ნაბარათევია, ჩამომიტანე. მე დაგიწერ ლოცვას, ჩემო ბაბალევ, დაწერილი ქაღალდი იმ მხარეს დააკარ, რომელიცა სტკივა, ეგრე იყოს ორი-სამი დღე, თუ შაკიკია — გააქარწყლებს მაშინვე.
ვერ უყურებთ, მკითხველო! კნეინა დარეჯანი მე უსწავლელი მეგონა და დახეთ, რაები სცოდნია? ეხლა მომაგონდა, რომ იმისი განაყოფი რძალი ელისაბედი, რომელიც ორგანაც მოვიხსენიეთ, თურმე ჩუმად ქვეყანაში ჰლაპარაკობდა, რომ ვითომც დარეჯანმა ჯადოობაც იცისო, ვითომც სოლომონ ბრძნის წიგნიც წაეკითხოს და ამიტომაც ღმერთი უწყრება და შვილს არ აძლევსო. ამისთანა ცილისწამებას როგორ დავიჯერებ? მაგრამ ელისაბედი კი ფიცით იჭაჭებოდა, რომ ეგ ეგრეაო. მაინც არ დავიჯერებ; რძალი — როგორც მოგეხსენებათ ჩვენის კურთხეულის ცხოვრების ამბავი — რძლის მტერია. განა ამისთანა ჭორები მოუგონია ელისაბედს დარეჯანზედა?
ამ დროს ძაღლმა, რომელიც შორი-ახლო იწვა და წაეყო ცხვირი მიწაშია, დაიყეფა, მაგრამ, რაკი თვალი გაახილა და დაინახა ორი მომავალი დედაკაცი, ისევ ხმა გაიკმინდა და ღრენით გაჯავრებულსავით ისევ ცხვირი ფეხებით ამოთხრილ მიწაში ჩაჰყო. დარეჯანმაც მოიხედა ამ ხმაურობაზედ და დაინახა კნეინა ელისაბედი და იმის ჩითმერდინით დარბეული, გულდაჩაგრული გოგო.
დარეჯანი ფეხზედ წამოდგა.
— მობძანდით, ჩემო რძალო! — მიაგება სიტყვა ელისაბედსა, — ძლივს არ მოგვიგონეთ!
— შენმა სიცოცხლემ, მოცლა არა მაქვს. ეს ისაო, ეს ესაო, სახლია, კარია, ხომ მოგეხსენებათ.
— აქეთ მობძანდით, აქეთ უფრო ნიავია, — მოიპატიჟა დარეჯანმა.
— სულ ერთია, — სთქვა ელისაბედმა და წაიძრო ფეხიდამ კროული ჩუსტები, გადმოვიდა ხალიჩაზედ და ჩაჯდა დარეჯანის გვერდით.
— სხვა, როგორა ბძანდებით, ჩემო რძალო? ჩემი მაზლი დავითი ხომ კარგად სუფევს, — დაიწყო ისევ დარეჯანმა.
— კარგად გახლავთ, — მიუგო ელისაბედმა.
— შინა ბძანდება?
— აბა ამისთანა დროს კაცი შინ დადგება, მამულის და მოსავლის პატრონი? — ყანაშია, ეს ორი დღეც იქნება, — სთქვა რაღაც ნიშნის მოგებით ელისაბედმა და უნებლიეთ შეჰხედა ლუარსაბსა, რომელიც ბოლთასა სცემდა და რომელსაც ფეხებზედ ეკიდა მოსავალიც და მამულიცა.
დარეჯანს ეწყინა. ამას ეგონა, რომ ელისაბედმა სახრე ლუარსაბისაკენ გადმოიქნივა.
— რასაკვირველია, ვისაც კაცი არა ჰყავს და არ აბადია, — რომ ჩააბაროს სახლის პატრონობა, და ვინც ასე გაზრდილა პატარაობითვე — რომ არც მზე დასიცხავს და არც ავნებს, ის შინ არ დადგება, ჩემი ლუარსაბი მაგას ვერა იქს.
— განა მაგაზედ მოგახსენე! — დაასწრო ელისაბედმა.
— მეც განა მაგაზედ მოგახსენე! — დაატანა დარეჯანმა, — მე მარტო ეს უნდა მეთქო, რომ ჩემს ლუარსაბს ჯერ ისე არა გასჭირებია-რა, რომ გლეხობა ჩაიდინოს.
— გლეხობა ჩაიდინოსო!.. რას ბძანებთ, ჩემო რძალო? არა, თქვენმა მზემ! ვინც მოსავლის დროს შინ არა დგება, განა იმისაგან, რომ გაჭირებულია, ან გლეხობა ჩაიდინოს და მესვეურსავით მკაში ბეგრის ხალხთან ოფლი იწუროს? თქვენც არ მამიკვდეთ. აი, თუნდ თქვენი მაზლი, — განა გლეხია, ან გლეხობას იდენს, რომ ყანაშია? სულაც არა, თქვენმა მზემ! მუშები იქა მკიან და იმას კი, როგორც შეჰფერის თავადიშვილის პატიოსნებასა, ხელზედ ლამაზი ნაგეში მიმინო უზის და ნადირობს. გუშინ საღამოზედაც, ჯერისთვის რომ ბიჭი ამოვიდა, ერთი აბგა მწყერი გამოეგზავნა. რა სათაკილოა, თქვენი ჭირიმე, მეფეები ნადირობენ და იმისთვის რა სათაკილოა!..
— არა, თქვენმა მზემ, ჩემო რძალო, მე ჩემს მაზლზედ არ მომიხსენებია. ისიც ლუარსაბის ძმა არ არის, ერთის სისხლისა და ხორცისა? განა არ ვიცი, რომ სხვებსავით ხელებს არ დაიბებრებს ნამგლის ჭერითა და არც ამ პაპანაქებაში დაისიცხება? განა არ ვიცი, ნამდვილის სისხლის თავადიშვილი ამას ვერ აიტანს, — და, სწორედაც მოგახსენო, არც საკადრისია: თავადს — თავადობა უნდა ეტყობოდეს და გლეხს — გლეხობა.
— მართალი ბძანებაა, თქვენმა მზემ!
— არა და, რომ არ იქნება: მთა და ბარი ვის გაუსწორებია?
— არავის, თქვენმა მზემ, ღვთის ბძანებას ვინ წაუვა?
ამ დროს ფეხის ხმაურობაც მოესმა დარეჯანსა, მოიხედა და დაინახა თავისი გოგო, ლამაზისეული, რომელსაც ხელში ეჭირა რაღაც ნაბარათევი და თავმოტეხილი წამლის მინა, რომელიც საწერელობას ჰთამაშობდა.
— რა დაგემართა აქამდინ? ის კიდეც წავიდა, — უბძანა დარეჯანმა.
— ჯერ კიდევ აქ გახლავთ, ჩალურშია თაფლუასთან, — მიუგო გოგომა.
— აშ კარგი, — სთქვა დარეჯანმა, დაიდო მუხლებზედ ქაღალდი და დაიწყო შაკიკის ლოცვის წერა. ამ დროს ლუარსაბიც მოვიდა ახალუხ და შალვარ-ჩაცმული, მოიკითხა ზდილობიანად თავისი რძალი და გაგორდა იქავ ხალიჩის ახლო მწვანე ბალახზედ და, დაასვენა რა ჩიბუხის ტარი თავის ღირსეულს მუცელზედა, — დაუწყო პირაღმა ყურება გუმბათიან ცასა.
მშვენიერს სურათს წარმოადგენდა ეს კრება. აღვწერ, თუ კი შევიძელ ჯერ გოგოდამ დავიწყოთ.
სასაცილო რამ იყო ეს ლამაზისეული: ერთი რაღაც უშნოდ ჩასუქებული, ჯმუხი, ჭუჭყიანი, ტანზედ ეცვა ხამის ჩითის კაბა, ჭუჭყისაგან ვერ გაირჩეოდა — რა ფერისა იყო; კალთები აქა-იქ გამომწვარი ჰქონდა ზამთარში ცეცხლთან ახლო გდებისაგან, ბოლოები სულ მომპალი და შემოფხრეწილი ჰქონდა; დახეულებიდამ გამოჩანდა ერთი რაღაც დამპალის საბნის ნაგლეჯი, კაბის ქვეშა გარშემო ჩამოკიდებული, მითომ და იუბკაა. აი, მეხი კი დაგეცა! ამასაც კი სდომებია იუბკა! თავზედ ეკრა შიგა-და-შიგ ამოფლეთილი ჩითმერდინი, ქალბატონის გამონაცვალი. იმ ამოფლეთილებში მუთაქის მატყლსავით დასორსვლილი შავი — უკაცრავოდ არ ვიყო — წილიანი და დაუვარცხნელი თმა მუჭა-მუჭად ამოშვეროდა. ქუსლებ-დახეთქილი, მუგუზალსავით შავი ფეხები, წენგოსაგან შეღებილი ხელები, ცხვირ-პირი ქვაბების მურით მოთხუპნული — აი, ამ-გვარი იყო ის ცხოველი, რომელსაც დარეჯანი „ლამაზისეულს“ ეძახდა და რომელიც გულ-ხელ-დაკრებილი დაჰყურებდა ბალან-გაცვივნულ ხალიჩასა. ხალიჩაზედ ორი პატიოსანი და დარბაისელი კნეინა იჯდა, როგორც მოგახსენეთ წინათვე, — ორი კნეინა, მაგრამ კი სხვა-და-სხვანაირი: ერთი მსუქანი, წითური, მეორე გამხდარი და უფერო. მსუქანი თავჩაღუნული სწერს, გამხდარი კი თვალ-გაფაციცებით თვალს ადევნებს მწერალის ხელსა, იქნება როგორმე შევატყო, რასა სწერსო: ხანდისხან გოგოსაც თვალს უშვრება და თავს უქნევს იმის ნიშნად, რომ „წეღან რომ სთქვა — „წავიდაო“, ვიზედა სთქვაო“. გოგოც იქიდამ ანიშნებს და ელისაბედი ვერ მიმხვდარა. მაშიბ გოგო პირზედ ხელს იფარებს, თავს იქით იბრუნებს, მითამ ეცინება კიდეც — რომ ელისაბედი ჰცდილობს და ვერ მიმხვდარა კი, და ჰმორცხობს კიდეც — რომ ბატონის რძალთან სიცილსა ჰბედავს. აქეთ ბალახებზედ ხალისიანად ჰქშენს ჩვენი ლუარსაბი, პირაღმა წევს, აბოლებს ჩიბუხს და, მინამ თვალში ცრემლი არ მოუვა, თვალს გულმოდგინებით ჩიბუხის ბოლს ადევნებს, — ვნახო, ღრუბლებამდინ ავა, თუ არაო. იქით, ხალიჩის დასწვრივ, ღობის გადმოღმა, ჩვენი ნაცნობი ქოფაკი ძაღლი წევს, ისევ-ისე მიწაში ცხვირწაყოფილი და ქანცმიწყვეტილსავით თვალებ-დახუჭვილი; ყოველს ხმაურობაზედ მძიმედ ახილებს თვალსა და გულზედ-მოსულსავით ჰღრინავს, თითქო ჯავრობსო — რომ ძილს უფრთხობენ. პატარა შორი-ახლო ძველი, ჭუჭყიანი სამოვარი სდგას, გვერდით დაჩოქილია გოგოზედ უარესად ჭუჭყიანი, დაგლეჯილი პატარა ბიჭი და, რაც ძალი და ღონე აქვს, უბერავს სამოვარსა. ხანდისხან ისეთის სახით გადააპარებს თვალსა იქითკენ, საცა ძაღლი განცხრომითა წევს და მოსვენებაშია, რომ თითქო შეჰნატრისო მის ყოფა-ცხოვრებასა და გულში ამბობსო: ნეტავი შენ, რომ ძაღლი ხარ! ნეტავი მეც ძაღლი ვყოფილიყავი!
ეს საძაგელი სურათი საძაგელის მიწისა, სასაცილოდ ახამებდა ამ დიდებულ სამხრეთის ცასა, მის ერთნაირად ღრმასა და ციაგსა კამარასა, რომელზედაც სარტყელსავით მიიგრიხებოდა ერთ გაუწყვეტელ ზოლად მთების ლაჟვარდი გრეხილი.
დრო გავიდა. დარეჯანმა გაათავა ლოცვის წერა და ბარათი მისცა გოგოს, ამ სიტყვის ზედ-დატანებით: როგორც გითხარი, ისე მოიქეცი-თქო.
მერე მოუბრუნდა ელისაბედს და შესაქცევრად ჩამოუგდო ლაპარაკი. ლუარსაბი ისევ ოცნებაში იყო და აბოლებდა ჩიბუხსა.
— პურის მოსავალი როგორი გაქვთ წელს? — ჰკითხა დარეჯანმა.
— თქვენმა მზემ, შარშანდელზედ ცოტა. თქვენს მაზლს ოც-და-ათის ურმის იმედი აქვს, — დაიტრაბახა ელისაბედმა.
— ეგ, ბატონო, კაი მოსავალია. ოც-და-ათი ურემი ხუმრობა არ არის; ჩვენც მოგვივა მაგდენი, მაგრამ ჩვენ ერთი ორად მეტი ნახნავი გვქონდა თქვენზედა, — იტყუვა თავის რიგზედ დარეჯანმაც.
— რას ბძანებთ, ჩემო რძალო, ჩვენზედ მეტი თქვენ რად გექნებოდათ. ჩვენ დიდი ნახნავები გვქონდა წელსა.
— რად გექნებოდათო? ჩვენ მკათათვის ნახევარში გუთანი გატანილი გვქონდა, თქვენ კი ენკენისთვეშიაც არ გაგეტანათ.
— არა, თქვენმა მზემ, ჩვენ თქვენზედ ადრე გავიტანეთ. ჩვენ დიდი ნახნავები გვქონდა.
— აი, ბატონო, თუნდ ლუარსაბსა ვკითხოთ. ეგ კაცია, მაგას უფრო ეცოდინება. ლუარსაბ! — დაუძახა ქმარს კნეინამა.
— რაო? — ჰკითხა ლუარსაბმა და მოიღრიჯა ცოლისაკენ კისერი.
— შენი რძალი ამბობს, რომ ჩვენ ამათზედ ნაკლები ნახნავები გვქონდაო წელსა.
— ეჰ, რას ამბობ, ჩემო რძალო! წელს ოთხი თქვენოდენა ნახნავები მქონდა, — მიუგო ლუარსაბმა. ამ-გვარებში ლუარსაბმა საშინელი კვეხნა იცოდა. — რას ბძანებთ!.. ჩემოდენა მოსავალი კახეთში ორს არ მოუვა, ქართლშიაც ბევრს არ მოუვა. აი, ჰნახავ, რამოდენა ფრთა-მოქცეულს წამოვაყენებ კალოზედა. ასეთს წამოვაყენებ რომ... რომ... აბა რა გითხრათ? თუნდ თორმეტ ამ სახლის ოდენასა, ვაი არა აქვს ლუარსაბსა! ფიე! ნახნავი იყო, რომ ჩემი იყო. შარშან ვენახისა არ იყოს, ჩემოდენა ღვინო კახეთში ორს არ მოუვა. ქართლში ხომ ნახევრის ნახევარიც არ მოუვათ. მაშ! თუ ეს მართალი არ იყოს, საიდამ ვცხოვრობ ეგრე მეფურად? საიდამ? ლევანსავით ურმებს ხომ ქირაზედ არა ვგზავნი, თავადიშვილის სისხლს ხომ არ შევირცხვენ! სომეხი ხომ არა ვარ, რომ ქირაობით ვიცხოვრო. თავადიშვილი ვარ, კაი ოჯახის და გვარის შვილი.
კიდევ რაღაცა უნდა ეთქვა, მაგრამ ელისაბედმა აღარ დააცალა:
— მართლა, ჩემო მაზლო, ლევანი ქირაზედ ურმებს ატარებს?
— მართლა, მაშ! ის შერცხვენილი, გვარის დამამცირებელი ისა!
— ნიკოლოზიც ატარებს თურმე, — დაუმატა დარეჯანმა.
— მაშ?! — უპასუხა ლუარსაბმა.
— უი, ლაფი დაესხათ თავზედ. კარგი გვარის მასახელებელი ისინი ყოფილან, — სთქვა ელისაბედმა.
— ნეტავი თავადიშვილი მაინც არ იყოს! — დაუმატა გულმტკივნეულად დარეჯანმა.
— ეგ არის და, რომ თავადიშვილია! — სთქვა წყრომით ლუარსაბმა. — თავადიშვილი რომ არ იყოს, ჯანი გავარდეს. ან გლეხი იყოს, ან სომეხი, კიდევ ჰო, — ეგა მკლავს, რომ თავადიშვილია. ძალიან არ წახდა ხალხი, თქვენი ჭირიმეთ! ამასაც შევესწარი, რომ თავადიშვილი ქირაზედ ურმებს ატარებს!
— ერე რა დედ-მამის შვილი — წამოიძახა დარეჯანმა.
— ეგა სთქვი და, — მიუგო ლუარსაბმა.
— კაცმა ეგრე როგორ უნდა დაკარგოს პატივი, — სთქვა თავის რიგზედ ელისაბედმა.
— ამას იქით გლეხი და თავადი რით უნდა გაირჩიოს. გლეხიცა გზავნის ურმებს ქირაზედ და თავადიშვილიცა, ისიც ქირითა სცხოვრობს და ესეცა. რით უნდა გაირჩიოს? — იკითსა ლუარსაბმა.
— არაფრით, თქვენმა მზემ, — დაარწმუნა რძალმა.
— ოღონდაც, რომ არაფრით, — კვერი დაჰკრა ცოლმაც.
— მშიერი რომ ვკვდებოდე, მშიერი, და ასი ურემი მებმებოდეს, მე მაგას არ ვიკადრებდი, თავი არ მომიკვდება. შენა, ჩემო რძალო?
— უი, უწინამც დღე გამქრობია. ვიკადრებდი კი არა, მე ჩემის ხელით თავს მოვიკლავდი. ოხრად დამრჩეს ქირით შემოტანილი ქონება. რა თავადიშვილის საქმეა.
— შენა, დარეჯან? — ჰკითხა ეხლა თავის ცოლს ცნობისმოყვარე თავადმა.
— არც მე, — სთქვა დარეჯანმა.
— მაშ არც მე, — სთქვა ლუარსაბმა იმ სახით, თითქო ამ სამის აზრით სამის ქვეყნის ბედი გადაწყდაო. — არა, დრო ძალიან გამოიცვალა, ჩემო რძალო! — გააგრძელა სიტყვა ლუარსაბმა, — ხალხი წახდა, სისხლი მოითხარა. აბა ჩვენ დროს ვინ მოიფიქრებდა, რომ თავადიშვილს თავი შეერცხვინა და ურემი ქირაზედ ეტარებინა. ქვით არ ჩავაქვავებდით? თავზედ ლაფს არ დავასხამდით? მაგრამ ეხლა? — დასწყევლოთ ღმერთმა — სირაჯობენ კიდეცა!.. გაგონილა? თავადიშვილების სირაჯობა! ოჰ, ღმერთო, რატომ წარღვნა არ მოვა? სომხები გახდნენ, სწორედ სომხები: ეხლა ისღა აკლიათ, ადლი ამოიჩარონ იღლიაში, სოფელ-სოფელ იარონ და „სავაჭრო, სავაჭრო“ იძახონ.
— მაგასაც იქმონენ, თქვენმა მზემ, — სთქვა ელისაბედმა, — მე კი ღმერთმა ნუ შემასწროს იმ დროსა და!
— იქმონენ, თავი არ მამიკვდება, იქმონენ, — წარმოსთქვა მწუხარებით ლუარსაბმა, — ბატონო! სისხლი რომ აღარ არის? წახდა სისხლი, მოითხარა.
— მართლა რომ წახდა, — დაატანა დარეჯანმა.
— ი, მაგალითად, გუშინ ზაქარიას ცოლს რა უქნია? — წამოიძახა ენაჭარტალა ელისაბედმა, — იცით რა უქნია? — ბიჭს გაუჯავრებია... ზაქარიას ცოლი ხომ ანჩხლია?
— მერე რა-რიგი! საშინელი! — დაჰკრა კვერი დარეჯანმა.
— ბიჭს გაუჯავრებია, — დაიწყო ისევ ელისაბედმა, — გამოსდგომია, წაუძვრია ფეხიდამ — ჩუსტი ყოფილა თუ ქოში — ქოში იქნებოდა — ამდენი უცემია, რომ დაუოსებია თურმე.
— არა, თუ ღმერთი გწამს? — ჰკითხა გაკვირვებულმა ლუარსაბმა.
— თქვენმა სიცოცხლემ!
— ეს რა მესმის, თქვენი ჭირიმეთ! იქნება პატარა ბიჭსა სცემა?
— კიდეც ეგ არის, რომ არა. პატარა ბიჭს რომ სცემოს, ეგ არაფერი: აი, მეცა ვსცემ ხოლმე, — სთქვა ელისაბედმა.
— მეცა, თქვენმა მზემ, — უპასუხა დარეჯანმა, — პატარა ბიჭი და გოგო სულ ერთია. როგორც ქალბატონმა რომ გოგოსა სცემოს, არ დაიძრახება, ისე პატარა ბიჭს რომ სცემოს, არაფერია.
— რასაკვირველია, — ჩამოართო სიტყვა ელისაბედმა, — პატარა ბიჭის ცემაზედ ვინ დაიძრახება. ის კი ვაჟკაცი კაცი გხლებიათ, აბა ქალი რომ ვაჟკაცს შეებას, — ვერაფერია, თქვენმა მზემ.
— დიდება შენდა, ღმერთო ჩემო, — სთქვა პირჯვრის-წერით ლუარსაბმა, — ეს რა მესმის, თქვენი ჭირიმეთ: დედაკაცმა ისე თავზედ ხელი უნდა აიღოს, რომ ვაჟკაცსა სცემოს? ცემა არაფერია, მაგაში ბატონს ვინ დასძრახავს, — იმისი ბატონი არა ვარ, რომ მინდა ვცემ, მინდა არა, — მაგრამ კაცმა კაცს უნდა სცემოს, დედაკაცისაგან რომ არა თქმულა! რომ არ გაგონილა! აი, გოგო ჰყავს, გოგოს რამდენიც უნდა სცემოს, ეგ საკადრისია, კაცს კი... ღმერთო დამიხსენ ქვეყნის ცოდვისაგან.
— ეგ რა კიდევ... — უნდა დაეწყო კიდევ ელისაბედს ჭორიკანაობა, მაგრამ ამ დროს ჩაიც მოართვეს.
— სიტყვა კი არ დაივიწყოთ, ჩემო რძალო, — უთხრა დარეჯანმა, — ჩაი მიირთვით.
— მიირთვით, სულ ერთია, — უპასუხა ელისაბედმა და წამოავლო ჭიქას ხელი.
ჩაი ჩამორიგდა.
ელისაბედმა მოსვა ცოტა თუ არა, ისევ დაიწყო გაწყვეტილი სიტყვა:
— იმას მოგახსენებდით: იმ წუწკს ნიკოლოზს, იცით, რა უქნია? თავის მოახლისათვის არშიყობა დაუწყია. ერთხელ ბინდი ყოფილა, — აქ რაღაც წასჩურჩულა დარეჯანს ყურში, — ბიჭებს დაუნახავთ, ქალბატონისთვის შეუტყობინებიათ, ის საწყალი ქალიც მისულა და გულს შემოჰყრია. აი, ბატონო!..
— მართლა?
— თქვენზედ მიწა არ მენახოს! — მოაჭორა ელისაბედმა და, მითამ ნიკოლოზის ცოლზედ გულიც შესტკივა, დაუმატა: — მე ის საწყალი ქალი მეცოდება, თორემ ნიკოლოზს თუნდა თავშიაც ქვა უხლია.
— საშინელ დროებას არ შევესწარით, თქვენი ჭირიმეთ! — მართალის გულით სთქვა ლუარსაბმა, — სწორედ მეორედ მოსვლა მოახლოვდა: ვაჟო, ქალს — ქალობა აღარ ეტყობა, კაცს — აცობა. ტყუილად კი არ მოგვეჩვენებიან ეს კუდიანი ვარსკვლავები, ერთი ღვთის რისხვა რამ უნდა მოვიდეს. რომ არ გაგონილა ყურით და ენით არა თქმულა ქალისაგან ვაჟკაცის გალახვა და ქმრისაგან ეგრე აშკარად მაგისთანა ამბები! სირცხვილი აღარ არის ეხლანდელ დროში. პირში წყალი გაგვშრობია.
— რა, ისე ჩუმად მოეხდინა მაინც იმ სულის მტერსა, კიდევ არაფერი იქნებოდა, — სთქვა დარეჯანმა.
— ჩუმად რომ მოეხდინა, ვინ რას იტყოდა? — გააწყვეტინა სიტყვა ლუარსაბმა. — განა უწინ კი არ იყო მაგისთანა ამბები, ხორციელები არ იყვნენ თუ? მაგრამ უწინ სულ დაფარული იყო, ისე დაიჭერდნენ საქმეს — რომ ხორციელ ადამიანს არ გააგებინებდნენ, — ბევრი მაგისთანაები მომხდარა უწინაც, მაგრამ აბა ერთი შეგიტყვიათ რამე? სულ ისე ჩუმად და გონიერად იცოდნენ უწინ ყველაფერი, ამიტომ რომ პირში წყალი ჰქონდათ. ეხლა, ბატონო, არაფრისა აღარ ჰრცხვენიანთ. ნამუსი აღარ არის, არა, წახდა ქვეყანა.
— სწორედ მეორედ-მოსვლის ნიშნებია, — დაუმატა დარეჯანმა.
— სწორედ. აი, ერთი კიდევ რა შევიტყე. გოგო და ბიჭი დაითხოვეთ, მოგახსენებთ, — სთქვა ელისაბედმა.
გოგო და ბიჭი დაითხოვეს. ელისაბედმა შემოავლო თვალი გარეშემოსა და ჰნახა რომ არავინ არ არის, მიჯდა ახლო. ლუარსაბმა ყურები დააცქვიტა და ახლო მოიწივა. დარეჯანმაც ყურთან ლეჩაქი გადაკეცა, რომ კარგად გაიგოს.
ელისაბედმა დაბალ ხმით დაიწყო:
— ამ წინაზედ რომ კუდიანი ვარსკვლავი ამოვიდა, ხომ გახსოვთ?
— დიაღ, — მიუგეს ერთ-ხმით ცოლ-ქმარმა.
— იმ დღეს თურმე გველეშაპი გამოსდგომოდა მზესა, — ისიც ხომ გაიგეთ?
— დიაღ, დიაღ, გავიგეთ! — წამოიძახეს ერთად შეშინებულმა ცოლმა და ქმარმა.
— იმ კუდიან ვარსკვლავზედ და გველეშაპზედ სომხების ტერტერებს თავიანთი კარაბადინი გაუშლიათ და უთქვამთ, რომ — აქ უფრო ხმა დაიდაბლა — თავადიშვილებს ყმები ჩამოერთმევათო.
— ვაი შენს ლუარსაბსა! — წამოიძახა ფერწასულმა ლუარსაბმა. — ეგ რა სთქვი, რა? აკი მოგახსენეთ, ბატონებო, რომ წარღვნა უნდა მოვიდეს-მეთქი. აი, ღვთის წყრომა! სულ ჩვენისავე ცოდვებისაგან მოგვევლინა. მამა-ჩემი ზაალ ნუ წამიწყდება, რომ წავალ, ზაქარიას ცოლსაც, ლევანსაც, ნიკოლოზსაც წიხლ-ქვეშ გავიგდებ, რომ ეს ამბავი სულ იმათი უნარია. კიდევ ატარონ ქირაზედ ურმები!
— რაზედ გაცხარდი, შენ გეთაყვანე! — მიატანა ლუარსაბსა ცოლმა, — სომხების კარაბადინს როგორ უჯერებ! შარშანწინ კი არა სთქვეს, რომ დედამიწა ხარის რქაზედა სდგას. იმ ხარს ერთი რქა მოსტეხია და ქვეყანა უნდა გადაბრუნდესო, მაგრამ ტყუილი კი გამოდგა. გარეჯელ მკითხავს ეთქო, რომ არც რქა მოსტეხია და არც არაფერიო.
— მართლა, ეგ კი აღარ მომაგონდა — სთქვა ეხლა კი დამშვიდებულმა ლუარსაბმა, — ჭორი იქნება. აბა, გეთაყვა, მეფის ერეკლეს ნაბოძებს სომხის კარაბადინის სიტყვით ვინ წამართმევს? თუნდ ეგ არ იყოს, რიღას თავადიშვილი ვიქნებით, თუ ყმაც არ გვეყოლება: კარაბადინი კი არა, სოლომონ ბრძნის წიგნიც რომ იყოს, არ დავიჯერებ. ან რა დასაჯერია?
— რასაკვირველია, დასაჯერი არ არის, მაგრამ გლეხობაში ეგ ხმა გავარდნილა, — ეგ ცუდია, თქვენმა მზემ, — სთქვა ელისაბედმა.
— ხმა გავარდნილა, მე ვიცი, თათქარიძობას წამართმევენ! შარშან კი არ იძახდნენ, რომ საიქიოს ბატონები ყმებად შეიცვლებიანო, ყმები ბატონებადაო, — ვენაცვალე ღვთის მადლს, იქაც ისე არიანო ბატონი ბატონადა, ყმა ყმადაო, როგორც აქა. ინგლისის ხელმწიფეს ბარათი ჩამოუგდიაო ფრანგის ხელმწიფისათვის, რომ „ნუ გეშინიანო, მეცა და ჩემ დიდკაცებსაცაო აქ უფრო დიდი პატივი გვაქვსო, მინამ მანდაო. ნუ დაიჯერებო, რასაც მანდ ყბედობენო“.
— რასაკვირველია, ეგ აგრე იქნება: ბატობ-ყმობა ღმერთს დაუწესებია და თითონვე ღმერთი რად მოშლის? ვენაცვალე ღვთის დიდებასა! — სთქვა დარეჯანმაცა.
— უფლისა უფალსა და კეისრისა კეისარსაო, სახარებაში სწერია: კეისრები ჩვენა ვართ, — დაუმატა ელისაბედმა.
— მართალი ბძანებაა, ჩემო რძალო! სახარების სიტყვას ვინ წაუვა? — მიატანა დარეჯანმა.
— არავინ, თქვენმა სიცოცხლემ! — დაამტკიცა ელისაბედმა და წამოდგა შინ წასასვლელად, — მშვიდობით ბძანდებოდეთ!
— მშვიდობით, ჩემო რძალო! ბიჭებში კი ხმა გააგდეთ, რომ ტყუილია-თქო, — ურჩია ლუარსაბმა.
— თქვენც რომ ეგრე ჰქმნათ, ცუდი არ იქნება: გლეხები არიან, მალე დაიჯერებენ ტყუილსაც და მართალსაც. მშვიდობით, — გამოესალმა და წავიდა ელისაბედი. თან აედევნა დაჩაგრული გოგო.
— ღმერთო, რა მეჭორეა!.. რა ენაჭარტალაა!.. — უთხრა ქმარს ელისაბედზე დარეჯანმა.
— ის რა მოიგონა, თქვენი ჭირიმეთ, ყმები უნდა ჩამოგვერთოსო! — დაჰკრა კვერი ლუარსაბმა.
— შენ ხომ მაშინვე დაიჯერე!
— კარაბადინმა სთქვაო, მოდი და ნუ დაიჯერებ. ის კი, ღვთის წინაშე, არ მომაგონდა, რომ გარეჯელ მკითხავს ბევრჯერ გაუცრუებია სომხური კარაბადინი.
— გონება სადა გქონდა?
— ეჰ, შე დალოცვილო! აქა მქონდა, მაგრამ ვერ მომაგონდა. სულ რომ მაგონდებოდეს, რაც გამიგია, მეტი რაღა მინდა: სოლომონ ბრძენი ვიქნებოდი. თუნდ ეგ არ იყოს, ქვეყანაზედ რა ვიცი რამდენი ეშმაკის მანქანებაა, ეგეც იქნება ერთი იმათგანი იყოს. ვეჟო, ცოდვილ ქვეყანაზედ რა არ მომხდარა ჩვენის ცოდვებისაგან? ეგეც შეიძლება, რომ მოჰხდეს, მაგრამ სიფრთხილეს თავი არ ასტკივდებაო, ნათქვამია; ხმა გავაგდოთ, რომ ტყუილია.
— რასაკვირველია, ცუდი არ იქნება, ჩვენ მაგითი რა დაგვაკლდება?
— არაფერი, შენმა მზემ, — ეხლავ დავუძახებ დათოსა და ვეტყვი. — დათო, დათო! — დაუყვირა ბატონმა.
— ბატონო! — სადღაც შორიდამ მოისმა დათოს ხმა: — ეხლავ გიახლებით.
ცოტას ხანს შემდეგ დათოც მოვიდა და ჰკითხა ბატონსა:
— რას გვიბძანებთ?
— იმას, რომა, ყმები ჩამოგვერთმევაო რომ ამბობენ, ტყუილია. გესმის, თუ არა? ყველას უთხარი, რომ ტყუილია. ხელმწიფეს მოუწერია, რომ დავარჩობ, ვინც იტყვის, რომ ეგ მართალიაო, ვინც გუნებაში მაგას გაიტარებსო. გაიგე?
— გავიგე, შენი ჭირიმე! — უპასუხა დათომა, — განა მაგას ვინა ჰფიქრობს? აი, რაღაც გოგო-ბიჭები მიჰქარავენ, შენი ჭირიმე, იმათ ვინ დაუჯერებს. წვრილფეხობის სიტყვა რა დასაჯერია? იყბედებენ და დაჩუმდებიან.
— ეგრე სთქვი ხოლმე სხვაგანაც, ჩემო დათო! ან რა კარგი იქნება თქვენთვის, რომ ჩვენ არა გყვანდეთ.
— შენი მტერი ყოფილა, ჩვენ ვიქნებოდით, შენი ჭირიმე!
— რაც უნდა იყოს, მამასავით გპატრონობთ.
— დიაღ, შენი ჭირიმე! სწორედ მამა ბძანდებით და ჩვენ შვილები ვართ. თუ ხანდისხან გაგვიწყრებით, აგვიკლებთ, წაგვართმევთ, — ეგ რა? სულ ჩვენის სიკეთისათვის არის ხოლმე, განა მამა შვილს არ გაუწყრება?
— ოღონდაც, რომ გაუწყრება, მაგრამ შვილი ისევ შვილია, მამა ისევ მამაა ხოლმე.
— მართალი ბძანებაა. სხვას არა აქვს მაგის გაგება, ამბობს, რომ რაც ჩემია — ჩემი უნდა იყოს, ბატონი რად უნდა გვართმევდესო. ის კი არ იციან, რომ თუ ბატონი ართმევს რასმეს, სულ იმათისავე სიკეთისათვის ართმევს. ხომ მოგეხსენებათ, გლეხკაცი რეგვენია.
— ოღონდაც რეგვენია, — ჩაერივა დარეჯანი, — მაშ ბატონი რისა არის, თუ არ დასტუქსავს, არ წაართმევს? თუნდ ეგ არ იყოს: უცხო ხომ არ ართმევს, ისევ თავისივე ბატონია.
— მართალი ბძანებაა. მამაა, უცხო რად იქნება? — დაუმატა ეშმაკობით დათომა.
— დიდი და პატარაობა სად არ არის? — სთქვა ლუარსაბმა, — აი, თუნდ თითებზედ დაიხედე: ერთი დიდია, მეორე პატარა. რისთვის? ამისთვის, რომ ღმერთს აგრე გაუჩენია, დიდი და პატარაობა ყველგან უნდა იყოს. აბა, დაიხედე!
— განა არ დამიხედნია, შენი ჭირიმე! დიდიც არის, პატარაც, მაგრამ, დაილოცა ღვთის სამართალი, ისე გაუჩენია, რომ ერთმანეთს არ უშლიან, — სთქვა ცბიერმა დათომ.
— მაშ! ყველგან არის დიდი და პატარაცა, ეხლა როგორ იქნება, რომ ჩვენში არ იყოს. ან რა დასაჯერია? — გააგრძელა ლუარსაბმა და ვერ გაიგო კი დათოს აზრი.
— ვისაც თავში ტვინი აქვს, აკი არ იჯერებს, შენი ჭირიმე, ვინც უტვინოა — ისინი მოგახსენებენ, რომ მართალიაო.
— როგორი მართალია? — დაატანა დარეჯანმა, — ხელმწიფისათვის ან ჩვენ რა დაგვიშავებია, რომ ყმები ჩამოგვერთოს, ან თქვენ რა შეგიმატებიათ, რომ გაგააზატონ. ეს როგორ ვერ მოიფიქრეთ?
— მითამ მოგახსენებენ, შენი ჭირიმე, ჭკვიან კაცებს დაუწერიათო, რომ ქვეყნისათვის კარგი იქნებაო. ტყუილი უნდა იყოს.
— ტყუილია, მაშ რა არის? — დაიყვირა ლუარსაბმა, — აბა, რომელი ჭკვიანი კაცი იტყოდა მაგას, თუ არ იუდას კერძო?
— აი, მეხი კი დავაყარე იმისთანა ჭკვიანსა! — მიაყარა ქოქოლა დარეჯანმა.
— თუ ეგ მართალია, გარეჯელ მკითხავს იცი რა უთქვამს? — ჰკითხა ლუარსაბმა.
— არა, შენი ჭირიმე! რა მოგახსენათ?
— ისა, რომ ტყუილიაო.
— აბა, იმისთანა გულთმისანს მოდი და ნუ დაუჯერებ, — დაუმატა დარეჯანმა.
— მე ეგ ადრევე ვიცოდი, შენი ჭირიმე, რომ ტყუილია, აბა უბატონოდ რა ხეირი დაგვეყრება? უპატრონო საყდარსაო ეშმაკები დაეპატრონებიანო, გლეხები იტყვიან ხოლმე. ჩვენც ეგრე მოგვივა. ეხლა ამითი გვატყუებენ თავადებსაც და გლეხსაც, რომ ქვეყნისათვის კარგი იქნებაო, თორემ რა დასაჯერია?
— თუ მე არ ვიქნები, ქვეყანა თუნდ ძირიანად ამოვარდნილა, თუნდ ბოდბელისა არ იყოს — „ქვა ქვაზედაც ნუ იქნება“, — სთქვა ლუარსაბმა, — ქვეყნისათვის კარგი იქნებაო! თუ მე და შენ არ ვიქნებით, ქვეყანა რად გვინდა? ჯანიც გავარდნია. არა, დათო?
— დიაღ, შენი ჭირიმე! სულ ტყუილია. მე ბევრისათვის მითქომს, რომ ტყუილია, და როდი მიჯერებენ.
— შენ უთხარი, რომ თითონ ბატონმა თავის პირით მიბძანა-თქო, მაშინაც არ დაიჯერებენ? — უბძანა ლუარსაბმა.
— მაშინ კი რაღა ეთქმით, შენი ჭირიმე!
— ეგრე, ჩემო დათო! ყველას უთხარი.
— ბატონი ხარ, მაშ გიახლოთ?
— წადი.
დათო წავიდა. ვინ იცის გულში როგორ ეცინებოდა ამ პირმოთნე ყმასა.
— არა, გული დააჯერა, რომ ტყუილია, — უთხრა დარეჯანმა, როცა დათო წავიდა.
— ჭკვიანი კაცია, დააჯერებდა, — უპასუხა ლუარსაბმა.
V
— ყველა-ყველა და ამაღამ ვახშმად რა გვაქვს? — ერთს საღამოს ლუარსაბმა თავის მეუღლეს ჰკითხა, როცა ქათმების შესხდომის დრომ მოაღწია. — დარეჯან! არ გეყურება, დედაკაცო? ამაღამ რა უნდა ვჭამოთ?
— რატომ რა უნდა ვჭამოთ, გენაცვალოს დარეჯანი! ღვთის წყალობა ბევრი გვაქვს, — ანუგეშა დარეჯანმა.
— მაინც?
— სადილიდამ დარჩომილი კაი ცივად ძროხა გვაქვს, კარგი ღორის სუკებია, კარგი...
კიდევ უნდა რაღაც ეთქვა, მაგრამ ღორის სუკების ხსენებაზედ აღტაცებულმა ლუარსაბმა სიტყვა გააწყვეტინა:
— უჰ, უჰ, უჰ! ეგ ღორის სუკები, შენმა მზემ, რადაც უნდა ჰღირს. სხვა? მე ამაღამ როგორღაც მადაზედა ვარ.
— ზურგიელიცა გვაქვს, ღვინოები რომ იყიდა, იმისი ფეშქაშია. ასეთია, რომ ქონი გასდის.
— უჰ ეგეც კარგია. სხვა?
— ყველი, პური და კაი გული.
— არც ეგ არის ურიგო, შენმა მზემ: ჩვენისთანა ვახშამი ხელმწიფესაც არ ექნება.
გაიკეთა ჩიბუხი მადა-წახალისებულმა მებატონემ და, მინამ სანატრელს ვახშამს მოიტანდნენ, მოუთმენლად წინა და უკან პატარა ოთახში ბოლთასა სცემდა. ხანდისხან რაღაც ფიქრში გართული უეცრად წამოიძახებდა: „ღორის სუკები? შენმა მზემ, რომ კარგია!“
ვახშამსაც, როგორც ყველაფერსა ამ წუთის-სოფელში, ბოლო მოეღებოდა. გამაძღარი და ტახტზედ გადაგორებული ლუარსაბი ეხლა ხვალისთვის დაიწყებდა ზრუნვასა. მაშ! ოჯახის კაცი იყო.
— ესეც ვახშამი, ღვთის მადლით, გადავაგორეთ, ეხლა ხვალინდელ დღისათვისაც ვიფიქროთ. ხვალაც ჭამა გვინდა, დალოცვილს ღმერთს ეგრე გაუჩენია კაცი. ხვალ რაღა ვჭამოთ?
— ხვალ?.. — ჩაფიქრდა დარეჯანი, ვითომც და ძნელი გამოსარკვევი საქმე მიანდვეს: — ხვალ? დაიცა ერთი მოვიგონო... ხვალ? არტალაზედ როგორა ხარ?
— უჰ, უჰ! შენმა მზემ, კარგი რამ მოიგონე. არტალაზედ? ვაცივითა ვარ, ვაცივით, — უპასუხა მსუნაგსავით სულწასულმა თავადმა, — ბარაქალა, დარეჯან! ერთი კარგი მსუქანი არტალა, ჩვენი თედოს მოხარშული, ნივრით, — ერთ სახელმწიფოდა ჰღირს, მე და ჩემმა ღმერთმა. ეგ ძალიან კარგი. სხვა? მარტო ეგ რას გვეყოფა?
— ერთი კარგი ჩიხირთმა? — ჰკითხა მაცდურის ღიმილით კნეინამა.
— ჩიხირთმა?.. ჰა, ჩიხირთმა?.. არა, გეთაყვა, ბოზბაში სჯობია, — მიუგო მცირე დაფიქრების შემდეგ ლუარსაბმა.
— ეხლა მაგას დაიჟინებ. რითა სჯობია?
— ვა!.. ტყემლის მჟავით გაკეთებული ბოზბაში?.. — ისეთის ხმით წამოიძახა ლუარსაბმა, თითქო უკვირსო: ეს ამისთანა უბრალო ჭეშმარიტება როგორ არ ესმის ამისთანა ჭკვიან დედაკაცსაო.
— შენც არ მომიკვდე, ლუარსაბ, კარგად გაკეთებულ ჩიხირთმას ბოზბაში არა სჯობდეს.
— ვა!.. — უფრო გაკვირვებით შეჰყვირა ლუარსაბმა, — ტყემლით გაკეთებულს ბოზბაშს ჩიხირთმა უნდა ამჯობინო?.. შენს ჭკვაზედ არა ხარ, დედაკაცო! ჯერ ისე ბოზბაში რა არის, რომ ტყემლით რა იყოს!.. რას ამბობ, რასა? ერთი მსუქან ბოზბაშში ამოვლებული პურის ლუკმა მთელ ქვაბ ჩიხირთმას მირჩევნია. ამის შემდეგ შენ უნდა დამაჯერო, რომ ჩიხირთმა სჯობია? მაშ კაცი აღარ ვყოფილვარ, ქუდი არა მხურებია.
— შენ ერთი ახირებული კაცი ხარ: რასაც იტყვი, ხომ კაცი ვეღარ გადაგათქმევინებს? — არ იყო რომ ცოტა წყენით არ უთხრა დარეჯანმა დაჟინებულს ლუარსაბსა.
— მაშ? კაციც მაგისთანა უნდა. ის ხომ კარგია, დღეს ერთი სთქვას, ხვალ სხვა? — სთქვა ლუარსაბმა, შემოიყარა დოინჯი და გამარჯვებულსავით ამაყი შეხედულობა მიიღო.
დარეჯანმა იგრძნო, რომ ლუარსაბმა საბუთიანად დაიჭირა და შერცხვენილმა ბანზედ სიტყვა გადააგდო:
— მაშ შენ ბოზბაშს ამჯობინებ?
— ვამჯობინებ.
— მაშ შენ პირში გემო არა გქონია, — ეხლა კი გულზედ მოსულსავით სთქვა დარეჯანმა.
ლუარსაბი აიტკიცა, მაგრამ თავი შეიკავა და არ იყო რომ მაინც ცოტა წყენით არ უპასუხა:
— შენ არა გქონია, რომ ჩიხირთმას ამჯობინებ, თორემ მე ხომ ბოზბაში მირჩევნია.
— აბა რას მიედ-მოედები? — ეხლა კი გაანჩხლდა დარეჯანი, — ბოზბაში როგორა სჯობია ჩიხირთმასა, რომ როცა ჩიხირთმა მაგონდება — პირში წყალი მომდის, თუ მშიერიც ვარ — მაშინ უფრო, ბოზბაშზედ კი არა. მაშ ჩიხირთმა სჯობნებია. ეხლაც დაიჟინებ?
ისეთ გულდაჯერებით და ზაფრიანად წარმოსთქვა ეს კნეინამა, რომ, ასე გგონია, უნდა ეთქვაო: „შე სულელო, ამისთანა საბუთი მაქვს და შენ კი მაინც შენსას ამბობო?“
მაგრამ არც ამის მოპირდაპირე იყო სუსტის ჭკუისა, რომ ის საბუთი უფრო ძლიერის საბუთით არ დაერღვია. მართალია, პირველშივე ძალიან ჩაფიქრდა, მაშინვე ვერ მოახერხა, — რა ეთქვა, მერე კი — ღვთის წყალობა გქონდეთ — ყოჩაღად ლუარსაბმა იმას მიუგო.
— მაგ სიტყვებზედ სდგეხარ? — ჰკითხა ჯერ ლუარსაბმა და ფეხზედ წამოდგა.
— ვდგევარ.
— მაშ კარგი: შენ ხომ ჩიხირთმა მშიერს მოგგვრის პირში ნერწყვსა, მე კი ბოზბაში — მაძღარსაცა. აი, თუნდა ეხლა: მე ხომ ამაღამ შენზედ მეტი მიჭამია, მაგრამ რომ მაგონდება პირამდინ პურ-ჩაყრილი, ჩაჟუჟუნებული ბოზბაშით სავსე მათლაბა, თუ ზემოდამაც ერთი კარგი კანჭი აძევს!.. რას ამბობ, დედაკაცო? მე მოგიკვდე, თუ შენ გესმოდეს რამე: ბოზბაში — წვნიანების მეფეა, როგორც თართი — თევზებისა. შენ რა იცი, დედაკაცი ხარ.
— აბა შენ კაცმა როგორ უნდა დაგიჯეროს, რომ ეგეც არ იცი: ორაგული თქმულა თევზების მეფედ და არა თართი... აბა, სულ ეგრე სტყუი ხოლმე, — უკიჟინა ნიშნის მოგებით გახარებულმა კნეინამ, რომ ტყუილში დაიჭირა.
შერცხვა ცოტა ლუარსაბსა, მაგრამ არ შეიმცნივა და გაიზრახა, რომ პატივისათვის — რაც უნდა დაემართოს — უნდა დაამტკიცოს, რომ თართი არის მეფე.
— ეხლა მაგას დაიჟინებ. თართია-მეთქი.
— ორაგულია.
— ეჰ, თართია, თავი არ მამიკვდება, არც ეხლა დაიჯერებ?
— ორაგულია, ორაგული! — დასძახა კნეინამა.
— აბა საიდამ იცი, რომ ორაგულია?
— შენ საიდამღა იცი, რომ თართია?!
ამ კითხვამ გააბა ლუარსაბი მახეში. მერე რა-რიგად! ხსნა არ იყო! ძალიან კი უნდოდა მოეგონა რამ, უნდოდა ეთქვა კიდეც, რომ „კარაბადინში“ სწერიაო, მაგრამ მოაგონდა, რომ დარეჯანი უფრო ნაკითხია და ვეღარ გაბედა.
დარეჯანი ჭკვიანი დედაკაცი იყო — როგორც იცის თითონ მკითხველმა ჰნახა რომ ლუარსაბმა პასუხი ვერ მოუხერხა, უფრო-და-უფრო დააყარა თავმოწონებით:
— მითხარ, საიდამ იცი? მაშა! რაც არ იცი, ნუ იტყვი. აბა ეხლა სთქვი: ჩიხირთმა არა სჯობია?
დარეჯანმა იფიქრა, რომ ეგრე დაჭერილი ლუარსაბი თუ გატყდება, ეხლა უნდა გატყდეს. ამისთანა გაჭირებაში თუ დაიყოლიებს ჩიხირთმის უკეთესობაზედ, თორემ სხვა დროს ვეღარა. ამიტომაც ეგრე უეცრად გადავიდა ისევ ჩიხირთმაზედ.
ლუარსაბი დაგვიღონდა, მკითხველო! ისე თავჩაღუნული იდგა, როგორც პატარა ბავშვი, როცა შაქრის ქურდობაში დაიჭერენ. არ იცოდა რა ექნა. ჰგრძნობდა, რომ ცოლმა დაიჭირა, აჯობა, მაგრამ ამის კისრად აღება ეთაკილებოდა. სხვა დროს იქნება დაეთმო, მაგრამ ეხლა, რაკი საქმე სახუმარი აღარ იყო, რაკი ჯიბრზედ შედგა, ეხლა დათმობა სათაკილო ეგონა. მართალია, იყო წუთი, როცა ისე დამარცხებული ჰნახა თავისი თავი, რომ თითქმის დააპირა კიდეც ჩიხირთმის უკეთესობის აღიარება, მაგრამ ამ დროს თვალ-წინ წამოუდგა მაორთქლავი მათლაბა ლავაშ-ჩაყრილის ბოზბაშისა, მოაგონდა ზემოდამაც გადახირული ბატკნის კანჭი, ამან გაიტაცა ისევ ლუარსაბი: ამის სულს ღონე მოემატა, გული გაუმაგრდა, დაავიწყა სირცხვილიც, დამარცხებაც, გამარჯვებაც და ათქმევინა ეს ღონიერი სიტყვები:
— მე არ ვიცი, თუნდ რომ მართლა ორაგული იყოს თქმული თევზების მეფედ, მაინც კიდევ ბოზბაში სჯობია ჩიხირთმასა.
— ჩიხირთმა, ადამიანო!
— ბოზბაში, დედაკაცო!
— ეჰ, წეღანდელი არ იყოს, მტყუანი ხარ და არა სტყდები, — უთხრა ყვედრებით დარეჯანმა.
— შენა ხარ მტყუანი.
— დახე! შენ არა თქვი — თართიაო?
— მე ეგ არ მითქვამს — ეგ შენა თქვი, — იცრუა ლუარსაბმა და თავის სიტყვა თავის ცოლს გადააბრალა, — მე ორაგული ვთქვი.
— დახე, დახე, თქვენი ჭირიმეთ!.. ეს რა მოიგონა! — წამოიძახა ეხლა კი სწორედ გულზედ-მოსულმა დარეჯანმა.
— ამდენი იყვირე, რამდენიც გინდოდეს! — დაბალ ხმით უთხრა ლუარსაბმა და წავიდა, რომ გარეთ გავიდეს. კარებში რომ მივიდა, ერთი კიდევა სთქვა:
— მე ორაგული ვთქვი. — თქმა ამისა და იმისი გარეთ გასვლა ერთი იყო.
— მტყუანს?.. — მისძახა გაკაპასებულმა, ამ უსირცხვილობისაგან მოთმინებიდამ გამოსულმა ცოლმა, — გაუწყრეს წმინდი-გიორგის მადლი და ნეკრესის ღვთისმშობლისა!
ლუარსაბმა ყური არ ათხოვა, თუ ვერ გაიგონა — არ ვიცი, ეს კი ვიცი, რომ ამ წყევლამ დარეჯანს მშვიდობიანად ჩაუარა.
ხშირად შუაღამემდინ ცოლ-ქმარნი გაცხარებულნი და გაჭარხლებულნი ამისთანა ღრმა აზრებს ამტკიცებდნენ: „დღეს რა ვჭამოთ“, — იტყოდნენ დილით. „ხვალ რა ვჭამოთ“, — იტყოდნენ საღამოზედ. ეს იყო იმათი სულის საზრდო, ეს იყო იმათი გონების ვარჯიში, ეს იყო იმათი აზრის აღებ-მიცემა.
რა იცოდნენ ამათ, რომ თავისის ქცევით, თავისის ცხოვრებით არისხებდნენ ღმერთსა, რომელსაც თავისი სული ამათთვის შთაუბერია.
— ვაჟო! მე ვარისხებ ღმერთსაო? — გეტყოდათ გაოცებით ლუარსაბი: — წირვა-ლოცვას მე არ ვაკლდები, კაცი მე არ მამიკლავს და კაცისათვის მე არ მამიპარავს, — რაზედ ვარისხებ ღმერთსა?
მართალი ხარ, ჩემო ლუარსაბ, შენ კაცი არ მოგიკლავს, კაცისთვის არ მოგიპარავს, ერთის სიტყვით — რაც არ უნდა გექნა, არ გიქნია — ესეც კარგია: უარარაობას ეგა სჯობია. მაგრამ ეხლა ეს უნდა გკითხო: რაც უნდა გექნა, ის კი გიქნია?
— დიაღ, — მეტყვი შენ, — მისვამს და მიჭამია, არც ერთი დღე მშიერი არა ვყოფილვარ.
მითამ პასუხი ეგ არის? წირვა-ლოცვას არ ვაკლდებიო რა გამოვიდა? იქ ყოველთვის გსმენია ჩვენთვის ჯვარცმულის ქრისტეს სიტყვა: „ვითა მამა ზეცისა იყავ შენ სრულიო“. აბა, ან ერთს წამს შენს სიცოცხლეში მაგისთვის სცდილხარ? არა, შენ მაგისათვის არა სცხოვრობ: შენ სცხოვრობ — რომ სვა და სჭამო, და არა იმისთვის სჭამ და სვამ — რომ იცხოვრო, ესე იგი ეცადო — რომ ვითა მამა ზეცის იყო შენც სრული.
VI
ოცი წელიწადია თურმე, რაც ლუარსაბი და დარეჯანი ერთს უღელში შებმულან და ერთს ბედის კალთას ქვეშ ამოფარებულან. საოცარი ამბავია ამათი ჯვარისწერა. ჯერ ლუარსაბი თავის ძმასთან — დავითთან — გაუყრელი იყო, როცა ოცი წლისა შესრულდა და მოინდომა ცოლის შერთვა. ძალიან მოინდომა, მაგრამ არ იცოდა ვისი ქალი შეერთო; მდიდარიც უნდოდა, კაი გვარის-შვილიც და მზეთუნახავიცა. ამაების მექონი ქალი ჩვენში ძვირია. ლუარსაბს ჯერ კი თვალი ეჭირა — იქნება შემხვდესო, და, რომ ვერსად ვერა ჰპოვა, გაიზრახა გულში — შეიკეროს პტყელის ბუზმენტებით ჩოხა, ბუზმენტებითვე მორთული განიერი მაუდის შალვარი, ერთი ოციოდ თუმანს თავი მოუყაროს და ჩავიდეს ქალაქში იმ ფიქრით, რომ ერთი-ორიოდჯერ ქუჩა-ქუჩა გავაჭენებ დროშკასაო, იქნება ერთი მდიდარი, კაი გვარის და ოჯახის შვილი ქალი ბადეს მოხვდესო, თუ არა და სომხის ქალები ხომ იქ არიან, ათასს თუმანს წამოვიღებო. ბოლოს შეიტყო, რომ შორს წასვლა საჭირო არ არის; თავად გძელაძეს, დიაღ პატიოსანის გვარის და კაი ოჯახის შვილს, ერთი მზეთუნახავი ქალი უზის გასათხოვარი და ზედ ზურგზედ ორასი თუმანი თეთრი ნაღდად აკერია. აუფორთხალდა ლუარსაბს გული, გაუჯდა გვერდებში და დღე-მუდამ საამურად უღიტინებდა, მაგრამ არ იცოდა — როგორ მოეხდინა საქმე. უშველა ღმერთმა და ერთს დღეს მაჭანკალიც გაუტყვრა.
მაჭანკალი, გძელაძისაგან მოგზავნილი, გახლდათ ერთი მოხუცებული, დარბაისელი, ღარიბი და ქვრივი დედაკაცი, რომელიც მას აქეთ, რაც ქმარი მოჰკდომოდა, ამ პატიოსანის ხელობით თავს ირჩენდა. ამას „სუტ-კნეინას“ ეძახოდნენ, იმიტომ რომ ამისი უბედური ქმარი მთელ სიცოცხლეში კნიაზობას ეძებდა და ვერ დაიმტკიცა. ჩვენც ეგრე დავუძახოთ.
დიდი ენამეტყველობის სახელი ჰქონდა გავარდნილი თავადიშვილებში ამ სუტ-კნეინასა. ამისთანა გამოცდილი შუამავალი თურმე ორიც არ დადიოდა დედამიწის ზურგზედა. ამიტომაც ბლომად იღებდა ფეხის-ქირასა, მაგრამ ეს იყო კარგი, რომ რაკი იკისრებდა საქმეს, ბოლოსაც მოუღებდა. აი, გძელაძესაც ეს ამოერჩივა, ხუთი თუმანი ბე მიეცა და თხუთმეტსაც დაჰპირებოდა, როცა საქმეს გაარიგებს. თუმცა გძელაძემ გამოგზავნა ლუარსაბთან, მაგრამ გამოცდილმა სუტ-კნეინამ ისე აჩვენა თავი, რომ მითამ ჩემ თავად მოვედიო, რომ ლუარსაბსაც დაავალოს და დასცინცლოს რამე.
ეს მოჰხდა ერთის აზნაურიშვილის სახლში, რომელმაც ჯვარი დაიწერა და ქორწილში სხვათა შორის ლუარსაბიც დაჰპატიჟა. ის სუტ-კნეინა ამ აზნაურიშვილის მამიდა იყო. ქორწილის მეორე დღეს, სადილის შემდეგ, ჩვენი ლუარსაბი შექეიფიანებული წავიდა და ფანჩატურში დაწვა. მზე დაწურვაზედ იყო, როცა ვიღაცამ ხელი ჰკრა და გააღვიძა. ლუარსაბმა გააჭყიტა თვალები და დაინახა ერთი პატიოსანი ხნიერი დედაკაცი. წამოხტა მაშინვე ფეხზედ.
— დაბძანდით, შენი ჭირიმე, მოისვენეთ, — უთხრა სუტ-კნეინამა, — უკაცრავოდა ვარ, მოსვენება დაგიფრთხეთ, მაგრამ დედითქვენის მეგობრობა და ხათრიჯამი რომ მაგონდება, ის პატივი და სიყვარული, თქვენზედაც გული შემტკივა... აი ამოდენა (დაბლა ხელით აჩვენა) ხელში მჭერიხართ, მითამაშებიხართ. დედა-თქვენი და მე დიდი მეგობრები ვიყავით, უერთი-ერთმანეთოდ ვერ გაგვეძლო, დიდი სიყვარული გვქონდა ერთმანეთისა: დები რად იქნებიან ისე, როგორც ჩვენ ვიყავით. დედა-თქვენი ხომ არ გახსოვთ?
— არა, მე მაშინ ორის წლისა ძლივა ვყოფილვარ, — მიუგო ლუარსაბმა, რომელმაც არ იცოდა ჯერ, რა ამბავია და ან რა უნდა ამ კნეინასა.
— რასაკვირველია, არ გეხსომებათ. ის უბედური ღმერთს რომ თავის უმანკო სულს აბარებდა, — იმის დამკარგავი მე ცოცხალი რაღადა ვარ, ეჰ, მადლობა ღმერთს, იმის ნებას ვინ წაუვა, — რომ უმანკო სულს აბარებდა, მე მაშინ ფეხთით ვეჯექი. ყველანი დაითხოვა ჩემ-გარდა. მამა თქვენი, მგონია, მაშინ მიცვალებული იყო.
— არა, ჯერ მასუკან თუნდ ექვსი წელიწადი იცოცხლა, — მიუგო ისევ ლუარსაბმა.
— მართლა, მართლა, რამ დამავიწყა? — სთქვა სუტ-კნეინამა, მითამ-და მართლა დაავიწყდა, — აი, სიბერე რა არის, ხსოვნამ მიღალატა, დიაღ, ცოცხალი ბძანდებოდა. დახე ჩემს გონებას! თავის პირით არ მიბძანა: „დაო, ხორეშან! ვიცი, რა სიყვარული გაქვთ შენ და ჩემ ცოლსა, წადი, ფეხთით დაუჯექ, იამება, შენ რომ გნახავს ისე ჩემი ნახვაც არ იამება“. მამა-თქვენი დარბაისელი კაცი იყო, დიდი პატიოსანი, სახელოვანი და ყველასაგან პატივცემული. დიდი შიში-კრძალვა ჰქონდათ იმისი, განა მარტო საქრისტიანოში, სალეკოშიაც; დაღისტნამდინ იმისი სახელი გავარდნილი იყო, რუსებისაგანაც დიდი პატივი ჰქონდა. აბა თქვენ რა გეხსომებათ, პატარა იყავით. ჰო, რას მოგახსენებდით?.. — ჰკითხა ლუარსაბსა.
— რომ მამი-ჩემის სახელი დაღისტნამდინ გავარდნილი იყო, რომ რუსებისაგანაც დიდი პატივი ჰქონია, — უპასუხა ლუარსაბმა.
— არა, ეგ ხომ ვიცი. რაზედ დავიწყე, ის დამავიწყდა, ვეღარ მომიგონებია. აი, ბატონო, სიბერე ეს გახლავთ: წუთის წინად რას ვლაპარაკობდი, არ მახსოვს, მამა-თქვენის სიკვდილი — ოცის წლის ამბავი — რომ არ მახსოვდეს, რა საკვირველია.
— თორმეტის წლის ამბავი გახლავთ, — გაუსწორა ლუარსაბმა
— თუნდ თორმეტისა, მაინც საკვირველი არ არის. რაზედ დავიწყე ლაპარაკი?.. — ჩაფიქრდა სუტ-კნეინა, მითამ-და არ იცოდა, რაზედ დაიწყო. იცოდა, ძალიან კარგად იცოდა, მაგრამ ჰფიქრობდა, ისე როგორ მოახერხოს, რომ ლუარსაბმა ტყუილში ვეღარ დაიჭიროს, როგორც მამის სიკვდილში დაიჭირა. ლუარსაბი გაშტერებული იდგა და სულ არ ესმოდა, რა განზრახვით მოსულა ამასთან კნეინა და რა განზრახვით ჰლაპარაკობს.
— ჰო, მართლა! — წამოიძახა სუტ-კნეინამა, ფიქრის შემდეგ, — იმას მოგახსენებდით: ცხონებული დედა-თქვენი რომ უმანკო სულს უფალს აბარებდა, ყველანი დაითხოვა, ჩემ-გარდა, და, როცა მარტოკანი დავრჩით, მიბძანა თავის სირინოზის ხმითა: „მე, ჩემო გულითადო მეგობარო ხორეშან, დიდის ხნის სიცოცხლე აღარა მაქვს. ვიცი, რომ ჩემი სიყვარული დიდი გაქვს. აი, ეს შენ და ეს ჩემი ობლები, შენ იყავ ამათი დედა“. ეს რომ ბძანა, — ვუი უბედურების მნახველს! — გული ამოუჯდა. მეც ღაპა-ღუპით წამომივიდა ცრემლები, ბევრი ვიტირეთ. მერე ხომ განუტევა კიდეც ის ანგელოზის სული. მე, როგორც თავზარდაცემული, ისე გიჟსავით დავრბოდი, თურმე ეგონათ — ვერ ავიტან მწუხარებას და ჭკვიდამ შევცდები. დიდი სიყვარული გვქონდა, ესე ვიყავით, თითქო ერთი ხორცი გვაქვსო და ერთი სული. დედა-თქვენიც ასეთი დედაკაცი ბძანდებოდა, — დაუმკვიდროს ღმერთმა სასუფეველი, — ასეთი დედაკაცი ბძანდებოდა, რომ ყველას ხატსავით უნდა ელოცნა. ასეთი რამ იყო! სადღა არიან ეხლა იმისთანები! ჩვენც ვიტყვით, დედაკაცები ვართო... მესამეს დღეს ქრისტიანულის წესით მივაბარეთ მიწასა იმისი ნათელი გვამი. დიდი სამღვდელო იყო მოპატიჟებული. მოგახსენებენ, მამა-თქვენს გვამის გასაპატიოსნებლად არქიელიც უნდა მოეწვივა, მაგრამ დროშკის ცხენები ვერ ეშოვნათ, რომ გაეგზავნათ. თქვენ ერთი ბეწო ობლები დარჩით, თქვენ და დავით პატარები იყავით, თქვენ მაშინვე შემიყვარდით, თქვენკენ მაშინვე გული უფრო მამიწევდა. არ ვიცი რად, — დათიკოც ხომ იმისი ნაშობი იყო, მაგრამ თქვენ ჩემთვის სხვა იყავით. მე თქვენ ხომ არ გეხსომებით?
— არა, არ მახსოვხართ.
— აბა, რასაკვირველია, არ გეხსომები, შენ სამის წლისა იქნებოდი, როცა მე ქმარი მომიკვდა, — ვაი იმის დამკარგავს! — მას აქეთ შინიდამა ფეხი არ გამომიდგამს, — ვარ ესე უნუგეშო, უპატრონო, ქვრივ-ოხერი. სიხარული ჩემთვის სიხარული აღარ არის, ქვეყანა ჩემთვის სულ შავებშია ჩაცმული. მაპატივეთ კადნიერება, იქნება თავი მოგაწყინეთ. რა ვქნა? ბედისაგან დამწვარ-დადაგული ვარ, დარდები მეშლება ხოლმე. რაღა გავაგრძელო, მოკლე სიტყვა სჯობია. თქვენ სამის წლისა იქნებოდით, რომ ქმარი დავკარგე. მოგშორდით და მას აქეთ აღარ მინახვიხართ, მაგრამ გულით ისევ თქვენთან ვიყავი; ვისაც კი თქვენებურს შევხვდებოდი, თქვენს ამბავს ვკითხავდი, ერთ ღამეს — აი, ეს სამი თვეც არ იქნება — დამეძინა. ვნახოთ, ღრმა ძილში რომ ვარ — ერთი მშვენიერი ანგელოზი, შუქმოფენილი, განწმენდილი და გასპეტაკებული თვალ-წინ გამომეცხადა. სიზმარს მოგახსენებთ, მაგრამ ასეთი სიზმარი იყო, რომ აქამდინ ცხადი მგონია. — „ხორეშან!— მიბძანა სულმა ცხოველმა, — მე შენის გულითადის მეგობრის სული ვარ, განწმენდილი და გასპეტაკებული“. მაშინვე მუხლებზედ მოვეხვიე დედი-თქვენის სულსა, დედა-თქვენი ბძანდებოდა. — „მუხლებზედ ნუ მეხვევი, — მიბძანა ხელახლად, — მე შენგან გული მტკივა: რად დაანებე თავი ჩემს დავითს და ლუარსაბსა? დავითი კიდევ არაფერი, იმან ცოლი იშოვა და დაბინავდა, ლუარსაბს რატომ არ ჰპატრონობ?“ სამი ღამე ერთი-ერთმანეთზედ მომევლინებოდა და სულ იმას მეტყოდა ხოლმე. ეგრე გახლდათ, თქვენი დაუტირებელი არ მოვკვდე! თუნდ ეგ არ ყოფილიყო, მე — როგორც მოგახსენეთ — უფლისა წინაშე აღთქმა მივეც, რომ დედობა გაგიწივო, და, აი, დღეს მოვიდა ის დღე. თქვენ ყმაწვილი კაცი ბძანდებით. მე, რა წამსაც დაგინახეთ, მაშინვე მივხვდი, რასაც გაუგიჟებია ის საწყალი ქალი. ღმერთმა შეარცხვინოს შენს მხარ-ბეჭთან ყარამანის მხარ-ბეჭი და სიტურფე ტარიელისა, გონიერება გარდანქეშანისა. თვალი მოგკარით თუ არა, მაშინვე მივხვდი, რასაც აუნთია ცეცხლი იმ უბედურის ქალის გულშია. უბედურს ვამბობ იმიტომ, რომ იქნება თქვენ იმაზედ არც კი ჰფიქრობთ, ის კი იქა ჰდნება.
ლუარსაბს იამა, ისე უნებლიეთ ქუდი უფრო ჩაიტეხა, კისერი მოიღერა, წვრილ, ახალ აშლილ ულვაშებს ხელი გადუსო, წელში გასწორდა და მხარ-ბეჭი მოიმარჯვა. ისე იამა, რო�