�λλές, το χώμα πιο πλούσιο από θησαυρούς.
Τι δεν έβρισκες εκεί μέσα! Πράσινα και γαλάζια κομμάτια γυαλί, κάποτε και άσπρα, χαλκάδες τενεκεδένιους σκουριασμένους ή καπάκια κουτιών στρογγυλά, σα ρόδες χωρίς αξόνι - μα ο Αντώνης έλεγε πως ήταν εύκολο να τους κάνεις αξόνι μ' ένα καρφί που θα τα τρυπούσε στη μέση - κάποτε κανένα κουδουνάκι σιδερένιο χωρίς γλωσσίδι - που και αυτό διορθώνουνταν, βεβαίωνε ο Αντώνης, με μια μεγάλη χάντρα της Αλεξάνδρας, κρεμασμένη σε μια κλωστή, μόνο που η Αλεξάνδρα, που είχε πέντε τέτοιες χάντρες, δεν ήθελε να δώσει καμιά, - κάποτε κανένα κομμάτι σκοινί ή σπάγκο ή τέλι, μα προπάντων πέτρες, πέτρες όλων των σχημάτων, με φλέβες σταχτιές, μενεξελιές, τριανταφυλλιές ή μαύρες.
Μια μέρα, η Πουλουδιά βρήκε έναν αληθινό θησαυρό· βόλους, βόλους μαύρους, πολλούς, σκόρπιους, μικρούς, ολοστρόγγυλους. Ζαλισμένη τους κοίταζε, άφωνη από τη χαρά της. Η πρώτη της σκέψη ήταν να μη φωνάξει τ' αδέλφια της, μην της τους πάρει ο Αντώνης, που πρέσβευε πως τα κορίτσια δεν πρέπει να παίζουν βόλους, πως έχουν κούκλες και πως αυτές τους αρκούν. Μα ήταν τόσο πολλοί οι σκόρπιοι βόλοι, αρκούσαν για όλους, ακόμα και για τον Αλέξανδρο, που τόσο τους λαχταρούσε και που ποτέ δεν του δάνειζε τους δικούς του ο Αντώνης.
Φώναξε λοιπόν τ' αδέλφια της.
- Βόλους! Βόλους! Ελάτε να δείτε πόσοι! τους είπε μαζεύοντας τους στη γεμάτη φούχτα της.
Ανακούρκουδα πλάγι της, καταχαρούμενος, τους μάζευε ο Αλέξανδρος έναν έναν και τους φύλαγε στην άλλη παλάμη του. Ο Αντώνης όμως, με τα δυο του χέρια στις τσέπες του πανταλονιού του, δεν το θεώρησε αξιόπρεπο για ένα αγόρι να ενθουσιαστεί με το εύρημα ενός κοριτσιού. Και είπε ακατάδεχτα:
- Οι δικοί μου είναι πιο μεγάλοι!
Και η Αλεξάνδρα, που ακολουθούσε πάντα τον Αντώνη, είπε:
- Και για να τους πετάξουν εδώ, θα πει πως είναι χαλασμένοι!
Απογοητευμένος άνοιξε ο Αλέξανδρος τα χέρια του και οι βόλοι του σκορπίστηκαν στο χώμα. Η Πουλουδιά όμως επέμεινε.
- Πού το ξέρεις πως τους πέταξαν; ρώτησε. Μπορεί ένα αγόρι να τους είχε στην τσέπη του και να τρύπησε η τσέπη του και να του έπεσαν όσο περπατούσε. Για δες, έχει παντού, εδώ, κι εκεί, και παρακάτω! Θα έτρεχε το αγόρι και θα έπεφταν οι βόλοι...
- Πφφφ... διέκοψε ο Αντώνης που είχε πολλή όρεξη να πάρει από το θησαυρό της αδελφής του, μα που δεν το καταδέχουνταν πια, μιας και τον είχε περιγελάσει. Ξέρεις και συ τώρα από αγόρια!
Πειραγμένη στο φιλότιμο της για την περιφρονητική αδιαφορία των αδελφών της, η Πουλουδιά γέμισε την τσέπη της και είπε:
- Καλά. Όταν αύριο μου ζητήσετε τους βόλους μου, εγώ δε θα σας τους δώσω!
Και κάκιωσε και δεν ήθελε να ρίξει με τους άλλους πέτρες στο γιαλό.
Αυτό ήταν το πιο ωραίο τους παιχνίδι. Και παράμερα, λυπημένη, κοίταζε η Πουλουδιά τις πέτρες που τις πετούσαν τ' αδέλφια της και που πηδούσαν στους βράχους και ξαναπηδούσαν ως κάτω κι έπεφταν πλουφ στο νερό.
Το πλουφ δεν το άκουαν, γιατί ήταν πολύ ψηλά και το νερό πολύ χαμηλά. Μα τους είχε πει ο Αντώνης πως κάνει πάντα πλουφ η πέτρα στο νερό, και αν το 'λεγε ο Αντώνης, πρέπει να ήταν αλήθεια. Γιατί ποτέ δεν είπε ψέμα ο Αντώνης.
Και το 'λεγε πάντα ο θείος: «Ο Αντώνης είναι σκάνταλος, μα ψέματα δε λέγει!» Και το 'λεγε και η θεία, που του τις έβρεχε συχνά. Και το 'λεγε η κερα-Ρήνη η μαγείρισσα, που, σαν είχε πονοκέφαλο, έδενε ένα μαντίλι γύρω στο μέτωπο της με φέτες πατάτες ή λεμόνια στα μηνίγγια της κι έβριζε μες στα δόντια της κι έλεγε: «Ντελή- Αντώνης, Τρελαντώνης, που κακό να μην τον πιάσει... γιατί ψέματα δεν ξέρει!»
Το 'λεγε και η Αφροδίτη η τραπεζιέρα, που ήταν καλή, όσο ήταν άσχημη, που γύρευε να κρύψει από τη θεία τις ζημιές του, μα που τις ομολογούσε ύστερα εκείνος. Όλα τα ομολογούσε, σαν τον ρωτούσαν. Και τον έτρεμαν τα κορίτσια, μην ομολογήσει και τις δικές τους αταξίες και τα δικά τους μυστικά.
Έτσι, εκείνη την ημέρα που βρήκε το θησαυρό της, πέρασε η Πουλουδιά μεγάλη στενοχώρια.
Είχαν επιστρέψει τ' αδέλφια στο σπίτι με την Εγγλέζα δασκάλα που αισθάνθηκε, λέει, κακοδιάθετη και ανέβηκε στην κάμαρα της. Τ' αδέλφια μείναν στην αυλή για να παίξουν, που ήταν ακόμα μέρα, μα κανένας δεν είχε κέφι για παιχνίδια, γιατί ο Αλέξανδρος, στην επιστροφή εκείνο το απόγεμα, είχε ντροπιάσει την οικογένεια.
- Πώς του ήλθε να το κάνει! είπε η Αλεξάνδρα σμίγοντας τα δυο της χέρια κάτω από το πιγούνι της.
Ο ένοχος κάθουνταν στο πεζούλι τής πίσω πόρτας του σπιτιού, τα χέρια ακουμπισμένα στην πέτρα όπου απλώνουνταν φουντωτή η άσπρη του κεντημένη φουστίτσα, τα μάτια πρησμένα από τα κλάματα, το μυτάκι κατακόκκινο, τα χείλια σφιγμένα για να συγκρατήσει τ' αναφιλητά που όλο ξανανέβαιναν. Κοίταζε πότε τη μεγάλη του αδελφή, που φαίνουνταν ζαλισμένη από το κακό που της ήλθε στο κεφάλι, πότε τον Αντώνη, που, μισοκρεμασμένος από το τεντωμένο σκοινί της απλώτρας, ξεχνούσε από την αγανάκτηση του να κάνει τη σβούρα στριφογυρίζοντας στο τακούνι του, και πότε την Πουλουδιά, που συνήθως ήταν κόμμα του, μα που κι εκείνη τώρα έσκυβε το μέτωπο κάτω από την οικογενειακή συμφορά.
- Φαντάσου να το ήξερε η μαμά πως είπε «Βρε συ!» σ' έναν αξιωματικό! είπε αργοπροφέροντας μια μια τις λέξεις του ο Αντώνης.
- Και να σηκώσει και τη γροθιά του! είπε η Αλεξάνδρα.
- Και να χτυπήσει το πόδι του εμπρός, σα να τραβούσε σπαθί! πρόσθεσε ο Αντώνης.
- Και σε ποιον; Σ' έναν αξιωματικό! είπε η Αλεξάνδρα.
Ο Αλέξανδρος, στη φοβερή αυτή ενθύμηση, έλιωσε πάλι στα κλάματα.
- Μα δεν το ήξερα πως ήταν αξιωματικός! είπε ανάμεσα στα δάκρυα του.
- Πώς δεν το ήξερες; Δεν τον είδες, με την άσπρη του στολή και τα χρυσά γαλόνια στο πηλήκιο του; ρώτησε αυστηρά ο Αντώνης.
- Τον είδα... μα τον είδα αφού το είπα!
- Καλά, δεν άκουσες τ' άλογο του που ήρχουνταν πίσω μας;
- Το άκουσα. Μα νόμιζα πως ήταν ο Μπαρμπαγιάννης Κανατάς!
Στάθηκε μια στιγμή ο Αντώνης να σκεφθεί και να ζυγίσει αυτή την πιθανότητα. Μα τη βρήκε αστήριχτη.
- Αυτά που λες μόνο ένα μωρό σαν και σένα μπορεί να τα πει! του αποκρίθηκε με το πιο αυστηρό του ύφος. Άκουσες μήπως το τσίκι τσάκα που κάνουν οι κανάτες του Μπαρμπαγιάννη Κανατά, σαν τρέχει το γαϊδουράκι του;
- Όοοχι... ομολόγησε χαμηλόφωνα ο Αλέξανδρος.
- Και δεν άκουσες το κλοπακλόπ, κλοπακλόπ, κλοπακλόπ που κάνει το άλογο σαν τρέχει και που δε μοιάζει καθόλου με το τακ, τακ, τακ του γαϊδουριού;
- Ναι... τ' άκουσα... αποκρίθηκε ακόμα πιο σιγά ο Αλέξανδρος.
- Και αμέ το κλικικλίκ του σπαθιού στη σέλα; έκαμε η Αλεξάνδρα, για να μη μείνει πίσω στην παρατηρητικότητα και την περιγραφή. Με αυτή την ενθύμηση του σπαθιού του αξιωματικού, καινούρια δάκρυα του Αλέξανδρου. Κι είπε η Αλεξάνδρα, αναπολώντας πάλι το δράμα:
- Ήρχουνταν ο αξιωματικός από την Καστέλα... Κι έτρεχε για να πάγει σπίτι του... Και βλέπει μπροστά του τέσσερα παιδιά που θα νόμιζε, βέβαια, πως είναι καλοαναθρεμμένα παιδιά. Κι άξαφνα, το πιο μικρό, γυρνάει πίσω, κάνει απότομα ένα βήμα μπροστά...
- Σα να έκανε έφοδο! διέκοψε με αγανάκτηση ο Αντώνης.
- Ναι, σα να έκανε έφοδο! επανέλαβε η Αλεξάνδρα. Και σηκώνοντας τη γροθιά του, φωνάζει: «Βρε συ!» Και σε ποιον; Σ' έναν αξιωματικό!
Ο Αλέξανδρος ήταν αναλυμένος πια όλος στα δάκρυα.
- Και δε θύμωσε ο αξιωματικός, είπε συντριμμένη η Πουλουδιά, κουνώντας πάνω κάτω το κεφάλι της, όπου βάραινε όλη η ντροπή του αδελφού της, και δε μάλωσε... μόνο γέλασε!
- Ναι, φαντάσου! Γέλασε! επανέλαβε καταστενοχωρεμένη η μεγάλη αδελφή.
Αυτή τη φορά απέκανε ο Αλέξανδρος. Έσκυψε το κεφάλι του στα γόνατα του κι έπνιξε δάκρυα και αναφιλητά στ' άσπρα κεντήματα της φούστας του. Η Αλεξάνδρα και ο Αντώνης, ακίνητοι, τον κοίταζαν με όλη την αυστηρότητα που άξιζε το έγκλημα του. Η Πουλουδιά όμως, ίσως γιατί ήταν πιο μικρή και είχε τα κλάματα πιο εύκολα, ίσως γιατί ο Αλέξανδρος, στους καβγάδες, ήταν πάντα κόμμα της, η Πουλουδιά ένιωσε να γεμίζουν και τα δικά της μάτια δάκρυα και ν' ανεβαίνει κάτι πνιγερό στο λαιμό της, και, σκύβοντας στις πέτρες της αυλής, έβγαλε τους βόλους της από την τσέπη της και άρχισε να παίζει μόνη της, ανοίγοντας όσο μπορούσε πλατύτερα τα μάτια της, για να στεγνώσουν πριν στάξουν τα δάκρυα. Εκείνη τη στιγμή ακούστηκε η φωνή της θείας:
- Αλεξάνδρα! Αντώνη!... Πού είναι τα παιδιά; Και πού είναι η μις Ράις;
Τα τέσσερα αδέλφια ανορθώθηκαν. Η Πουλουδιά πέταξε χάμω όλους της τους βόλους και τίναξε τα σκονισμένα χέρια της, η Αλεξάνδρα έτρεξε στον Αλέξανδρο, του κατέβασε και του έσιαξε την τσαλακωμένη του φούστα και με το χέρι βιαστικά βρούτσισε στην κανονική τους θέση τα κάπως ανακατωμένα ξανθά του κατσαρά, ο Αντώνης, παρατώντας το σκοινί όπου κουνιούνταν κρεμαστός, έβαλε τα χέρια του στις τσέπες και κοίταξε, σα να τον ανακάλυψε πρώτη φορά, ένα βασιλικό φουντωμένο στη γλάστρα του. Και η θεία, κοντή, στρογγυλή, παχιά, ευκίνητη όμως κι ελαφριά σαν μπάλα λαστιχένια, βγήκε στην αυλή. Μόλις είχε φθάσει απέξω. Φορούσε ακόμα το καπέλο και τα γάντια της.
Έριξε γύρω της μια γοργή ματιά, που περιτύλιξε και τα τέσσερα αδέλφια μεμιάς, και είπε:
- Μόνοι σας; Πού είναι η μις Ράις;
- Πήγε στην κάμαρα της... άρχισε η Αλεξάνδρα. Μα τη διέκοψε η θεία:
- Γιατί;
- Ήταν άρρωστη και...
- Δε βγήκε μαζί σας; διέκοψε πάλι η θεία.
- Ναι, βγήκαμε. Μα, σα γυρίσαμε, είπε πως ήταν άρρωστη... Βήματα ακούστηκαν από μέσα και ο θείος Ζωρζής βγήκε στην πόρτα, κοντός, στρογγυλός, παχύς, με το αγαθό του χαμόγελο που ξανάνιωνε το σταχτί του κεφάλι και τ' άσπρα του φρύδια.
- Η μις Ράις είναι πάλι άρρωστη, είπε η θεία γυρνώντας σ' εκείνον.
- Άρρωστη; Τι έπαθε! Καλώς τα παιδιά! Ελάτε στη βεράντα, που ήλθε η θεία Αργίνη με τον Γιάννη...
Μια φωνή της θείας τον διέκοψε:
- Καλέ, τι είναι αυτά; Τι είναι αυτές οι βρώμες στην αυλή μας; Ποιος έμπασε κατσίκες εδώ;
Όλοι γύρισαν σαστισμένοι.
Σκυμμένη εμπρός, σηκώνοντας με τα δυο της χέρια τις φούστες της, στις μύτες των ποδαριών της, σα να φοβούνταν μη λερωθεί πατώντας ολόκληρα τα παχιά της ποδαράκια, κοίταζε η θεία με φρίκη και αηδία το θησαυρό της Πουλουδιάς σκορπισμένο στις πλάκες.
- Ποιος έβαλε μέσα κατσίκες; επανέλαβε. Και φώναξε:
- Ειρήνη!
Στο παράθυρο της κουζίνας παρουσιάστηκε το συγυρισμένο κεφάλι της μαγείρισσας.
- Ορίστε, κυρία!
- Ποιος έμπασε κατσίκες στην αυλή μας;
- Κατσίκες;
Έσκυψε να δει εκεί που έδειχνε το αμείλικτο δάχτυλο της θείας.
- Πωπώ! έκανε.
Και υποψιάρικα πρόσθεσε:
- Μην τις έβαλε μέσα ο Αντώνης;
- Εγώ; Όχι! έκανε ξαφνισμένος ο Αντώνης. Μα πού είναι οι κατσίκες;
- Έ, ανόητε! είπε γελώντας ο θείος. Οι κατσίκες ξανάφυγαν, μ' άφησαν πίσω τους τα... τα σημάδια τους! πρόσθεσε με καινούριο ξεκάρδισμα.
Την ίδια ώρα εμφανίζουνταν η Ειρήνη με σκουπάκι και φαράσι. Και μουρμουρίζοντας και γρινιάζοντας «Τι βρώμες... πωπώ... τι αηδίες, στις παστρικές μας πλάκες κιόλα...», μάζεψε όλους τους βόλους της Πουλουδιάς, γοργά, στο φαράσι της. Μα η Πουλουδιά δε στάθηκε να δει και ν' ακούσει το τέλος της ιστορίας. Από τα πρώτα λόγια του θείου, σαν κατάλαβε τι ήταν ο θησαυρός της, τρομαγμένη κοίταξε τ' αδέλφια της. Αντάμωσε την περιφρονητική ματιά της Αλεξάνδρας, το κοροϊδευτικό σήκωμα των φρυδιών του Αντώνη, το ξαφνισμένο, όλο ρωτήματα μουτράκι του Αλέξανδρου και, βουλιάζοντας κάτω από το βάρος της ντροπής, παρακαλώντας μέσα της να την καταπιεί η γη, δίπλωσε τους ώμους της, χώθηκε σιγά στο κούφωμα της πόρτας και, ξεγλιστρώντας πίσω από το θείο, έτρεξε στη σκάλα, ανέβηκε δυο δυο, μπήκε στην κρεβατοκάμαρα της, που ήταν όλων των αδελφών κάμαρα, και κρύφθηκε πίσω από την κουνουπιέρα της.
Η καρδιά της βροντούσε, όχι πια ταμπούρλο αλλά γκρανκάσα. Τώρα θα ρωτήσει η θεία. Και τώρα θ' απαντήσει ο Αντώνης που δεν έλεγε ποτέ ψέματα: «Ναι, τις βρώμες αυτές τις έφερε η Πουλουδιά!» Και δεν ήταν μόνο αυτό, μα που θα πει: «Γιατί τις πήρε για βόλους!» Και θα την περιγελάσουν όλοι. Αχ, τι φοβερό να την περιγελάσουν όλοι!
Και τα 'πιασε με τα χέρια της, αυτά... Πουφού! τι αηδία! Και θα τη μαλώσει η θεία... και θα της δώσει κανένα μπάτσο... Δεν την έμελε ο μπάτσος, το παχύ χεράκι της θείας δεν πονούσε πολύ, μα η ντροπή, η ντροπή! Και αυτή την ώρα θα τα λέγανε κάτω. Και ήταν κάτω η θεία Αργίνη και ο εξάδελφος ο Γιάννης! Και θα κορόιδευε ο Γιάννης...
Αυτό ήταν περισσότερο απ' ό,τι μπορούσε να υποφέρει. Σαν τον Αλέξανδρο πρωτύτερα, ξέσπασε κι εκείνη στα κλάματα. Και τόσο δυνατά έκλαιγε, ώστε δεν άκουσε τον Αντώνη που ανέβηκε και μπήκε στην κάμαρα. Μα την άκουσε κείνος και παραμερίζοντας την κουνουπιέρα, τη βρήκε ζαρωμένη στη γωνία της.
- Γιατί κλαις; τη ρώτησε περιφρονητικά.
Ο Αντώνης είχε βαθιά περιφρόνηση για τα κορίτσια, γιατί, λέει, κλαιν για το τίποτα. Εκείνος, σαν αγόρι που ήταν, δεν έκλαιγε ποτέ, όσο και να χτυπούσε, όσο και να πονούσε. Και ούτε σαν έπεσε από τη σκάλα της βεράντας κι έσπασε το κεφάλι του κι έτρεχαν αίματα και του το κόλλησε ο θείος με τσιρότο, πάλι δεν έκλαψε. Οι αδελφές του του είχαν μεγάλο θαυμασμό γι' αυτό. Και του είχαν και κάποιο σεβασμό, σα να πούμε, ντρέπονταν να κλαιν μπροστά του. Και τώρα που την τσάκωσε την Πουλουδιά αναλυμένη στα κλάματα, ντράπηκε κείνη πιο πολύ. Μα πάλι δεν έκανε να το δείξει και σηκώθηκε χωρίς ν' αποκριθεί. Και της είπε ο Αντώνης:
- Είσαι μια κουτή! Λερώνεις την αυλή μας και ύστερα κλαις κιόλα!
- Δεν κλαίγω γι' αυτό, είπε πειραγμένη η Πουλουδιά.
- Αμέ γιατί κλαις;
- Γιατί... Στάθηκε να σκεφθεί ποιαν αιτία να προτιμήσει. Και αποφάσισε: Γιατί θα με μαλώσει η θεία και θα μου δώσει κι έναν μπάτσο!
- Φοβητσιάρα! έκανε ο αδελφός της. Η Πουλουδιά επαναστάτησε.
- Δε φοβούμαι! διαμαρτυρήθηκε. Και πρώτον το ξέρεις πως δεν πονεί το χέρι της θείας!
- Αμέ τότε;
- Έτσι! Δε μ' αρέσει να με δέρνουν!
Ο Αντώνης σήκωσε τους ώμους του και πήγε στην μπαλκονόπορτα και πιάνοντας την κουπαστή του μπαλκονιού, άρχισε να κλοτσιά το ξύλινο περίφραγμα.
- Εσείς τα κορίτσια όλο αφορμές γυρεύετε για να κλαίτε, είπε περιφρονητικά. Και τώρα βρίσκεις αφορμή πως θα σε δείρει η θεία, χωρίς να ξέρεις τίποτα.
- Αφού το ξέρω πως θα με δείρει! είπε η Πουλουδιά που είχε βγει και αυτή στο μπαλκόνι και είχε πιάσει και αυτή την κουπαστή και κλοτσούσε το ξύλινο περίφραγμα.
- Τίποτα δεν ξέρεις! Γιατί θα σε δείρει;
- Μα δεν της είπες πως εγώ έφερα τους βόλ... δηλαδή... αυτά, έκανε με αηδία.
- Βέβαια όχι... αφού δε με ρώτησε.
Από τη σαστισμάδα της σταμάτησε η Πουλουδιά το κλοτσοκόπημα. Η χαρά και η ανακούφιση την πλημμύρισαν. Της ήλθε να φιλήσει τον Αντώνη. Μα πάλι δεν το καταδέχθηκε. Ούτε του είπε ευχαριστώ. Έκανε την αδιάφορη και είπε:
- Α, καλά, αν είναι έτσι...
Μα θα το κατάλαβε ο Αντώνης, γιατί η φωνή της δεν ήταν πια κλαψιάρικη. Την κοίταξε από πάνω από τον ώμο του και της είπε:
- Μ' έστειλε η θεία Αργίνη να σε φωνάξω. Μα είναι το πρόσωπο σου σιχαμένο... σκούπισες τα μάτια σου με βρώμικα χέρια... που πιάσανε τους βόλους σου... πουφού! τι βρώμες!
- Καθόλου! φώναξε αγανακτισμένη η Πουλουδιά.
- Πώς καθόλου; Κοίταξε το πρόσωπο σου στον καθρέφτη!
Φουρκισμένη πήγε κείνη στο νιφτήρα, έχυσε νερό στη λεκάνη και, αποφεύγοντας τον καθρέφτη μπροστά της, βιαστικά σαπούνισε χέρια και πρόσωπο. Ο Αντώνης την είχε ακολουθήσει. Με το δάχτυλο, κοροϊδευτικά, της έδειξε τις μαυριδερές σαπουνάδες της λεκάνης.
- Όλα αυτά είναι πάστρες, είπε, είναι οι πάστρες που βγαίνουν από τους βόλους της δεσποινίδας...
Ένας μπάτσος του βρεγμένου χεριού της «δεσποινίδας» του έκοψε τη φόρα. Γύρισε ο Αντώνης και την άρπαξε από τα κατσαρωμένα της φουντωτά μαλλιά. Και ακολούθησε μάχη άγρια, αλλά σιωπηλή, χωρίς φωνές, με σφιγμένα δόντια, μην ακούσει η δασκάλα στην πλαγινή κάμαρα κι έλθει και ανακατωθεί. Τους καβγάδες τους τ' αδέλφια τούς έβγαζαν πέρα μονάχα, χωρίς ανάμειξη των μεγάλων. Κάθε φορά που ανακατώνουνταν οι μεγάλοι, τα πράματα χειροτέρευαν και, μετά τον καβγά, έμεναν τ' αδέλφια μαλωμένα. Ενώ, όταν τα 'βγαζαν πέρα μονάχα, μια φορά που τελείωνε η μάχη, γαλήνευε πάλι ο ουρανός.
Αυτό δεν εμπόδιζε τις φοβέρες την ώρα της μάχης. Και τώρα, παλεύοντας με τον αδελφό της, νιώθοντας πως τις τρώγει από το μεγαλύτερο της, σφίγγοντας με λύσσα τα δόντια της, είπε η Πουλουδιά:
- Θα πω του θείου πως μου τράβηξες τά μαλλιά! Επίσης χαμηλόφωνα, πνιγμένα, της αποκρίθηκε ο Αντώνης:
- Κι εγώ θα πω της θείας πως εσύ έφερες τις κατσικίσιες... ξέρεις τι, στην αυλή μας!
Αμέσως παράτησε η Πουλουδιά τη μάχη.
- Αν το πεις, θα είσαι μαντατούρης! του είπε.
- Εσύ είσαι η μαντατούρα!
- Καθόλου! Εγώ δε μαντατεύω!
- Ουτ' εγώ δε μαντατεύω. αν δε μαντατέψεις εσύ!
Αυτό ήταν το τέλος του καβγά. Χωρίς άλλες εξηγήσεις χωρίστηκαν τ' αδέλφια, βρουτσίστηκαν, συγυρίστηκαν και ειρηνεμένα, κατέβηκαν στη βεράντα.
Κάτω, στη βεράντα, γύρω σ' ένα σιδερένιο τρίποδο τραπεζάκι, όλοι ήταν συναγμένοι, η θεία Μαριέτα, σαν πάντα, στην κουνιστή μαύρη της πολυθρόνα, ο θείος Ζωρζής κάπνιζε ειρηνικά το ναργιλέ του, κρατώντας μες στο δικό του το χέρι του Αλέξανδρου, που κάθουνταν φρόνιμα σ' ένα ψάθινο σκαμνί. Η Αλεξάνδρα, όρθια, με την πλάτη στην κουπαστή της βεράντας, κοίταζε σιωπηλά τη θεία Αργίνη μισοξαπλωμένη σε μια ψάθινη βαθιά πολυθρόνα, και τον Γιάννη, ένα αγόρι δώδεκα χρονών, που όρθιος και αυτός και ακατάδεχτος, ακουμπισμένος στον τοίχο με τα χέρια πίσω, κοίταζε πάνω από το κεφάλι της τη θάλασσα και δε μιλούσε σε κανένα.
Η θεία Αργίνη, αν και αδελφή της θείας Μαριέτας, δεν της έμοιαζε καθόλου. Ψηλή, λεπτή, με μάτια μαύρα που σε χάιδευαν και χέρια μαλακά σα μετάξι, με στόμα που χαμογελούσε πάντα και φρύδια που δε σουφρώνουνταν ποτέ, ήταν για τα τέσσερα αδέλφια το άκρον άωτον της ομορφιάς. Φορούσε ένα καφετί φουστάνι με κίτρινο πλαστρόνι, ανοιχτό στο λαιμό, και ψάθινο καπέλο τουρλωτό, όπου σκαρφάλωναν πλαγίως λουλούδια του αγρού, και χαμογελούσε πότε της Αλεξάνδρας και πότε του Αλέξανδρου, χαδιάρικα, σα μαμά, μ' ένα χαμόγελο που έστριφτε γλυκά λίγο πλάγια στο στόμα της. Η θεία Μαριέτα, που είχε βγάλει πια γάντια και καπέλο, κουνιούνταν στην πολυθρόνα της και αναπολούσε την ακρίβεια των μαγαζιών, όπου πάλι είχε ψουνίσει παπούτσια για το κατελυτήρι αυτό, τον Αντώνη, που τρύπησε πάλι τα δικά του, πριν κλείσει ο μήνας.
Το κατελυτήρι εκείνη την ώρα έβγαινε στη βεράντα, με τα μαντατούρικα τριμμένα μπροστά παπούτσια του και πριν προφθάσει να βγει από τη μέση και να ξεσκεπάσει την Πουλουδιά, που κατάφθανε πίσω του, τον έπιασε η θεία Μαριέτα και, σηκώνοντας το πόδι του, έδειξε της θείας Αργίνης τη μύτη του παπουτσιού.
- Βλέπεις; Σε τέτοια θηρία χρειάζονται σιδερένια ποδήματα! είπε.
Η θεία Αργίνη, που με το λίγο στραβό χαμόγελο της έγνεφε της Πουλουδιάς, για να την εγκαρδιώσει να ξεκολλήσει από τη γυάλινη πόρτα και το πόμολο της, και συνάμα άπλωνε το χέρι της ν' αγκαλιάσει τον Αντώνη, είπε γλυκά:
- Όχι δα, καημένη! Αρκεί να πεις του τσαγκάρη να προσθέσει ένα σιδεράκι στις μύτες, όπως κάνω εγώ για τα δικά μου αγόρια, και ιδίως για τον Γιάννη που είναι και αυτός κατελυτήρι.
Και χαμογέλασε του Γιάννη κοντά της, έτσι που της φάνηκε της Πουλουδιάς πως άλλαξε έννοια η λέξη κατελυτήρι κι έγινε έξαφνα χάδι.
- Εγώ, είπε αργότερα η Αλεξάνδρα στ' αδέλφια της, αν είχα τη θεία Αργίνη μαμά, δε θα έκανα ποτέ αταξίες, για να μη λυπάται. Ενώ ο Γιάννης, που είναι κι έτσι μεγάλος, κάνει όλη την ώρα αταξίες.
- Πού το ξέρεις; ρώτησε ο Αντώνης, που ένιωσε το αγορίστικο γόητρο να κινδυνεύει.
- Το είδα! αποκρίθηκε η Αλεξάνδρα. Και πρώτον είχε σχίσει το παντελόνι του και στέκουνταν όλη την ώρα ακουμπισμένος στον τοίχο, για να μην τον δει κανείς και τον μαλώσει η μαμά του. Μα εγώ το κατάλαβα. Και όταν έφευγε, εγώ το είδα!
- Ο Γιάννης δε θα φοβάται τη μαμά του, γιατί ποτέ δεν τον μαλώνει, είπε μελαγχολικά η Πουλουδιά.
- Πού το ξέρεις; ρώτησε πάλι ο Αντώνης, χολιασμένος που τόσα παρατήρησαν τα κορίτσια, εκεί που αυτός δεν είχε δει τίποτα.
- Εγώ το ξέρω! είπε η Πουλουδιά σείοντας το φουντωτό της κεφάλι.
- Τίποτα δεν ξέρεις! Ούτε μίλησες του Γιάννη!
- Όχι, μα το είδα όταν τον κοίταξε η θεία Αργίνη.
- Δεν είδες τίποτα! Κοροφέξαλα!
- Εγώ όμως είδα, είπε η Αλεξάνδρα, και ξέρω πως είναι πολύ κακό παιδί ο Γιάννης! Ήταν και τα δυο του χέρια τόσο βρώμικα, που τα έκρυβε πίσω στην πλάτη του και όλο κουνούσε τα δάχτυλα του, και όλο μαδούσε τον τοίχο της βεράντας κι έτριβε ύστερα το σοβά στα χέρια του, για να βγάλει τις μουντζούρες και τα μελάνια.
- Πώς το ξέρεις; ρώτησε όλο και πιο ερεθισμένος ο Αντώνης. Αφού ήταν τα χέρια του πίσω του!
- Έβλεπα κάθε λίγο σκόνες και πετραδάκια που έπεφταν από τη ράχη του. Και, σαν έφυγαν, πήγα και κοίταξα τον τοίχο και είδα πως τον είχε μαδήσει. Και είχε και δαχτυλιές μαύρες.
Το πράμα άρχισε να γίνεται ενδιαφέρον. Ο Αντώνης παράτησε τα κακιώματα.
- Και τι είπε η θεία Μαριέτα; ρώτησε.
- Δεν το είδε. Δεν κοίταξε από κει. Και ήταν πια σούρουπο σαν έφυγαν. Μα θα το δει αύριο και θα πει πως το 'κανες εσύ!
Ο Αντώνης δε μίλησε. Ανήσυχη τον κοίταξε η Πουλουδιά.
- Τι θα κάνεις, Αντώνη;
- Θα της πω πως δεν το έκανα.
- Δε θα το πιστέψει! Να της πεις την αλήθεια, πως το 'κανε ο Γιάννης.
Μια στιγμή δεν αποκρίθηκε ο Αντώνης. Συλλογίζουνταν. Ύστερα είπε:
- Δε θα το πω!
- Μα θα σε δείρει!
Με αδιαφορία σήκωσε ο Αντώνης το δεξί του ώμο.
- Ας με δείρει! έκανε.
Τα κορίτσια τώρα τον κοίταζαν με θαυμασμό. Να, κάτι τέτοια είχε ο Αντώνης που τις έκανε να αισθάνονται κουτές, φοβητσιάρες και ανάξιες και να δέχονται την επιβολή του σα δίκαια. Ως την ώρα που γίνουνταν τυραννικός, και τότε αυτές επαναστατούσαν. Ο Αλέξανδρος όμως, που καθισμένος στο πάτωμα παρακολουθούσε όλη αυτή τη συζήτηση, κοιτάζοντας πότε τον έναν, πότε την άλλη, καταπώς έπαιρναν το λόγο τ' αδέλφια του, συγκινήθηκε.
- Όχι, Αντώνη, παρακάλεσε και το στόμα του έτρεμε, έτοιμο να ξεσπάσει στα κλάματα, πες πως το έκανε ο Γιάννης, μη σε δείρει η θεία, όπως τη μέρα που έριξε ο αέρας κάτω τη στάμνα κι εκείνη νόμιζε πως την έσπασες εσύ!
Ο Αντώνης τώρα είχε φθάσει στην ακμή του ηρωισμού και της αυτοθυσίας. Θυμήθηκε κείνο το ξύλο, θυμήθηκε το παχουλό χέρι της θείας, που δεν πονούσε και πολύ, και είπε ρίχνοντας πίσω το κεφάλι του:
- Εγώ μαντατούρης δε γίνομαι!
Όλοι σώπασαν υποταγμένοι. Αυτός ο Αντώνης άξιζε να είναι αρχηγός τους και ας ήταν η Αλεξάνδρα μεγαλύτερη του. Και όλο κείνο το βράδυ τα όρισε και τα κυβέρνησε τ' αδέλφια του σαν απόλυτος άρχοντας, ως την ώρα του κρεβατιού και του ύπνου. Και το άλλο πρωί, εκτός από τις ώρες που γίνουνταν τα μαθήματα, πάλι όρισε και διεύθυνε τα παιχνίδια, σα δικτάτορας που δε δέχεται ούτε ν' ακούσει άλλου γνώμη. Τα κορίτσια άρχισαν να δυσανασχετούν. Παραμάκραινε η μοναρχία του Αντώνη, προπάντων που η θεία δεν είχε δει το μουντζουρωμένο και μαδημένο τοίχο, κι έτσι δεν του έδωσε αφορμή να δείξει, με τον ηρωισμό του, πως ήταν άξιος άλλη μια μέρα να επιβληθεί στ' αδέλφια του. Τα πράματα άρχισαν να θολώνουν και θα ξεσπούσε βέβαια επανάσταση, αλλά ήλθε μήνυμα από τη θεία Αργίνη να παν τ' απόγεμα και τα τέσσερα αδέλφια με τη δασκάλα, να παίξουν με τα δικά της τα επτά παιδιά, πως θα έβγαινε κείνη έξω, πως θα έλειπε και ο θείος ο γιατρός και πως τα παιδιά θα έχουν σπίτι και αυλή δικά τους, να τρέξουν, αν θέλουν, και να φωνάξουν και να τραγουδήσουν όσο το τραβούσε η καρδιά τους. Το μήνυμα αυτό σκόρπισε τα σύννεφα, γαλήνεψε τα πρόσωπα, η επανάσταση έγινε καπνός και η ομόνοια βασίλεψε ανάμεσα στα τέσσερα αδέλφια, χωρίς μονάρχες και υποτακτικούς.
Μα λίγην ώρα βάσταξε η μπουνάτσα. Όταν έμαθε η μις Ράις πως τα επτά παιδιά της θείας Αργίνης δεν είχαν ούτε δασκάλισσα Εγγλέζα ούτε νταντά, αρνήθηκε να πάγει και πρόσταξε τα τέσσερα αδέλφια να ζητήσουν να παν περίπατο, να πουν πως το προτιμούν παρά να παν στη θεία. Και η επανάσταση που είχε γίνει καπνός, ξανάγινε μπαρούτι. Άρχισε με διαμαρτυρίες, εξελίχθηκε σε ξύλο και το χέρι της Εγγλέζας ήταν πιο βαρύ και πιο σκληρό από το χεράκι της θείας Μαριέτας, και πνίγηκε σε ποτάμια από δάκρυα, που ολοένα ανάβρυζαν αστέρευτα από τρία ζευγάρια μάτια συνάμα. Μόνος ο Αντώνης δεν έκλαψε, γιατί ο Αντώνης δεν έκλαιγε ποτέ. Αλλά έσφιξε τα δόντια του με λύσσα και είπε της δασκάλας:
- Είσαι κακιά γυναίκα!
Και αυτό τα κατέστρεψε όλα. Καλύτερα να είχε κλάψει σαν τα κορίτσια ή σαν τον Αλέξανδρο.
- Θα είχες βρει το δίκιο σου! τον βεβαίωσε η Αλεξάνδρα. Μα δε βρήκε το δίκιο του ούτε κείνος ούτε οι αδελφές του ούτε και ο μικρός Αλέξανδρος που, βαλμένος στη γωνιά με πρόσωπο κατά τον τοίχο, κλαίγοντας και αναστενάζοντας μουρμούριζε σιγά σιγά, για να τ' ακούσει μόνος ο τοίχος:
- Και όμως, η μις Ράις είπε ψέματα!
Όσο για τ' άλλα τρία αδέλφια, ούτε πρόφθασαν να δικαιολογηθούν. Δικάστηκαν και καταδικάστηκαν χωρίς απολογία. Γιατί είχε ακούσει το θόρυβο η θεία και είχε μπει στο σπουδαστήριο των αδελφών όπου, με άτακτα μαλλιά και το πρόσωπο αναμμένο, ο Αντώνης βαστούσε... -τι φρίκη!- ναι, ο Αντώνης βαστούσε, ψηλά πάνω από το κεφάλι του, τα δυο χέρια της μις Ράις. Άκουσε την πόρτα η μις Ράις και, με τα χέρια ακόμα αιχμαλωτισμένα στα χέρια του Αντώνη, γύρισε, είδε τη θεία και φώναξε:
- Καμαρώστε τ' ανίψια σας! Ιδού με τι τρόπο γίνεται το μάθημα κάθε μέρα!
Η παρουσία της θείας σταμάτησε κάθε κίνηση των αδελφών, επιθετική όσο και αμυντική. Μόνο τα δάκρυα δεν μπόρεσαν να σταματήσουν απότομα, και τα πνιγμένα αναφιλητά του Αλέξανδρου έκοβαν κάπου κάπου την τέλεια σιωπή που ξαφνικά είχε χυθεί στην κάμαρα. Και πήρε αργά η θεία μια καρέγλα και κάθισε. Και ύστερα, με σουφρωμένα φρύδια, ρώτησε:
- Τι τρέχει, μις Ράις;
Τα σουφρωμένα φρύδια της θείας Μαριέτας, που έμοιαζαν τόσο με τα σουφρωμένα φρύδια του πατέρα, όταν ήταν θυμωμένος, είχαν την ιδιότητα να σκορπούν βούβα και υποταγή γύρω της, όχι μόνο με τα τέσσερα αδέλφια, αλλά και με την Αφροδίτη και με την κερα-Ρήνη, ακόμα και με το θείο Ζωρζή, που σε τέτοιες ώρες, χωρίς ν' απαντήσει, δίπλωνε τους ώμους του κι έπαιρνε το καπέλο του κι έβγαινε έξω. Και μες στη σιωπή που είχε ακολουθήσει την ανεμοζάλη, ακούστηκε η φωνή της Εγγλέζας που έλεγε:
- Δεν μπορώ να εξακολουθήσω να διδάσκω παιδιά που μου είπαν: «Είσαι κακιά γυναίκα»!
Τα καστανά μάτια της θείας Μαριέτας, που γίνουνταν μαύρα κάτω από τα σουφρωμένα της φρύδια, περιπλανήθηκαν στα τέσσερα σκυφτά κεφάλια των ανιψιών της και στάθηκαν στον Αντώνη. Και ρώτησε:
- Ποιος είπε αυτή τη λέξη;
- Ποιος άλλος; Ο Αντώνης φυσικά! Και το κακό είναι που παρασύρει και τις αδελφές του και ακόμα και τον Αλέξανδρο που τόλμησε να μου πει: «Μη φωνάζεις»! Εγώ δεν τ' ανέχομαι αυτά!
Η θεία δε μίλησε αμέσως. Κοίταζε τ' ανίψια της που άφωνα περίμεναν την καταδίκη τους.
- Πρέπει να πέρασαν πολλές ώρες! είπε αργότερα η Αλεξάνδρα στ' αδέλφια της. Τα γόνατα μου κουράστηκαν τόσο, που κόντευα να πέσω!
Δεν έπεσε κείνη. Μα έπεσε ο κεραυνός στο κεφάλι τους. Και είπε η θεία:
- Δεν έχει να πάτε στη θεία Αργίνη τ' απόγεμα! Θα βγείτε περίπατο με τη μις Ράις! Και ούτε το μεσημέρι ούτε το βράδυ δε θα φάγει κανένας σας φρούτο! Και τώρα, ο κύριος Αλέξανδρος να πάγει στη γωνιά με το πρόσωπο στον τοίχο, ο δε κύριος Αντώνης να έλθει μαζί μου, ν' ανέβει στη σοφίτα και να μείνει μονάχος, κλεισμένος ως την ώρα του τραπεζιού.
- Μάλιστα! Τέτοια κάνουν αυτές οι ξένες, τέτοιες ψευτιές λεν κι έτσι τυραννούν τα παιδιά! Και το κάνουν πάντα! δήλωσε ο Αντώνης το απόγεμα, όταν με τ' αδέλφια του και τη δασκάλα βγήκε από την αυλή τους.
Γύρισε η Εγγλέζα και τον αγριοκοίταξε.
- Σπίκ Ίγκλις! πρόσταξε με θυμό.
Παρακάτω, εμπρός στην αυλή του μεγάλου σπιτιού, είδαν τ' αδέλφια τέσσερις πέντε αξιωματικούς και κυρίες που κάθουνταν γύρω σ' ένα τραπέζι στρωμένο φλιτζάνια και μπισκότα. Ο Αντώνης συμμαζεύθηκε αμέσως. Είχε αναγνωρίσει το βασιλέα, με τον Ντον ξαπλωμένο στα πόδια του, και τη βασίλισσα, που φορούσε ένα άσπρο φόρεμα μ' ένα μαύρο βελούδο στα μαλλιά. Φρόνιμα, σα στρατιώτες πέρασαν τα τέσσερα αδέλφια, με τεντωμένες τις ράχες τους, εμπρός στο βασιλικό τραπέζι. Πετάχθηκε πάνω ο Ντον και άρχισε να πηδά γύρω τους και τρόμαξε τον Αλέξανδρο. Τον φώναξε όμως πίσω ο βασιλέας και γέλασε και είπε του Αλέξανδρου:
- Μη φοβάσαι, μικρέ! Είναι καλός και δε δαγκώνει!
Και ντροπιασμένος χώθηκε ο Αλέξανδρος πίσω από τη δασκάλα, και οι τρεις μεγάλοι, ταπεινωμένοι από τη δειλία του αδελφού τους, πέρασαν κάνοντας τους αδιάφορους.
- Αυτός ο Αλέξανδρος πάντα θα μας ντροπιάζει! είπε ελληνικά ο Αντώνης, σα γύρισαν στο δρόμο. Δε φθάνει που είπε χθες «Βρε συ» στον αξιωματικό...
- Σπίκ Ίνγκλις! φώναξε άγρια η δασκάλα.
Μα τ' αδέλφια είχαν αποφασίσει, πριν βγουν από την αυλή τους, να μην της πουν ούτε λέξη όλο τ' απόγεμα και να μη μιλήσουν καθόλου αγγλικά μεταξύ τους, ώσπου να πλαγιάσουν το βράδυ. Κι έτσι σιωπηλά ανέβηκαν στο λόφο, κάθισαν στις πέτρες, σταύρωσαν χέρια και πόδια και, με σφιγμένα χείλια και πεισμωμένα πρόσωπα, κοίταζαν τη θάλασσα με τα καραβάκια της. Ώσπου τους γύρισε τη ράχη η δασκάλα κι έβγαλε κρυφά την μποτίλια της και άνοιξε το βιβλίο της. Ένα ένα σηκώθηκαν τότε τ' αδέλφια, κατέβηκαν στο δρόμο και κάθισαν στη σκόνη, κάνοντας κύκλο, να συζητήσουν την κατάσταση και να οργανώσουν την αντίσταση που στο μέλλον έπρεπε να είναι γενική, αδιάκοπη και αμείλικτη, χωρίς όμως και να μπορεί η δασκάλα να βρει πάτημα για μαντατέματα.
- Εγώ, είπε ο Αντώνης, αν ξαναδοκιμάσει ποτέ να με δείρει, δε θα της πω πια «Κακιά γυναίκα», μα θα σηκωθώ και θα βγω από την κάμαρα χωρίς να της μιλήσω.
- Κι εγώ! είπε ο Αλέξανδρος που ήθελε να εξιλεωθεί από την πρωτυτερινή του τρομάρα και το χθεσινό του αμάρτημα απέναντι του αξιωματικού. Η Αλεξάνδρα τον μέτρησε με μια ματιά, τόσο μικρούτσικος που ήταν, και είπε:
- Ναι! Εσύ! Εσένα θα σε στρώσει μπρούμυτα στα γόνατα της, όπως πάντα, και θα σου τις βρέξει, χωρίς να μπορείς εσύ να κάνεις τίποτα!
Τα μάτια του Αλέξανδρου βούρκωσαν με την ενθύμηση του «πάντα» και του «βρεξίματος» και τα χείλια του άρχισαν να τρέμουν. Προστατευτικά έριξε ο Αντώνης το χέρι του πάνω στους ώμους του μικρού του αδελφού.
- Έννοια σου, του είπε μεγαλόψυχα, εγώ θα σε πάρω από το χέρι και θα σε πάγω έξω μαζί μου!
- Κι εγώ θα πάγω ίσια στη θεία και θα της πω: «Θεία, η μις Ράις θέλει να μας δείρει»... είπε η Αλεξάνδρα που αισθάνουνταν το θάρρος της να μεγαλώνει με κάθε λέξη που ανταλλάζουνταν. Και να δούμε τότε τι θα πει αυτή, σαν τη μαλώσει η θεία.
Μελαγχολικά είπε η Πουλουδιά:
- Η θεία δε θα τη μαλώσει! Θα σε δείρει εσένα!
Όλοι σώπασαν συλλογισμένοι. Μπορεί να ήταν σωστό αυτό που έλεγε η Πουλουδιά. Και βλέποντας την εντύπωση που έκαναν τα λόγια της στ' αδέλφια της, πήρε φόρα η Πουλουδιά και πρόσθεσε:
- Καλύτερα να το πούμε στο θείο. Αυτός δε μας δέρνει ποτέ. Κι εκείνος θα την κάνει... θα την κάνει...
Δεν ήξερε τι θα την κάνει ο θείος, ώστε το άφησε ανείπωτο και ο καθένας μπορούσε να φανταστεί το χειρότερο για τη μις Ράις.
Μα είχε πάρει αέρα η Πουλουδιά, κουνούσε το κεφάλι της, μιλούσε σα μεγάλη κι έπρεπε να ξαναμπεί στη σειρά της.
- Ναι! Στο θείο! έκανε ο Αντώνης. Τι ανοησίες που λες! Θα του πει η θεία «Εσύ, Ζωρζή, μην ανακατώνεσαι» και θα πάρει ο θείος το καπέλο του και θα βγει έξω. Και αυτό μπορούσε να γίνει. Είχε ξαναγίνει και άλλοτε.
- Και τότε... πωπώ, τι έχομε να πάθομε από τη μις Ράις! είπε η Αλεξάνδρα.
Και όλο το ωραίο πρωτυτερινό της θάρρος καταγκρεμίστηκε και την έπιασε τρόμος, σα να ήλθε κιόλα η ώρα να τις φάγει.
- Πωπώ! έκανε επίσης τρομαγμένος ο Αλέξανδρος, κουνώντας απάνω κάτω το κεφάλι του.
Ο Αντώνης άπλωσε τα πόδια του και σήκωσε ένα σύννεφο σκόνη από την τροχιά του δρόμου.
- Τι θα μας κάνει; είπε ακατάδεχτα. Θα της πιάσω τα χέρια, όπως το πρωί, και θα την ντροπιάσω!
Η Πουλουδιά είχε ξαναπέσει στην απαισιοδοξία της.
- Και θα φωνάξει αυτή, και πάλι θα έλθει η θεία, και πάλι θα σε κλείσει στη σοφίτα! είπε με αθυμία.
Ως απάντηση, ο Αντώνης ξανακλότσησε τη σκόνη, σήκωσε δεύτερο σύννεφο και σηκώθηκε και αυτός.
- Σεις τα κορίτσια είστε φοβητσιάρες! είπε περιφρονητικά. Δε θα κάνετε ποτέ σας τίποτα!
Και χώνοντας τα χέρια στις τσέπες, άρχισε πάλι να σκαρφαλώνει στο λόφο.
- Τι φεύγεις; του φώναξε η Αλεξάνδρα. Δεν αποφασίσαμε τίποτα!
Μα ο Αντώνης είχε σκύψει και, ανακούρκουδα, γοργά, χώριζε τα ξερά κλαριά ενός θάμνου και πάλι πηδούσε παρακάτω, έπεφτε ανακούρκουδα και πάλι χώριζε άλλα κλαριά. Είχε βγάλει το καπέλο του και κάθε λίγο το κατέβαζε στα κλαριά, σα να ήθελε να τα καπακώσει. Η περιέργεια της Αλεξάνδρας την έκανε να ξεχάσει τα προσβλητικά λόγια του Αντώνη. Πετάχθηκε πάνω και με τ' αδέλφια της πήρε κι εκείνη τον ανήφορο. Μα ο Αντώνης όλο ξανασηκώνουνταν, όλο πηδούσε παραπέρα και όλο γύρευε μες στ' αγκάθια.
- Τι ψάχνεις; του φώναξε η Αλεξάνδρα.
Με τα δυο χέρια τής έγνεψε ο Αντώνης να μην πλησιάσει.
- Σσσστ! έκανε. Μια σαυρίτσα!
Και κατεβάζοντας τελευταία φορά το καπέλο του, φώναξε θριαμβευτικά:
- Την τσάκωσα! Γρήγορα! Γρήγορα! Ελάτε να με βοηθήσετε να την πιάσω! Ελάτε όλοι!
Ούτε η Αλεξάνδρα ούτε η Πουλουδιά δεν αγαπούσαν τις σαύρες. Μα ύστερα από τα προσβλητικά λόγια του Αντώνη πώς να το δείξουν; Κοίταξε η Αλεξάνδρα την Πουλουδιά και κοίταξε η Πουλουδιά την Αλεξάνδρα, και σιωπηλά, αλλά χωρίς βία, σίμωσαν τον Αντώνη. Ο Αλέξανδρος, διστακτικός, θεώρησε φρονιμότερο να μην πλησιάσει πολύ.
- Πιάστε το καπέλο μου... γρήγορα, και οι δυο σας! Πατήστε το με τα χέρια, τις άκρες, η μια από δω, η άλλη από κει! πρόσταξε αναμμένος ο Αντώνης. Προσέξτε μη σας φύγει!
Πάτησαν τα κορίτσια και, γονατιστός, ανάμεσα τους, ο Αντώνης έχωσε το χέρι κάτω από το καπέλο, πασπατεύοντας να πιάσει τη σαύρα. Φοβισμένη αυτή πετάγουνταν εδώ κι εκεί, γυρεύοντας να φύγει, και χτυπιούνταν στις πλευρές του καπέλου. Χτύπησε και την πλευρά που πατούσε η Πουλουδιά, τρόμαξε αυτή, έβγαλε μια φωνή και σήκωσε τα χέρια της. Και άνοιξε μια πόρτα κι έφυγε η σαύρα.
- Τι έκανες! φώναξε ο Αντώνης.
Και τέτοιες φωτιές έβγαζαν τα μάτια του, που θυμήθηκε η Πουλουδιά τα φρύδια της θείας Μαριέτας.
- Με... με χτύπησε η σαύρα... είπε μισοζαλισμένη και από το φόβο της σαύρας και από το θυμό του Αντώνη.
Έξω φρενών εκείνος της έδωσε μια σπρωξιά και ξανασήκωσε το χέρι. Μα δεν πρόφθασε να τη χτυπήσει και βροχή έπεσαν ξυλιές στους δικούς του ώμους, στο κεφάλι, στη ράχη, κόβοντας του φωνή και αναπνοή.
- Μις Ράις! ξεφώνισαν τα δυο κορίτσια τρομαγμένα.
Μα τι μις Ράις ήταν αυτή! Το καπέλο της ήταν στραβό στο κεφάλι της, τα μαλλιά της σκουλιά ξεχτένιστα, η φούστα της είχε στρίψει στο ένα πλάγι και τα μάτια της... πωπώ, τα μάτια της, θολά και κατακόκκινα, παράβγαιναν, θα 'λεγες, με τη μύτη της, ποιο να μοιάσει περισσότερο με παντζάρι. Και ανεβοκατέβαιναν τα χέρια της στο κεφάλι του Αντώνη, σαν της πλύστρας τον κόπανο στα ρούχα της μπουγάδας, και γύρευε κείνος να της ξεφύγει, μα πού! Τον είδε έξαφνα η Αλεξάνδρα αιματωμένο και φώναξε:
- Πουλουδιά! Να τον βοηθήσομε!
Τρομαγμένη έτρεξε και η Πουλουδιά να πιάσει με την αδελφή της τα χέρια της Εγγλέζας, όταν μια νυχιά τής γδέρνει το μάγουλο και τη γεμίζει και αυτήν αίματα. Βγάζει τις φωνές η Αλεξάνδρα, μπήγει τα κλάματα ο Αλέξανδρος, γυρίζει η δασκάλα να δει τι τρέχει και της ξεφεύγει ο Αντώνης, σέρνοντας μαζί του και την Πουλουδιά. Κάνει να τους κυνηγήσει η Εγγλέζα, σκοντάφτει και πέφτει χάμω και μένει σα ζαλισμένη. Παρακάτω μαζεύτηκαν όλα μαζί τ' αδέλφια και, σαν πιο μεγάλη, η Αλεξάνδρα τα κοίταξε στο πρόσωπο να δει από πού μάτωναν. Είχε ανοίξει η μύτη του Αντώνη κι έτρεχε άφθονο αίμα, και από το γδάρσιμο στο μάγουλο της Πουλουδιάς είχε πασαλειφθεί αίματα όλο της το πρόσωπο.
Τότε έβγαλε η Αλεξάνδρα το καθαρό μαντίλι της και σκούπισε το πρόσωπο της Πουλουδιάς, ύστερα και του Αντώνη, στέγνωσε το κλαμένο πρόσωπο του Αλέξανδρου και, λίγο σαστισμένη ακόμα από την αντάρα που είχε πέσει απάνω τους, πήρε τ' αδέλφια της και κάθισαν στο χώμα να συνέλθουν. Ωστόσο είχε συνέλθει και η δασκάλα από το πέσιμο της. Σηκώθηκε με δυσκολία και, με το καπέλο της ακόμα πιο στραβό και μισοξεκούμπωτη τη φούστα της, κατασκονισμένη και σκοντάφτοντας, πλησίασε τ' αδέλφια και τους είπε, μιλώντας αργά και δύσκολα:
- Πάμε στο σπίτι... Κάνατε πο... πολύ δρόμο, παι... παιδιά μου... και κουραστήκατε... όχι;
Κοιτάχθηκαν τ' αδέλφια. Τι άλλαξε και τους μιλούσε γλυκά; Και πώς δεν ξανάρχισε το ξύλο; Σηκώθηκαν ευθύς και ακολούθησαν τη δασκάλα, που, βαστώντας το χέρι του Αλέξανδρου, κατέβαινε προς το δρόμο.
Μα ήταν ξεκούμπωτη η φούστα της και σκάλωνε στα πόδια της και κάθε λίγο σκόνταφτε και της ξέφευγε το χέρι του Αλέξανδρου, κι εκείνη ύστερα ξεχνούσε να το ξαναπιάσει κι έμενε ο Αλέξανδρος πίσω. Τον άκουσε η Αλεξάνδρα που έκλαιγε, γιατί ήταν, λέει, κουρασμένος, και γύρισε πίσω και πήρε το χέρι του, και στην αράδα πήγαιναν σιωπηλά τα τέσσερα αδέλφια πίσω από τη δασκάλα, που σήκωνε με τη φούστα της σύννεφο τη σκόνη.
Καλά και ράβει η θεία και δε μας είδε! είπε η Αλεξάνδρα λίγη ώρα πιο ύστερα, αφού πλύθηκαν και χτενίστηκαν και κατέβηκαν πάλι τ' αδέλφια στην αυλή, χωρίς τη δασκάλα, που είχε κλειστεί στην κάμαρα της. Ήσασταν και οι τρεις τόσο βρώμικοι!
- Μα μας είδε η βασίλισσα! είπε η Πουλουδιά. Και γύρισε μάλιστα και μας κοίταξε δυο φορές!
- Θα κοίταξε κανέναν άλλο, είπε ο Αντώνης, έτοιμος πάντα να επαναστατήσει για κάθε επίκριση γυναικεία, είτε από τραπεζιέρα ήρχουνταν είτε από αδελφή είτε από βασίλισσα. Θα κοίταζε την Αλίς Χορν.
- Όχι, μας κοίταξε εμάς, δυο φορές! Ναι, εγώ την είδα! επέμεινε η Πουλουδιά.
- Και πρώτον η Αλίς ήταν στη δική της πόρτα και η βασίλισσα δεν μπορούσε να τη δει, επικύρωσε η Αλεξάνδρα. Και η πόρτα της Αλίς είναι ύστερα από τη δική μας.
Η Αλίς Χορν, συνομήλικη του Αντώνη και γειτόνισσα του, είχε δύο αδέλφια, τον Μαξ δέκα χρονών και τον Αλέκο, που ήταν μικρότερος από την Πουλουδιά και μεγαλύτερος από τον Αλέξανδρο. Τα γειτονοπούλα αυτά ήρχουνταν στην αυλή της θείας Μαριέτας κι έπαιζαν με τα τέσσερα αδέλφια, όποταν τα έβλεπαν μόνα. Η παρουσία της μις Ράις είχε πάνω τους την επίδραση του σκιάχτρου πάνω στα σπουργίτια. Όταν την άκουαν ή την έβλεπαν, όπου φύγει φύγει! Συχνά, σαν ήταν μόνα τ' αδέλφια, ο Αντώνης σκαρφάλωνε στη γαζία της αυλής τους και, αν από πάνω από το παρατηρητήρι του έβλεπε τα Χορνόπουλα, τα φώναζε στην αυλή του, και το παιχνίδι γίνουνταν άξιο της πλούσιας φαντασίας του, προπάντων σαν ήταν και ο Μαξ. Ειδεμή μόνο με κορίτσια, τι να φανταστείς και τι να εφαρμόσεις; Σήμερα όμως κανένας δεν είχε όρεξη για την Αλίς και τ' αδέλφια της.
- Μας είδε η βασίλισσα! είπε πικρά η Αλεξάνδρα. Και, το χειρότερο, μας είδε και η Αλίς! Κι έμπηξε τα γέλια και δάγκασε τα χέρια της κι έτρεξε πίσω στο σπίτι της! Πώς θα μας περιγελάσει!
- Και είδε το καπέλο της μις Ράις που ήταν στραβό; ρώτησε τρομαγμένος ο Αλέξανδρος.
- Βέβαια! αποκρίθηκε η Αλεξάνδρα.
Και κουνώντας το κεφάλι της πρόσθεσε η Πουλουδιά:
- Και είδε τα αίματα στην μπλούζα του Αντώνη!
- Δεν έχω αίματα! διαμαρτυρήθηκε ο Αντώνης.
- Ναι, έχεις! Εδώ! είπε η Πουλουδιά φέρνοντας μπροστά τον πλατύ ναυτικό κολάρο του.
Τον τράβηξε ο Αντώνης ακόμα πιο μπροστά, να βεβαιωθεί πως αλήθεια ήταν αιματωμένος, και είπε:
- Πώς πήγε εκεί πίσω το αίμα;
- Θα σου έσπασε το κεφάλι! αναφώνησε η Αλεξάνδρα. Για να δω; Πού πονείς;
Ο Αντώνης δεν πονούσε πουθενά. Δε θέλησε όμως να λιγοστέψει το θαυμασμό των αδελφών του για την ηρωική του καρτερία και τους παρέδωσε το κεφάλι του. Μα, όσο και να έψαξαν τα δυο κορίτσια ανάμεσα στα μαλλιά του, δε βρήκαν καμιά πληγή.
Λίγο απογοητευμένος, ιδίως που της Πουλουδιάς το μάγουλο μάτωνε ακόμα κάπου κάπου, είπε ο Αντώνης:
- Εγώ... εγώ δεν άφηνα να μου χτυπήσει το κεφάλι ή να μου γδάρει το πρόσωπο! Εγώ θα της έπιανα τα χέρια! Μόνο που, έτσι άνανδρα, με χτύπησε από πίσω! Ας ερχόταν μπροστά μια φορά και να 'βλεπε αυτή!
- Κι εγώ θα της έπιανα τα χέρια! είπε η Πουλουδιά που, μ' όλη τη φανερή πληγή, ένιωθε καταφρόνια στα λόγια του Αντώνη. Κι εγώ θα της έπιανα τα χέρια, αν... αν... Δε βρήκε αμέσως για ποιο λόγο δεν το έκανε και θριαμβευτικά ξαναβρίσκοντας μεμιάς την ανδρική του υπεροχή, είπε ο Αντώνης:
- Εσύ δεν της τα 'πιασες και όμως σε χτύπησε από μπρος, στο πρόσωπο!
Πειραγμένη έκανε ν' απαντήσει η Πουλουδιά, μα τη διέκοψε η Αλεξάνδρα.
- Εγώ, είπε, σαν είδα τα αίματα, ήθελα να πάρω τον Αλέξανδρο από το χέρι, να πάρω και την Πουλουδιά, να σε φωνάξω και σένα και να τρέξομε να φύγομε, κι εκείνη θα έμπλεκε στη φούστα της που είχε λυθεί και δε θα μπορούσε να μας κυνηγήσει και θα την αφήναμε κει και θα ερχόμασταν σπίτι!
- Αλήθεια! θαύμασε η Πουλουδιά, που τέτοια τολμηρή λύση δεν την είχε σκεφθεί.
Μα ο Αντώνης, που από κανένα κορίτσι δεν παραδέχουνταν ούτε τολμηρές αποφάσεις ούτε καν και ιδέες καθόλου, τη ρώτησε απότομα:
- Και γιατί δεν το έκανες;
- Γιατί; επανέλαβε η Αλεξάνδρα, μάταια γυρεύοντας μιαν απάντηση που δεν ήρχουνταν.
- Ναι, γιατί δε μας το είπες ελληνικά; Και γιατί, σαν έπεσε κάτω, πάλι δεν είπες τίποτα;
- Κούκου!
Μια φωνή από ψηλά γλίτωσε εγκαίρως την Αλεξάνδρα και τους έκανε όλους να σηκώσουν το κεφάλι. Πάνω από τον τοίχο που χώριζε τις δυο αυλές πρόβαλε το κεφάλι της η Αλίς, με δυο ξανθές πλεξούδες δεμένες στεφάνι και, αμέσως μετά, παρουσιάστηκαν τα ξέθωρα μαλλιά του Μαξ και ύστερα το κόκκινο ολοστρόγγυλο πρόσωπο του και πλάγι τους το πενταχρονίτικο, πάντα γελαστό, μουτράκι του Αλέκου.
- Ο μπαμπούλας έφυγε; ρώτησε χαμηλόφωνα η Αλίς.
- Όχι! αποκρίθηκε η Αλεξάνδρα.
Και για να μιλήσει πιο σιγά, έκανε να πλησιάσει τον τοίχο. Μα την ίδια στιγμή ακούστηκε η φωνή της θείας Μαριέτας, και τα τρία ξανθά κεφάλια εξαφανίστηκαν από πάνω από τον τοίχο, την ώρα που το μελαχρινό κεφάλι της θείας εμφανίζουνταν στο παράθυρο της σκάλας.
- Τι κάνετε τέτοιαν ώρα εδώ, παιδιά; Γιατί δεν είστε περίπατο; φώναξε η θεία από ψηλά.
Απροετοίμαστα, μαγκωμένα, μάσησε κάθε αδέλφι από μιαν απάντηση διαφορετική, που δεν έφθασε ως το παράθυρο της σκάλας.
- Δεν ακούω... Σταθείτε, κατεβαίνω, είπε η θεία. Και το κεφάλι της χάθηκε πάλι.
Τ' αδέλφια αλληλοκοιτάχθηκαν, τινάχθηκαν, συγυρίστηκαν και βιαστικά ρώτησε η Αλεξάνδρα:
- Τι θα πούμε;
Μα δεν πρόφθασαν να βρουν καμιάν απάντηση και, πηδηχτή και στρογγυλή, βγήκε η θεία στην αυλή.
- Γιατί είστε δω, παιδιά; Πού είναι η μις Ράις;
Τ' αδέλφια ξανακοιτάχθηκαν χωρίς ν' απαντήσουν. Με μια γοργή ματιά στα τέσσερα σκυφτά κεφάλια, υποψιάρικα είπε η θεία:
- Τι τρέχει; Αλεξάνδρα, εσένα ρωτώ! Πού είναι η μις Ράις;
- Στην... κάμαρα της... μουρμούρισε η Αλεξάνδρα.
- Γιατί;
- Δεν ξέρω... Δεν κατέβηκε...
Μα τη διέκοψε η θεία.
- Τι έπαθες, Πουλουδιά; Έλα δω! έκανε πιάνοντας την ανιψιά της από τους ώμους. Σήκωσε το κεφάλι... Κοίταξε με! Ποιος σου το 'κανε αυτό στο μάγουλο;
Τα σουφρωμένα της φρύδια γύρισαν κατά τον Αντώνη.
- Εσύ; ρώτησε.
- Όχι! αναφώνησε η Πουλουδιά και σώπασε φοβισμένη.
- Εσένα δε σε ρώτησα! είπε η θεία. Τον Αντώνη ρωτώ! Αντώνη, εσύ χτύπησες την αδελφή σου;
- Όχι, θεία! αποκρίθηκε χωρίς πολύ θάρρος ο Αντώνης.
- Ποιος τη χτύπησε; Πες μου!
- Η μις Ράις, είπε ακόμα πιο χαμηλόφωνα ο Αντώνης.
- Η μις Ράις;
Τα φρύδια της θείας ξεσουφρώθηκαν και ανέβηκαν σχεδόν ως τα μαλλιά της.
- Γιατί; Τι έκανε η Πουλουδιά; Μα... καλέ, τι είναι αυτά; Αίματα στα ρούχα σου; αναφώνησε η θεία τραβώντας πάλι μπροστά τον τσαλακωμένο του κολάρο.
- Άνοιξε η μύτη μου! εξήγησε ο Αντώνης.
- Κι έσταξε στη ράχη σου; Τι παραμύθια είναι αυτά;
Ναι, αλήθεια, έμοιαζαν παραμύθια όλα αυτά, τόσο, που έχασε την παλικαριά του ακόμα και ο Αντώνης. Και σώπασε. Και τότε έγινε παλικάρι η Αλεξάνδρα. Η φωνή της έτρεμε πολύ, μα δε στάθηκε καθόλου. Και είπε μεμιάς:
- Αλήθεια σας λέγει, θεία! Η μις Ράις χτύπησε τον Αντώνη στο κεφάλι και στο πρόσωπο και του άνοιξε τη μύτη, και τον χτυπούσε και στην πλάτη και παντού, παντού! Και τρέξαμε με την Πουλουδιά να τον γλιτώσομε, κι έδειρε την Πουλουδιά και της ξέγδαρε το πρόσωπο, κι έτρεχαν αίματα, και τρομάξαμε... Αχ, θεία, τρομάξαμε πολύ! αναφώνησε η Αλεξάνδρα και ξέσπασε στα κλάματα.
Την είδε ο Αλέξανδρος και άρχισε κι εκείνος να κλαίει φωναχτά. Και τότε έγινε κάτι περίεργο. Η θεία δε σούφρωσε καθόλου τα φρύδια της, μόνο έβγαλε ένα πολύ ψιλό μαντίλι, που μύριζε τριαντάφυλλο, και σκούπισε τα μάτια του Αλέξανδρου. Και δε μάλωσε καθόλου την Αλεξάνδρα, μόνο της είπε:
- Έλα πάνω μαζί μου! Έλα να μου τα ξαναπείς όλα αυτά εμπρός στη μις Ράις!
- Όχι, θεία! Παρακαλώ! προσπάθησε να πει η Αλεξάνδρα. Μα η θεία την πήρε από το χέρι.
- Μην είσαι ανόητη! της είπε γλυκά. Τι φοβάσαι, αφού είσαι μαζί μου;
Και τ' άλλα τρία αδέλφια είδαν μαγεμένα τη θεία να μπαίνει στο σπίτι με την Αλεξάνδρα και να σιάζει χαδιάρικα τα κατσαρωτά, σαν της Πουλουδιάς, μαλλιά της, χωρίς καθόλου να σουφρώνει τα φρύδια.
- Και τώρα;... Η μις Ράις;... έκανε ο Αντώνης καμτσικώνοντας τον αέρα με τη χλωρή του βέργα, που ήταν πάντα πρόχειρη.
- Θα τις φάγει; ρώτησε η Πουλουδιά σμίγοντας μ' έκσταση τα χέρια της.
Από πάνω από τον τοίχο παρουσιάστηκαν πάλι τα τρία ξανθά κεφάλια.
- Πσσστ... πσσστ... Τι σας έκανε ο μπαμπούλας;
- Τι θα κάνει η θεία σας τον μπαμπούλα;
- Μη κι έλθει κάτω ο μπαμπούλας; ρώτησαν τα τρία κεφάλια μαζί.
Ο Αντώνης κοντοστάθηκε. Δεν του πολυάρεζε ν' ανακατώνει τη γειτονιά στις δουλειές του. Μα η Πουλουδιά, που, σαν κορίτσι που ήταν, δε συλλογίζουνταν πολλά πράματα, σίμωσε αμέσως τον τοίχο και, χαμηλόφωνα, με σηκωμένο το κεφάλι κι ενωμένα τα χέρια, διηγήθηκε όλη την ιστορία του περιπάτου. Ώστε τι να κάνει και ο Αντώνης, προπάντων που δεν τα έλεγε και σωστά η Πουλουδιά και ξεχνούσε πολλά που έκανε και είπε ο Αντώνης; Αναγκάστηκε να πλησιάσει κι εκείνος στον τοίχο και να πει κι εκείνος το λόγο του και μάλιστα να πάρει εκείνος ολόκληρο το λόγο και να παραμερίσει την Πουλουδιά, που μαγεμένη τον άκουε, τόσο τα έλεγε καλά. Και, όρθιος κοντά τους, ο Αλέξανδρος κοίταζε κι εκείνος τα τρία κεφάλια πάνω στον τοίχο και μ' έκσταση άκουε τα λόγια του Αντώνη, τυλίγοντας και ξετυλίγοντας τα δάχτυλα του το ένα μες στο άλλο.
Ώσπου κατέβηκε η Αλεξάνδρα και άλλαξε ολότελα η ατμόσφαιρα της αυλής. Η μις Ράις ήταν πολύ άρρωστη, πάρα πολύ άρρωστη, παραμιλούσε, δεν αναγνώριζε κανένα· και σαν είδε τη θεία, άπλωσε τα χέρια και είπε:
- Έλα, μωρό μου!
Η Αλεξάνδρα άρχισε τα κλάματα και όλοι οι άλλοι αποσβολώθηκαν.
- Κι εγώ που ήθελα να τη δείρει η θεία... μουρμούρισε η Πουλουδιά.
- Κι εγώ που την είπα μπαμπούλα... είπε η Αλίς από πάνω από τον τοίχο.
- Κι εγώ!
- Κι εγώ! είπαν και τ' άλλα δυο κεφάλια κοντά της.
- Και τώρα τι θα κάνομε; ρώτησε ο Αλέξανδρος και η φωνή του έτρεμε σαν κατσίκας.
Η Αλεξάνδρα σκούπισε τα μάτια της και τους διηγήθηκε όλη την ιστορία. Η θεία είχε τρομάξει πολύ, γιατί είπε της μις Ράις: «Δεν είμαι μωρό, είμαι η θεία της Αλεξάνδρας» και πάλι δεν τη γνώρισε κείνη. Και είπε η θεία κάτι τρομερό. Είπε: «Δε μ' αρέσει η θέση της!» Κι έστειλε ευθύς την Αφροδίτη να φωνάξει το θείο το γιατρό. Και η κερα-Ρήνη που τα 'κουσε είπε:
«Για να λέγει η κυρία πως δεν της αρέσει η θέση της, πρέπει να είναι του θανατά!» Και τη ρώτησε η Αλεξάνδρα: «Θα πεθάνει;» Και είπε η κερα-Ρήνη: «Ίσως». Τα τέσσερα αδέλφια στέκουνταν μουδιασμένα και τα τρία κεφάλια πάνω στον τοίχο δε γελούσαν πια. Και πέρασε κάμποση ώρα.
Και είπε η Αλεξάνδρα:
- Δεν μπορούμε σήμερα, Αλίς, να παίξομε μαζί σας. Θα πάμε στη βεράντα να περιμένομε το θείο το γιατρό.
- Να έλθομε αύριο; ρώτησε η Αλίς.
- Ναι, βέβαια! είπαν τα μεγαλύτερα αδέλφια.
Και τα τρία ξανθά κεφάλια χάθηκαν πίσω από τον τοίχο. Ο Αλέξανδρος δεν είχε μιλήσει. Όρθιος, τυλίγοντας και ξετυλίγοντας τα δάχτυλα του, κοίταζε τον τοίχο και ρώτησε:
- Πώς ανέβηκαν εκεί πάνω;
Ο Αντώνης και τα δυο κορίτσια αγανάκτησαν. Πώς μπορούσε να σκεφθεί και να μιλήσει ο Αλέξανδρος για άλλο παρά για το θάνατο της μις Ράις; Σήκωσε όμως και ο Αντώνης το κεφάλι κατά τον τοίχο. Αλήθεια, πώς ανέβηκαν εκεί πάνω; Δεν ήξερε. Ευτυχώς όμως ο Αλέξανδρος δεν είχε ρωτήσει κανένα τους ιδιαιτέρως, κι έτσι μπήκαν όλοι στο σπίτι χωρίς να του απαντήσουν.
Ο θείος ο γιατρός έφθασε και πήγε πάνω με τη θεία Μαριέτα.
- Μην κουνήσετε από δω από τη βεράντα, είπε η θεία στ' αδέλφια. Εκτός...
Σήκωσε τα μάτια της στα σύννεφα που μαζεύουνταν πυκνά από τη δύση.
- Εκτός αν βρέξει, πρόσθεσε, και τότε να μπείτε μέσα. Και ακολούθησε το θείο, ίσιο, λιγνό, με ψαρό μουστάκι και γένια, που ανέβαινε. Και πέρασε πολλή ώρα κι εκείνοι δεν κατέβαιναν.
- Θα είναι πιο άρρωστη η μις Ράις! είπε η Αλεξάνδρα.
- Ίσως πέθανε πια! πρόσθεσε η Πουλουδιά. Και όλα τ' αδέλφια μελαγχόλησαν.
Και τότε ήλθε ο Γιάννης. Με τα χέρια στις τσέπες, κουνιστός, χωρίς βία, ανέβηκε τις σκάλες της βεράντας και ρώτησε:
- Πού είναι η θεία Μαριέτα;
- Απάνω, με το θείο. Η μις Ράις είναι πολύ άρρωστη, αποκρίθηκε η Αλεξάνδρα.
Ο Γιάννης είχε βγάλει το δεξί του χέρι από την τσέπη του και, σα μεγάλος, το έδωσε στην Αλεξάνδρα, στον Αντώνη, στην Πουλουδιά και στον Αλέξανδρο, και είπε στον καθένα χωριστά:
- Καλησπέρα!
Το είπε πολύ ευγενικά. Και ύστερα από τη χθεσινή του διαγωγή, που μάδησε τον τοίχο για να καθαρίσει τα χέρια του, τ' αδέλφια δεν ήξεραν πολύ καλά τι στάση να πάρουν. Ο Γιάννης όμως δε φαίνουνταν καθόλου ν' αντιλαμβάνεται πως βρίσκουνταν σε στενοχώρια τα εξαδέλφια του. Σα να μιλούσε σε μεγάλη κυρία, είπε ευγενικά της Αλεξάνδρας:
- Η μητέρα μ' έστειλε να ρωτήσω ποιος είναι άρρωστος. Ανησύχησε που στείλατε έτσι βιαστικά να πάρετε τον πατέρα.
Ο πληθυντικός «στείλατε» και «να πάρετε» κολάκευσε πολύ την Αλεξάνδρα, που δεν είχε φαντασθεί ως εκείνη την ώρα πως έπαιζε ρόλο, εκείνη και τ' αδέλφια της, στον ερχομό του θείου Γιώργη. Άλλο τόσο ευγενικά και πρόθυμα αποκρίθηκε του Γιάννη:
- Ναι! Παρακαλέσαμε να έλθει πολύ γρήγορα, γιατί η μις Ράις είναι πολύ, πάρα πολύ άρρωστη.
- Τι έχει; ρώτησε ο Γιάννης χωρίς να φαίνεται πολύ ταραγμένος.
- Παραμιλά! αποκρίθηκε η Αλεξάνδρα. Μα καθόλου δεν ταράχθηκε ο Γιάννης.
- Πολλοί άνθρωποι παραμιλούν και με λίγο πυρετό! είπε καθησυχαστικά.
Τ' αδέλφια θαύμασαν. Τι είναι ωστόσο να 'χεις πατέρα γιατρό!
Μα θυμήθηκε η Αλεξάνδρα κάτι φοβερό.
- Η θεία. είπε: «Δε μ' αρέσει η θέση της!» Και η κερα-Ρήνη λέγει πως θα είναι του θανατά!
Ο Γιάννης χαμογέλασε με επιείκεια.
- Ούτε η θεία ούτε η κερα-Ρήνη δεν είναι γιατροί! είπε. Αυτή η ασυζήτητη αλήθεια αποστόμωσε τ' αδέλφια που, και τα τέσσερα, όρθια, θαμπωμένα, κοίταζαν τον Γιάννη. Τους είδε αυτός και γέλασε.
- Τι με κοιτάζετε έτσι; ρώτησε.
Πολύ ντράπηκαν τ' αδέλφια και όλα κούνησαν από τη θέση τους και καμώθηκαν πως κάτι γυρεύουν. Άθελα γύρισε η Αλεξάνδρα στον τοίχο που είχε μαδήσει χθες ο Γιάννης, ενώ ο Αλέξανδρος έσκυβε να κουμπώσει ένα χαμένο κουμπί από το παπούτσι του, η Πουλουδιά άπλωνε το χέρι της πάνω από την καγκελαρία να δει αν βρέχει, και σιωπηλά ο Αντώνης κατέβηκε στο δρόμο.
Μα τον είδε ευτυχώς η Αλεξάνδρα κι έτρεξε στη σκάλα και του φώναξε:
- Η θεία είπε να μην κουνήσομε από δω! Κοντοστάθηκε ο Αντώνης και κακοθέλητα είπε:
- Πάγω μια στιγμή στης Αλίς.
- Όχι, να μην πας! πρόσταξε η Αλεξάνδρα. Θα θυμώσει η θεία!
Αργά επέστρεψε ο Αντώνης και, κλοτσώντας ένα ένα τα σκαλοπάτια όσο ανέβαινε, είπε:
- Θέλω κάτι να ρωτήσω την Αλίς...
- Ποια είναι η Αλίς; ρώτησε ο Γιάννης.
- Η Αλίς Χορν... Κάθεται δω, πλάγι μας, αποκρίθηκε βιαστικά η Πουλουδιά, ενθουσιασμένη που βρήκε μια κουβέντα να κάνει με το μεγάλο εξάδελφο. Παίζομε συχνά μαζί της. Έχει κι έναν αδελφό μεγάλο, που τον λένε Μαξ. Τον ξέρεις, Γιάννη;
- Τον ξέρω, είπε ακατάδεχτα ο Γιάννης. Έρχεται στο σχολείο μου.
- Έχει κι ένα μικρό αδελφό και τον λένε Αλέκο, προθυμοποιήθηκε να τον πληροφορήσει η Πουλουδιά. Και τον αγαπούμε πολύ...
Ο Γιάννης είχε ξαναβάλει τα χέρια του στις τσέπες του και χαμογελούσε ακόμα πιο ακατάδεχτα.
- Τους ξέρω, είπε. Και πρόσθεσε:
- Είναι Εβραίοι!
Τ' αδέλφια έμειναν εμβρόντητα.
- Εβραίοι!... Και πάγει ο Μαξ στο σχολείο σου; έκανε η Αλεξάνδρα.
- Γιατί όχι; είπε ο Γιάννης.
Η απάντηση του Γιάννη τους έριξε όλους σε συλλογή. Και ο Αντώνης, σαν αγόρι προς αγόρι, πήρε το λόγο και είπε:
- Ο Στάμος λέγει πως οι Εβραίοι σταύρωσαν το Χριστό!
- Ποιος είναι ο Στάμος; ρώτησε ο Γιάννης.
- Ένας εξάδελφος μας στην Αλεξάνδρεια. Είναι αλήθεια;
- Βέβαια είναι αλήθεια, αποκρίθηκε ο Γιάννης.
- Λοιπόν πώς μπορείς να παίζεις μαζί τους;
- Εγώ δεν παίζω με τον Μαξ, δεν τον έχω φίλο, γιατί είναι μικρός και σ' άλλη τάξη. Μα άλλα παιδιά παίζουν.
- Χριστιανοί;
- Ναι.
- Μα δε φοβούνται; ρώτησε η Πουλουδιά.
- Τι να φοβηθούν;
Η Πουλουδιά αποστομώθηκε. Κάθε απάντηση του Γιάννη της φαίνουνταν αλήθεια, βεβαίωση που δε σήκωνε συζήτηση. Τόσο έμοιαζε να τα ξέρει όλα αυτός ο Γιάννης! Και η Αλεξάνδρα κλονίστηκε. Εκείνη όμως, σαν πιο μεγάλη τόλμησε να πει:
- Μα ο Στάμος λέγει πως αν δείξεις του Εβραίου ένα σταυρό, αυτός πέφτει ξερός! Γιατί έχει ένα διάβολο μέσα του και σα δει ο διάβολος το σταυρό, σκάζει! Ο Γιάννης την κοίταξε και είπε:
- Τι ανοησίες!
- Ναι! επέμεινε η Αλεξάνδρα. Κι εμείς ξέραμε κάτι κορίτσια Εβραίες που πήγαιναν κι έπαιζαν στο ίδιο περιβόλι όπου πηγαίναμε κι εμείς και μας είπε ο Στάμος να δοκιμάσομε και να δούμε. Και πήραμε το σταυρό της βαφτίσεώς μου...
Έχωσε η Αλεξάνδρα το χέρι της μες στο λαιμό του φουστανιού της και τράβηξε έξω ένα χρυσό σταυρό που κρέμουνταν σε μιαν αλυσιδίτσα.
- Να, αυτό το σταυρό! Κι εμείς φοβόμασταν πολύ. Και ο Στάμος είπε: «Δώσ' μου εμένα το σταυρό!» Και σαν είδε τις Εβραίες, σήκωσε το σταυρό...
- Κι έπεσαν ξερές; ρώτησε ο Γιάννης. Η Αλεξάνδρα μαζεύθηκε.
- Όχι! ομολόγησε. Έφυγαν. Μα ο Στάμος λέγει πως δεν τον είχαν κοιτάξει καλά και γι' αυτό δεν έσκασαν...
- Τι ανοησίες! είπε πάλι ο Γιάννης. Ο Στάμος, θαρρώ, τις κόβει!
- Εσύ δεν το πιστεύεις, Γιάννη; ρώτησε η Πουλουδιά κλονισμένη.
- Όχι! αποκρίθηκε ο Γιάννης.
- Και όμως είναι αλήθεια! βεβαίωσε η Αλεξάνδρα. Να, ρώτα τον Αντώνη να σου πει τι λέγει ο Στάμος.
Μα ο Αντώνης δε θέλησε να πει τι λέγει ο Στάμος. Δεν ταίριαζε, απέναντι ενός αγοριού, να δώσει δίκαιο σε κορίτσι. Κι εδώ, ή ο Στάμος είχε πει «ανοησίες», όπως έλεγε ο Γιάννης, ή ο Γιάννης ήταν άπιστος Θωμάς, που και αυτό ήταν κακό. Ώστε γύρισε στον Αλέξανδρο και τον διέταξε:
- Πήγαινε απάνω και φέρε μου τη σβούρα μου!
- Δεν πάγω! είπε ο Αλέξανδρος που με πάθος παρακολουθούσε τις περιπέτειες του σταυρού, του διαβόλου και των Εβραίων.
- Πήγαινε! επανέλαβε ο Αντώνης. Δε γυρνά καλά! Θέλω να τη δείξω του Γιάννη!
- Πηγαίνω ύστερα! αποκρίθηκε ο Αλέξανδρος.
- Αν δεν πας, ξέρεις;... Θα πω του Γιάννη τι είπες στον αξιωματικό!
Ο Αλέξανδρος πετάχθηκε απάνω.
- Όχι! αναφώνησε. Ο Γιάννης γύρισε.
- Τι είπες; Και σε ποιον αξιωματικό; ρώτησε με καλοσύνη.
- Μην πεις! φώναξε με αγωνία ο Αλέξανδρος. Και σου φέρνω τη σβούρα σου!
Και σαν αστραπή χάθηκε πίσω από τις πόρτες και όρμησε στη σκάλα. Στη βεράντα έπεσε σιωπή. Ο Γιάννης κοίταζε τις εξαδέλφες του και οι εξαδέλφες κοίταζαν τη θάλασσα, για να κρύψουν την ντροπή που τις πλάκωσε πάλι με την ενθύμηση του αξιωματικού και του Αλέξανδρου.
Μόνος ο Αντώνης, με τα χέρια στις τσέπες του πανταλονιού του και το κεφάλι ψηλά, πήγαινε κι έρχουνταν κλοτσώντας καρέγλες και τραπέζι, χωρίς ντροπή και χωρίς ανησυχία, αφού εκείνος όριζε την κατάσταση και από κείνον κρέμουνταν να πει ή να μην πει, να ντροπιάσει την οικογένεια στα μάτια του Γιάννη ή να βαστάξει το γόητρο της ψηλά. Πέρασε ένας κουλούρας φωνάζοντας:
- Φρέσκα κουλούρια της ώρας!
Κατέβηκε ο Γιάννης, διάλεξε ένα κουλούρι κι έβγαλε από την τσέπη του μια φούχτα πράματα, όπου χώριζαν δυο βόλοι, ένας σουγιάς, τρεις τέσσερις πενίτσες, ένα κομματάκι αλυσίδα και μια πεντάρα. Πήρε την πεντάρα και την έδωσε του κουλούρα και άρχισε ν' ανεβαίνει σιγά, σηκώνοντας τη μύτη του κατά τον ουρανό.
- Βρέχει, είπε.
Και με το κουλούρι στο χέρι, ακούμπησε στην ξύλινη κολόνα που βαστούσε τη σκεπή της βεράντας, κοιτάζοντας κατά τη θάλασσα και αγνοώντας εξάδελφο κι εξαδέλφες, που τον λοξοκοίταζαν με περιέργεια. Ώσπου λαχανιασμένος κατέβηκε ο Αλέξανδρος και, κατακόκκινος και ανήσυχος, έδωσε τη σβούρα του Αντώνη. Γύρισε ο Γιάννης και του χαμογέλασε με το λίγο στραβό χαμόγελο της θείας Αργίνης και του πρόσφερε το κουλούρι.
- Σ' αρέσει; ρώτησε. Για σένα τ' αγόρασα!
Σάστισε ο Αλέξανδρος και κοκκίνισε ακόμα περισσότερο. Σάστισαν και οι αδελφές του, σάστισε ακόμα περισσότερο και ο Αντώνης. Και δεν ήξερε ο Αλέξανδρος τι να κάνει.
- Ε, δεν το παίρνεις; ρώτησε ο Γιάννης.
Και το πήρε ο Αλέξανδρος και ξέχασε να πει ευχαριστώ.
- Αυτός ο Αλέξανδρος όλο θα μας ντροπιάζει... μουρμούρισε η Αλεξάνδρα της Πουλουδιάς. Δώσ' του μια σπρωξιά να ξυπνήσει...
Μα, πριν προφθάσει η Πουλουδιά να δώσει την παραγγελμένη σπρωξιά, βγήκε πηδηχτή και θυμωμένη η θεία, άρπαξε τον Αλέξανδρο με το κουλούρι στο χέρι και τον πήρε μέσα φωνάζοντας:
- Βρέχει, δεν το βλέπετε; Τι κάνεις εσύ, Αλεξάνδρα, που είσαι η πιο μεγάλη; Και τι σας είπα πριν; Θέλετε νταντά να σας φυλάγει, κοτζάμ παιδιά;
Η απρόοπτη αυτή μπόρα, που από το κεφάλι του Αλέξανδρου ξεσπούσε έξαφνα στο κεφάλι της Αλεξάνδρας, ζάλισε ακόμα περισσότερο τα ξαφνισμένα από το κουλούρι αδέλφια. Κι επειδή η θεία τούς είπε και άλλα και μάλωσε τον καθένα χωριστά, μπάζοντας τους μέσα, κι έκλεισε με πάταγο τη γυάλινη πόρτα και φώναξε: «Αφροδίτη! Φέρε καφέ και γλυκό για το γιατρό, στο γραφείο του κυρίου» και ξανάφυγε βιαστική, όπως είχε έλθει, τ' αδέλφια άργησαν να συνέλθουν και ύστερα στάθηκαν και κοιτάχθηκαν και μετρήθηκαν. Ο Αλέξανδρος ήταν ολόκληρος εκεί, με το κουλούρι ακόμα στο χέρι. Μα έλειπε ένας, ο Γιάννης.
Μουδιασμένα πήγαν τ' αδέλφια στη γυάλινη πόρτα και κοίταξαν έξω, όπου τώρα έπεφτε καταρράχτης η βροχή.
Ο Γιάννης ήταν ακόμα εκεί, στην ίδια κολόνα, σκασμένος στα γέλια, με τα δυο χέρια στις τσέπες, και κοίταζε τα εξαδέλφια του κοροϊδευτικά. Και, καθώς πλάκωσαν και οι τέσσερις τη μύτη τους στο τζάμι, αυτός τους έβγαλε τη γλώσσα, δηλαδή τους κορόιδεψε ακόμα περισσότερο. Ο Αντώνης δήλωσε πως αυτό ήταν αδικία. Γιατί, σα μάλωνε η θεία Μαριέτα, ήθελαν δεν ήθελαν έπρεπε να μπουν μέσα, ενώ ο Γιάννης, που ήταν μεγάλος και είχε και μητέρα και πατέρα στο σπίτι...
Μα ο Γιάννης, απέξω, τώρα έκανε τέτοια πράματα, που όλες οι κουβέντες σταμάτησαν και ο Αλέξανδρος ξέχασε να κόψει το κουλούρι του. Με τα χέρια στις τσέπες πηδούσε μ' ενωμένα τα ποδάρια κι έπεφτε με ανοιχτά και πάλι ξαναπηδούσε με ανοιχτά και ξανάπεφτε μ' ενωμένα, τρεις, τέσσερις, πέντε φορές στην αράδα. Και ύστερα, χωρίς να σταθεί, έβγαλε τα χέρια του από τις τσέπες του, έπιασε τη μέση του και άρχισε να χορεύει μονάχος του. Και τι χορό! Πετούσε τα πόδια του μπροστά και τα χτυπούσε χάμω και ύστερα τα πετούσε πλάγια και πάλι τα χτυπούσε χάμω και σήκωνε τα γόνατα του ως το πιγούνι και λύγιζε ως κάτω στις πλάκες και πάλι πηδούσε σαν μπάλα κι έστριφτε σα σβούρα στο τακούνι του και στέκουνταν στο ένα πόδι, κι έγερνε το σώμα του ως κάτω και ακουμπούσε χάμω στο χέρι του, τεντώνοντας τάβλα το άλλο πόδι, και πάλι ορθώνουνταν μεμιάς και χτυπούσε απανωτά τις πλάκες με τακούνια και μύτες, πλακαπλάκ, πλακαπλάκ, πλακ, πλακ! Θαμπωμένα τον κοίταζαν τ' αδέλφια. Και, σα να μην έφθαναν όλα αυτά, έβαλε μπροστά του μια καρέγλα και πήδηξε από πάνω. Και ύστερα πήρε το τρίποδο σιδερένιο τραπέζι και το έβαλε στη μέση κι έπαιξε βαρελάκια, πηδώντας από πάνω.
- Τι δεν κάνει αυτός ο Γιάννης! είπε θαυμάζοντας η Αλεξάνδρα.
Μα και αυτού ακόμα δε σταμάτησε ο Γιάννης. Εκεί που θαύμαζαν τ' αδέλφια, σήκωσε το τραπέζι στα χέρια του, το αναποδογύρισε στον αέρα, με τα πόδια πάνω, και το στήριξε στο κεφάλι του.
Τ' αδέλφια ξέσπασαν σε χειροκροτήματα. Και τότε είπε η Πουλουδιά την ιστορική εκείνη αναίδεια που έμεινε μαύρη σελίδα στα οικογενειακά τους αρχεία. Μαγεμένη, εκστατική, είπε:
- Εγώ, σα μεγαλώσω, θα πάρω τον Γιάννη! Καταστροφή! Παν τα μάγια και η γοητεία, πάει και το μεθύσι!
- Και ποια είσαι συ που θα πάρεις τον Γιάννη; ρώτησε με καταφρόνια ο Αντώνης.
- Και πού το ξέρεις αν θέλει να σε πάρει ο Γιάννης; ρώτησε συνάμα η Αλεξάνδρα.
Και ως και ο Αλέξανδρος, που ήταν συνήθως κόμμα της, είπε:
- Ναι, πού το ξέρεις;
Κατακόκκινη, ντροπιασμένη, είχε κολλήσει πάλι η Πουλουδιά το μέτωπο της στο γυαλί της πόρτας μα πού να κοιτάξει πια τον Γιάννη! Και πάλι θα ήθελε να την κατάπινε η γη κι έκανε πως βλέπει τις κλωστές από νερά που κρέμουνταν στην ξύλινη σκεπή της βεράντας και τσάκιζαν στην κουπαστή και γίνουνταν σκόνη υγρή και σκορπίζουνταν χάμω. Και είπε ο Αντώνης:
- Μούτρο για σιδέρωμα! Αυστηρά τον διέκοψε η Αλεξάνδρα:
- Αντώνη, το ξέρεις πως η μαμά δε θέλει να λες τέτοια λόγια!
- Μα είναι φανταγμένη! διαμαρτυρήθηκε ο Αντώνης.
- Πολύ φανταγμένη, είπε η Αλεξάνδρα. Μα εσύ να μη λες άσχημα λόγια!
Άνοιξε ο Αλέξανδρος το στόμα του να μιλήσει, μα πάλι άλλαξε γνώμη και δεν είπε τίποτα. Και σε λίγο έκοψε ένα κομμάτι από το κουλούρι του και το πρόσφερε της Πουλουδιάς. Μα εκείνη, χωρίς να γυρίσει, σήκωσε τον ώμο της. Και θέλησε ο Αλέξανδρος να της το βάλει στο χέρι κι εκείνη τράβηξε το χέρι της. Και για να μη λυπηθεί ο Αλέξανδρος με τον τρόπο της, είπε ο Αντώνης:
- Δώσε μού το μένα! και το έφαγε. Και είπε η Αλεξάνδρα:
- Και μένα!
Κι έκοψε άλλο κομμάτι ο Αλέξανδρος και της το 'δωσε. Κι επειδή δε γύριζε η Πουλουδιά, ακούμπησε ο Αλέξανδρος το κουλούρι του στο τραπέζι, πήρε μια καρέγλα, την έστησε κοντά της και ανέβηκε πάνω, πλάγι της, να δει τι κοιτάζει. Δεν είδε όμως τίποτα. Και, αφού στραβολαίμιασε γυρεύοντας να δει, ξανακατέβηκε και ζήτησε για παρηγοριά το κουλούρι του. Μα από το κουλούρι δεν έμενε πια παρά ένα κομματάκι μια σταλιά και λίγα σησάμια σκορπισμένα στο τραπέζι. Θύμωσε ο Αλέξανδρος και χτύπησε το πόδι του και είπε πως θέλει όλο το κουλούρι του. Και άναψε καβγάς. Αγανακτισμένη γύρισε η Πουλουδιά ν' ακούσει και απέξω ο Γιάννης κόλλησε το πρόσωπο του στο τζάμι να δει, και την ίδια ώρα έβγαινε η θεία Μαριέτα με το θείο Γιώργη από το γραφείο του θείου Ζωρζή.
Τα πράματα ήταν πολύ άσχημα, προπάντων που ο Αλέξανδρος άρχιζε να κλαίει. Πέρασε βιαστικά ο Αντώνης κοντά του και του είπε:
- Αν κλάψεις, θα πω της θείας πως είπες «Βρε συ» στον αξιωματικό!
Και συνάμα άνοιξε του Γιάννη που χτυπούσε το τζάμι. Ο Αλέξανδρος κατάπιε τα δάκρυα του, η Πουλουδιά την αγανάκτηση της, και οι τέσσερις θυμήθηκαν ξαφνικά πως η μις Ράις ήταν πολύ άρρωστη. Μπήκε μέσα ο θείος Γιώργης γελώντας και τον ακολούθησε η θεία Μαριέτα. Εκείνη δε γελούσε· φαίνουνταν μάλιστα πολύ σκοτισμένη και τα φρύδια της ήταν σηκωμένα στη μέση σαν περισπωμένη. Και είπε ο θείος Γιώργης:
- Μπα, Γιάννη, τι κάνεις εδώ;
Μα σαν του αποκρίθηκε ο Γιάννης: «Μ' έστειλε η μητέρα να ρωτήσω ποιος είναι άρρωστος», είπε ο θείος ο γιατρός κάτι παράξενο. Είπε, χτυπώντας τον Γιάννη στον ώμο:
- Κανένας δεν είναι άρρωστος! Άιντε, πάμε σπίτι μας! Καθισμένα στα κρεβάτια τους, εκείνο το ίδιο βράδυ, αφού τα είχε ξεκουμπώσει και πλύνει η Αφροδίτη, και κανένας δεν είχε τυλίξει χαρτιά στα μαλλιά των κοριτσιών, τα τέσσερα αδέλφια, με σβησμένο το κερί και κατεβασμένες τις κουνουπιέρες, χαμηλοκουβέντιαζαν.
- Εγώ ήθελα να ξέρω, είπε η Αλεξάνδρα, γιατί δε μας είπαν την αλήθεια!
- Γιατί δε μας είπαν τίποτα πρόσθεσε η Πουλουδιά.
- Πώς δε μας είπαν τίποτα; ρώτησε ο Αντώνης. Μας είπε η θεία πως είναι πολύ άρρωστη η μις Ράις!
- Και είπε ο θείος Γιώργης του Γιάννη πως κανένας δεν είναι άρρωστος εδώ! αποκρίθηκε η Αλεξάνδρα.
- Μπορεί να μην ξέρει καλά ο θείος Γιώργης! παρατήρησε ο Αλέξανδρος.
- Σώπα συ! του είπε ο Αντώνης. Αφού είναι γιατρός ο θείος!
- Και η Αφροδίτη δεν ξέρει; έκανε η Πουλουδιά.
- Εκείνη ξέρει πιο καλά απ' όλους! επικύρωσε η Αλεξάνδρα. Αφού ήταν στην κάμαρα σαν πήγε ο θείος με τη θεία, και ήταν και ύστερα, και ήταν και πριν.
- Ε! Αυτή δεν είπε ποτέ πως η μις Ράις δεν είναι άρρωστη! είπε ο Αντώνης.
- Όχι, μα είπε: «Αυτές οι Εγγλέζες δεν παθαίνουν τίποτα, κι έννοια σας!» Που είναι σα να λέγει πως δεν είναι άρρωστη! αποκρίθηκε η Αλεξάνδρα.
- Είπε και κάτι άλλο, πρόσθεσε συλλογισμένη η Πουλουδιά. Είπε: «Κάθε άλλος θα είχε γκρεμοτσακιστεί δέκα φορές! Αυτή τίποτα!» Γιατί θα είχε γκρεμοτσακιστεί η μις Ράις; Και από πού;
- Από το κρεβάτι της ίσως; αν είχε πέσει; έκανε δειλά ο Αλέξανδρος.
- Όχι, γιατί είπε η Αφροδίτη: «Με τα εγγλέζικα ποδάρια της τα 'βγαλε πέρα» και δε μίλησε για κρεβάτι, αποκρίθηκε η Πουλουδιά. Την άκουσα που το είπε της κερα-Ρήνης.
Τα τέσσερα αδέλφια έπεσαν σε συλλογή.
- Εγώ αύριο θα πάγω μέσα να τη δω και θα σας πω! αποφάσισε ο Αντώνης.
- Κι εγώ! πετάχθηκε και είπε ο Αλέξανδρος.
- Όχι εσύ, δεν κάνει! Είσαι μικρός και μπορείς να κολλήσεις την αρρώστια της!
- Καθόλου δε θα κολλήσω! Και θα πάγω!
- Τότε θα πάμε όλοι μας! είπε η Αλεξάνδρα.
- Σιγά, μη ζητήσει τώρα να πάγει και η Πουλουδιά! έκανε κοροϊδευτικά ο Αντώνης.
Η Πουλουδιά ορτσώθηκε υψώνοντας και τη φωνή:
- Και γιατί να μην πάγω;
- Γιατί είσαι κορίτσι, και τα κορίτσια κάθονται ήσυχα!
Από τα κοριτσίστικα κρεβάτια σηκώθηκε διαμαρτυρία. Ο Αντώνης τους είπε να σωπάσουν. Ο Αλέξανδρος υποστήριζε τις αδελφές του. Για να επιβληθεί, αναγκάστηκε ο Αντώνης να φωνάξει. Τα κορίτσια επαναστάτησαν, μα κανένας δεν τις άκουσε, γιατί όλοι μιλούσαν μαζί. Παλαμάκια δυνατά και μια φωνή ανέβηκαν από το κάτω πάτωμα.
- Παιδιά, θέλετε ν' ανεβώ;
Ξαφνική σιωπή απλώθηκε στη σκοτεινή κάμαρα. Ούτε φωνή ούτε κίνηση ακούστηκε πια. Και όταν ανέβηκε η θεία να βεβαιωθεί πως όλα ήταν εντάξει, τέσσερις κουνουπιέρες άσπρες ξεχώριζαν θαμπά στην αστροφεγγιά που έμπαινε από τα ορθάνοιχτα παράθυρα, μα τσιμουδιά πια δεν ακούουνταν.
Την επαύριο το πρωί μεγάλη είδηση συντάραξε τα τέσσερα αδέλφια. Είπε η Αφροδίτη:
- Πάει η μις Ράις!
- Τι; Πέθανε;
- Όχι, έφυγε!
Κανένας δεν το πίστεψε. Κι ένας ένας πήγε στην πλαγινή κάμαρα να βεβαιωθεί και βρήκε την πόρτα ανοιχτή και την κάμαρα άδεια. Και πήγαν τ' αδέλφια στη θάλασσα με την Αφροδίτη κι έκαναν όλες τις αταξίες και δεν ήθελαν πια να βγουν από το νερό, ώσπου θύμωσε η Αφροδίτη και φοβέρισε πως θα το πει της θείας.
Και όταν γύρισαν στο σπίτι και κάθισαν στο πρόγευμα, εκεί που σερβίριζε τον καφέ με το γάλα, είπε η θεία:
- Παιδιά, η μις Ράις ήταν άρρωστη χθες και έφυγε.
- Πού πήγε, θεία; ρώτησε η Αλεξάνδρα.
- Δεν ξέρω. Μα ίσως πήγε στη μητέρα της, ώσπου να γίνει πάλι καλά. Και σεις κοιτάξτε να είστε πολύ φρόνιμοι σήμερα, να μη θυμώσω!
Ο θείος δεν είπε τίποτα, μόνο κοίταξε τ' αδέλφια, το ένα ύστερα από το άλλο, μ' ένα χαμόγελο που στένευε τα μάτια του από τις πολλές τις δίπλες.
Ούτε τ' αδέλφια δεν είπαν τίποτα. Μόνο κοιτάχθηκαν και σώπασαν. Μα όταν βρέθηκαν μόνα, πήγε ροδάνι η γλώσσα τους.
- Και πρώτον, είπε η Αλεξάνδρα, άρρωστη δεν ήταν η μις Ράις, αφού έφυγε. Ένας άρρωστος παίρνει λάδι και μένει στο κρεβάτι. Και στη μητέρα της δεν πήγε, αφού μας είπε πως η μητέρα της πέθανε και ο πατέρας της ξαναπαντρεύτηκε και δεν ξέρει πού είναι.
- Ναι, είπε η Πουλουδιά, μα και η θεία, βλέπεις, δεν ήξερε. Είπε «ίσως». Και πρέπει κάτι να τρέχει, γιατί, σα ρώτησα την Αφροδίτη, μου αποκρίθηκε πως ούτε κείνη δεν ήξερε πότε έφυγε η μις Ράις. Και όμως ύστερα είπε πως πονεί το χέρι της, γιατί κατέβασε το μπαούλο που ήταν πολύ βαρύ. Γιατί λοιπόν κατέβασε το μπαούλο, αν δεν ήξερε πως φεύγει η μις Ράις;
- Και η κερα-Ρήνη λέγει κοροφέξαλα! είπε πάλι η Αλεξάνδρα. Μου είπε, σαν τη ρώτησα: «Να πας να ρωτήσεις τη θεία σου! Εμένα δε με βαλαν να τη φυλάγω!» Και με την Αφροδίτη όλο κρυφομιλάει.
- Ίσως... άρχισε ο Αλέξανδρος.
Μα δε βρήκε τι μπορούσε το «ίσως» να είναι κι έμεινε με τα χέρια του απλωμένα στα γόνατα του και με την απορία του.
- Και τι μας μέλει τι ώρα έφυγε και γιατί; Φθάνει που έφυγε! Ζήτω η ελευθερία! φώναξε ο Αντώνης χορεύοντας στο ένα πόδι, όπως είδε τον Γιάννη να το κάνει χθες. Πάει το μάθημα! Βούλιαξε το μάθημα! Παιχνίδι όλη μέρα σήμερα!
Μα τι παιχνίδι να φανταστούν, που να μη μοιάζει με κανένα παιχνίδι που έπαιξαν ως τώρα; Χρειάζουνταν για την περίσταση αυτή κάτι εντελώς διαφορετικό κι εξαιρετικό, κάτι μεγάλο και τρελό, άξιο της καινούριας ελευθερίας τους. Κι ενώ το συζητούσαν, ήλθε στο σπουδαστήριο η κερα-Ρήνη μ' ένα πανέρι βύσσινο για γλυκό. Το είχε στείλει η θεία Αργίνη κι έπρεπε να καθαριστεί γρήγορα, γιατί ήταν λίγο γινωμένο. Η θεία μηνούσε ν' αρχίσουν τα κορίτσια ευθύς το ξεκουκούτσιασμα κι εκείνη έρχεται αμέσως.
- Να παιχνίδι μια φορά! είπε καταχαρούμενη η Αλεξάνδρα που, σαν και την Πουλουδιά, τρελαίνουνταν για τις σπιτικές δουλειές. Έλα, Αντώνη, και συ, να κάνομε πιο γρήγορα!
Μα ο Αντώνης ακατάδεχτα κοίταζε τις προετοιμασίες των κοριτσιών, τις ποδιές που ζώνουνταν, τα μανίκια που σήκωναν και τύλιγαν ως τον άγκωνα, τις σουπιέρες, το πακετάκι με άπιαστες φορκέτες, με πιάτα όπου θα έριχναν τα κουκούτσια. Αυτός δεν ήταν κορίτσι. Αυτή δεν ήταν αντρίκεια δουλειά. Φαντάσου να έλεγαν του πατέρα: «Βάλε ποδιά κι έλα να καθαρίσεις βύσσινο ή τριαντάφυλλο ή σταφύλι»! Σήκωσε τους ώμους του ο Αντώνης και, με τα χέρια στις τσέπες, βγήκε από την κάμαρα.
- Έλα, Αλέξανδρε, φώναξε, άφησε τις γυναικείες αυτές δουλειές στα κορίτσια!
Ο Αλέξανδρος, που είχε δέσει μια πετσέτα στη μέση του και με λαχτάρα ετοιμάζουνταν να βοηθήσει, διαλέγοντας και βάζοντας χωριστά τα σάπια βύσσινα και βγάζοντας τα κοτσάνια, δίστασε μια στιγμή. Ήταν μεγάλος ο πειρασμός να μείνει με τα κορίτσια και να πασπατεύει βύσσινα! Ήταν τόσο κόκκινα και δροσερά! Μα, πάλι, ν' αρνηθεί την πρόσκληση του Αντώνη, που του έκανε την τιμή να του φερθεί σαν αγόρι - τιμή σπάνια όσο και ποθητή - και να τον βάλει στην ίδια μοίρα με τον εαυτό του; Δεν μπόρεσε ο Αλέξανδρος ν' ανθέξει στο δεύτερο. Αναστενάζοντας, ξεζώθηκε την πετσέτα και ακολούθησε τον Αντώνη.
- Τόσο το καλύτερο! είπε λίγο πειραγμένη η Αλεξάνδρα, θα μας μείνει εμάς περισσότερο βύσσινο να καθαρίσομε!
Και με ζήλο έχωναν το δυο κορίτσια το κεφάλι μιας φορκέτας σε κάθε βύσσινο, τραβούσαν έξω το κουκούτσι, έριχναν το φρούτο σε μια σουπιέρα και το κουκούτσι σ' ένα πιάτο. Το γλέντι ήταν μεγάλο. Έτρεχαν τα ζουμιά, κόκκινα σαν αίμα, σ' όλο το γυμνό μπράτσο κι έσταζαν από τον άγκωνα. Κι έπρεπε να προσέχεις να μη στάξουν ούτε χάμω ούτε στα ρούχα σου, γιατί λέκιαζαν, και να έχεις πάντα μια κατσαρόλα κάτω από τον άγκωνα, που να μαζεύει το ζουμί, γιατί η θεία φώναζε, μη χαθεί ούτε στάλα, που θα κάνει όμορφο χρώμα στο γλυκό.
- Και τα κουκούτσια μη χαθούν, γιατί θα στραγγίσουν ύστερα, είπε η Αλεξάνδρα της Πουλουδιάς, ούτε κανένα από τα πολύ γινωμένα βύσσινα. Από αυτά θα γίνει ύστερα η βυσσινάδα...
Τη διέκοψε ο Αλέξανδρος που μπήκε στην κάμαρα σα σίφουνας:
- Αλεξάνδρα! Έλα γρήγορα! Ο Αντώνης είναι πολύ άρρωστος! Γρήγορα! Γρήγορα! Θα κάνει, λέει, εμετό!
Πετάχθηκε πάνω η Αλεξάνδρα. Μα τι να κάνει τα ζουμιά που έσταζαν από τα χέρια της και που δεν έπρεπε να τα σκουπίσει, μη λεκιάσουν την πετσέτα; Ευτυχώς η κερα-Ρήνη είχε φροντίσει να βάλει και μια λεκάνη με νερό απάνω στο τραπέζι, για το τέλος της δουλειάς.
- Γρήγορα! Γρήγορα! φώναζε ο Αλέξανδρος.
Ξέβγαλε η Αλεξάνδρα τα χέρια της, βούτηξε και η Πουλουδιά τα δικά της και, τρεχάτες και οι δυο, ακολούθησαν τον Αλέξανδρο. Τις πήγε ίσια στο γραφείο του θείου.
Σωριασμένος στα γόνατα, ακουμπισμένος στον τοίχο, το πρόσωπο κατάχλομο και τα μάτια κλειστά, ο Αντώνης φαίνουνταν αλήθεια του «θανατά», όπως είπε ύστερα η Αλεξάνδρα, όταν τη ρώτησε η Αφροδίτη. Έτρεξαν οι δυο αδελφές κι έκαναν να τον σηκώσουν. Μα, καθώς τον άγγιξαν, γούρλωσε ο Αντώνης τα μάτια του, τις κοίταξε με αγωνία, έκανε να σηκωθεί, μα δεν πρόφθασε. Και... πλουφ... όλο το πρωινό πρόγευμα χύθηκε στο πάτωμα! Ευτυχώς συγύριζε ακόμα η Αφροδίτη την τραπεζαρία, όταν άκουσε τις φωνές των κοριτσιών κι έτρεξε. Σήκωσε τον Αντώνη, που είχε πέσει χάμω σα σακούλι άδειο, και τον ξάπλωσε στον καναπέ, του έβρεξε το μέτωπο και το πρόσωπο και βγήκε έξω να φέρει σφουγγαρόπανα και νερά να πλύνει το πάτωμα.
- Πώς σου ήλθε, Αντώνη; ρώτησε η Αλεξάνδρα που εξακολουθούσε να του βρέχει το μέτωπο, όπως είχε δει την Αφροδίτη να το κάνει.
Ο Αντώνης δε μίλησε. Αλλά βιαστικά, μήπως και του κόψει ο Αντώνης το λόγο και δεν προφθάσει να τα πει, διηγήθηκε ο Αλέξανδρος την ιστορία, με πολλά πήγαινε κι έλα, φασαρεύοντας και πολυλογώντας, για ν' αναπαραστήσει και να ζωντανέψει τη σκηνή.
- Να, έτσι! είπε ο Αλέξανδρος. Μου λέγει ο Αντώνης: «Τι να παίξομε;» Εγώ δεν ήξερα. Και είπε ο Αντώνης: «Εγώ θα είμαι ο θείος Ζωρζής και συ θα είσαι η κερα-Ρήνη!» Και κάθισε, να έτσι, στην πολυθρόνα. Εγώ δεν ήθελα να είμαι κερα-Ρήνη. Μου είπε ο Αντώνης: «Θα κάνεις μόνο αγορίστικες δουλειές. Φέρε μου το ναργιλέ του θείου!»...
- Αντώνη! αναφώνησε η Αλεξάνδρα πιάνοντας το πιγούνι της με τα δυο της χέρια. Πώς τόλμησες;
Ο Αντώνης δεν αποκρίθηκε.
Κι εξακολούθησε ο Αλέξανδρος με ακόμα πιότερη πολυλογία:
- Ναι, κι εγώ του το είπα: «Όχι, Αντώνη. Ο θείος δε θέλει!» Μα εκείνος πρόσταξε: «Φέρε μού τον!» Κι εγώ δεν μπορούσα να τον σηκώσω. Λοιπόν ήλθε ο Αντώνης, να έτσι, και ήθελε να τον σηκώσει. Και ύστερα μου είπε: «Είναι αναμμένος. Θέλεις να κάνω, όπως κάνει ο θείος, φούσκες στο νερό;» Και είπα ναι. Κι εκείνος έβαλε το κεχλιμπάρι στο στόμα κι έκανε φούσκες στο νερό. Κι έκανε, ξέρεις, πολλέεεες... πολλές φούσκες! Και του είπα: «Κάνε το πάλι!» Και το ξανάκανε. Και του είπα: «Πάλι!» Μα εκείνος δεν ήθελε πια. Είπε: «Θα κάνω εμετό!» Και πήγε στον τοίχο κι έπεσε χάμω κι εγώ έτρεξα να σας το πω...
Με κλειστά μάτια μουρμούρισε ο Αντώνης:
- Μην το πείτε της θείας!
Την ίδια ώρα μπήκε μέσα η θεία. Φορούσε κι εκείνη μια μεγάλη ποδιά άσπρη και είχε τα μανίκια της σηκωμένα.
- Τι τρέχει; ρώτησε. Κανένας δε μίλησε.
Πίσω από τη θεία μπήκε μέσα η Αφροδίτη με σφουγγαρόπανα κι έναν κουβά νερό.
- Το παιδί είναι κακοδιάθετο, είπε, κι έκανε εμετό!
Η θεία φαίνουνταν ανήσυχη. Είχε πλησιάσει τον καναπέ κι έπιασε το μέτωπο του Αντώνη.
- Είναι δροσερός, είπε, και είναι σαν ιδρωμένος! Τι έχεις, Αντώνη; Μην έφαγες τίποτα βύσσινα;
- Όχι! Όχι, θεία! φώναξαν μαζί τα δυο κορίτσια, ούτε ήλθε μαζί μας να τα καθαρίσει! Μας φώναξε ο Αλέξανδρος εμάς τις δυο!
- Μα πώς του ήλθε; ρώτησε πάλι η θεία.
Κανένα από τ' αδέλφια δε μίλησε. Κι ευθύς είπε η Αφροδίτη:
- Θα 'ναι η ζέστη!
- Ναι, είπε η θεία, κάνει πολλή ζέστη σήμερα! Άνοιξε το παράθυρο, Αφροδίτη, να του φυσήξει...
Και παίρνοντας ένα χάρτινο ριπίδι από το τραπέζι, άρχισε να φυσά του Αντώνη.
- Αισθάνεσαι καλύτερα; ρώτησε.
- Ναι, θεία, ευχαριστώ, είμαι καλά, αποκρίθηκε ο Αντώνης.
Μα ούτε άνοιγε τα μάτια του ούτε σηκώνουνταν. Και σαν είπε η θεία «Συνήλθε το χρώμα του. Είναι καλύτερα. Πάμε τώρα, κορίτσια, να καθαρίσομε το βύσσινο», σηκώθηκαν οι δυο αδελφές χωρίς να τολμήσουν να κοιτάξουν καν το ναργιλέ.
Η θεία όμως τον είδε. Τίποτα δεν ξέφευγε από τη γοργή ματιά της.
- Ποιος άγγιξε το ναργιλέ του κυρίου; ρώτησε την Αφροδίτη.
Η τραπεζιέρα που σφουγγάριζε το πάτωμα γύρισε και, σηκώνοντας με απορία τα φρύδια, της είπε:
- Κανένας, κυρία! Ποιος θα τον αγγίξει;
- Αυτό ρωτώ κι εγώ! είπε η θεία. Ο κύριος είχε τυλίξει το μαρκούτσι γύρω στο γυαλί, πριν φύγει! Ποιος το ξετύλιξε και το έριξε χάμω; Η Αφροδίτη γύρισε πάλι να δει και είπε βιαστικά:
- Θα ξετυλίχθηκε μόνο του το μαρκούτσι... ή θα το έριξα εγώ σαν ξεσκόνισα...
Από τον καναπέ σηκώθηκε η φωνή του Αντώνη.
- Όχι, είπε, εγώ ξετύλιξα το σωλήνα! Τ' αδέλφια στάθηκαν παγωμένα.
- Εσύ; έκανε παίρνοντας φωτιά η θεία. Ο Αντώνης ήταν πάλι κατάχλομος.
- Ναι, είπε χωρίς ν' ανοίξει τα μάτια του, εγώ έπιασα το ναργιλέ... κι έκανα φούσκες στο νερό...
Σώπασε ο Αντώνης και κανένας δε μίλησε. Και στη μεγάλη σιωπή ακούστηκε μόνο το φουρκισμένο σφουγγάρισμα της Αφροδίτης.
Πλησίασε η θεία τον καναπέ και τα κορίτσια και ο Αλέξανδρος άρχισαν να τρέμουν. Πωπώ!... Τι θα γίνει τώρα;
Μα η θεία, αντί να του τις βρέξει, όπως το περίμεναν τ' αδέλφια, έσκυψε απάνω στον Αντώνη και, με το μαντίλι της, σκούπισε το καταϊδρωμένο πρόσωπο του. - Δε σε τιμωρώ, του είπε, γιατί τιμωρήθηκες μόνος σου με τον εμετό που σου έφερε το κάπνισμα του ναργιλέ. Ελπίζω όμως αυτό να σου γίνει μάθημα και άλλη φορά να υπακούεις όταν σου λέγει ο θείος σου να μην αγγίζεις πράματα που δε σου ανήκουν... Σήκω τώρα να πας να πλυθείς. Και μεις, κορίτσια, πάμε στο βύσσινο μας...
- Ουφ! έκανε η Αλεξάνδρα, όταν, μετά το μεσημέρι, στην κρεβατοκάμαρα τους τ' αδέλφια βρέθηκαν πάλι μόνα. Τι τρομάρα πήρα, Αντώνη, σαν πήγες και είπες της θείας πως κάπνισες το ναργιλέ του θείου!
- Κι εγώ! είπε η Πουλουδιά.
Με τα χέρια στη ράχη πίσω, μαζεύοντας και ξεμαζεύοντας την άσπρη του φουστίτσα, ρώτησε ο Αλέξανδρος:
- Γιατί το είπες της θείας, Αντώνη, αφού μας είπες 