ими ніякого надужиття.

Але не тільки в самій Тухольщині видний і спасенний був вплив Захара
Беркута; його знали люди на кільканадцять миль довкола, по руськім і
угорськім боці. Та й то знали його не лиш як чудовного лікаря, що
лічить рани і всякі болісті, але й не менше як чудовного бесідника та
порадника, котрий «як заговорить, то немов бог тобі в серце вступає»,
а як порадить чи то одному чоловікові, чи й цілій громаді, то хоч
цілий майдан старців набери, то й ті вкупі, певно, ліпшої ради не
придумають. Віддавна Захар Беркут прийшов був до того твердого
переконання, що як чоловік сам-один серед громади слабий і безрадний,
так і одна громада слаба, і що тільки спільне порозуміння і спільне
ділання многих сусідніх громад може надати їм силу і може в кождій
громаді поокремо зміцнити свобідні порядки громадські. Тож ніколи,
працюючи всілякими способами для своєї

Тухоль-щини, Захар не забував і про сусідні громади. Він за молодших
часів часто ходив по громадах, бував на їх копних зборах, старався
пізнати добре їх потреби й людей, і всюди ради та намови його змагали
до одного: до скріплення дружніх, товариських і братерських зв'язків
між людьми в громадах і між громадами в сусідстві. А зв'язки ті були
тоді ще досить живі й сильні; ще роз'їд- лива князівщина та боярщина
не здужала була порозривати їх до решти,- тому й не диво, що під
проводом так усіма любленого, так досвідного і громадському ділу
відданого чоловіка, як Захар Беркут, ті зв'язки живо відновилися і
зміцніли.

Особливо зв'язок з руськими громадами по угорськім боці був дуже
важним ділом для Тухоль-щини, ба й для цілої Стрийської верховини,
багатої вовною та кожухами, та зате досить убогої на хліб, якого мали
недостатком загірні люди.

Отже ж то одним із головних старань Захара було - провести зі своєї
Тухоль- щини просту і безпечну дорогу на угорський бік. Довгі літа він
носився а тою гадкою, переходив здовж і вшир тухольські полонини,
розмірковуючи, куди би найліпше, найбезпечніше і а найменшим коштом
можна провести дорогу, а заразом старався звільна й ненастанно накло-
нювати верховинські громади по однім і другім боці Бес-кида до того
діла. При кождій нагоді, на кождій громадській раді він не залишав
доказувати користь і потребу такої дороги, поки вкінці не добився
сього. Більше як десять громад з ближчої й дальшої околиці прислали до
Тухлі своїх виборних на громадську раду, на якій мало обговорюватись
побудовання нової дороги. Се був радісний день для Захара.

Він не тільки прийнявся радо сам повитичувати, куди має йти дорога,
але також через весь час, поки вона мала будуватися, взявся надзирати
за роботою, а окрім того, виправив чотирьох своїх синів до роботи, а
п'ятий його син, коваль, мав із своєю перевізною кузнею все бути на
місці роботи для направи потрібних знаряддів. Кожда громада висилала
по кільканадцять робітників, із запасом свого хліба й своєї страви,- і
під проводом невтомного Захара дорога була збудована в однім році.
Користі її відразу для всіх стали очевидні. Зв'язок з багатими ще тоді
угро-руськими громадами оживив усю верховину; почалася жива і
обопільна хосен - на обміна здобутків праці: туди йшли кожухи, сир
овечий та й цілі отари на заріз, а відтам пшениця, жито та полотна.
Але не тільки для такого обмінного торгу була вигідна тухольська
дорога; вона була також проводом для всіляких вістей про життя громад
по однім і по другім боці

Бескида, була живою ниткою, що в'язала докупи дітей одного народу,
розбитих між двома державами.

Правда, тухольська дорога була не перша така нитка. Давнішня і колись
далеко славніша була дуклянська дорога. Але галицько-руським князям
вона з многих причин не злюбилася, менше, може, для того, що
піддержувала живий зв'язок між громадами по сім і по тім боці Бескида
та через те скріплювала в одних і в других вольні громадські порядки,
як радше для того, що туди частенько мадьярські королі й дуки впадали
з військами до Червоної Русі. От тому-то галицькі та перемиські князі
старались коли не зовсім замкнути, то бодай укріпити ту входову браму
в свої границі, а звісно, що таке «укріплення», зроблене по-державному
і для державних цілей, мусило вийти на шкоду громад

і громадської самоуправи. Князі понасаджували здовж дуклянської дороги
своїх бояр, понадаровували їм із громадських земель просторі грунти й
посідища і вложили на них обов'язок - пильнувати Дуклянської брами, в
разі воєнного нападу спиняти неприятеля воєнними дружинами, набраними
з околичних громад, а також засіками, себто дерев'яними та кам'яними
запорами, що ними в тісних місцях завалювано дорогу, чинячи її при
якій-такій обороні зовсім непрохідною для ворожих вояків. Розуміється,
що ті обов'язки цілим своїм тягарем спадали на селян, на громади. Вони
не тільки тратили часть своїх споконвічних земель, на яких розсідалися
бояри, але мусили, крім того, ставити варти, �