�ій не
було. Досить того, що бояри якось не мали охоти затісуватися в той
закуток. Але і се щастя не було вічне. Нараз одної гарної днини заїхав
у тухольські гори боярин Тугар Вовк і, не кажучи нікому ані слова,
почав на горбі над Опором, віддалік від Тухлі, але на тухольськім
грунті, будувати собі дім. Тухольці з зачудування зразу мовчали не
спиняли нового гостя, далі почали допитуватися його, хто він, відки і
за чим приходить сюди?

- Я боярин князя Данила,гордо відповідав їм Тугар Вовк.За мої заслуги
- князь надгородив мене землями й лісами в Тухольщині.

- Але ж се землі й ліси громадські! відповідали йому тухольці.

- Се мене нічого не обходить,відказував боярин,ідіть і в князя
- допоминайтеся.

Я маю його грамоту - і більше нічого знати не хочу!

Тухольці кивали головами на такі боярські слова і не казали нічого. А
боярин тим часом починав собі все згорда все похвалявся княжою ласкою
та княжою волею, хоч зрештою, наразі й не стісняв ні в чім тухольців і
не мішався в їх громад�