�ого двора. Боярин лютився на своїм дворі, кляв поганих смердів,
але супротивлятися їм не мав смілості і наразі не робив уже другої
рогачки. Перший напад на громадські права був відбитий, але тухольці
не радувалися завчасно,- вони добре знали, що се тільки перший напад і
що за ним треба надіятись інших. І справді, так воно сталося. Одного
дня прибігли до Тухлі вівчарі, голосячи сумну вість, що боярські слуги
зганяють їх із найкращої громадської полоняни. Не вспіли вівчарі до
ладу розказати свого, коли втім прибігли громадські лісничі, кажучи,
що боярин відмірює і запальковує для себе величезний кусень найкращого
громадського лісу. Знов громадська рада вислала відпоручників до
Тугара

Вовка.

- За що, боярине, кривдиш громаду?

- Я беру тільки те, що мені мій князь дарував.

- Але ж се не княжі, а громадські землі! Князь не міг дарувати того,
- що до нього не належить.

- Ну, то йдіть на князя жалуйтеся! відказав їм боярин і відвернувся
- від них.

Від тої пори почалася правдива війна між боярином і тухольцями. То раз
тухольці зженуть боярські стада зі своїх полонин, то боярські слуги
зженуть тухольські отари. Лісу, загарбаного боярином, стерегли і
громадські, і боярські лісничі, між котрими не раз приходило до сварки
і бійки. Се лютило бояри