умів так добре важності сеї хвилі,
як Захар

Беркут. Він бачив, що тут ціле діло його життя важиться на вістрю
громадського засуду. Та й коби-то в тім засуді ходило лиш о просту
справедливість, то Захар був би спокійний і покладався б уповні на
громадський розум. Але тут приходилося розважати - перший раз на
тухольськім копнім суді - також інші, посторонні, а безмірно важні
обставини, що запутували справу майже до безвихідності. Захар розу^
мів добре, що засуд, чи прихильний, чи неприхильний для боярина,
грозить громаді великою небезпекою. Прихильний засуд значить признання
не так права, як сил