�ав її на протязі п'ятьох миль;
кождий місток, кожда закрутина, кож-дий вивіз на тім протязі зроблений
за його показом.

Боярин неохітно якось поглянув горами, куди на далекий протяг понад
потоком вилася між скалами протерта гірська дорога. Потім глянув долі
вивозом і похитав головою.

- Твій батько має велику вдасть над громадою? спитав він.

- Власть, боярине? відказав здивований Максим.Ні, власті у нас над
- громадою не має ніхто: громада має власть сама, а більше ніхто,
- боярине. Але мій батько досвідний чоловік і радо служить громаді. Як
- він говорить на раді громадській, так не зуміє ніхто в цілій
- верховині. Громада слухає батькової ради,але власті батько мій не
- має ніякої і не жадає її.

Очі Максима блищали огнями гордості й подиву, коли говорив про свого
батька.

Тугар Вовк при його словах у задумі похилив голову; зате Мирослава
гляділа на

Максима, не зводячи з нього очей. Слухаючи Максимових слів, вона чула,
що його батько стається для неї таким близьким, таким мов рідним
чоловіком, немов вона вік жила під його батьківською опікою.

Але Тугар Вовк ставав чимраз більше понурий, чоло його морщилося, і
очі з виразом давно здержуваного гніву звернулися на Максима.

- То се твій батько бунтує тухольців против мене і против князя?
- спитав він нараз терпким, різким тоном. Немов болющий дотик, вразили
- ті слова

Мирославу; вона зблідла і позирала то на батька, то на Максима. Але
Максим цілком не змішався від тих слів, а відповів спокійно:

- Бунтує громаду, боярине? Ні, се тобі неправду сказано. Вся громада
- гнівна на тебе за те, що ти присвоюєш собі громадський ліс і
- полонину, не спитавши навіть громади, чи схоче вона на те пристати,
- чи ні.

- А так, ще питатися вашої громади! Мені князь дарував той ліс і тоту
- полонину,

і мені ні в кого більше дозволятися.

- Те самісіньке й говорить громаді мій батько, боярине. Мій батько
- уцитькує громаду і радить підождати аж до громадського суду, на
- котрім те діло розбереться.

- Громадського суду! скрикнув Тугар Вовк.То й я мав би ставати перед
- тим судом?

- Думаю, що й тобі самому се буде пожадане. Ти будеш міг усім доказати
- своє право, вспокоїти громаду.

Тугар Вовк відвернувся. Вони йшли далі вивозом, який закручувався
насередині, щоб зробити дорогу не так похилою і не так небезпечною.
Максим,

ідучи позаду, не зводив очей із Мирослави. Але його лице не ясніло вже
таким чистим щастям, як недовго перед тим. Чим чорніша хмара гніву й
невдоволення залягала на чолі її батька, тим виразніше почув Максим,
що між ним і

Мирославою розвертається глибока пропасть. При тім він, дитя гір, не
знаючи великого світу і високих боярських замислів, і не догадувався,
яка широка і глибока була та пропасть на самім ділі.

Зійшли вже на долину. Під водопадом творив потік просторий, спокійний
і чистий, мов сльоза, ставок. При його берегах стояли великі шапки
перлової шипучої піни: дно наїжене було великими й малими обломами
скал; прудкі, мов стріла, пструги блискали поміж камінням своїми
перлово-жовтими, червоно цяткованими боками; в глибині затоки долі
кам'яною стіною ревів водо-пад, мов живий срібний стовп, граючи до
сонця всіми барвами веселки.

- Що за пречудове місце! аж скрикнула Мирослава, вдивляючися в водопад
- і навалені в глибині дико пошарпані скали, обведені згори темно-
- зеленою габою смерекового лісу.

- Це наша Тухольщина, наш рай! сказав Максим, обкидаючи оком долину, і
- гори, і водопад з такими гордощами, з якими мало котрий цар обзирає
- своє царство.

- Тільки мені ви затроюєте життя в тім раю,сказав гнівно Тугар Вовк.

Ніхто не відзивався на ті слова; всі троє йшли мовчки дальше. Ось уже
доходили до села, що розкинулося густими купами порядних, драницями
критих хат, густо обсаджене рябиною, вербами та розлогими грушами.
Народ робив у полю; тільки старі діди, поважні, сивобороді, походжали
коло хат, то дещо тешучи, то плетучи сіті на звіра та на рибу, то
розмовляючи про громадські діла. Максим кланявся їм і вітав їх
голосно, приязно; далі й Мирослава почала вітати старих тухольців, що
стояли на дорозі; тільки Тугар Вовк ішов понурий та німий, навіть
поглянути не хотів на тих смердів, що сміли супротивлятися волі його
князя.

Аж ось насеред села з ними пострічалася дивна компанія. Три старці,
убрані по- празничному, несли дорогою на високій, гарно точеній і
оздібно сріблом окованій дрючині великий, також сріблом окований
ланцюг, вироблений суцільно з одної штуки дерева в виді перстеня,
нерозривного і замкнутого в собі.

Понад тим ланцюгом повівала червона, кармазинова, сріблом вишивана
хоругов. Три старці йшли повільно. Перед кождим дворищем вони
зупинялися і викликали голосно хазяїв по ім'ю, а коли той або хто-будь
із жильців дворища явився, вони говорили:

- Завтра на копу! і йшли дальше.

- Се що за дивоглядія? спитав Тугар Вовк, коли старці почали
- наближатися до них.

- Хіба ж ти не видав ще такого? спитав його здивований Максим.

- Не видав. У нас коло Галича нема такого звичаю.

- На копу скликають, на раду громадську,сказав Максим.

- Я гадав, що попи з корогвою,почав насміхатися Тугар.У нас коли
- скликають на копу, то скликають потиху, передаючи з хати до хати
- копне знамено.

- У нас копне знамено обноситься по селу отсими закличниками; вони
- повинні кождого громадянина по ім'ю закликати на копу. І тебе
- закличуть, боярине.

- Нехай собі кличуть, я не прийду! Нічого мене не обходить ваша копа.
- Я тут із княжої волі і можу сам збирати копу, коли буду вважати се
- потрібним.

- Ти сам… збирати копу? спитав зачудований Максим.Без наших
- закличників?

Без нашого знамена?

- У мене свої закличники і своє знамено.

- Але ж на твою копу ніхто з наших громадян не піде. А наша копа як
- осудить, так у нашій громаді й буде.

- Побачимо! сказав гнівно й уперто Тугар Вов-я. В ту саму пору
- наблизилися наші пішоходи до закличників. Побачивши боярина,
- закличники поставили знамено, а один із них відізвався:

- Боярине Тугаре Вовче!

- Ось я,відповів боярин понуро.

- Завтра на копу!

- Чого?

Але закличники на се не відповіли нічого і пішли дальше.

- Не їх діло, боярине, говорити чого,пояснив Максим, стараючись
- якомога втихомирити нехіть боярина до тухольської громадської ради.
- По довшій мовчанці, під час котрої вони все йшли селом, Максим знов
- зачав говорити:

- Боярине, позволь мені, недосвідному, молодому, сказати тобі слово.

- Говори! сказав боярин.

- Прийди завтра на копу!

- І піддатися вашому холопському судові?

- Що ж, боярине, тухольська громада судить по справедливості, а
- справедливому судові хіба стид піддатися?

- Таточку! вмішалася й Мирослава до тої розмови.Зроби так, як каже
- Максим.

Він добре каже! Він урятував моє життя,- він же ж не хотів би тобі зле
радити; він знає добре тутешні звичаї.

Тугар Вовк знехотя всміхнувся на ту правдиво жіночу логіку, але чоло
його швидко знов наморщилося.

- І вже ти протуркала мені упгі тим Максимом! сказав він.Ну, урятував
- тобі життя, я і вдячний йому за те, і, коли хочеш, дам йому пару
- волів. А тут знов о

інші річі йде, до яких не слід мішатися ні тобі, ні Максимові.

- Ні, боярине,відмовив на се Максим,ти чей не схочеш унизити мене
- відплатою за моє незначне діло. Ані я, ані мій батько не приймемо
- ніякої відплати. А то, що я тебе прошу прийти завтра на копу, я
- роблю тільки з щирої прихильності. Я рад би, боярине, щоб між ту-
- хольською громадою і тобою була згода.

- Ну, нехай і так,сказав вкінці Тугар Вовк,прийду завтра на тоту вашу
- раду, але не на те, щоб Їй піддатися, а лиш на те, щоб побачити, що
- се за рада буде.

- Прийди, боярине, прийди! скрикнув радісно Максим.Побачиш сам, що
- тухольська громада вміє бути справедливою.

Приречення Тугара Вовка облегшило серце Максимові. Він став веселий,
говіркий, показував Мирославі направо і наліво, що було гарного й
цікавого довкола, а гарного й цікавого було багато. Наші пішоходи були
саме серед села і на середині тухольської долини. Стрімкі ска-листі
береги кітловини світилися по обох боках далеко, мов рівні, високі
мармурові мури. Потік плив посеред села, тут же біля дороги, шумів і
пінився, розбиваючись по каменях, котрими усіяне було його дно, і
навіваючи свіжий холод на всю долину. По обох боках потока, якого
береги були досить високі, прорізані в намулі давнього озера,
побудовані були кашиці (загати) з річного каміння і грубих смерекових
палів та колод, щоб охоронити село від виливу. Всюди через потік
пороблені були вигідні з поруччями кладки, а зараз поза кашицями йшли
скопані грядки з фасолею й горохом, що вилися вгору по тичинню, з
буряками й капустою, а також загони пшениці, що чистими ясно-зеленими
пасмугами простягалися далеко поза хати. Хати були порядно обгороджені
і харно удержувані; стіни з гладкого дилиння, не обмазаного глиною,
але кілька разів до року митого і скобленого річними черепницями;
тільки там, де одна ди-лина сходилася з другою, в вузьких пасмугах
стіни були поліплені глиною і побілені паленим вапном, і виглядали
дуже гарно серед зелених верб і груш. При вході до кождого дворища
стояли дві липи, між якими прив'язані були гарно плетені в усякі узори
ворота. Майже над кождими воротами на жердці висіла прибита якась хижа
птиця: то сова, то сорока, то ворона, то яструб, то орел, з широко
розпростертими крилами і звислою додолу головою; се були знаки духів -
опікунів дому. За хатами стояли стайні та інші господарські будинки,
всі під драницями і з грубезних тесаних брусів збудовані; тільки
нечисленні обороги були з соломи і насторошували де-де свої золото-
жовті остро-круглі чуби догори помія» чотирма високими оборожинами.

- Ось мого батька двір,сказав Максим, показуючи на один двір, нічим не
- відмінний від інших. Перед домом не було нікого, але двері від сіней
- були відчинені, а в стіні до полудня прорубані були два невеличкі
- квадратові отвори, які вліті оставались або зовсім створені, або
- закладались тонкими і напівпрозірчастими гіпсовими плитками і на
- зиму, крім того, забивались дощаними віконницями. Се були тодішні
- вікна.

Мирослава цікаво позирнула на те гніздо Беркутів, над котрого ворітьми
справді висів недавно вбитий величезний беркут, ще й по смерті немов
грозячи своїми могутніми залізними пазурами і своїм чорним, у каблук
закривленим дзюбом.

Затишно, супокійне і ясно було па тім обійстю; потік відділював його
від гостинця, пе-рекинений широкою кладкою, і журчав стиха та плескав
кришталевою хвилею о кам'яну загату. І Тугар Вовк позирнув туди.

- Ага, то тут сидить той тухольський владика. Ну, рад я пізнати його.
- Побачимо, що се за птиця!

Максим хотів попрощати боярина й його доньку і звернути додому, але
щось немов тягло його йти з ними дальше. Мирослава немов порозуміла
се.

- Чи вже вертаєш додому? спитала вона, відвертаючись, щоб укрити своє
- помішання.

- Хотів було вертати, але нехай і так проведу вас іще через тіснину до
- вашого двора.

Мирослава втішилася, сама не знаючи чого. І знов пішли вони вниз
селом, гуторячи, озираючись на всі боки, любуючись одне одним,
голосом, присутністю, одне для другого забуваючи все довкола, батька,
громаду. І хоча в цілій розмові ані одним словом не згадували про
себе, про свої чуття й надії, але й крізь найбай-дужнішу їх бесіду
тремтіло тепло молодих, першою любов'ю огрітих сердець, проявлялася
таємнича сила, що притягала до себе ті дві молоді, здорові й гарні
істоти, чисті та незопсовані, що в своїй невинності навіть не думали
про перепони, які мусила стрінути їх молода любов.

І Тугар Вовк, що йшов передом у важкій, понурій задумі та міркував над
тим, як би то завтра стати гідно і в цілім блиску перед тими смердами
та показати їм свою повагу та вищість,- і Тугар Вовк не завважав
нічого між молодими людьми; одно тільки гнівало його, що той молодий
парубок такий смілий і так поводиться з ним і з його донькою, мов з
рівними собі. Але до пори, до часу він здержував свій гнів.

Минули вже село і зближалися до того місця, де ту-хольська кітловина
замикалася, пропускаючи тільки вузькою скалистою брамою потік у
долину.

Сонце вже похилилося геть із полудня і стояло над вершиною лісу,
купаючи своє скісне проміння в спінених хвилях потоку. Від скал, що
затіснювали виплив потоку з тухоль-ської долини, лежали вже довгі
тіні; в самій тіснині було сумрачно, холодно і слизько. Внизу
розбивалася вода потоку о величезне, купами тут навалене каміння, а
вгорі високо шуміли величезні смереки і буки.

Понад самим потоком з обох боків вели проковані в скалах вигідні
стежки - також діло тухольців. Якась дрож пройняла Мирославу, коли
входила в оту дивовижну «кам'яну браму»: чи то від пануючого тут
холоду, чи від вогкості, чи бог знає від чого,- вона взяла батька за
руку і притиснулася до нього.

- Яке страшне місце! сказала вона, зупиняючись у самій тіснині і
- озираючись кругом та догори. І справді, місце було незвичайне, дике.
- Потік був вузький, може, на три сажні, не більше, завширшки, і так
- гладко прорізаний рвучою гірською водою в лупаковій скалі, що
- незнающий був би міг присягнути, що се людських рук робота. А перед
- самим проходом стояв насторч величезний кам'яний стовп, усподу геть
- підмитий водою і для того тонший, а вгорі немов головатий, оброслий
- папороттю та карлуватими берізками. Се був широко звісний Сторож,
- котрий, бачилось, пильнував входу в тухольську долину і готов був
- упасти на кождого, хто в ворожій цілі вдирався б до сього тихого,
- щасливого закутка. Сам Тугар Вовк почув якийсь холод за плечима,
- зирнувши на того страшного Сторожа.

- Тьфу, яка небезпечна каменюка! сказав він.Так нависла над самим
- проходом, що, бачиться, ось-ось упаде!

- Се святий камінь, боярине,сказав поважно Максим,йому щовесни
- складають вінки з червоного огнику се наш тухольський Сторож.

- Ех, все у вас ваше, все у вас святе, все у вас ту-хольське,аж
- слухати обридло!

- скрикнув Тугар Вовк.Немовто поза вашою Тухольщиною вже й світу нема!

- Для нас і справді нема світу,відмовив Максим.Ми над усе любимо свій
- кутик,коли б так кождий інший любив свій кутик, то, певно, всі люди
- жили б на світі спокійно й щасливо.

Максим у своїй невинній щирості й не розумів, як чутко вколов він у
серце боярина тими словами. Він не завважав також, якими злобними
очима позирнув на нього Тугар Вовк. Звертаючися до Мирослави, Максим
мовив далі спокійним, теплим голосом:

- А про той камінь, про нашого Сторожа, я вам оповім, що чув від
- батька. Давно то, дуже давно діялось, ще коли велетні жили в наших
- горах. То тут, де тепер наша Тухля, стояло велике озеро; сеся
- кітловина була ще зовсім замкнена, і тільки через верх текла вода.
- Озеро се було закляте: в нім не було нічого живого

- ні рибки, ні хробачка; а котра звірина напилася з нього, мусила
- згинути; а пташина, що хотіла перелетіти понад нього, мусила впасти
- в воду і втопитися.

Озеро було під опікою Морани, богині смерті. Але раз сталося, що цар
велетнів посварився з Мораною, і, щоб зробити їй наперекір, ударив
своїм чародійським молотом о скалу, і розвалив стіну, так що вся вода
з заклятого озера виплила і стратила свою дивну силу. Ціла околиця
раптом ожила; дно озера зробилося плодючою долиною і зазеленілося
буйними травами та цвітами; в потоці завелися риби, поміж камінням
усяка гадь, у лісах звірина, в повітрі птиця. За те розлютилася
Морана, бо вона не любить нічого живого, і закляла царя велетнів у
отсей камінь. Але долині самій не могла нічого зробити, бо не могла
назад вернути мертвящої води, що виплила з озера; якби була вернула
назад усю воду до краплини і заткала отсей у скалі вибитий прохід, то
була би знов царицею наших гір. А так, то хоч цар велетнів і не жив,
та проте й Морана не має вже тут власті. Але цар не зовсім погиб. Він
триває в тім камені і пильнує сеї долини.

Кажуть, що колись Морана ще раз ізбере свою силу, щоб нею завоювати
нашу

Тухольщину, але отсей заклятий Сторож упаде тоді на силу Морани і
роздавить

її собою.

З дивним чуттям слухала Мирослава тої повісті: вона глибоко щеміла її
в серці,-

їй так бажалося стати під руксю того доброго і животворного царя
велетнів до бою з силою Морани; кров живіше заграла в її молодім
серці. Як сильно, як гаряче любила вона в тій хвилі Максима!

А Тугар Вовк хоч і слухав Максимової повісті, але, бачилось, не дуже
вірив їй, тільки ще раз обернувся, позирнув на кам'яного тухольського
Сторожа і з погордою всміхнувся, немов подумав собі: «От дурні смерди,
в якій дурниці покладають свою гордість і свою надію!»

Вже наші пішоходи минули вузький протік тухольського потоку і вийшли
на ясний світ. Перед їх очима раптом розкинулася довга, крутими горами
обмежена долина Опору, котра ген-ген сходилася з долиною Стрию. Сонце
вже клонилося на захід і гарячим пурпуром мерко-•гіло в широких хвилях
Опору. Тухольський потік скаженими скоками і з лютим шумом гуркотів
додолу, щоб скупатися в

Опорі. Його вода, різко відбиваючи в собі заходову червоність,
виглядала неначе кров, що бурхає з величезної рани. Довкола шуміли
темні вже ліси.

Хвилю стояли наші пішоходи, напуваючись тою безсмертною і живущою
красою природи. Максим немов вагувався на якійсь думці, що так і
засіла в його голові і силоміць просилася на волю. Далі він зібрався з
відвагою і приблизився до Тугара Вовка, тремтячи й черво-ніючись.

- Боярине-батьку,сказав він незвичайно м'яким і несміливим голосом.

- Чого тобі треба?

- Позволь мені бути твоїм найщирішим слугою…

- Слугою? Що ж, се нетрудно,прийди з батьком і наймись, коли конче
- хочеш на служб