ином, мов молодий, пишний дубчак, і сказав
лагідним, але певним голосом:

- Нічого злого я не сказав тобі, боярине,нічого такого, що би
- приносило нечесть тобі або твоїй доньці. Я просив у тебе руки твоєї
- доньки, котру я люблю, як її ніхто в світі не буде любити. Невже ж
- між твоїм боярським, а моїм мужицьким родом така велика пропасть,
- щоб її любов не могла перегатити? Та й чим же ж тя так дуже вищий
- від мене?

- Мовчи, смерде! перебив його лютим криком Тугар Вовк.Рука моя
- судорожне стискає рукоять меча, щоб заткати ним твою глупу гортанку.
- Одно тільки рятує тебе від моєї мести, а се те, що ти нин�