�авати науки, гаде? скрикнув розлючений Тугар Вовк,
- і очі його заблищали безумним гнівом.Геть мені з очей, а то, богом
- кленусь, не буду ні на що зважав, а просаджу тебе отсим ножем, як
- просадив нині рано медведя.

- Не гнівайся, боярине, за слова дурного хлопця,відповів усе спокійний

Максим.- Прощай! Прощай і ти, моя зоре, що блиснула мені так чудово на
одну днину, а тепер мусиш навіки для мене померкнути! Прощай і будь
щаслива!

- Ні, годі мовчати,сказала нараз Мирослава, рішучо обертаючись,я не
- померкну для тебе, молодче, я буду твоя.

Тугар Вовк, мов остовпілий, глядів на свою доньку і вже аж тепер не
знав, що йому робити.

- Доню, а се що ти кажеш! скрикнув він.

- Те, що чуєш, таточку. Віддай мене за Максима! Я піду за нього.

- Дурна дівчино, се не може бути!

- Спробуй а побачиш, що може.

- Ти в гарячці говориш, доню,ти перелякалася дикого звіра, ти
- недужа!..

- Ні, таточку, я здорова і скажу тобі ще раз, і кле-нусь перед он тим
- ясним сонцем, що сей молодець мусить бути моїм! Сонце, будь свідком!

І вона взяла Максима за руку і гаряче прилипла устами до його уст.
Тугар Вовк не міг отямитися, не міг здобутися на один рух, на одно
слово.

- А тепер, молодче, йди домів і не лякайся нічого. Мирослава присягла,
- що буде твоєю, і Мирослава зуміє додержати присяги. А ми, таточку,
- спішімо додому!

Онде в долині наш двір, а ось і наші гості надходять.

І, сказавши се, дивна дівчина взяла безтямного з диву батька за руку і
пішла з ним долі горою. А Максим довго ще стояв на місці, очарований,
щасливий.

Вкінці прочунявся і, впавши лицем на землю, помолився захо-довому
сонцю так, як молилися його діди й прадіди, як молився тайком і його
батько. Потім устав і тихою ходою пішов додому.




ІIІ


За селом Тухлею, зараз же близ водопаду, стояла насеред поля величезна
липа.

Ніхто не затямив, коли її засаджено і коли вона розрослася така
здорова та конариста. Тухля була оселя не дуже давня, і деревина, що
росла на тухольській долині, була геть-геть молодша від тої липи; тим-
то й не диво, що тухольський народ уважав її найдавнішим свідком
давнини і окружав великою пошаною.

Тухольці вірили, що тота липа - дар їх споконвічного добродія, царя
велетнів, який засадив її власноручно на тухольській долині на знак
своєї побіди над

Мораною. З-під коріння липи било джерело погожої води і відтак, тихо
журчачи по дрібних камінцях, впливало до потоку. Се було місце копних
зборів тухольських, місце сільського віча, котре в старовину являло з
себе всю і одиноку вдасть у руських громадах.

Довкола липи був широкий, рівний майдан. Рядами стояли на нім до схід
сонця гладкі кам'яні брили, призначені на стільці, де сідали старці
громадські, батьки родин. Кілько було таких батьків, стілько й
кам'яних стільців. Поза ними було вільне місце. Під липою, над самим
джерелом, стояв чотиригранний камінь з проверченою всередині дорого;
тут на час ради виставлялося копне знамено. А обік зроблене було друге
підвищення - для бесідника, себто для того, хто в якій- небудь справі
говорив; він виступав із свого місця і входив на се підвищення, щоб
увесь народ міг чути його.

На другий день після боярських ловів густо тухоль-ського народу
роїлося по копнім майдані. Гамір ішов по долині. Старці громадські
йшли повагом із села один за одним і засідали на своїх місцях. Шумно
збиралася мо-лодіж і ставала поза ними широким півколесом. І жінки
сходилися, хоч не так численно: від громадської ради жаден дорослий
громадянин, чи муж, чи жінка, не був виключений. І хоч рішаючий голос
мали тільки старці-батьки, але при нараді вільно було й молодежі, й
жіноцтву подавати свій голос під розвагу старцям.

Сонце піднялось уже високо на небі, коли з села, остатні за всіма,
надійшли закличники, несучи перед собою тухольське копне знамено.
Поява їх викликала загальний шепіт між громадою, а коли вони
наблизилися, все втихло.

Закличникн, тричі поклонившися громаді, вийшли під липу і познімали
шапки з голів. Уся громада зробила те саме.

- Чесна громадо,відізвалися закличники,чи воля ваша нині раду держати?

- Так, так! загула громада.

- То нехай же бог помагає! сказали вони і, піднявши високо вгору копне
- знамено, встромили його в дірку, продовбану в камені. Се був знак,
- що рада зачата.

Потім устав зі свого місця найстарший у зборі, Захар Беркут, і
повільним, але твердим кроком виступив під липу, і, доторкнувшися її
рукою, наблизився до пливучої з її коріння нори, і, припавши на
коліна, помазав собі нею очі й уста.

Се була звичайна стародавня церемонія, що знаменувала очищення уст і
прояснення ока, потрібне при такім важнім ділі, як народна рада. По
тім він сів на підвищенім місці, звернений лицем до народу, тобто до
східної сторони неба.

Захар Беркут - се був сивий, як голуб, звиш 90-літній старець,
найстарший віком у цілій тухольській громаді. Батько вісьмох синів, із
яких три сиділи вже разом

із ним між старцями, а наймолодший, Максим, мов здоровий дубчак між
явориною, визначався між усім тухоль-ськкм парубоцтвом. Високий
ростом, поважний поставою, строгий лицем, багатий досвідом життя й
знанням людей та обставин, Захар Беркут був правдивим образом тих
давніх патріархів, батьків

і провідників цілого народу, про яких говорять нам тисячолітні пісні
та перекази. Незважаючи на глибоку старість, Захар Беркут був іще
сильний і кремезний. Правда, він не робив уже коло поля, не гонив
овець у полонину, ані не ловив звіра в лісових нетрях,- та, проте,
працювати він не переставав. Сад, пасіка й ліки - се була його робота.
Скоро лишень весна завітає в тухольські гори, Захар Беркут уже в своїм
саду, копле, чистить, підрізує, щепить і пересаджує. Дивувалися
громадяни його знанню в садівництві, тим більше дивувалися, що він не
крився з тим знанням, але радо навчав кождого, показував

і заохочував. Пасіка його була в лісі, і кождеї погідної днини Захар
Беркут ходив у свою пасіку, хоч дорога була утяжлива і досить далека.
А вже найбільшим добродієм уважали тухольці Захара Беркута за його
ліки. Коли було настане час між зеленими святами а святом Купайла,
Захар Беркут з своїм наймолодшим сипом Максимом іде на кілька неділь у
гори за зіллям і ліками. Правда, чисті та прості звичаї тодішнього
народу, свіже тухольське повітря, просторі та здорові хати і
ненастанна та зовсім не надсильна праця - все те вкупі хоронило людей
від частих і заразливих хвороб. Зате частіше лучалися каліцтва, рани,
на які, певно, ніякий знахар не вмів так скоро і так гарно зарадити,
як Захар Беркут.

Але не в тім усім покладав Захар Беркут головну вагу свого старечого
життя.

«Життя лиш доти має вартість,- говорив він частенько,- доки чоловік
«може помагати іншим. Коли він стає для інших тягарем, а хісна не
«приносить їм ніякого, тоді він уже не чоловік, а завада, тоді він уже
«й жити не варт. Хорони мене боже, щоб я коли-будь мав статися тягарем
«для інших і їсти ласкавий, хоч і як заслужений хліб!» Ті слова - то
«була провідна, золота нитка в життю Захара

Беркута. Все, що він робив, що говорив, що думав, те робив, говорив і
думав з поглядом на добро і хосен інших, а поперед усього - громади.
Громада - то був його світ, то була ціль його життя. Ви-дячи, що
медведі та дики часто калічать худобу й людей у горах, він, ще бувши
молодим парубком, задумав навчитися лічити рани і, покинувши
батьківський дім, вибрався в далеку, незнайому дорогу до одного
славного ворожбита, який, чутка була, вмів замовляти стріли й кров.
Але примова того лікаря показалася пустою. Захар Беркут, прийшовши до
нього, обіцяв йому десять ку-шіць плати, щоб навчив його своєї
примови.

Ворожбит пристав, але Захарові не досить було навчитися насліпо, він
хотів попереду переконатися, чи лік ворожбитів добрий. Він вийняв свій
ніж і задав собі ним глибоку рану в стегно.

- На, заков,сказав він до зачудованого лікаря. Примова не вдалася.

- Е,сказав лікар,це для того не вдається, що ти самовільно завдав собі
- рану.

Такої рани замовити не можна.

- Ну, то видно, що кепська твоя примова, і мені Гі не потрібно. Я
- потребую такої примови, котра не питала би, чи рана само