�는 공식과는 달라서 사랑을 죽이기 위해서 제 목숨을 죽이는 것이었다. 그렇다 하더라도,
`사랑은 목숨을 빼앗는다.'
는 데에는 다름이 없다.
나는 불쾌도 하고 몸도 으스스하여 얼른 자리에 누웠다. 며느리가 들어온 뒤부터 사랑 생활을 하는 지가 벌써 오 년이나 되었다. 우리 부처란 인제는 한 역사적 존재요, 윤리적 관계에 불과하였다. 오래 사귄 친구와 같은 익숙함이 있고, 집에 없지 못할 사람이라는 필요감도 있지마는 젊은 부처가 가지는 듯한 그런 정은 벌써 없는 지 오래였다. 아내도 나를 대하면 본체만체, 나도 아내를 대하면 본체만체, 무슨 필요가 있어서 말을 붙이더라도 아무쪼록 듣기 싫기를 원하는 듯이 톡톡 내던졌다. 아내도 근래에 와서는 옷도 아무렇게나, 머리도 아무렇게나, 어디 출입할 때밖에는 도무지 화장을 아니 하였다.
그러나 그렇다고 우리 부처의 새가 좋지 못한 것도 아니었다. 서로 소중히 여기는 마음도 있었다. 아내가 안에 있다고 생각하면 마음이 든든하고 또 아내의 말에 의하건대 내가 사랑에 있거니 하면 마음이 든든하다고 한다.
우리 부처의 관계는 이러한 관계다.
나는 한 방에서 혼자 잠을 자는 것이 습관이 되어서 누가 곁에 있으면 잠이 잘 들지 아니하였다. 혹시 어린것들이 매를 얻어맞고 사랑으로 피난을 와서 울다가 내 자리에서 잠이 들면 귀엽기는 귀여워도 잠자리는 편안치 아니하였다. 나는 책을 보고 글을 쓰고 공상을 하고 있으면 족하였다. 내게는 아무 애욕적 요구도 없었다. 이것은 내 정력이 쇠모한 까닭인지 모른다.
그러나 최석의 편지를 본 그 날 밤에는 도무지 잠이 잘 들지 아니하였다. 최석의 편지가 최석의 고민이 내 졸던 의식에 무슨 자극을 준 듯하였다. 적막한 듯하였다. 허전한 듯하였다. 무엇인지 모르나 그리운 것이 있는 것 같았다.
"어, 이거 안되었군."
하고 나는 벌떡 일어나 담배를 피워 물었다.
"나으리 주무셔 곕시오?"
하고 아범이 전보를 가지고 왔다.
"명조 경성 착 남정임"
이라는 것이었다.
"정임이가 와?"
하고 나는 전보를 다시 읽었다.
최석의 그 편지를 보면 최석 부인에게는 어떤 반응이 일어나고 정임에게는 어떤 반응이 일어날까, 하고 생각하면 자못 마음이 편하지 못하였다.
이튿날 아침에 나는 부산서 오는 차를 맞으려고 정거장에를 나갔다.
차는 제 시간에 들어왔다. 남정임은 슈트케이스 하나를 들고 차에서 내렸다. 검은 외투에 검은 모자를 쓴 그의 얼굴은 더욱 해쓱해 보였다.
"선생님!"
하고 정임은 나를 보고 손에 들었던 짐을 땅바닥에 내려놓고, 내 앞으로 왔다.
"풍랑이나 없었나?"
하고 나는 내 손에 잡힌 정임의 손이 싸늘한 것을 근심하였다.
"네. 아주 잔잔했습니다. 저같이 약한 사람도 밖에 나와서 바다 경치를 구경하였습니다."
하고 정임은 사교적인 웃음을 웃었다. 그러나 그의 눈에는 눈물이 있는 것 같았다.
"최 선생님 어디 계신지 아세요?"
하고 정임은 나를 따라 서면서 물었다.
"나도 지금까지 몰랐는데 어제 편지를 하나 받았지."
하는 것이 내 대답이었다.
"네? 편지 받으셨어요? 어디 계십니까?"
하고 정임은 걸음을 멈추었다.
"나도 몰라."
하고 나도 정임과 같이 걸음을 멈추고,
"그 편지를 쓴 곳도 알고 부친 곳도 알지마는 지금 어디로 갔는지 그것은 모르지. 찾을 생각도 말고 편지할 생각도 말라고 했으니까."
하고 사실대로 대답하였다.
"어디야요? 그 편지 부치신 곳이 어디야요? 저 이 차로 따라갈 테야요."
하고 정임은 조급하였다.
"갈 때에는 가더라도 이 차에야 갈 수가 있나."
하고 나는 겨우 정임을 끌고 들어왔다.
정임을 집으로 데리고 와서 대강 말을 하고, 이튿날 새벽 차로 떠난다는 것을,
"가만 있어. 어떻게 계획을 세워 가지고 해야지."
하여 가까스로 붙들어 놓았다.
아침을 먹고 나서 최석 집에를 가 보려고 할 즈음에 순임이가 와�