�? რა-რიგად გაუხარდება ქალსა!
— თორემ მამას კი არა, — სთქვა სუტ-კნეინის ქებით გაზვიადებულმა ლუარსაბმა.
— არ გაუხარდება, თქვენმა მზემ! — გაუძნელა ძალად საქმე სუტ-კნეინამ.
— მაშ იმისგან არა ხართ მოგზავნილი?
— რას ბძანებთ? იმისაგან რომ ვიყო, საქმე გათავდებოდა, რაკი თქვენი ნებაც არის. ის არის, რომ თითონ მამა დიდს უარზედ სდგას.
— უარზე სდგასო!.. — წამოიძახა გულნატკენმა ლუარსაბმა, — რაში მიწუნებს მითამ? გვარი იმაზედ ცუდი არა მაქვს და ოჯახი მითამ რაო?
— ეხლა, ხომ მოგეხსენებათ, რიხიანი კაცია.
— მაშ არა იქს, რაღა?
— როგორ არა იქს, მაგრამ დიდი ცდა და ხერხიანობა კი უნდა.
— აშ შეიძლება დავიყოლიოთ?
— ვინ იცის? ეგ ხერხზედ ჰკიდია, მაგრამ მაინც კიდევ ღმერთმა იცის, ჯიუტი კაცია.
— ერხი კიდევ თქვენი საქმეა.
— მართალია, მაგრამ მარტო ჩემი ხერხი რასა იქს?
— სხვა რა უნდა? რაც შემეძლება, ჩემ კისერზედ იყოს. მადლის გადახდა ჩვენც ვიცით.
— უი, შენ გეთაყვანე, შენა! მაგას ვინ მოგახსენებს? გულუხვობაში თქვენი გვარი დიდი ხანია განთქმულია, განა არ ვიცი, თუნდ ეგ არ იყოს, დედიშენის შვილს მე უნდა გამოგართო რამე, მაშინ შემერგება ლუკმა? არა, გეთაყვა, მე მაგას არ ვიქ, — ეგ შენ იცი. მაგრამ... მაგარი ეს არის, რომ „ქრთამი ჯოჯოხეთს ანათებსო“, ერთი ოციოდ თუმანი მოგინდება, რომ იმისი მახლობლები შემოვისყიდოთ. ერთი კაცია იქ, იმისი სიტყვა გძელაძიანთ მოსესათვის ბეჭედია, ფირმანია სწორედ. იმას უნდა ხახა დავულბოთ.
— ეხლა სად ვიშოვო მე ოცი თუმანი? — უთხრა ცხვირ-პირ-ჩამოშვებულმა და დაღონებულმა ლუარსაბმა.
— მაგაზედ ნუ შესწუხდები: შენ თამასუქი მამეც და ფულს მე გიშოვი.
— ბატონი ხარ. აი, თუნდ ეხლავ, — წაატანა სიტყვა გახარებულმა ლუარსაბმა.
სუტ-კნეინამ, რომ ჰნახა ესე ადვილად ლუარსაბის დაყოლება, იფიქრა: სულელი ყოფილა, რატომ ბლომად არ ვუთხარიო და, რომ გაასწოროს შეცდომა, ეს მოიგონა:
— ეს კი უნდა იცოდე, ჩემო შვილო, რომ დიდს სარგებელს გამოგართმევენ.
— დიდსა? მაინც რამდენს?
— თუმანზედ შვიდ შაურს.
— რა ვუყოთ, მივცემ. „როგორც გიჭირდეს, ისე გიღირდესო“, — ნათქვამია...
— მაშ ყური დამიგდე: შენ ჯერ უარზედ დადეგ, ვინც რა უნდა გითხრას, ფეხი მაგრა დააჭირე, იქნება იმ ქოფაკს, როცა დაყაბულდება, ჭახრაკი მოვუჭიროთ, მეტი დავსტყუოთ, გესმის? მე სულ შენთვის ვამბობ, თორემ მე რა მერგება. ხომ გესმის?
— ესმის, როგორ არ მესმის! ფეხი უნდა დავაჭირო.
— მაშ ეხლა მე ვიცი, ხვალ დილაზედ თამასუქს მოვამზადებინებ, შენც ხელი მოაწერე და მერე მე ვიცი.
— თამასუქი წინ მოგცე?
— მაშ, ქა!.. ფულს ისე ვინ განდობს? მე რომ მქონდეს, არ დაგიჭერ, ხომ იცი. დედი-შენის შვილს როგორ დავუჭერ, მაგრამ მე, ქვრივ-ოხერს, ვინ მომაბადა, სომეხს უნდა გამოვართო. აბა სომეხი, ხომ იცი, რა ურიაა.
— ვიცი, ვიცი.
— მერე, როცა გავარიგებ, მეც ერთი ქვრივ-ოხერი ვარ... ერთი-ორჯერ პურს მაინც მაჭმევ, — შეაბრალა თავი სუტ-კნეინამა, — შენი გვარი დარდიმანდობაში და პურ-მარილობაში განთქმულია.
ლუარსაბს იამებოდა ხოლმე, როცა ეგრე იხსენიებდნენ იმის გვარს, ოღონდ ეს გეთქვა და ჩოხას გაიხდიდა და შენ ჩაგაცმევდა.
— ერთი ეს მითხარ, ქალი როგორია? ყველა-ყველა და ეს კი დაგვავიწყდა, — მოიგონა ბოლოს ლუარსაბმა.
— წიგნში და ხელსაქმეში კარგად გაწურთვნილია, მეტი რა გინდა, — უპასუხა იმანაც.
— წიგნი რად მინდა? რა, ბრძნად ხომ არ დავსომ!.. შენ ერთი ეს მითხარ, მადლიანი სახე აქვს? ფერზედ როგორ არის?
— მაგას ნუღარ მკითხავ, კალმით ნახატია.
— მაშ რაღა, ფეხი დავაჭირო? — ჰკითხა ლუარსაბმა, რომელსაც სუტ-კნეინის უკანასკნელ სიტყვებზედ სიხარულმა და წადილმა ტანში მეტად საამურად გაურბინა.
— დიაღ, ფეხი დააჭირე. ამას შენთვის ვამბობ, რადგანაც ჩემს დაზედ უკეთესის შვილი ხარ, თორემ — თითონ შენ იცი — მე გამორჩენა არა მაქვს-რა. ჩემის სულის საცხონებლად მინდა მოვახდინო ეს საქმე, თორემ მოსე გძელაძე მე არას მამცემს. ნეტავი დავიყოლიო და დედი-შენის შვილის ბედნიერება მოვახდინო და გამორჩენას ვინ იკითხავს!
— ჩემ კისერზედ იყოს ეგა. ლამაზია? — ჰკითხა ღიმილით კიდევ ლუარსაბმა.
— გითხარ — კალმით ნახატია-მეთქი.
— ორასი თუმანიცა აქვს?
— იქნება მეტიც. — ეგ მე და შენზედ ჰკიდია.
— იქნება მეტიცო!.. ჰა, თქვენ რას იტყვით, ცუდი არ იქნება, — ისე სთქვა ლუარსაბმა, თითქო რჩევას ეხლა აპირებსო.
— შენ როგორღაც გულში ჯერ არ გადაგიწყვეტნია, როგორც ვხედავ, — დაატანა ცბიერმა სუტ-კნეინამ, რომ გამოათქმევინოს, გულში კარგად გაუჯდა თუ არა; თუ გაუჯდა, კიდევ დასტყუოს რამე.
— ეჰ, რას ბძანებ?
— როგორ რას ვბძანებ? თუ გულში არა გაქვს, ნუ შემარცხვენ, ეხლავ თავი დამანებებინე.
— თავი როგორ დაგანებებინო, რომ იმ ქალის სიყვარული გულში ნაღვერდალსავით ჩამიგდე. აბა, როგორ დავანებო თავი? მითამ რაში დავიწუნებ?
— მაშ გავათავეთ?
— გავათავეთ.
— უი, შენ გენაცვალოს ჩემი თავი! ძლივს დედი-შენის მოვალეობას და უფლისა წინაშე აღთქმას არ შევასრულებ, თუ მოსე გძელაძე ძალიან არ გაგვიჯიუტდა!
— ის კაცი რომ სთქვი, მოიყიდე, მეც აქ ფეხს დავაჭერ.
— ნეტავი იმის მეტი ქრთამი არ დაგვეხარჯოს! იქნება სხვასაც მოუნდეს.
— შუაზედ გაუყავ ოცი თუმანი.
— უი ჩემ თვალებს! ქა, როგორ იქნება? უბრალო კაცის შვილები ხომ არ არიან, ათ-ათ თუმანში ხელი გაისვარონ, თავადიშვილები არიან, სახელგანთქმულები, იმათი მოსყიდვა ადვილი არ არის. აი, როგორ გეტყობა, რომ ჯერ ყმაწვილი ხარ.
— ოცის წლისა ჯერ სრული არა ვარ, — იტყუა ლუარსაბმა, სრული იყო.
— ისიც ჩვიდმეტის წლისა იქნება. სწორედ გვრიტები იქნებით. უი, ნეტავი კი იმ ბედნიერ დღეს შევესწრა, რომ თქვენ ერთად მხარი-მხარ მსხდომნი გნახოთ და! ბევრი არ შემოგნატრებენ!
— მაშ ერთი აუჩქარე, თუ მართლა ეგრეა, თუ ღმერთი გწამს, — შეეხვეწა მოუთმენელი ლუარსაბი.
— ნეტავი ჩემს აჩქარებაზედ იყოს დამოკიდებული და მალე მტერი მოგიკვდეს, მალე მე მაგას ბოლო მოვუღო, მაგრამ ის წყეული მამაა საქმე. ღმერთი მოწყალეა, ნუ გეშინიან.
ეგრე გათავდა პირველი მოციქულობა სახელოვანის მოციქულისა. ლუარსაბს ამ დღის აქეთ, ცხადივ თუ სიზმრად, სულ ის კალმით ნახატი ქალი აგონდებოდა და ორას-თუმნიანი პარკი. საღერღელი მეტად აეშალა, სურვილმა მეტად აადუღა, ასე რომ, როცა მოიგონებდა, ერთს ლაზათიანად გაიზმორებდა და ამას იტყოდა მსუნაგსავით ტუჩის ლოკვითა: „კალმით ნახატი ქალი, ორასი თუმანი ბაჯაღლო ოქრო და იქნება მეტიცო... ჰა! რას იტყვი ლუარსაბ, ურიგო არ იქნება, განა? ამაზედ არის ნათქვამი: „ბედი მომეცი და სანახვეზედ გადამაგდეო!“
VII
 თუმცა სუტ-კნეინამ თავის ანგარიშების გამო საქმე ცოტად გააგრძელა, მაგრამ მალე უნდა გათავებულიყო, რადგანაც ორივეს მხრივ ნების დართვა იყო. სუტ-კნეინის ანგარიშების გარდა, ერთი სხვა ხიფათიც მოსდევდა ამ საქმ�