გორ?
— თუ შენ შემეწევი, ჩემო დაო, და ჩემს პურ-მარილს არ დაივიწყებ, საქმეს დამში მოვიყვანთ.
— აბა, გეთაყვა, მე რაღა თხოვნა მინდა, ხომ იცი ჩემს თავს შენის სამსახურისათვის არ დავზოგავ.
— მაშ თუ ეგრეა, დამაცა.
ადგა მოსე, გავიდა გარეთ და პატარა ხანს შემდეგ შემოიყვანა ერთი მშვენიერი, მოხდენილი ახალგაზრდა გოგო. დააყენა სუტ-კნეინის წინ, ხან აქეთ შემოატრიალა, ხან იქით, მერე უბძანა, რომ გარეთ გავიდეს.
გამოცდილი სუტ-კნეინა მიხვდა, რასაც მოასწავებდა ეს ამბავი, მაგრამ თავი მოიკატუნა, მითამ და არაფერი იცის. მოსე გძელაძე მოვიდა და მოუჯდა ისევ გვერდით.
— როგორ მოგეწონა? — დაიწყო გძელაძემ.
— ერთი ტურფა რამ არის, — უმანკოებით მიუგო მანკიერმა სუტ-კნეინამ.
— უფრო კარგი იქნება, რომ ჩემის ქალის ტანისამოსით მოვრთოთ?
— რასაკვირველია: ერთი-ორად მოემატება სიკეკლუცე.
— ეხლა შენ რას იტყვი, რომ ნიშანის მომტანს ეს გოგო, ლამაზად მორთული, ჩემის ქალის მაგიერად ვაჩვენოთ? — ჰ