��ას გამოგზავნის.
— უფრო კარგი. რასაც თავის თვალით ჰნახავს, თუნდ ქრთამი არ იყოს, ის არ უნდა უთხრას? თორემ ფულიც ხომ არა მშურს.
— არა, გეთაყვანე, მე მაგ ცოდვაში არ ჩავდგები. აი, შენი ბეედ მოცემული ხუთი თუმანი, მე კი ხელი დამიბანია.
ამოიღო ორი ოც-და-ხუთ მანეთიანი ასიგნაცია და მისცა მოსეს გამოქნილმა მოციქულმა.
— მაშ მღალატობ?.. — უთხრა გულის სატკენად მოსემა, — მაშ ჩემი ოჯახის დაღუპვა გინდა? მაშ ჩემი საწყალი ქალი არ გებრალება? ეჰ! მუხანათო წუთის-სოფელო!.. სულ ტყუილი ყოფილა: პურმარილიც, პატივისცემაც, სიყვარულიც, მეგობრობაც!.. ეჰ, შენი ნებაა!.. ეს კი იცოდე, რომ გულში შხამ-წასმუ�