ცი, ჩემი საქმე მაშინ გათავებული იქნება.
— ნიშნობის ღამეს ფულს სრულად ჩაგაბარებ, ეხლა თუ გინდა, ეს ხუთი თუმანი ბე ისევ წაიღე.
— არა, ათი თუმანი მიბოძე, რა ვიცი, იქნება როგორ დამჭირდეს, აქ ხომ ვერ გამოვიქცევი.
— შვიდ-თუმან-ნახევარი იყოს ჯერ.
— ათი მიბოძე. ისევ შენის საქმისათვის მინდა, შენს საქმეს მოვახმარებ, თუ გამიჭირდა. ჩემთვის ხომ არა გთხოვ.
— რა? ეს ათი თუმანი იმ ოც-და-ათ თუმნის ანგარიშში არ გინდა წაიღო თუ?
სუტ-კნეინამ გაიცინა.
— მაშ, ქა?
— ჰო, ეგრე სთქვი, მე მეგონა, მართლა, ეს ცალკე გინდა, რომ ჩემს საქმეს მოახმარო.
— არა, გეთაყვანე, იმის ანგარიშში მიმაქვს. საკაბე კი მალე მიბოძე, რომ შეკერვა მოვასწრო.
— აი, ათს თუმანს მოგართმევ, იქიდამ შეიკერე და მერე გავსწორდებით.
სუტ-კნეინა დაჰყაბულდა, მაგრამ მოსტყუვდა კი.
რაღა გავაგრძელო, მოსემა და კნეინამ ესე დააწყეს საქმე და სწორედ ეგრეთაც ბოლო მოუღეს. კაი ბადე დაუგეს ლუარსაბსა და კარგადაც გააბეს.
ორი კვირა რომ გავიდა, აღტაცებულმა ლუარსაბმა, აქაო და საქმე გარიგდაო, კარგის ნიშანით თავისი უფროსი ძმა დავითი გამოისტუმრა. დიდის ყოფით მიიღეს დავითი. ხალხი მოსემ არ მოიწვივა, სრულიად არავინ, რომ ეშმაკობა არ შეუტყონ, ლუარსაბსაც მისწერა — ნურავის შეატყობინებო. აი, ის წიგნი ნამდვილი თავის ღირსებით და შეცდომებით:
„ჩემო აღმატებულო ბედნიერო გვაროვანო სიძეო:.
„თუმცა დიდათ ბედნიერი ვარ რომელიცა რომა შენგანა ვარ დღეს მოხუცებული ბედნიერი და გული ჩემი სიხარულით აღავსე ნეტარითა სიძოობითა თქვენითა და თვალი ჩემი აახილე რომელიცა რომა დაინახა ისევ გაზაფხული მუხთალისა სოფლისა ამისა ფრიად სიხარულში ვარ რომელიცა ეხლა ვარ ჩემო აღმატებულო გვაროვანო სიძეო რომელიცა გთხოვ გამოგზავნო ნიშანი რომა საქმემ არ დაიგვიანოს დიდი ხალხი არ გამოგზავნო რომელიცა რომა მე მოხუცებული კაცი ავადა ვარ სნეული და პატივი და მასლაათი და ქეიფი რომელიცა აწ მე აღარ ძალმიძს რომელიცა ფრიად შეაწუხებენ ქორწილში რომელიც თქვენ იქნებით ჩემს სახლში მასპინძელი დიაღ დიდი ხალხი მოვიწვიოთ თქვენცა დიდი და პატიოსანი ნათესაობა გყავს რომელიცა არც მე ვარ უნათესაო და ბლომად შევყაროთ ისე როგორათაც შეჰფერის დიდებულს გვაროვნობასა თქვენსა და ჩემსა ოჯახს სახლკარიანობასა ჩემსა.
“სხვებრ ბძანდებოდეთ ბედნიერებით იესო ძე ღვთის მიერ ვითხოვ თქვენს ბედნიერებას რომელიცა რომა მსურს ნახვა თქვენი თქვენი სიმამრი ბრწყინვალე თავადი მოსე ნოშრევანისძე გძელაძე:.”
რასაკვირველია, თავაზიანი ლუარსაბი ამ წიგნის შემდეგ აღარ გაგზავნიდა ბევრს ხალხსა. მარტო ერთი დავითი და ერთი კიდევ ვიღაცა გამოისტუმრა, რომ ახალი სიმამრი, რადგანაც ავად არის, არ შეაწუხონ, დავითს კი დააბარა, რომ ფულზედ კარგად მოილაპარაკოს, როდის ჩააბარებენ, და მერე ქალი კარგად გასინჯოს.
დიდის პატივით მიიღო მოსემ დავითი. ქალის მაგიერად ის მშვენიერი გოგო მორთეს და დავითს ისე აჩვენეს. დავითი გაგიჟდა — რომ დაინახა და გულში არ იყო რომ შურმაც არ გაუარა, ნამეტნავად თავისი მჭლე ცოლი რომ მოაგონდა ამასთან. ვახშამზედ რომ ისხდნენ, მარტო ოთხნი იყვნენ — დავითი და ამასთან მოყოლილი ის ვიღაცა, თითონ მოსე და ამისი მოზრდილი შვილი. კნეინაც თუმცა მოსესთან იყო, მაგრამ ქალთან ივახშმა. მოსემ ბოდიში მოიხადა, რომ ხალხი არ დაუპატიჟა ამისთანა ბრწყინვალე გვარიშვილებსა.
— რა ვქნა, შენი ჭირიმე, — უთხრა დავითს მოსემა, — ჩემო ახალო მოყვარევ! ავადა ვარ, თასლიბს ვერ გავუწევდი. სიძუნწეში არ ჩამომართო, შენი ჭირიმე! აბა, ჯერ ისე ავადმყოფი რა არის, მერე მასპინძელი რა უნდა იყოს. თორემ იმდენი სიკეთე ღმერთმა შენ მოგცეს, რამდენი ნათესაობა და მახლობლობა მე მყვანდეს. მაგრამ ჩემი მაყურებლები რა ქეიფს გასწევდნენ. ისევ ის ვამჯობინე — ნუ დავპატიჟებ-მეთქი. ამ ნიშნობამ ისე შინაურულად ჩაიაროს, ქორწილი კი ჩემ კისერზედ იყოს. ქორწილისა რა ბძანა ჩემმა სიძემა?
— რაც ჩქარა იქნება, ისა სჯობიაო, — უპასუხა დავითმა, პირფერობაში კი ნუ ჩამომართმევთ და ეს ქალი რომ ჰნახოს იმან, იმ წამშივე ჯვარს დაიწერს, თავი არ მომიკვდება!
— მზეთუნახავი ყოფილა, — დაუმატა სტუმარმაც.
— რა ვქნა? მადლობა ღმერთსა, ღმერთმა ეგ მომცა და ყველაფერი ღვთის ნებაზედ ჰკიდია, — თქვა მოსემა, — მიხარიან, თქვენმა მზემ, რომ ქალი მოგეწონათ.
— ღმერთმა აცოცხლოს პატარძალი! — წამოავლო ჯამს ხელი დავითმა, — ღმერთმა ტკბილად შეაბეროსთ ერთმანეთს!
— მადლობელი ვარ, თქვენი ჭირიმეთ! — დაუკ�