�езнищимо в вашу тямку те становище, на якім би нам, по моїй думці,
- треба стояти, твердо стояти до крайньої крайності. А втім, і тут ні
- я, ні ніхто інший не має власті над вами: схочете, то послухаєте, а
- не схочете воля ваша! Тільки ж кажу вам, що сьогодні ми стоїмо на
- розстайній дорозі, сьогодні нам прийдеться вибрати: сюди чи туди.
- Тож годиться нам, людям старим і досвідним, добре вияснити собі той
- вибір і ті дороги, на які він може повести нас, і те місце, на
- котрім ми стоїмо тепер!

- Погляньте, чесна громадо, на те наше копне знамено, котре від
- п'ятдесятьох літ чує наші слова і бачить наші діла. Чи знаєте ви, що
- виражають його знаки? Святі

і поважні старці, батьки наші, зробили його і передали мені його
значення.

«Захаре,- сказали вони,- колись, у хвилі найгрізнішої небезпеки, коли
«життя наверне супротивну хвилю на громаду і загрозить її порядок,-
«тоді ти відкриєш громаді, що значить се знамено, а заразом відкриєш,
«що на нім спочиває наше й нашого духа-опікуна благословенство, що
«відступлення від тої дороги, яку вказує те знамено, буде найбільшим
«нещастям для громади, буде початком її цілковитого упадку!»

Захар утих на хвилю. Його бесіда зробила велике враження на всіх
громадян.

Усіх очі звернені були на знамено, що на високій жердці, встромленій у
камінь, стояло перед громадою, блискотіло срібною оковою на своїх
кільцях і повівало кармазиновою хоруговкою, немов переливалось живою
кров'ю.

- Я досі не говорив вам про се нічого,говорив Захар дальше,бо часи
- були спокійні. Але сьогодні пора се зробити. Глядіть на нього, на се
- знамено наше! З одного здорового пня вироблений весь той суцільний
- ланцюг, сильний і немов замкнутий у собі, а прецінь свобідний в
- кождім поєдинчім колісці, готовий прийняти всякі зв'язки. Сей ланцюг
- то наш руський рід, такий, який вийшов з рук добрих, творчих духів.
- Кожде колісце в тім ланцюзі то одна громада, нерозривно, з самої
- природи зв'язана з усіма іншими, а, проте, свобідна сама в собі,
- немов замкнена сама в собі, живе своїм 