розірветься. От так і упадок
- вольних громадських порядків у одній громаді стає раною, котра
- приносить недугу, а то й заразу для цілого тіла нашої святої Русі.

Горе громаді, котра добровільно станеться тою раною, котра не ужиє
всіх сил і способів, щоб удержати себе прії здоров'ю! Ліпше би було
такій громаді щезнути з лиця землі, запастися в безодню!

Остатні слова Захара, сказані грізним, піднесеним голосом, приглушили
в ушах слухаючої громади шум водо-паду, що недалеко гримав собою о
камінь і, мов живий стовп кришталю, граючи проти сонця всіми барвами
веселки, видавався блискучою пасмугою понад головами громади. Захар
говорив дальше:

- Гляньте ще раз на те знамено! Кожде колісце його ланцюга сковане
- блискучими срібними оковами в гарні узори. Окови ті не обтяжають
- колісця, а додають йому оздоби й тривкості. Так само кожда громада
- має свої дорогоцінні установи і порядки, породжені потребами,
- упорядковані розумом мудрих батьків наших. Порядки ті святі, але не
- для того, що давні, що батьками нашими уладже-ні, тільки для того,
- що свобідні, що не в'яжуть нікого доброго в добрім діланню, а
- в'яжуть лиш злого, що хотів би шкодити громаді. Порядки ті не
- в'яжуть і громаду, а тільки додають їй сили і власті для охорони
- всього, що добре і хосенне, а для знищення всього, що зле і шкідне.
- Коли б не ті срібні окови, дерев'яні обручки легко могли би
- потріскати і вся одноцілість ланцюга пропала би. Так само, якби не
- наші святі громадські установи, то й уся громада пропала би.
- Уважайте ж, чесна громадо! Злодійські руки простягаються, щоб
- обдерти ті срібні окови з нашого колісця, щоб ослабити і ногами
- потоптати наш громадський лад, при якім нам так добре жилосяі

- Ні, ми не попустимо їм того! крикнула разом од-нодушно
- громада.Станемо в обороні своєї свободи, хоч би прийшлося нам і
- остатню краплю крові пролити!

- Добре, діти! сказав зворушений Захар Беркут.Так воно й треба! Вірте
- мені, се дух нашого великого Сторожа прорік із вас! Ви його силою
- вгадали значення тої хоругви, що повіває на нашім знамені. Чому вона
- червона? Бо значить кров!

До остатньої краплі крові п