їй обороні!

В тій хвилі очі всіх громадян, немов на даний знак, звернулися в
сторону села.

Там, на шляху, що вів від села попри водопад у гори, показалася
невеличка громада пишно построєних, оруж-них людей. Се йшов у всій
своїй пишноті на тухольську раду боярин Тугар Вовк зі своєю дружиною.
Незважаючи на гарячу весняну днину, боярин був у повній рицарській
зброї: в панцирі з залізної блискучої бляхи, в "аких же набедрениках і
наголінниках і в блискучім спижевім шоломі з розвіяною поверх нього
китото з когутячих косиць. При боці у нього теліпався в піхві тяжкий
бойовий меч, через плечі перевішений був лук і сагайдак зі стрілами, а
за поясом стримів топір, блискучий широким сталевим вістрям і бронзою
набиваним обухом. Поверх усеї тої страшної зброї, на знак супокійного
свого наміру, боярин накинув вовчу шкуру, з пащею, переробленою в
защіпку на груді, і з лабами, що гострими кігтями обхапували його
пояс.

Довкола боярина йшло десять вояків, лучників і топірників, повбираних
у такі ж вовчі шкури, але без панцирів. Мимоволі стрепенулася
тухольська громада, побачивши наближення тої вовчої дружини; всі
зрозуміли, що се, власне, й є той ворог, який напосівся на їх свободу
й незалежність. Але поки що вони ще не надійшли, а Захар кінчив свою
бесіду.

- Ось надходить боярин, котрий хвалиться, що з милості для нього князь
- подарував йому наші землі, нашу свободу, нас самих. Бачте, як гордо
- виступає він у тім почуттю княжої милості, в тім почуттю, що він
- княжий слуга, що він раб! Нам не потрібно милості від боярина і ні
- за що ставати нам рабами се причина, для чого він ненавидить нас і
- прозиває нас смердами. Але ми знаємо, що гордість ного пуста і що
- правдиво свобід-ному чоловікові личить не гордість, а супокійна
- повага та розум. Заховайте ж проти нього ту повагу і той розум, щоб
- не ми упокорили його, а сам він у глибині свого сумління почув себе
- упокореним! Я скінчив.

Тихий шепіт вдоволення і радісної рішучості пройшов по громаді. Захар
сів на своє місце. Хвилю стояла мовчанка на майдані, поки Тугар Вовк
не наблизився до ради.

- Здорові були, громадо! сказав він, дотикаючи рукою свого шолома, але
- не знімаючи його з голови.

- Здоров будь і ти, боярине! відповіла громада. Тугар Вовк гордим,
- безпечним поступом вийшов перед громаду і, ледве окинувши її оком,
- проговорив:

- Ви кликали мене перед себе і ось я. Чого хочете від мене?

Слова ті сказані були різким, гордим голосом, котрим боярин, очевидно,
хотів показати громаді свою вищість. При тім він не дивився на
громаду, але обертав у руках свій топір і немов любувався блиском його
вістря та обуха, показуючи явно, що глибоко погорджує цілою тою радою.

- Ми закликали тебе, боярине, перед суд громадський, щоб, заким
- осудимо твої поступки, вислухати твого слова. Яким правом і в якій
- цілі ти робиш кривду громаді?

- На суд громадський? повторив, немов зачудува-ний, Тугар Вовк,
- обертаючись лицем до Захара.Я княжий слуга і боярин. Ніхто не має
- права судити мене, окрім князя і рівних мені бояр.

- Про се, боярине, чий ти слуга, ми не будемо з тобою сперечатися,се
- нас нічого не обходить. А про твоє право поговоримо пізніше. Тепер
- тільки будь ласкав сказати нам: відкіля прийшов ти в наше село?

- Зі столичного княжого міста Галича.

- А хто велів тобі йти сюди?

- Мій і ваш пан князь Данило Романович.

- Говори про себе, а не про нас, боярине! Ми вольні люди і не знаємо
- ніякого пана. А чого ж велів тобі твій пан іти в наше село?

Лице боярина облилося червоною пасмугою злості при тих словах Захара.

Хвилю він вагувався, чи відповідати дальше на його допитування, далі
погамував свій невчасний порив.

- Він велів мені бути сторожем його земель і його підданих, воєводою і
- начальником Тухольщини і дав мені і моїм потемкам у вічне посідання
- тухольські землі в нагороду за мою вірну службу. Ось його грамота,
- його печать

і підпис!

При ти�