ними?

- Князь робить з ними ще більше,відповів боярин.Він дає їм мудрі права
- і мудрих суддів, посилає їм своїх вірних слуг, аби боронили їх від
- ворога.

- Не по правді сказав ти се, боярине,замітив строго Захар.Бач, сонце
- на небі закрило своє ясне лице, щоб не слухати твоїх кривих слів!
- Мудрі права наші походять не від твого князя, а від дідів і батьків
- наших. Мудрих суддів княжих ми не видали досі і жили тихо, в згоді й
- ладі, судячись самі громадським розумом. Батьки наші здавна вчили
- нас: один чоловік дурень, а громадський суд справедливий суд. Без
- княжих воєвод жили наші батьки, жили й ми досі, і, як бачиш, хати
- наші не попустошені, і діти наші не забрані до ворожої неволі.

- Так було досі, але відтепер не так 