όγια». Για τ' αδέλφια ήταν σα να σάλπισε σιωπητήριο. Σε τέτοια διαταγή δεν επιτρέπουνταν αντίρρηση. Και οι τρεις μικρότεροι, ευάγωγα, έκλεισαν τα μάτια τους.
Ξαπλωμένος χάμω, πίσω από το μολυβένιο στρατό του, το ένα μάτι κλειστό, σημαδεύοντας με το άλλο πού να ρίξει το βόλο του, είπε ο Αντώνης:
- Λοιπόν! Αποφάσισε! Είσαι ή δεν είσαι Τούρκος;
- Δεν είμαι! αναφώνησε αγανακτισμένος ο Αλέξανδρος, γονατισμένος και αυτός πίσω από το δικό του στρατό, τα χέρια του απλωμένα προστατευτικά πάνω από τα παρατεταγμένα μολυβένια στρατιωτάκια.
Ο Αντώνης άνοιξε το δεύτερο μάτι του για να αγριοκοιτάξει τον αδελφό του.
- Λοιπόν τι είσαι;
- Έλληνας! φώναξε ο Αλέξανδρος.
- Μα πώς μπορούν Έλληνες να πολεμούν και να σκοτώνουν Έλληνες; ρώτησε ο Αντώνης.
Ο Αλέξανδρος δεν ήξερε.
- Δε θέλω όμως να είναι Τούρκοι οι στρατιώτες μου! διαμαρτυρήθηκε θυμωμένος.
- Και ποιος θα είναι τότε Τούρκος; Πώς θα πολεμήσομε; Ή Έλληνες θα είναι οι στρατιώτες σου ή Τούρκοι! Αφού οι δικοί μου είναι Έλληνες, οι δικοί σου πρέπει να είναι Τούρκοι!
- Δε θέλω! επανέλαβε ο Αλέξανδρος.
Από το τραπέζι, όπου με μπλου και κόκκινα μολύβια χ�