�ρχομός της Πουλουδιάς σήμαινε επικουρία, σήκωσε το κεφάλι και παρακάλεσε:
- Πες του!
- Τότε μάζεψε το στρατό σου, είπε ο Αντώνης.
- Γιατί δε γίνεσαι εσύ Τούρκος; ρώτησε η Πουλουδιά.
- Εγώ;
Υπερήφανα έδειξε ο Αντώνης το στρατό του, ολοκαίνουριο, περιποιημένο, βερνικωμένο, σα να 'βγαινε από το μαγαζί, και χάιδεψε τη χάρτινη ελληνική σημαία, όχι πολύ τακτικά χρωματισμένη, αλλά παστρικά κολλημένη απάνω στη μολυβένια σημαία, για να σκεπάσει τα τρία της χρώματα.
- Αυτοί Τούρκοι; έκανε. Πώς μπορούν να είναι οι Τούρκοι πιο ωραίοι από τους Έλληνες; Και πώς μπορούν οι Έλληνες να έχουν αυτό το χάλι; πρόσθεσε με μια περιφρονητική κίνηση κατά τη μολυβένια μάζα του Αλέξανδρου.
Το επιχείρημα συγκίνησε την Πουλουδιά. Ειρηνευτικά είπε του Αλέξανδρου:
- Ας είναι Άγγλοι οι δικοί σου!
- Λαμπρά! Σαν τη μις Ράις! επιδοκίμασε ο Αντώνης που ήξερε τη νίκη του σίγουρη και ήταν ενθουσιασμένος να τραβήξει έναν τράκο στους συμπατριώτες της μις Ράις, ας ήταν και μολυβένιοι.
Ο Αλέξανδρος στάθηκε να συλλογιστεί.
- Καλά, είπε αργοκουνώντας πλαγίως το κεφάλι του, όχι για τη μις Ράις, μα γιατί ο θείος λέγει πως οι Άγγλοι μας έδωσαν την Κρήτη...
- Την Κέρκυρα! διόρθωσε ο Αντώνης. Πού η Κρήτη! Η Κρήτη θα ελευθερωθεί μόνη της! Αυτή δεν έχει ανάγκη από τους Άγγλους!
- Ναιαιαι; έκανε ο Αλέξανδρος. Πώς θα ελευθερωθεί;
- Θα κάνει επανάσταση, όπως ο Καραϊσκάκης... που μας έδειξε ό θείος τον τάφο του, και θα ελευθερωθεί όπως ελευθερώθηκε η Ελλάδα. Να! Αυτοί οι Κρητικοί είναι παλικάρια! Οι δικοί μου στρατιώτες λοιπόν είναι Κρητικοί!
- Ωραία! φώναξε μ' ενθουσιασμό ο Αλέξανδρος. Και οι δικοί μου Έλληνες...
Μα τον διέκοψε ο Αντώνης:
- Μπούφο! Και τι είναι οι Κρητικοί; Δεν είναι και αυτοί Έλληνες; Και οι Κερκυραίοι; Και οι Ροδίτες και οι Κυπριώτες; Πώς μπορούν Έλληνες να σκοτώνουν Έλληνες; Ο ενθουσιασμός του Αλέξανδρου έπεσε και κοντοστάθηκε, ζαλισμένος λίγο από τόσα ονόματα.
- Μα τότε; Τι θα είναι οι δικοί μου; ρώτησε κατσουφιασμένος.
- Μα δεν είπαμε πως θα είναι Άγγλοι; Και η σημαία σου το λέγει. Είναι ξένη.
- Η μις Ράις είπε πως δεν είναι αγγλική αυτή η σημαία, μουρμούρισε διστακτικός ο Αλέξανδρος.
- Το ξέρω, είναι γαλλική, αδιάφορο. Έλα! Ετοιμάσου!
- Μα είναι παλικάρια οι Άγγλοι; ρώτησε επιφυλακτικά ο Αλέξανδρος.
- Βέβαια είναι! Αφού μας έδωσαν την Κέρκυρα; Έλα τώρα! Πού είναι ο βόλος σου;
Μα ο Αλέξανδρος είχε χάσει το βόλο του. Τον γύρεψε μες στις φούστες του, ανάμεσα στους στρατιώτες του, μες στο κουτί τους, και πάλι στη μάζα των στρατιωτών. Ο βόλος δε βρέθηκε. Μόνο που έπεσαν οι στρατιώτες του, που ήταν, ποιος πολύ ποιος λίγο, όλοι κάπως κουτσοί και ανάπηροι, και χρειάστηκε να τους ξαναστήσει. Έχασε την υπομονή του ο.Αντώνης.
- Έλα, τελείωνε! φώναξε του Αλέξανδρου. Σου δίνω εγώ άλλο βόλο! Μόνο στήσε γρήγορα το στρατό σου!
Βιάζουνταν ο Αλέξανδρος όσο μπορούσε και βοηθούσε και η Πουλουδιά. Μα δεν ήταν εύκολο να στηθούν γερά στρατιώτες που όλοι σχεδόν είχαν στραβωμένες τις βάσεις. Το είδε η Πουλουδιά και άρχισε να θυμώνει. Με τα δόντια της, νευρικά, θυμωσιάρικα, έσιαζε μια δυο λυγισμένες βάσεις.
- Τι χάλια που είναι οι στρατιώτες σου! είπε χαμηλόφωνα του Αλέξανδρου, ενώ παρακάτω ο Αντώνης γύρευε ανάμεσα στους βόλους του έναν όμοιο σαν το δικό του, για να τον δώσει του αδελφού του. Τι χάλια! Ένας δεν έχει στέρεη βάση! Και θες να είναι κι Έλληνες! Με την πρώτη θα πέσουν!
Ντροπιασμένος κοίταζε ο Αλέξανδρος τα θυμωμένα χέρια της Πουλουδιάς που γύρευε να στερεώσει τους στρατιώτες του, πατώντας τη μια βάση πάνω στην άλλη, μήπως τις αλληλοσυγκρατήσει. Μα επέστρεφε ο Αντώνης. Τους έσφιξε η Πουλουδιά όσο μπορούσε σε μια μάζα και σηκώθηκε.
- Να, είπε ο Αντώνης του αδελφού του. Δε βρήκα τον απαράλλαχτο σαν το δικό μου βόλο, μα δεν πειράζει. Ο δικός σου είναι λίγο πιο μεγάλος, θα σκοτώσεις περισσότερους από τους δικούς μου στρατιώτες. Έλα! Τράβα εσύ πρώτος!
- Και σημάδεψε καλά! πρόσταξε η Πουλουδιά.
Δίπλωσε ο Αλέξανδρος τον αντίχειρα του μέσα στο στρογγυλεμένο του δείχτη, τοποθέτησε το βόλο πάνω στο νύχι του και σημάδεψε. Μα ήταν μικρός ο αντίχειρας και βαρύς ο βόλος. Τον τίναξε, έφυγε αυτός στραβά και πέρασε πλάγι στους στρατιώτες του Αντώνη, χωρίς ν' αγγίξει κανένα.
- Μπούφο! μουρμούρισε η Πουλουδιά.
- Δική μου σειρά! είπε ο Αντώνης.
Ξαπλώθηκε χάμω, τοποθέτησε το βόλο του στο νύχι του, έκλεισε το ένα μάτι, σημάδεψε κι έριξε. Ο βόλος χτύπησε τη μάζα του Αλέξανδρου στη μια γωνιά και πήρε τους μισούς.
- Ω! ω! ω! έκανε ο Αλέξανδρος, έτοιμος να κλάψει.
- Στάσου! φώναξε η Πουλουδιά απλώνοντας τα χέρια της. Είπαμε πως όποιος στρατιώτης έπεσε πάνω σ' άλλο στρατιώτη είναι πληγωμένος και ξανασηκώνεται. Σκοτωμένοι είναι μόνο όσοι ακουμπούν ολόκληροι στο πάτωμα.
- Σωστά, αποκρίθηκε ο Αντώνης που είχε κάνει το νόμο στα γενέθλια του Αλέξανδρου, όταν είχε λάβει ο αδελφός του καινούριους στρατιώτες, ενώ οι δικοί του είχαν αρχίσει να χάνουν λίγο την ισορροπία τους. Σωστά, επανέλαβε πλησιάζοντας να επιτηρήσει την επιλογή. Μα τούτοι είναι σχεδόν όλοι σκοτωμένοι.
- Καθόλου! είπε η Πουλουδιά σηκώνοντας έναν πεσμένο που έσπρωξε έναν άλλο πλάγι του. Να, κούνησε αυτός· άρα ακουμπούσε στον άλλο.
- Στην άκρη μόνο της ξιφολόγχης! παρατήρησε ο Αντώνης.
- Αδιάφορο! Ακουμπούσε! επέμεινε η Πουλουδιά.
Και σήκωσε τον πληγωμένο, και άλλον έναν, και πάλι άλλον, ώσπου δεν έμειναν παρά τρεις τέσσερις σκοτωμένοι.
- Σα να μου φαίνεται πως τους σήκωσες όλους! ξαναδιαμαρτυρήθηκε ο Αντώνης.
- Καθόλου! Σήκωσα μόνο τους πληγωμένους! Έλα, Αλέξανδρε, τράβα πάλι!
Αναστέναξε ο Αλέξανδρος με ανακούφιση, σαν είδε πάλι όρθιους τους στρατιώτες του, και πάλι σημάδεψε και πάλι έριξε. Μα πάλι στράβωσε ο βόλος του και αστόχησε και κατρακύλησε πέρα από το στρατό του Αντώνη.
- Μα δεν προσέχεις! του φώναξε η Πουλουδιά.
- Δική μου σειρά! είπε θριαμβευτικά ο Αντώνης.
Και σημάδεψε και τράβηξε, και πάλι ο μισός στρατός του Αλέξανδρου στρώθηκε χάμω. Η Πουλουδιά ρίχθηκε στα γόνατα και άρχισε πάλι το ξεδιάλεγμα των πληγωμένων. Μ' αυτή τη φορά είχε ρίξει πιο δυνατά ο Αντώνης και είχαν σκορπίσει μακριά οι στρατιώτες, αφήνοντας λιγότερους πληγωμένους παρά σκοτωμένους.
- Έλα, είπε σφίγγοντας τα δόντια της η Πουλουδιά, σημάδεψε! Πρόσεξε!
Πρόσεξε ο καημένος ο Αλέξανδρος, μα του έπεφτε βαρύς ο βόλος και μικρό το χέρι και ήταν στερεές οι βάσεις του Αντώνη. Αυτή τη φορά χτύπησε την πλευρά μιας τετράδας, αλλά, αν και κλονίστηκε ολόκληρη η σειρά, μόνο ένας στρατιώτης έπεσε.
Και πάλι τράβηξε ο Αντώνης, και πάλι σκόρπισαν, πεθαμένοι και πληγωμένοι, όλοι σχεδόν οι στρατιώτες του Αλέξανδρου.
Τα δάκρυα έτρεχαν τώρα σιωπηλά στα μάγουλα του, ενώ σήκωνε τους πληγωμένους του, και πλάγι του, σιωπηλή και αυτή, έτριζε η Πουλουδιά τα δόντια της κι έσφιγγε κοντά-κοντά, για να υποστηρίξει ο ένας τον άλλο, τους λίγους πια ήρωες του Αλέξανδρου.
Ο αγώνας δε βάσταξε πολύ. Στην κατοπινή ριξιά έπεσε όλος ο στρατός του Αλέξανδρου.
- Ζήτω! φώναξε ο Αντώνης. Ζήτω! Σας έφαγα πάλι!
- Καθόλου! αποκρίθηκε η Πουλουδιά, γοργά σηκώνοντας τρεις τέσσερις στρατιώτες. Αυτοί είναι πληγωμένοι, πληγωμένος και ο στρατηγός! Έλα, Αλέξανδρε!
- Ζαβολιάρα! της φώναξε ο Αντώνης. Ήταν όλοι σκοτωμένοι!
- Δεν ήταν! διαμαρτυρήθηκε η Πουλουδιά. Και δε θέλω να με λες ζαβολιάρα! Αυτοί ήταν πληγωμένοι, να, ήταν πεσμένοι έτσι...
- Εγώ τους είδα, και ήταν όλοι σκοτωμένοι! επέμεινε ο Αντώνης.
- Δεν ήταν! επέμεινε και η Πουλουδιά.
- Ήταν!
- Δεν ήταν!
Τα πράγματα αγρίευαν.
- Μη μαλώνετε! φώναξε η Αλεξάνδρα από το τραπέζι της. Ο Αντώνης ρίχθηκε κι εκείνος στα γόνατα.
- Έλα, καλά, ξεμπέρδευε, Αλέξανδρε, ρίξε άλλη μια, είπε πεισμωμένος, και με την πρώτη θα σου τους σαρώσω όλους κάτω!
Ο Αλέξανδρος, γονατιστός, δάγκανε τα χείλια του, για να σταματήσει τα δάκρυα που ολοένα ανάβρυζαν. Πήρε το βόλο του, σημάδεψε κι έριξε. Μά έτρεμαν τα χέρια του και ο βόλος πήδηξε από πάνω από το στρατό του Αντώνη και κύλησε με κρότο στα σανίδια, μακριά, πίσω του.
- Δική μου σειρά και τελείωσε! φώναξε θριαμβευτικά ο Αντώνης.
- Δεν πάει αυτή! αντιφώναξε η Πουλουδιά.
- Πάει και παραπάει!
- Όχι, δεν πάει! Έδωσες του Αλέξανδρου ένα μεγάλο βόλο που δε χωρεί στο δάχτυλο του! Δώσ' του το δικό σου βόλο!
- Ανοησίες λες! Φύγε από κει!
- Δεν πάει σου λέγω! Στάσου!
Με μια σπρωξιά την παραμέρισε ο Αντώνης, έριξε το βόλο του και σκόρπισε στα πέρατα τους τελευταίους ανδρείους του Αλέξανδρου, μαζί και το στρατηγό, που αυτή τη φορά έπεσε από το άλογο. Ο Αλέξανδρος δε γύρευε πια να συγκρατήσει τ' αναφιλητά του. Η Πουλουδιά άφριζε.
- Δεν πάει! έλεγε και ξανάλεγε. Δεν πάει, είναι αδικία! Και με φούρκα μάζεψε το στρατηγό, τον κάθισε στο άλογο και άρχισε να στήνει πάλι όρθιους τους στρατιώτες.
Με μια ξανάστροφη τους έριξε κάτω ο Αντώνης. Έξω φρενών κλότσησε η Πουλουδιά και αναποδογύρισε και σκόρπισε όλο το στρατό του Αντώνη. Άλλη μάχη ξέσπασε τότε. Την έπιασε ο Αντώνης από τα δυο χέρια γυρεύοντας να τη γονατίσει.
- Τι έκανες; της είπε μέσα από τα δόντια του. Είδες τι έκανες; Έριξες κάτω την ελληνική σημαία και την ξεκόλλησες! Μάζεψε την ευθύς και φίλησε την!
- Δεν τη μαζεύω και δεν τη φιλώ!
- Θα τη μαζέψεις!
- Δεν τη μαζεύω!
Με τη βία τη γονάτισε.
- Μάζεψε την! Είναι η ελληνική σημαία!
- Δεν είναι! Είναι ένα παλιόχαρτο...
- Πουλουδιά!...
Διακόπηκε κείνη, τρομαγμένη με τα ίδια της τα λόγια. Σα να πάγωσε ξαφνικά η κάμαρα όλη. Η Αλεξάνδρα είχε σηκωθεί από τη ζωγραφική της, ο Αντώνης τράβηξε τα χέρια του, ο Αλέξανδρος σταμάτησε τα κλάματα του. Και οι τρεις την κοίταζαν. Μα η Πουλουδιά δεν τα 'βαζε κάτω.
- Δεν είναι αυτό σημαία! επέμεινε. Αυτό το ζωγράφισε ο Αντώνης, και το κόλλησε ο Αντώνης, και δεν είναι τίποτα, και είναι πασαλειμμένο γκόμες και μουντζούρες! Είναι... είναι...
Δεν τόλμησε να επαναλάβει τη λέξη, μα τα χείλια της έτρεμαν και δάκρυα μαζεύουνταν στα μάτια της.
- Είναι μια μουντζούρα! μουρμούρισε.
- Καλά! είπε ο Αντώνης. Το απόγεμα θα έλθει ο Γιάννης και θα τον ρωτήσω αν επιτρέπονται αυτά! Θα του πω πως είπες τη σημαία μας παλιόχαρτο και μουντζούρα! - Δεν την είπα!
- Δεν την είπες; Τ' άκουσε και η Αλεξάνδρα και ο Αλέξανδρος!
- Όχι! Δεν το είπα για τη σημαία μας! Το είπα γι' αυτό το χαρτί...
- Να, πάλι το λες! Λοιπόν για τιμωρία σου θα του πω και το άλλο. Πως είπες που, όταν μεγαλώσεις, θα τον πάρεις...
Αυτού πια ξεχείλισε το ποτήρι. Η Πουλουδιά έμπηξε τα κλάματα, πετάχθηκε έξω από την κάμαρα κι έτρεξε ολόισια στην αυλή. Εκεί ήταν μοναξιά και ηλιοπύρι. Κάθισε στο πεζούλι της πόρτας, έσκυψε το κεφάλι της στα γόνατα κι έκλαψε, έκλαψε όσο το τραβούσε η καρδιά της. Η πόρτα της αυλής άνοιξε σιγά και η Αλίς μπήκε μέσα. Μα τόσο έκλαιγε η Πουλουδιά, που δεν την άκουσε. Πλησίασε η Αλίς λίγο διστακτικά και ακούμπησε το χέρι στο σκυμμένο κεφάλι της Πουλουδιάς.
- Γιατί κλαις; ρώτησε γλυκά.
Ξαφνίστηκε η Πουλουδιά και ανορθώθηκε. Το πρόσωπο της ήταν μουσκεμένο και μουντζουρωμένο από τ' ασκούπιστα δάκρυα. Αντίκρισε το συμπονετικό βλέμμα της Αλίς και συγκινήθηκε και ξανάρχισε τα κλάματα.
- Γιατί κλαις; Τι έχεις;
Μα δεν ήθελε να πει η Πουλουδιά ούτε για τη σημαία ούτε για τον καβγά της με τον Αντώνη ούτε για τις φοβέρες του πως θα τα πει του Γιάννη. Συνάμα θυμήθηκε την τελευταία φορά που είχε έλθει η Αλίς και, βλέποντας την τόσο συμπονετική και γλυκιά, ντράπηκε για τα τραχιά λόγια που της είχε πει ο Αντώνης, πως εκείνη σταύρωσε το Χριστό. Και, με ξαφνική τρυφερότητα, αγκάλιασε την Αλίς και τη φίλησε.
Κοκκίνισε κείνη από ευχαρίστηση και της ανταπέδωσε το φίλημα της.
- Μα γιατί κάθεσαι στον ήλιο; Πύρωσε το κεφάλι σου, είπε. Έλα στη σκιά.
Μαζί πήγαν τα δυο κορίτσια και κάθισαν κάτω από τη γαζία. Και για να κάνει την Πουλουδιά να ξεχάσει τη λύπη της, είπε η Αλίς.
- Ξέρεις γιατί δεν ήρθα τόσες μέρες; Ήμουν στης θείας μου, στην εξοχή, στο βουνό, στην πρασινάδα και στα πεύκα! Αχ, έλα και συ!...
Μέσα στην κάμαρα ωστόσο άλλος θρήνος γίνουνταν. Ο Αλέξανδρος μάζευε φούχτες τους στρατιώτες του, κλαίγοντας, και τους έριχνε φύρδην μείγδην στο κουτί τους, ενώ ο Αντώνης, με τα χέρια στην τσέπη, πήγαινε κι έρχουνταν σα Μεγάλος Ναπολέων μετά τη νίκη.
- Και πρώτον δεν κάνει να κλαις γιατί νικήθηκες! είπε του αδελφού του. Δεν είναι σπορ αυτό!
Ο Αλέξανδρος, που το ήξερε, που είχε ακούσει αυτό το ίδιο μάθημα ύστερ' από κάθε μάχη με τον Αντώνη, δεν αποκρίθηκε, μόνο μουσούνιζε σιωπηλά, γυρεύοντας να καταπιεί τα δάκρυα του.
Η Αλεξάνδρα είχε ξανακαθίσει στο τραπέζι κι έγλειφε το πινέλο της για να το κάνει μυτερό.
- Ο Αλέξανδρος είναι μικρός, είπε μ' επιείκεια. Μα η Πουλουδιά που είναι μεγάλη πρέπει να μάθει να μη θυμώνει, σα χάνει ένα παιχνίδι.
Ο Αλέξανδρος ξέσπασε σε καινούρια κλάματα.
- Η Πουλουδιά είναι πολύ καλή! είπε.
- Βέβαια, γιατί σε βοήθησε! αποκρίθηκε ο Αντώνης.
- Δε με βοήθησε! Αν με είχε βοηθήσει, θα κέρδιζα εγώ τον πόλεμο!
- Κιαμεδέ! Με τέτοιους στρατιώτες, στραβωμένους, σπασμένους...
- Ναι, θα σου σκότωνε η Πουλουδιά τους δικούς σου!
- Κιαμεδέ! είπε πάλι ο Αντώνης.
Ξανάνοιξε το κουτί του, όπου έναν έναν είχε συγυρίσει και φυλάξει τους στρατιώτες του, αφού πρώτα διόρθωσε και ίσιασε όσες ξιφολόγχες είχαν κακοπάθει από την κλοτσιά της Πουλουδιάς, και τους χάιδεψε με αγάπη.
- Τέτοιο στρατό δεν τον νικά κανένας! είπε. Οι δικές μου βάσεις είναι όλες στερεές!
- Η Πουλουδιά θα τους νικούσε, γιατί σημαδεύει πιο καλά από σένα!
- Κιαμεδέ! επανέλαβε κοροϊδευτικά ο Αντώνης.
- Ναι, σημαδεύει πιο καλά! επέμεινε με πείσμα ο Αλέξανδρος. Στο κροκέ, στην Αλεξάνδρεια, πολλές φορές σε κέρδιζε!
- Στο κροκέ! Ένα κουτό, κοριτσίστικο παιχνίδι! έκανε ακατάδεχτα ο Αντώνης. Εγώ σου λέγω για βόλους! Στους βόλους τα βγάζει πέρα μαζί μου;
- Και στους βόλους σε κερδίζει η Πουλουδιά!
- Ποτέ!
- Ναι, σε κέρδισε μια μέρα, εγώ το θυμούμαι!
- Λες ανοησίες!
- Σε κέρδισε μια μέρα!
- Και πρώτον η Πουλουδιά δεν έχει βόλους! Πώς με κέρδισε; Με τι;
- Ο Στάμος της είχε δώσει βόλους!
- Ο Στάμος; Θυμάσαι συ τώρα τι έκανε στην Αλεξάνδρεια ο Στάμος!
- Ναι, εγώ θυμούμαι. Εσύ κάνεις πως ξέχασες. Εσύ έπαιζες με την Αλεξάνδρα κι εκείνη εναντίον σου με τον Στάμο.
- Ο Στάμος κέρδισε κείνη τη μέρα, όχι η Πουλουδιά!
- Ναι, η Πουλουδιά! Εγώ το θυμούμαι! Το είπε και ο Στάμος!
- Και συ λες ό,τι ακούσεις, σαν παπαγάλος!
- Και συ λες ψέματα...
- Αλέξανδρε! φώναξε τρομαγμένη η Αλεξάνδρα.
Πιο μεγάλη προσβολή δεν μπορούσε να γίνει του Αντώνη, παρά να του πουν πως λέγει «ανακρίβειες». Τη λέξη όμως «ψέματα» κανένα απ' τ' αδέλφια δεν είχε τολμήσει ποτέ να την ξεστομίσει. Θα έπεφτε τώρα ξύλο;
Σφίγγοντας φούχτες και δόντια, κατακόκκινος, είπε ο Αντώνης:
- Είσαι μικρός και δε σε δέρνω! Μα στάσου να έλθει η μαμά, να μάθει πως είπες «Βρε συ» στον αξιωματικό, και βλέπεις εσύ!
Ο Αλέξανδρος αναλύθηκε πάλι στα κλάματα.
- Μην το πεις! παρακάλεσε.
- Όχι, τι; Να λες έτσι, πως λέγω εγώ ψέματα; Και σα μάθει η μαμά πως λες αυτή τη λέξη...
- Που δε θέλει ο πατέρας ούτε να περνά το στόμα μας! πρόσθεσε αυστηρά η Αλεξάνδρα.
- Και πως μου την είπες εμένα... εμένα! επανέλαβε ο Αντώνης. Να δεις! Να δεις τι θα πάθεις, κι εσύ και η Πουλουδιά, που είπε μουντζούρα και παλιόχαρτο την ελληνική σημαία!
Αυτή η διπλή φοβέρα αποτελείωσε πια τον Αλέξανδρο. Κάθισε χάμω, έχωσε το κεφάλι του στις δίπλες της φούστας του και αφέθηκε στην απελπισία του. Η πόρτα της κάμαρας άνοιξε και το γελαστό κεφάλι της Αλίς, με τις ξανθές της πλεξούδες στεφάνι, παρουσιάστηκε στο άνοιγμα.
- Καλημέρα! φώναξε χαρούμενα. Μας θέλετε; Και μπήκε μέσα με την Πουλουδιά.
Το μάτι της Πουλουδιάς έπεσε αμέσως στο ξαφνισμένο, όλο δάκρυα και δαχτυλιές πασαλειμμένο πρόσωπο του Αλέξανδρου. Μάντεψε ευθύς καβγάδες και λογομαχίες, όπου ο φυσικός της σύμμαχος θα τις έφαγε πάλι.
- Γιατί κλαις; ρώτησε απότομα, έτοιμη για μάχη.
- Γιατί... γιατί... κλαψαποκρίθηκε ο Αλέξανδρος. Μα τον διέκοψε ο Αντώνης μ' ένα νόημα.
- Μην πεις! διέταξε σιωπηλά, κρυφοδείχνοντας την Αλίς. Και σκύβοντας πάνω στον αδελφό του, τάχα να τον βοηθήσεινα σηκωθεί, του πρόσταξε στο αυτί:
- Μην πεις για τη σημαία μπροστά της!
Και σώπασε ο Αλέξανδρος κι έγινε σιωπή, και τ' αδέλφια στάθηκαν αδέξια, κουτά, μαγκωμένα.
Μα η Αλίς δεν τους άφησε καιρό να νιώσουν τη στενοχώρια τους. Γελαστή σίμωσε τον Αντώνη και, σπρώχνοντας με το δάχτυλο πίσω το κεφάλι του, είπε:
- Για να δω; Μπα! Περίεργο! Δε φαίνονται τα δαγκάματα του Ντον, μόνο δυο μικρά κοκκινάκια! Πόνεσες πολύ;
- Όχι! Μα πώς το ξέρεις; ρώτησε ο Αντώνης.
- Μας το 'πε χθες βράδυ η Μαρούσα. Μας είπε πως ήλθατε να με φωνάξετε, αλήθεια; Τι κρίμα που είχα φύγει! Και πως ύστερα σε δάγκασε ο Ντον. Καημένε Αντώνη! Πώς θα πόνεσες!
- Όχι, δεν πόνεσα πολύ, με δάγκασε, να, έτσι! είπε ο Αντώνης πιάνοντας το χείλι του ανάμεσα στον αντίχειρα και στο δείχτη.
- Καλέ, τι λες; Σου έκανε, λέει, κιμά το πρόσωπο! Ναι, η Μαρούσα μας το είπε. Και κόντεψες να λυσσάξεις και δεν έκλαψες, ούτε καν φοβήθηκες! Μπράβο σου! Όλοι σε θαυμάσαμε...
Ο Αντώνης, που δεν είχε καταλάβει καθόλου πως έγινε κιμάς το πρόσωπο του, ούτε πως κόντεψε να λυσσάξει, ένιωσε έξαφνα σα να υψώνουνταν μια πήχη πάνω από το μπόι του.
Οι αδελφές του όμως, φυσικά, έκαναν να τον κατεβάσουν από τα ύψη του.
- Τι; Τι είπε η Μαρούσα; ρώτησε ειρωνικά η Αλεξάνδρα. Και φουριαστά διαμαρτυρήθηκε η Πουλουδιά:
- Καθόλου δεν του έκανε κιμά το πρόσωπο! ενώ με βιαστικά βήματα πλησίαζε ο Αλέξανδρος και σηκώνουνταν στις μύτες του, για να δει από πιο κοντά τις άγνωστες πληγές στο πρόσωπο του αδελφού του.
Μα η Αλίς δεν υποχώρησε.
- Ναι, ναι, σε ξέρω! Είσαι πάντα παλικάρι και ποτέ δε λες πως πονείς! επανέλαβε. Μα κόντεψες να λυσσάξεις και να πεθάνεις! Το είπε και ο πατέρας, και κατατρόμαξαν όλοι εδώ...
- Εμείς; Καθόλου! αναφώνησε η Πουλουδιά. Εκτός, ναι, μόνο σαν έτρεχαν τα αίματα...
- Καλέ, τι αίματα! Τόσο τρόμαξε η θεία σας η Μαριέτα, που έστειλε το θείο σας στο βασιλέα να του πει να σκοτώσει τον Ντον. Και είπε ο βασιλέας: «Πώς λυπούμαι γι' αυτό που συνέβηκε! Να είστε βέβαιος πως θα θέσομε τον Ντον και θα τον παραφυλάξομε!» Και κάθε μέρα, ύστερα, μηνούσε πως ο Ντον ήπιε πολύ νερό...
- Γιατί; ρώτησε η Αλεξάνδρα.
- Γιατί, αν ήταν λυσσασμένος, δε θα έπινε νερό, έτσι λέγει ο πατέρας. Μα ο Αντώνης δεν το ήξερε πως δε θα ήταν λυσσασμένος, και όμως δε φοβήθηκε καθόλου! Οι δυο αδελφές άκουαν κλονισμένες και ο Αλέξανδρος ξέχασε, στη σαστιμάδα του, να κλείσει το στόμα του.
- Και όχι μόνο τον δάγκασε, αλλά τον δάγκασε στο πρόσωπο, που είναι ακόμα πιο επικίνδυνο, εξακολούθησε η Αλίς. Γιατί, όσο πιο κοντά στο κεφάλι σε δαγκάσει ο σκύλος, τόσο πιο άσχημο είναι...
- Γιατί; ρώτησε πάλι η Αλεξάνδρα, θαμπωμένη από τις γνώσεις της Αλίς.
Μ' αυτή τη φορά δεν ήξερε η Αλίς. Σταμάτησε μια στιγμή και πάλι πήρε φόρα:
- Έτσι είπε ο πατέρας. Και είπε: «Πώς θ' ανησύχησαν οι άνθρωποι που τον δάγκασε στο πρόσωπο!» Και μας είπε η Μαρούσα πως και ο Αντώνης θα δάγκανε όλο τον κόσμο και πως θα έπεφτε ξερός! Και όμως ο Αντώνης δε φοβήθηκε!
Άκουσε ο Αντώνης και θαύμαζε. Ποτέ δεν είχε φανταστεί πόσο ηρωικά είχε φερθεί. Τον γέμιζε λίγο λίγο αίσθημα από συμπόνια και θαυμασμό για τον εαυτό του και συνάμα μια τρυφερή αγάπη για την Αλίς που έβγαζε στη φόρα τον ηρωισμό του.
Μα όταν είδε δάκρυα στα μάτια της Αλεξάνδρας και της Πουλουδιάς τα φρύδια ν' ανεβαίνουν τρομαγμένα κατά τα κατσαρωμένα της μαλλιά, φούσκωσε η καρδιά του από ευγνωμοσύνη και του ήλθε ακράτητη λαχτάρα να διορθώσει την αδικία, την προσβολή που είχε κάνει της Αλίς την τελευταία φορά που την είχε δει.
- Αλίς, της είπε μ' ενθουσιασμό, εσύ δεν είσαι Εβραία! Είμαι βέβαιος πως δεν είσαι Εβραία!
Η Αλίς σώπασε μαζεμένη και ανήσυχα κοίταξε ένα ένα τ' αδέλφια.
- Πες! επέμεινε ο Αντώνης. Δεν είναι αλήθεια πως δεν είσαι Εβραία;
- Δεν ξέρω... μουρμούρισε διστακτικά η Αλίς.
- Εγώ είμαι βέβαιος πως δεν είσαι Εβραία και πως είσαι Ελληνίδα.
- Ναι, είμαι Ελληνίδα, είπε ντροπαλά η Αλίς.
- Αυτό δε σημαίνει, είπε σκοτισμένη η Αλεξάνδρα. Νομίζω πως μπορείς να είσαι και Ελληνίδα και Εβραία...
- Όχι, δεν μπορείς! φώναξε ο Αντώνης. Εγώ ξέρω πως στην Αλεξάνδρεια οι Εβραίοι δεν είναι Έλληνες και δεν πάνε στο δικό μας σχολείο, μόνο πάνε στους ιησουίτες.
- Στάσου να δούμε, έχω μιαν ιδέα και θα καταλάβομε αμέσως, είπε η Αλεξάνδρα. Αλίς, τι μαθαίνεις εσύ στο σχολείο που πας;
- Τι μαθαίνω; ρώτησε ανήσυχα η Αλίς. Γιατί; Τι μαθαίνω;
- Να, σας μαθαίνουν για τον Τρωικό πόλεμο και τον Αχιλλέα;
- Βέβαια!
- Και για τον Σωκράτη; Ξέρεις ποιος είναι ο δίκαιος Αριστείδης;
- Ξέρω!
- Και ο Περικλής; Και ο Λεωνίδας;... Μα τη διέκοψε ο Αντώνης:
- Ξέρεις τι θα πει «Μολών λαβε»; Και «Ή ταν ή επί τας»; Έμαθες το «Πάταξον μεν, άκουσον δε»; ρώτησε ορμητικά.
- Ναι!
- Λοιπόν δεν είσαι βέβαια Εβραία! φώναξε θριαμβευτικά ο Αντώνης.
- Δεν είσαι Εβραία! επικύρωσε η Αλεξάνδρα. Είσαι Ελληνίδα σαν και μας!
Και, στη συγκίνηση της απάνω, φίλησε την Αλίς.
Ήταν το δεύτερο φιλί που δέχουνταν η Αλίς εκείνο το ίδιο πρωί από τις αδελφές. Και χαρούμενη, συγκινημένη κι εκείνη, κάθισε στον καναπέ, ανάμεσα στις δυο αδελφές που της βαστούσαν η καθεμιά από ένα χέρι, σα να είχαν ανακαλύψει ξαφνικά ένα θησαυρό.
Όρθιος, με τα χέρια μπερδεμένα το ένα μες στο άλλο πίσω στην πλάτη, τις κοίταζε ο Αλέξανδρος και συλλογίζουνταν.
- Μα... μα τι πειράζει αν είναι Εβραία η Αλίς; ρώτησε αργά. Ο θείος λέγει πως οι Εβραίοι είναι πάρα πολύ καλοί άνθρωποι και πως ο μπαμπάς της Αλίς...
- Καλά, το ξέρομε, διέκοψε με μεγαλείο η Αλεξάνδρα. Εμείς όμως θέλομε την Αλίς να είναι Ελληνίδα!
Και της χαμογέλασε η Αλίς και χαμογέλασε και του Αλέξανδρου και φαίνουνταν χαρούμενη όσο ποτέ ακόμα.
Μα ο Αντώνης δεν ένιωθε αρκετά ικανοποιημένη την ευγνωμοσύνη του προς την Αλίς. Έκανε να βγει έξω, να πάγει να βρει τη θεία Μαριέτα. Μα το καλοσυλλογίστηκε και προτίμησε να στείλει τον Αλέξανδρο που, σαν πιο μικρός, ήταν πιο χαϊδεμένος κι έτρωγε τις λιγότερες κατσάδες. Τον πήρε ιδιαιτέρως και του είπε:
- Πήγαινε να ρωτήσεις τη θεία αν μπορούμε να προσκαλέσομε την Αλίς στο πρόγευμα.
Και πήγε ο Αλέξανδρος και γύρισε φωνάζοντας:
- Ναι, είπε η θεία πως μπορεί να μείνει η Αλίς το μεσημέρι...
Κατακοκκίνισε η Αλεξάνδρα και ντράπηκε η Πουλουδιά. Αλήθεια, αυτός ο Αλέξανδρος όλο ντρόπιαζε τ' αδέλφια του.
Και, βρουτσίζοντας τα μαλλιά του πριν καθίσουν στο τραπέζι, τον μάλωσε η Αλεξάνδρα:
- Κάνεις σα χωριάτης! του είπε. Δε λεν στους ανθρώπους «μπορείς να μείνεις», τους ρωτούν ευγενικά: «Θες να μείνεις:»
Ο Αλέξανδρος δεν είδε καμιά διαφορά στις δυο προσκλήσεις, μα δεν είπε τίποτα· όλη του την προσοχή τη συγκέντρωνε στις θυμωμένες βρουτσιές της Αλεξάνδρας και κοίταζε πώς να της ξεφύγει και να σμίξει τον Αντώνη, που ακτινοβολούσε όλος και δεν ήξερε πώς να περιποιηθεί καλύτερα την Αλίς.
- Και θα μείνεις το απόγεμα, Αλίς; Και θα παίξεις μαζί μας; Θα έλθει και ο Γιάννης, ο εξάδελφος μας! Να δεις πώς πηδά!...
Θυμήθηκε η Πουλουδιά την πρωινή φοβέρα και όλο της το κέφι έσβησε. Αχ και να μην ήρχουνταν ποτέ πια ο Γιάννης!
Κι έλεγε, έλεγε ο Αντώνης τα καλά και τα κατορθώματα του Γιάννη, και μεγάλωνε και άπλωνε ολοένα η ανησυχία της Πουλουδιάς.
Μα είχε τόσα κέφια σήμερα ο Αντώνης, ήταν τόσο στις καλές του! Αν του το ζητούσε άραγε... Μα πώς να το ζητήσει; Σε παρακάλια δεν ξέπεφτε κανένα από τ' αδέλφια, εκτός από τον Αλέξανδρο που ήταν μικρός...
Κλωθογύριζε λοιπόν η Πουλουδιά γύρω στον Αντώνη και στην Αλίς και άκουε της Αλίς τις διηγήσεις, πως ήταν τόσο ωραία στης θείας της στην Κηφισιά...
- Πού είναι η Κηφισιά; ρώτησε ο Αντώνης. Η Αλίς έδειξε αόριστα κατά το Πασαλιμάνι.
- Να, από κει, μα πέερα, κατά την Πεντέλη. Πας με το τρένο· ανεβαίνεις· είναι βουνό· και όμως δεν είναι βουνό. Κι έχει δέντρα, πολλά δέντρα. Και στο περιβόλι της θείας μου έχει όλα τα φρούτα, δεν έχει πια κεράσια, μα έχει σύκα, σταφύλια, ροδάκινα, αχλάδια... Και τι δεν έχει! Κι έφυγε ο περιβολάρης της θείας μου και κάναμε μεις τον περιβολάρη, σκάβαμε, ποτίζαμε, κόβαμε φρούτα, κλαδεύαμε! Τι ωραία που περάσαμε! Έλα κι συ, Αντώνη, στης θείας μου...
Με τα χέρια ενωμένα και τα μάτια χαμένα κατά πέερα από το Πασαλιμάνι, ο Αντώνης έβλεπε όσα του ζωγράφιζε με τα λόγια της η Αλίς και χαμογελούσε μακαρίως.
- Και θα μ' αφήσει η θεία σου να σκάψω; ρώτησε.
- Και βέβαια! είπε η Αλίς.
- Και να ποτίσω;
- Ακούς λέει! Θα της κάνεις και χάρη, αφού δεν έχει περιβολάρη!
- Εγώ, σα μεγαλώσω, θα δώσω όλα μου τα παιχνίδια του Αλέξανδρου και θα γίνω περιβολάρης! είπε μαγεμένος ο Αντώνης.
Ήταν η ώρα της Πουλουδιάς. Ποτέ δε θα ξανάβρισκε τον Αντώνη σε τέτοια διάθεση.
- Αντώνη, δε θα πεις του Γιάννη... ξέρεις τι, που έλεγες το πρωί... του ψιθύρισε σιγά.
Μια στιγμή στάθηκε ο Αντώνης, ώσπου να βγει από τα όνειρα του και να ξαναμπεί στην πραγματικότητα. Κι έξαφνα θυμήθηκε.
- Εγώ δε μαντατεύω! είπε περήφανα.
Και ξαναγύρισε στην Αλίς.
- Η θεία είναι στην τραπεζαρία, της ανήγγειλε. Πες της εσύ για την Κηφισιά, να μας αφήσει να πάμε. Του έκανε νόημα «Ναι» και πέρασαν στο τραπέζι.
Φυσούσε μελτέμι δυνατό. Σκυμμένος στο παράθυρο κοίταζε ο Αντώνης τις βάρκες, δεμένες στην ακρογιαλιά, που χόρευαν στα κύματα τεντώνοντας τα σκοινιά τους, σα να ήθελαν να τα κόψουν και να ξεφύγουν στο πέλαγος.
Είχε τελειώσει το βιβλίο που του είχε δανείσει ο Μαξ, Η Μικρά Καλύβη του Δάσους, και δεν είχε άλλο πρόχειρο. Η Αλεξάνδρα μελετούσε σκάλες στο πιάνο, ο Αλέξανδρος, σαν κορίτσι, έκοβε κυρίες από παλιά φιγουρίνια της θείας, και η Πουλουδιά βρήκε την ώρα να βγάλει την άσχημη κούκλα της, μια Αραπίνα με προβατίσια μαύρα μαλλιά και χρυσές φούσκες γύρω στο λαιμό της, και να παίζει μαμά και μωρό.
Τι κουταμάρες, Θεέ μου, και τι έλλειψη φαντασίας που πρέπει να έχει ένα κορίτσι, για να διασκεδάζει πασπατεύοντας ένα κούτσουρο, με πορτσελανένιο κεφάλι και προβιά για μαλλιά! Δυο τρεις φορές την είχε φωνάξει, μ' αυτή πείσμα, να παίζει με την Αραπίνα της! Την είχε κοροϊδέψει, της είχε πει πως ήταν φρικτό το φόρεμα της κούκλας της, κόκκινο και κίτρινο.
- Τι γούστο, αλήθεια, αυτουνού που την αγόρασε!
- Μου τη χάρισε ο θείος ο νονός μου, κι έχει πολύ γούστο ο αδελφός της μαμάς μου! αποκρίθηκε η Πουλουδιά που άλλη φορά είχε παραδεχτεί πως ήταν πολύ άσχημο το φόρεμα της κούκλας της, μα που τώρα, λέει, άλλαξε γνώμη.
Της είπε πως οι χρυσές φούσκες του λαιμού της την έκαναν σαν καμπούρα. Μα και αυτό δεν το παραδέχθηκε η Πουλουδιά. Και στο τέλος κάκιωσε και δεν του απαντούσε πια. Και κοίταζε ο Αντώνης τις βαρκούλες που ανεβοκατέβαιναν λοξά, σα στραβόλαιμιασμένες, απάνω στα κύματα που σπούσαν και βροντούσαν στα χαλίκια, και θυμούνταν τον Σεβάχ το Θαλασσινό, που σε αμέτρητες βρέθηκε φουρτούνες, που καραβοτσακίστηκε και θαλασσοπνίγηκε τόσες φορές, και όλο τα 'βγαζε πέρα και δεν πνίγουνταν ποτέ.
- Να, επιστρέφει κιόλα η ατμάκατος του κυρίου Μακρονησιώτη! είπε σκύβοντας έξω από το παράθυρο.
Κανένας δεν του αποκρίθηκε.
Κοίταξε ο Αντώνης την ατμάκατο που σα σαΐτα έκοβε τα κύματα, ακίνητη, στερεά, και την εσύγκρινε με τις δεμένες βαρκούλες που χόρευαν σαν άδεια καρυδότσοφλα. Και λαχτάρησε μια παρόμοιαν ατμάκατο που θα δέσποζε και μελτέμι και κύματα.
- Εγώ, σα μεγαλώσω, θα γίνω καπετάνιος! είπε πάλι χωρίς να γυρίσει.
Η Πουλουδιά, κακιωμένη, δεν του αποκρίθηκε. Ο Αλέξανδρος όμως, χωρίς να σταματήσει το ψαλίδι του, αποτελείωσε πρώτα την ουρά μιας κιτρινοντυμένης κυρίας, που την είχε στολίσει το πινέλο της Αλεξάνδρας με του κόσμου τα διαμαντικά, την άπλωσε στο τραπέζι και ύστερα είπε με το συνηθισμένο ήσυχο του τρόπο:
- Εσύ είπες μια φορά πως, σα μεγαλώσεις, θα γίνεις σκύλος!
- Και ύστερα ήθελες να γίνεις και άλογο! πρόσθεσε κοροϊδευτικά η Πουλουδιά, παρατώντας για μια στιγμή την αξιοπρεπή σιωπή της, για να μπει στη μύτη του αδελφού της.
Ο Αντώνης κοκκίνισε. Μα σταύρωσε τα χέρια του και είπε, τάχα αδιάφορα:
- Ήμουν μικρός σαν τα έλεγα αυτά. Τώρα που είμαι μεγάλος λέγω πως θα γίνω καπετάνιος.
- Ναι! Να δούμε τι θα πεις αύριο που θα πάμε στο περιβόλι της Αλίς στην Κηφισιά. Πάλι θα θέλεις να γίνεις περιβολάρης, όπως προχθές που μας προσκάλεσε η Αλίς. Κάθε μέρα θες να γίνεις κάτι άλλο.
- Και συ κάθε μέρα γίνεσαι πιο σαχλή! της αποκρίθηκε ο Αντώνης. Λες κουταμάρες, πως, σα μεγαλώσεις, θα πάρεις τον Γιάννη, και ύστερα παρακαλείς να μην του το πω! Μα θα το πω καμιάν ώρα.
- Αν το πεις, φώναξε φουρκισμένη η Πουλουδιά, θα πω εγώ της μαμάς πως είπες της Αλίς ότι κείνη σταύρωσε το Χριστό!
Ο Αντώνης σήκωσε τους ώμους του.
- Και δεν το λες; έκανε ξένοιαστος.
Τι τον έμελε; Την τιμωρία του την είχε φάγει, και η μαμά δεν τιμωρούσε ποτέ δεύτερη φορά. Της Πουλουδιάς όμως της κόπηκε η φόρα και η φωνή. Αν δεν τον έμελε τον Αντώνη να το μάθει η μαμά, το όπλο της σπούσε στα χέρια της. Τι να το κάνει πια; Αλήθεια όμως! Αν έλεγε κι εκείνη πως δεν τη μέλει να το μάθει ο Γιάννης, δε θα τη φοβέριζε πια ο Αντώνης πως θα του μαντατέψει τα λόγια της. Το όπλο του ήταν ο δικός της φόβος. Τι κουτή! Μα τι κουτή! Γύρισε μεμιάς.
- Κι εγώ, άλλη φορά...
Μα μόνο ο Αλέξανδρος κάθουνταν στο τραπέζι κι έκοβε τις χάρτινες κυρίες του. Ο Αντώνης είχε φύγει.
Ο Αντώνης είχε φύγει και, με τα χέρια στις τσέπες, κατέβαινε να πάγει στο σαλόνι, να ξελογιάσει την Αλεξάνδρα που εξακολουθούσε να παίζει τις βαρετές και ατέλειωτες σκάλες της. Μα, περνώντας από την τραπεζαρία, είδε την αγριεμένη θάλασσα που πηλαλούσε αφρισμένη κατά την ακρογιαλιά και κόλλησε τη μύτη του στην τζαμόπορτα. Κοίταζε τον ήλιο που έγερνε και τις βάρκες που σκαμπανεβαίναν όλο και πιο γρήγορα και πιο πηδηχτά, τραβώντας τα σκοινιά τους. Και ηλεκτρίστηκε.
- Σα ζωντανές κάνουν! μουρμούρισε.
Και ανοίγοντας την πόρτα, βγήκε στη βεράντα και κατέβηκε στο δρόμο και από κει στο λιμάνι, για να τις δει από πιο κοντά. Φυσούσε δυνατά και κανένας βαρκάρης δε βρίσκουνταν πια εκεί. Τι κρίμα! Τόσα είχε να ρωτήσει ο Αντώνης... Μια βάρκα ιδιαιτέρως του άρεσε. Ήταν κάτασπρη, με μια γαλάζια γραμμή κοντά στην κουπαστή.
«Σαν τη σημαία μας!» σκέφθηκε υπερήφανα.
Και όταν τη γύριζε λίγο κανένα κύμα, διάβαζε ο Αντώνης τ' όνομα της, που με κομψά μαύρα γράμματα απλώνουνταν στην πλώρη της, «ΜΑΓΔΑΛΗΝΗ».
«Να 'χεις μια τέτοια βάρκα... και να 'σαι καπετάνιος!» σκέφθηκε με λαχτάρα. Ήταν άραγε δύσκολο να μπεις μέσα; Και μπορούσες να τη φέρεις άραγε ως απάνω στην άμμο;
Έσκυψε ο Αντώνης κι έπιασε το σκοινί που ήταν δεμένο σ' ένα παλούκι και τράβηξε. Ναι, ήταν εύκολο, και η βάρκα ανέβηκε σχεδόν ως απάνω στη στεγνή άμμο. Και ήταν εύκολο να μπεις και μέσα, λίγο μόνο να βουτούσες τα πόδια σου στο νερό.
Πιάστηκε ο Αντώνης στην κουπαστή και πήδηξε μέσα, δεν ήταν δύσκολο. Και βρέθηκε στη βάρκα σα βασιλιάς στο βασίλειο του. Ένα κύμα πήρε τη «Μαγδαληνή» και την τράβηξε πίσω, όσο πήγαινε το σκοινί, που έτριξε από το τέντωμα. Ενθουσιάστηκε ο Αντώνης. Πήρε τα κουπιά, βγαλμένα από τους σκαρμούς και ξαπλωμένα μες στη βάρκα, και τα πέρασε στις τροπωτήρες. Ύστερα στερεώνοντας τα πόδια του στον εμπροστινό μπάγκο, άρχισε να κωπηλατεί, ρίχνοντας πίσω το σώμα του, σαν που έβλεπε τους βαρκάρηδες να κάνουν.
- Τι τσακίζεσαι, Αντώνη; Η βάρκα σου είναι δεμένη! Γύρισε ο Αντώνης και είδε τον Αλέκο Χορν που, όρθιος σ' ένα βράχο, με τα χέρια στις τσέπες, τον κοίταζε.
- Το ξέρω, είπε ακατάδεχτα, μα γυμνάζομαι για όταν γίνω καπετάνιος!
Ο Αλέκος πήδηξε από το βράχο του και πλησίασε.
- Σε τι γυμνάζεσαι; ρώτησε.
- Τραβώ κουπί!
- Μ' αφού είσαι δεμένος;
Κοίταξε ο Αντώνης μελαγχολικά το σκοινί.
- Τι να κάνω; μουρμούρισε.
Ο Αλέκος γέλασε. Γύρισε ο Αντώνης και του είπε:
- Μόνος μου δεν τα καταφέρνω τα δυο κουπιά. Μ' αν έλθεις και συ, λύνομε το σκοινί.
Ο Αλέκος δίστασε.
- Δε ρώτησα τη μαμά... έκανε.
Ο Αντώνης δεν αποκρίθηκε. Έπιασε τα δυο κουπιά, στύλωσε πάλι τα πόδια του στον μπάγκο και τράβηξε με όλη του τη δύναμη. Η «Μαγδαληνή» ανέβηκε σ' ένα κύμα και όρμησε κατά την αμμουδιά. Θριαμβευτικά ξανατράβηξε ο Αντώνης και η «Μαγδαληνή», που ξανάφευγε, γύρισε πάλι και χώθηκε μαλακά στην άμμο. Ο Αλέκος δε βάσταξε στον πειρασμό. Πιάστηκε στην πλώρη και πήδηξε κι εκείνος στη βάρκα. Χαρούμενα του είπε ο Αντώνης:
- Πιάσε το ένα κουπί! Λύνω εγώ τη βάρκα!
Μα, μόλις τράβηξε τον κόμπο, ξετυλίχθηκε μεμιάς το σκοινί και η «Μαγδαληνή», μ' ένα δυο σκαμπανεβάσματα, άφησε τα ρηχά νερά και παραδόθηκε στα κύματα και στο χορό τους.
- Ε! Αντώνη! Μου φεύγει το κουπί! φώναξε ο Αλέκος.
Ο Αντώνης, που δεν είχε προφθάσει ακόμα να καθίσει στο άλλο κουπί, γύρισε να βοηθήσει τον Αλέκο, έχασε την ισορροπία του κι έπεσε μες στη βάρκα.
- Πάει! Πάει! Το πήρε η θάλασσα! φώναξε τρομαγμένος ο Αλέκος.
Ο Αντώνης έκαμε να σηκωθεί, μα κάθε του κίνηση έγερνε τη βάρκα πότε από τη μια μπάντα και πότε από την άλλη, και πάλι έπεφτε. Σύρθηκε ως το κάθισμα, σκαρφάλωσε με δυσκολία κι έπιασε το δεύτερο κουπί.
Ο Αλέκος μισοέκλαιγε.
- Αχ, Αντώνη, τι θα κάνομε χωρίς το κουπί μου; έλεγε.
- Δεν ντρέπεσαι να φοβάσαι! του είπε ο Αντώνης. Ο Σεβάχ ο Θαλασσινός είχε χάσει και τα δυο του κουπιά και το κατάρτι του και πάλι δεν πνίγηκε. Εμείς έχομε το ένα κουπί!
Στηρίχθηκε με τα δυο πόδια στον εμπροστινό μπάγκο και βούτηξε το κουπί στη θάλασσα. Μ' αντί να προχωρήσει, η «Μαγδαληνή» σήκωσε την πλώρη της κι έστριψε, με την κουπαστή της πλαγιασμένη ως το νερό. Ο Αντώνης άρπαξε το κάθισμα για να στηριχθεί, το κουπί έφυγε από τα χέρια του και το πήρε και αυτό η θάλασσα. Και η «Μαγδαληνή», ελεύθερη, ξανάρχισε να χορεύει στα κύματα. Ο Αλέκος τώρα έκλαιγε με τα σωστά του. Ο Αντώνης δεν τα 'χασε, μα ούτε ήξερε τι να κάνει. Γύρευε να σκεφθεί τι θα έκανε σε όμοια περίσταση ο Σεβάχ ο Θαλασσινός και θυμήθηκε πως όσο του έμενε το τιμόνι, τίποτα δεν ήταν χαμένο. Μα τα κύματα φούσκωναν, η «Μαγδαληνή» χόρευε και κυλούσε κι έκανε ν' αναποδογυρίσει με κάθε άτακτη κίνηση των αγοριών.
- Κάτσε ήσυχος, Αλέκο, κάτσε στο βάθος της βάρκας και μην κουνάς! διέταξε σαν αληθινός καπετάνιος ο Αντώνης. Εγώ θα πιάσω το τιμόνι.
Δεν ήταν όμως εύκολο πράμα να φθάσει ως εκεί, να περάσει πάνω από τους μπάγκους. Μ' αυτό δεν τον σταμάτησε· πέρασε από κάτω από τα σανιδάκια και σύρθηκε ως την πρύμη, όπου έπιασε το τιμόνι.
- Τώρα μη φοβάσαι! φώναξε του Αλέκου. Θα φθάσομε σίγουρα στο λιμάνι...
Μα η «Μαγδαληνή» χορεύοντας έφευγε. Έφευγε όλο και πιο μακριά, τα κύματα την έσερναν στο πέλαγος και, όσο και να γύριζε ο Αντώνης πότε δεξιά το τιμόνι και πότε αριστερά, αυτή δε γυρνούσε πίσω. Και δεν ήξερε ο Αντώνης πώς να τη φέρει πίσω. Σωριασμένος στο βάθος της βάρκας, ο Αλέκος έκλαιγε με λυγμούς.
- Αχ, μαμά μου, μαμά μου, γιατί δε σ' άκουσα...
Ο Αντώνης, βαστώντας πάντα το τιμόνι, κοίταζε ολόγυρα, τεντωμένος όλος στην προσπάθεια να βρει κάτι, σαν που θα το έκανε ο Σεβάχ ο Θαλασσινός σ' αυτή την περίσταση.
Μα δεν έβρισκε. Δε θυμούνταν καμιά τέτοια του ιστορία, που να είναι μόνος, μ' ένα παιδί τρομαγμένο που έκλαιγε, σε μια θάλασσα με σπίτια κοντά, και που να φεύγει η βάρκα, αντί να κινδυνεύει να σπάσει στους, βράχους. Πάντα σπάζουν οι βάρκες στους βράχους μες στα βιβλία. Και να βλέπεις, λίγο παραπέρα, τόσες βάρκες δεμένες στην ξηρά, με τόσα κουπιά άχρηστα, και να μην τις φθάνεις! Ο Σεβάχ ο Θαλασσινός; Αυτός θα έπεφτε στη θάλασσα και θα κολυμπούσε ως την ξηρά να φέρει βοήθεια. Μα έλα που ο Αντώνης δεν ήξερε κολύμπι...
- Εσύ ξέρεις κολύμπι, Αλέκο;
- Όχι! Δεν ξέρω! Και θα πνιγούμε, ε; Και θα νυχτώσει, αχ, Θεέ μου, αχ, Θεέ μου!
Κοίταξε τον ουρανό ο Αντώνης. Αλήθεια, είχαν σβήσει τα κόκκινα σύννεφα, σε λίγο θα ήταν νύχτα. Και τη νύχτα και ο Σεβάχ ο Θαλασσινός τα έχανε. Και μια φορά μάλιστα έκλαιγε κι έλεγε: «Αχ, βαχ! Σπιτάκι μου, σπιτάκι μου!»
Έξαφνα θυμήθηκε ο Αντώνης το σπίτι του στην Αλεξάνδρεια και τη μαμά του, και πρώτη φορά σκέφθηκε πως ήταν όμορφη η μαμά του, πολύ άσπρη, με κόκκινα χείλια και γαλανά μάτια, και πως τα φιλιά της ήταν πολύ γλυκά. Περίεργο! Ποτέ άλλη φορά δεν το είχε συλλογιστεί! Κι επίσης έξαφνα γέμισαν τα μάτια του δάκρυα... Ντράπηκε φοβερά και τ' άνοιξε όσο μπορούσε, για να στεγνώσουν στον άνεμο. Τι, θα κλάψει και αυτός τώρα; Σαν τον Αλέκο θα κάνει και αυτός; Φοβήθηκε μήπως και αυτός; Μα τι να φοβηθεί; Στο σπίτι τώρα... Στο σπίτι τι να γίνουνταν; Πού ήταν η θεία και ο θείος; Και όλα αυτά τα 'φταιγαν οι σκάλες της Αλεξάνδρας! Αν δεν ήταν αυτές οι σκάλες, θα είχε μείνει με την Αλεξάνδρα ή θα τον είχε δει η Αλεξάνδρα πως έφευγε και κατέβαινε στο δρόμο... Να είχε ένα φανάρι, θα έκανε σινιάλα σαν τον Σεβάχ το Θαλασσινό. Μα δεν είχε. Ούτε σπίρτα δεν είχε.
- Έχεις σπίρτα, Αλέκο;
- Όχι, δεν έχω. Γιατί;
- Δεν πειράζει, είπε ο Αντώνης.
Θα έπεφτε το μελτέμι τώρα... θα ησύχαζε η θάλασσα... Και ξαναγύρισε το τιμόνι, μια εδώ και μια εκεί, μήπως βρει ένα ρεύμα. Μα η «Μαγδαληνή», σειάμενη κουνάμενη, όλο και πιο μακριά έφευγε, και ο ουρανός ολοένα σκοτείνιαζε και το μούχρωμα κατέβαινε, κατέβαινε... Ο Αλέκος έκλαιγε με φωνές, αγριεμένος. Και ο Αντώνης δεν έβρισκε πια τίποτα παρηγορητικό να του πει, που να το πιστεύει και ο ίδιος. Είχε παρατήσει το τιμόνι και, με τα χέρια ενωμένα ανάμεσα στα γόνατα του, κοίταζε τα φώτα που άναβαν και πλήθαιναν στην προκυμαία, δείχνοντας το μούχρωμα όλο και πιο σκοτεινό. Και θυμήθηκε ιστορίες που είχε διαβάσει και ζωγραφιές που είχε δει: βάρκες χαμένες σε θάλασσες μανιασμένες· ανθρώπους με ξεκούμπωτα ή σχισμένα ρούχα, με μαλλιά αχτένιστα, ανακατωμένα ή που κρέμουνταν, σκουλιά βρεμένα· σχεδίες με ξαπλωμένους, μισοπεθαμένους ναυαγούς και άσπρα πανιά για σινιάλα, δεμένα σε κουπιά που τα είχαν στήσει όρθια...
Έξαφνα άκουσε ένα σφύριγμα τσιριχτό. Ανατρίχιασε και κοίταξε ολόγυρα. Από την ξηρά δυο βαρκούλες είχαν ξεκολλήσει και προχωρούσαν κατά το πέλαγος. Μ' από μέσα από τις καρίνες των καραβιών, που ήταν αραγμένα παραπέρα, πάλι ακούστηκε το ίδιο τσιριχτό σφύριγμα και μια μικρή ατμάκατος πρόβαλε, φυσώντας τον καπνό της κολόνα στον ουρανό, κι έτρεχε καταπάνω τους.
- Αλέκο! φώναξε ο Αντώνης. Του κυρίου Μακρονησιώτη η ατμάκατος! Έρχεται! Έρχεται να μας πάρει!
Ευθύς σταμάτησε τις φωνές του ο Αλέκος και ανασηκώθηκε και πέρασε το κεφάλι του πάνω από την κουπαστή.
- Έρχεται; ρώτησε με κλάματα ακόμα στη φωνή του.
- Δεν τη βλέπεις; Σε μας έρχεται! Να, και σφυρίζει πάλι να μας ειδοποιήσει πως μας είδε...
Τωόντι, η ατμάκατος ορμούσε καταπάνω τους με τσιριχτές σφυριγματιές και λαχανιάσματα βιαστικά, φούτου φούτου φούτου φούτου. Έβαζε λες τα δυνατά της να φθάσει γρηγορότερα. Έπιασε πάλι ο Αντώνης το τιμόνι και το γύρισε πάνω στην ατμάκατο, μα η «Μαγδαληνή», σαν από πείσμα, τράβηξε πιο ανοιχτά. Κι έξαφνα, στο σκοτάδι που ολοένα πύκνωνε, ακούστηκε μια φωνή γνωστή, η φωνή του θείου:
- Αντώνη, εσύ είσαι;
- Ναι, εγώ είμαι, και ο Αλέκος! αποκρίθηκε πνιχτά ο Αντώνης.
Και πάλι ντράπηκε, γιατί, χωρίς να το θέλει, ξαναγέμισαν τα μάτια του δάκρυα. Πλησίαζε, πλησίαζε η ατμάκατος, ώσπου έφθασε κοντά τους κι ένα παλικάρι έριξε ένα σκοινί στην πλώρη και γοργά άρπαξε τον Αλέκο και τον πέρασε στην ατμάκατο, ύστερα σα φτερό σήκωσε και τον Αντώνη και μαζί του πήδηξε και αυτός μέσα. Και βρέθηκε ο Αντώνης στην αγκαλιά του θείου που τον φιλούσε και του έλεγε:
- Κακό παιδί, μας κατατρόμαξες... Άλλη φορά να μην το κάνεις... Σου χρειάζεται γερή τιμωρία, η θεία σου είναι πολύ θυμωμένη... και με το άλλο χέρι αγκάλιαζε τον Αλέκο και γύριζε και του έλεγε κι εκείνου: Δεν έπρεπε ν' ακούσεις τον Αντώνη, τρόμαξε πολύ η μαμά σου. Άλλη φορά να μη λύνετε τις βάρκες...
Η ατμάκατος, σέρνοντας πίσω της τη «Μαγδαληνή», έτρεχε πάλι κατά τη στεριά, με τα βιαστικά της φούτου φούτου φούτου φούτου και, όσο πλησίαζαν, τα δυο αγόρια διέκριναν ανθρώπους μαζεμένους στην ακρογιαλιά και, μεταξύ τους, με καρδιόχτυπο ξεχώρισαν οι δυο ένοχοι το άσπρο φόρεμα της μαμάς του Αλέκου και το κιτρινοφορεμένο στρογγυλό κορμί της θείας Μαριέτας. Και τώρα που πέρασε ο κίνδυνος, η καρδιά τους βούλιαζε στα τακούνια τους με την πρόβλεψη της βεβαίας τιμωρίας. Στάθηκε η ατμάκατος και αμέσως μαζεύθηκαν γύρω της οι δυο βάρκες που είχαν ξεκολλήσει από την ακρογιαλιά και που γύρισαν πάλι πίσω. Δυο μαντέρια, από την ατμάκατο στη μια βάρκα και από τη βάρκα στην ακρογιαλιά και, ώσπου να το καλοκαταλάβουν, βρέθηκαν τ' αγόρια στην ξηρά, ο Αλέκος στην αγκαλιά της μητέρας του που έκλαιγε και τον φιλούσε, ο Αντώνης εμπρός στη θεία του που λιγότερο τρυφερά τον έπιασε από το μπράτσο και, σπρώχνοντας τον εμπρός, είπε:
- Πάμε τώρα στο σπίτι! Αρκετή ώρα στεκόμαστε δω, με την καρδιά στον Άδη! Περπατά εμπρός!
Περπατούσε μπρος ο Αντώνης, το κεφάλι σκυμμένο και τα φτερά ακόμα πιο χαμηλωμένα. Πίσω ακολουθούσαν σιωπηλά η θεία και ο θείος. Και υπολόγιζε ο Αντώνης και στοχάζουνταν αν η αναβολή της τιμωρίας από την ακρογιαλιά στο σπίτι σήμαινε πιο γερό ξύλο ή τιμωρία ήρεμη χωρίς ξύλο. Μα σαν έφθασε στο σπίτι και από τη σκάλα είδε τ' αδέλφια του μαζεμένα στη βεράντα, που τον περίμεναν και τον κοίταζαν τρομαγμένα χωρίς να τον πλησιάσουν, η δική του η καρδιά πήγε στον Άδη.
Έριξε μια λοξή ματιά στ' αδέλφια του και, χωρίς να τους μιλήσει, με σηκωμένο όμως τώρα το κεφάλι, σα να μην τον έμελε τι θα γίνει, ακολούθησε τη θεία Μαριέτα μες στο σπίτι. Τον πήγε η θεία στο σπουδαστήριο τους και κάθισε σε μια καρέγλα και τον φώναξε μπροστά της. Σιωπηλά τον κοίταζε και, κάτω από τη ματιά της, που θύμιζε τόσο τα μάτια του πατέρα σαν ήταν θυμωμένα, λίγο λίγο έχανε το θάρρος του ο Αντώνης και, όσο και αν σήκωνε το κεφάλι, η καρδιά του όμως βούλιαζε όλο και πιο βαθιά. Και όλο τον κοίταζε κείνη και όλο δε μιλούσε. Μα επιτέλους μίλησε η θεία και είπε:
- Όταν έκανες αυτή την αταξία, Αντώνη, κι έλυσες την ξένη βάρκα, συλλογίστηκες τη μαμά σου και τον πατέρα σου, τι θα έκαναν αν πνίγουσουν;
Αυτό δεν το περίμενε ο Αντώνης. Ήταν έτοιμος για ξύλο, όχι όμως για συγκινήσεις. Και τις συγκινήσεις τις απεχθάνουνταν ο Αντώνης. Χαμήλωσε τα μάτια του ταραγμένος. Και είπε πάλι η θεία:
- Νόμιζα πως ήσουν αληθινός γιος του πατέρα σου και πως ξένο πράμα δε θα τ' άγγιζες ποτέ. Και νόμιζα πως αγαπούσες τη μαμά σου και δε θα ήθελες ποτέ να την κάνεις να κλάψει. Αντώνη, αν ήταν εδώ ο πατέρας σου, τι θα σου έκανε, νομίζεις, τώρα;
Το ήξερε πολύ καλά ο Αντώνης τι θα του έκανε ο πατέρας και το περίμενε και από τη θεία, και ήταν έτοιμος να τις φάγει. Μα δεν αποκρίθηκε. Και του είπε η θεία:
- Θα σου έδινε, φαντάζομαι, γερό ξύλο, και με το δίκιο του. Και θα σ' έδερνα κι εγώ και θα το άξιζες. Μα να 'χεις χάρη που μεσίτεψε για σένα ο θείος σου, που νόμιζε πως θα πνιγείς και που το νόμισα κι εγώ, μαζί με τον άλλο μικρό, που τον πήρες στο λαιμό σου και πήγε να τα χάσει η μάνα του η κακομοίρα.
Το κεφάλι του Αντώνη χαμήλωνε, χαμήλωνε. Όσο ένιωθε το φόβο ν' απομακρύνεται, τόσο ντρέπουνταν περισσότερο για την αταξία του και τόσο δεν μπορούσε να σηκώσει τα μάτια του. Και είπε πάλι η θεία:
- Ας είναι, θα γίνει η χάρη του θείου σου και δε σε δέρνω. Πιστεύω άλλωστε να τρόμαξες αρκετά μες στη βάρκα, όταν σας έπαιρνε η θάλασσα...
Του ήλθε να πει: «Καθόλου δεν τρόμαξα...» Μα μια ματιά στα μαύρα μάτια της θείας τού έκοψε τη φόρα. Και είπε η θεία, σουρώνοντας τα φρύδια της, του πατέρα τα φρύδια:
- Σου αξίζει όμως μια τιμωρία, μια γερή τιμωρία, και θα την έχεις. Αύριο που θα πάμε μεις με τ' αδέλφια σου στης Αλίς, εσύ θα μείνεις εδώ, μόνος, και θα γράψεις ολόκληρο το ρήμα «λείπω». Και απόψε δε θα καθίσεις στο τραπέζι, μόνο θ' ανέβεις ευθύς στην κάμαρα σου. Μ' άκουσες; Πήγαινε!
Ο Αντώνης δεν περίμενε να του το επαναλάβει η θεία και βγήκε έξω και ανέβηκε στην κάμαρα του. Εκεί αναστέναξε. Η τιμωρία δεν τον πείραζε, όσο και να είχε όρεξη να πάγει στης Αλίς. Και το ξύλο θα το δέχουνταν. Εκείνο που φοβούνταν και που γλίτωσε, που δεν του το επέβαλε η θεία, ήταν να ζητήσει συγχώρηση. Αυτό απ' όλες τις τιμωρίες ήταν η χειρότερη. Ας τον έδερνε η θεία, ας τον σκότωνε, μόνο να μην έχει να πει, «Συγχωρήσετε με, θεία, και δε θα το κάνω πια». Αυτά ήταν για τα μωρά, σαν τον Αλέξανδρο. Αυτός δεν είχε ανάγκη να το υποσχεθεί για να μην το ξανακάνει. Και σα να το κατάλαβε η θεία... ποιος ξέρει; δεν του το ζήτησε... Βήματα ακούστηκαν στη σκάλα. Ανασηκώθηκε ο Αντώνης και κάνοντας τον αδιάφορο, χώνοντας τα χέρια του στις τσέπες, βγήκε στο μπαλκόνι και άρχισε να σφυρίζει. Μα ήταν μόνο η Αφροδίτη μ' ένα δίσκο. Ακούμπησε το δίσκο της στο τραπέζι και βγήκε κι εκείνη στο μπαλκόνι.
- Τι μου κάνεις τώρα τον καμπόσο, κακόπαιδο; είπε μ' ένα γοργό χάδι στο κεφάλι του.
Και σκύβοντας ξαφνικά τον φίλησε στις ρίζες των μαλλιών του.
- Κακό, κακόπαιδο! Τρελαντώνη! Καλά σε λέγει η κερα-Ρήνη! Τι τρομάρα πήραμε όλοι για χατίρι σου! Κόπηκε το αίμα μου σα σε είδα να σε παίρνει η θάλασσα μονάχο, στη βάρκα!
- Δεν ήμουν μονάχος, διέκοψε ο Αντώνης, ήταν και ο Αλέκος...
- Ναι! Βοήθεια σού ήταν! αντέκοψε η Αφροδίτη.
- Από πού μας είδες; ρώτησε ο Αντώνης.
- Από πού; Από την τραπεζαρία. Ο Θεός με φώτισε ν' ανέβω να βάλω τραπέζι πιο νωρίς. Είδα μια βάρκα να φεύγει μοναχή της και είπα: «Σε καλό τους, τέτοια ώρα και με τέτοιον άνεμο!» Κι εκεί σε βλέπω σένα να σηκώνεσαι, να πέφτεις μες στη βάρκα και να ξανασηκώνεσαι. Παναγιά μου! Σφάχτης μ' έκοψε! Και την ίδια ώρα ακούω τρεχιό στη σκάλα και τα δυο μικρά κατέβαιναν κι έτρεχαν στο σαλόνι, όπου έπαιζε πιάνο η Αλεξάνδρα, και φώναζαν: «Αλεξάνδρα! Αλεξάνδρα! Ο Αντώνης είναι στη βάρκα!» Τρομάρα τα παιδιά, μην τα ρωτάς! Και φοβούνταν να το πουν στη θεία σου! Τρέχω γω πάνω, που ήξερα πως ήταν στην κάμαρα της κι έραβε στη μηχανή, και με τους τρεις που έτρεχαν το κατόπι μου για να μην της το πω, λέει, της φωνάζω: «Σώστε, κυρία, και πνίγεται ο Αντώνης!» Πώς έγινε η καημένη, κατακίτρινη σαν το φλουρί! Κατέβηκε τρεχάτη, κι εμείς όλοι μαζί, και στο δρόμο, εμπρός στο σπίτι, βρίσκομε το θείο σου που γύριζε απέξω. «Γρήγορα, γρήγορα, Ζωρζή! Τρέχα, ο Αντώνης είναι σε μια βάρκα χωρίς βαρκάρη!» του φώναξε. Τρέχαν και τα παιδιά, μα τα γύρισε μπρος πίσω η θεία σου.
- Ήταν θυμωμένη; ρώτησε ταπεινωμένος ο Αντώνης.
- Θυμωμένη λέει; Πρώτα θύμωσε πολύ. Ύστερα όμως ήταν πιότερο τρομαγμένη. Μα δεν τα έχασε· έχει γερό κεφάλι η θεία σου! Κατέβηκε με το θείο σου να φωνάξει βαρκάρη, να βγει με τη βάρκα του να σας φέρει πίσω· μα δεν ήταν κανένας στην ακρογιαλιά. Εκείνη συλλογίστηκε τότε την ατμάκατο του κυρίου Μακρονησιώτη, και με το αμάξι έφυγε ο θείος σου να τη βρει. Μα κι έτσι δεν ησύχασε κείνη. Πήγε, φώναξε, σήκωσε τον κόσμο στο πόδι, και βρέθηκαν δυο βαρκάρηδες που έλυσαν τις βάρκες τους. Μα στο μεταξύ βγήκε και η ατμάκατος, δόξα να 'χει ο Θεός! είπε η Αφροδίτη και σταυροκοπήθηκε.
Κοίταζε ο Αντώνης τη σκοτεινή θάλασσα ησυχασμένη πια, τώρα που είχε πέσει ολότελα το μελτέμι, και του φάνηκε όλη αυτή η απογεματιανή ιστορία σαν παραμύθι. - Εγώ δεν τρόμαξα, είπε. Διάβασα χειρότερες ιστορίες που...
- Άφησε με που δεν τρόμαξες! Το λες τώρα που πατάς γερά τη γη, διέκοψε η Αφροδίτη. Ακούς, λέει, δεν τρόμαξες! Καλά έλεγε η θεία σου πως σου χρειάζεται ξύλο! - Μα δε μου το 'δωσε, αποκρίθηκε ο Αντώνης σηκώνοντας τους ώμους του.
Και σειώντας το κεφάλι του μια εδώ, μια εκεί, μπήκε στην κάμαρα.
- Εγώ θα σου τις έβρεχα, είπε η Αφροδίτη που μπήκε κι εκείνη στην κάμαρα. Και φαγί απόψε δεν έχει, μόνο μια σούπα με ξερό ψωμί, είπε η θεία σου. Ας έχεις χάρη στην κερα-Ρήνη που σε λυπήθηκε και σου έκοψε λίγο κρέας μες στη σούπα σου! Δε σου άξιζε βέβαια! Και σου βουτύρωσε και το ψωμί, που κακό να μη σε πιάσει, ζουρλόπαιδο! Άιντε, κάτσε τώρα να φας...
Είχε πλαγιάσει ο Αντώνης σαν ανέβηκαν τ' αδέλφια του. Ήταν σα μαγκωμένα και τα τρία, ζεματισμένα, μουδιασμένα ακόμα από το απογεματιανό κακό. Η αταξία του Αντώνη βάραινε πάνω τους. Στο τραπέζι η θεία δε μιλούσε και ο θείος, ύστερα από ένα δυο προφητείες για τον καιρό που θα κάνει αύριο στην Κηφισιά, σώπασε κι εκείνος, και ύστερα έπιασε την εφημερίδα του.
Η Αλεξάνδρα, σοβαρή, συλλογισμένη, ένιωθε πως, σαν πιο μεγάλη, ήταν υπεύθυνη για τα καμώματα του αδελφού της, που μέρα δεν άφηνε να περάσει χωρίς να κάνει και από μια τρέλα. Ντρέπουνταν γι' αυτόν και για όσα θα έλεγαν οι Χορν, τώρα που παρέσυρε και τον Αλέκο στην αταξία του.
Είχε αποφασίσει να μιλήσει του Αντώνη, μα δεν ήξερε πώς ν' αρχίσει. Το είχε πει μάλιστα και της Πουλουδιάς, να τη βοηθήσει εκείνη, να φέρει την ομιλία. Μα η Πουλουδιά, που άλλη φορά θα είχε κολακευθεί πολύ με αυτή την πρόταση, ήταν σα σκαντζόχοιρος εκείνο το βράδυ και δεν μπορούσες να την πλησιάσεις. Ο Αντώνης όμως δεν άφησε καιρό της Αλεξάνδρας να ετοιμάσει τη φράση της. Την πρόλαβε ρωτώντας:
- Τι φαγί είχατε απόψε;
Η Αλεξάνδρα, που περίμενε μετάνοια και συντριβή από τον αδελφό της, κοντοστάθηκε. Κοίταξε την Πουλουδιά για βοήθεια. Μ' αυτή είχε ακουμπήσει στα κάγκελα του κρεβατιού του Αντώνη και κοίταζε αλλού. Αποκρίθηκε ο Αλέξανδρος:
- Είχαμε περιστέρια με μπιζέλι.
- Αχ... το αγαπημένο μου φαγί! είπε μελαγχολικά ο Αντώνης. Κρίμα!
Τον λυπήθηκε η Αλεξάνδρα και σταμάτησε όλες τις παρατηρήσεις που είχε ετοιμάσει. Και αποκρίθηκε πάλι ο Αλέξανδρος:
- Το είπε και ο θείος.
- Τι είπε ο θείος; ρώτησε ο Αντώνης.
- Πως ήταν μεγάλη η τιμωρία σου, γιατί τα περιστέρια με τα μπιζέλια είναι το αγαπημένο σου φαγί. Και είπε η θεία: «Τόσο το καλύτερο, να καταλάβει τι έκανε!» Και ύστερα δεν είπε πια τίποτα ο θείος.
Ο Αντώνης έδωσε μια κλοτσιά στο σεντόνι του και το έκανε βουνό χιονισμένο με το πόδι του από κάτω.
- Εμένα δε με μέλει καθόλου, καυχήθηκε πετώντας έξω τα χείλια του, είτε φάγω είτε δε φάγω...
Η ώρα της Αλεξάνδρας είχε έλθει και την άρπαξε και είπε:
- Πρέπει να σε μέλει, Αντώνη! Και πρέπει να γίνεις πια καλό παιδί...
- Σαν τη θεία μιλάς τώρα, διέκοψε ο Αντώνης. Μα η Αλεξάνδρα είχε πάρει φόρα.
- Έχει πολύ δίκαιο η θεία, είπε με αγανάκτηση. Μας ντροπιάζεις όλους, κάθε μέρα, πότε εμπρός στην Αλίς, πότε εμπρός στους άλλους...
- Ποιους άλλους; Τι σαχλαμάρες! διέκοψε πάλι ο Αντώνης.
- Σαχλαμάρες τα λες αυτά; Εσύ αύριο δε θα έλθεις και δε σε μέλει, μα εμείς που θα πάμε στην Κηφισιά και θ' απαντήσομε τον πατέρα του Αλέκου...
- Ωωωω... έκανε η Πουλουδιά.
Και μες στη σαστισμένη σιωπή που ακολούθησε, ξέσπασε στα κλάματα, έδωσε μια κλοτσιά στ' ανεύθυνα πόδια του κρεβατιού κι έτρεξε στο μπαλκόνι. - Τι σ' έπιασε; φώναξε ο Αντώνης.
- Άσ' την, είπε η Αλεξάνδρα, είναι έτσι, στις κακές της σήμερα. Ό,τι και αν της πεις κλαίγει, τη μάλωσε η θεία που ήλθε στο τραπέζι με βρώμικη ποδιά...
- Όχι, δεν είναι γι' αυτό που κλαίγει, διέκοψε ο Αλέξανδρος. Έκλαιγε και πριν από το τραπέζι.
- Πριν έλεγε πως την πονεί το παπούτσι της, είπε η Αλεξάνδρα.
- Ναι... μα ίσως και τώρα να την πονεί... Βγήκε ο Αλέξανδρος στο μπαλκόνι και ρώτησε:
- Σε πονεί, Πουλουδιά, το παπούτσι σου;
- Όχι... ναι... με πονεί, ακούστηκε παραπονιάρικη η φωνή της.
- Και δεν το βγάζεις, κουτή; της φώναξε από το κρεβάτι ο Αντώνης.
- Ναι, βγάλ' το, Πουλουδιά, είπε ο Αλέξανδρος. Στάσου, εγώ θα σου το βγάλω...
Η Πουλουδιά δεν ήθελε. Επέμεινε ο Αλέξανδρος και τον έσπρωξε η Πουλουδιά. Θύμωσε ο Αλέξανδρος και της έδωσε μια στην πλάτη. Και ξέσπασε πάλι η Πουλουδιά στα κλάματα.
- Μα τι έπαθες απόψε; ξαναφώναξε ο Αντώνης. Η Αλεξάνδρα σήκωσε τους ώμους της.
- Έχει μπουρινάκια, εξήγησε. Άρχισε όταν μας έστειλε μέσα η θεία, κι εμείς θέλαμε να κατεβούμε στην ακρογιαλιά, να δούμε τη βάρκα σου. Και από κείνη την ώρα όλο ξανανοίγουν οι βρύσες...
- Πουλουδιά, κλείσε τις βρύσες! φώναξε ο Αντώνης. Ακούς, Πουλουδιά; Ε, Πουλουδιά...
- Αντώνη!... ακούστηκε θυμωμένη η φωνή της θείας. Ξέχασες πως είσαι τιμωρημένος;
Σιωπή στην κάμαρα.
Και ο Αντώνης χώθηκε κάτω από το σεντόνι του, η Αλεξάνδρα άρπαξε το χτένι, τάχα πως λύνει τα μπερδεμένα μαλλιά της, ο Αλέξανδρος κάθισε χάμω να ξεκουμπώσει τα παπούτσια του και σιωπηλή και ντροπιασμένη τρύπωσε μέσα η Πουλουδιά και μισοκρύφθηκε πίσω από την κουνουπιέρα της να γδυθεί.
Όταν μπήκε στην κάμαρα η Αφροδίτη, βρήκε όλα τ' αδέλφια μισογδυμένα. Απόγδυσε τον Αλέξανδρο και άρχισε να χτενίζει την Αλεξάνδρα, τυλίγοντας τα μαλλιά της σκουλιά σκουλιά σε χαρτί.
Και οι δυο αδελφές μισούσαν αυτή την προετοιμασία που γίνουνταν κάθε βράδυ, με περισσότερη φροντίδα, που σήμαινε περισσότερα χαρτιά στο κεφάλι, κάθε φορά την επαύριο έπρεπε να είναι καλοχτενισμένα τα κορίτσια. Τα σφιγμένα μαλλιά, τεντωμένα και τραβηγμένα στις ρίζες, τα χαρτιά κόμποι κόμποι, που χώνουνταν στο κεφάλι μόλις έκανες να γυρίσεις στο κρεβάτι, πονούσαν, σε ξυπνούσαν, σε νεύριαζαν. Και το χειρότερο για τις δυο αδελφές ήταν το πρωί, όταν έβγαζες τα χαρτιά και τους ξεδιάλυνες τα μαλλιά, που φούντωναν σγουρεμένα και τους έκαναν δυο κεφάλια σαν «ξεραχνιάστρες», έλεγε η Αλεξάνδρα, μ' ένα φιόγκο ή μια κορδέλα που τις έκανε σα μαϊμούδες, έλεγε ο Αντώνης.
Μα έτσι το ήθελε η μαμά, και οι αδελφές το είχαν πάρει απόφαση και η τελετή του σγουρώματος γίνουνταν λίγο πολύ χωρίς φασαρία.
Απόψε όμως ήταν στις στραβές της η Πουλουδιά και, σαν ήλθε η σειρά της, σήκωσε επανάσταση:
- Δε θέλω, δε θέλω να μου κάνεις κατσαρά!
- Μπρε, αμάν, παιδί μου!
- Όχι, δε θέλω!
- Αύριο θα είσαι σαν κατσιβέλα!
- Ας είμαι!
- Δε θα σε πάρει η θεία σου στην Κηφισιά!
- Ας μη με πάρει!
- Στάσου, μπρε παιδί μου, μια στιγμή!
- Δε θα σταθώ!
Και δε στάθηκε και δεν μπήκαν τα χαρτιά και την άλλη μέρα μόνη η Αλεξάνδρα βρέθηκε καλοχτενισμένη, με φουντωτά κατσαρωμένα μαλλιά.
Η Πουλουδιά είχε ξυπνήσει πάλι από την ανάποδη. Ακόμα δεν της είχε μιλήσει κανείς και άρχισε να κλαίγει. Και σαν τη ρώτησε η Αφροδίτη τι έχει, είπε πάλι πως την πονεί το παπούτσι.
- Μα άφησε να δω, μην έχει κανένα καρφί το παπούτσι σου!
- Όχι, δεν έχει!
- Στάσου, μπρε παιδί μου, να δω!
- Όχι, δε θέλω!
Μα όταν κατέβηκαν στο πρόγευμα και είδε η θεία το κεφάλι της σαν «κατσιβέλας» κι έμαθε για ποιο λόγο είχαν μείνει τα μαλλιά της ακατσάρωτα, θύμωσε και της είπε: - Λοιπόν δε θα σε πάρομε στην Κηφισιά! Τα καπριτσιόζικα παιδιά μένουν σπίτι!
Τ' αδέλφια περίμεναν πως θ' ανοίξουν οι βρύσες και θα γίνει νεροποντή. Μα, ω του θαύματος, η Πουλουδιά δεν έκλαψε!
Και σαν ήλθε το αμάξι και πήρε θεία, θείο, Αλεξάνδρα και Αλέξανδρο και γύρισε ο Αντώνης μελαγχολικά από τη βεράντα να μπει μέσα, πηδώντας με τα πόδια της ενωμένα μπήκε και η Πουλουδιά και, πιάνοντας τον από τους ώμους, φώναξε θριαμβευτικά:
- Όλο το σπίτι δικό μας είναι σήμερα! Πάμε να παίξομε κυνηγητό στις σκάλες!
Μα ο Αντώνης δεν ξεμελαγχόλησε.
- Έχω να γράψω ένα ρήμα, της αποκρίθηκε κατσουφιασμένος.
- Μπα! Εσύ γράφεις γρήγορα! Τι είναι ένα ρήμα! Να σου το λέγω εγώ από τη γραμματική και συ να γράφεις.
- Θα 'ρθεις και συ μαζί; ρώτησε ο Αντώνης. Και πρόσθεσε συμπονετικά:
- Τι κουτή που ήσουν χθες να μην αφήσεις να σε σγουράνουν και να πας στην Κηφισιά!
Η Πουλουδιά έκανε άλλους δυο πήδους.
- Μα εγώ δεν ήθελα να πάγω, είπε.
Με τα χέρια στις τσέπες την κοίταξε ο Αντώνης.
- Γιατί; ρώτησε.
Η Πουλουδιά κοντοστάθηκε, δίστασε.
- Γιατί έτσι, είπε με απόφαση.
Έστριψε μια δυο φορές στο τακούνι της και πιάνοντας τον πάλι από τους ώμους:
- Έλα να γράψομε το ρήμα σου, είπε. Μόνο η οριστική έχει πολλά. Τ' άλλα, υποτακτική, προστακτική, απαρέμφατο, αυτά παν γρήγορα. Έλα, πάμε να το ξεφορτωθούμε!
Και πήγαν και το ξεφορτώθηκαν και αναστέναξε ο Αντώνης και πέρασε το στουπόχαρτο πάνω στο χαρτί του, όπου λες και είχαν περάσει πηδηχτά μελανωμένα ποδαράκια σπουργιτιού. Και με την αδελφή του, τρεχάτος κατέβηκε στην αυλή.
- Κι εδώ μπορούμε να κάνομε τους περιβολάρηδες, είπε η Πουλουδιά. Χθες ίσα ίσα έλεγε ο θείος πως όλο το περιβόλι θέλει σκάψιμο. Έλα να το σκάψομε εμείς!
Πήραν λοιπόν ο ένας ένα μικρό σκουριασμένο καρφί, η άλλη ένα κομμάτι σπασμένο κεραμίδι και άρχισαν να σκάβουν.
- Μιάου!
Γύρισαν τ' αδέλφια και είδαν την κιτρινόμαυρη γάτα της Ρωσίδας κυρίας της Τιμής.
- Φύγε, φύγε! Κσσστ! έκανε η Πουλουδιά. Έχομε δουλειά!
Μα η γάτα δεν έφυγε, απεναντίας σίμωσε.
- Φύγε! επανέλαβε η Πουλουδιά, μα συνάμα της έτριψε χαδιάρικα το κεφάλι.
- Να την έβλεπε ο Ντον! είπε ο Αντώνης.
- Τι θα έκανε ο Ντον;
- Θα την έτρωγε!
- Γιατί;
- Έτσι. Ο θείος λέγει πως οι σκύλοι και οι γάτες όλο τρώγονται.
- Αλήθεια; ρώτησε μαγεμένη η Πουλουδιά. Κρίμα που δεν είναι εδώ ο Ντον!
Ο Αντώνης σηκώθηκε και τίναξε τα χώματα από τα χέρια του.
- Πάμε να δοκιμάσομε αν είναι αλήθεια; ρώτησε.
- Πού να πάμε;
- Στην αυλή του βασιλέα. Δεν είναι ποτέ κλειδωμένη. Η καρδιά της Πουλουδιάς πήδηξε στο λαιμό της. Αυτό και αν ήταν τρέλα! Τρομερή τρέλα! Αντώνικη τρέλα!
Μα λες και αυτή την ώρα κόλλησε από την τόλμη του Αντώνη και η Πουλουδιά.
- Ναι! αναφώνησε. Πάμε!
Πήρε τη γάτα στην αγκαλιά της και ρίχνοντας πίσω ανήσυχες ματιές, μην και τους δει η κερα-Ρήνη ή η Αφροδίτη, τα δυο αδέλφια, πατώντας στα νύχια, βγήκαν από την αυλή. Η πόρτα του βασιλέα ήταν ξεκλείδωτη και με καρδιόχτυπο την έσπρωξαν τ' αδέλφια. Ησυχία. Τα τρία σκυλιά, δεμένα, ξαπλωμένα ηλιάζουνταν. Μόνος ο Ντον σήκωσε το κεφάλι του και κούνησε την ουρά του. Βαστώντας τη γάτα πλησίασε η Πουλουδιά. Μα τι ήταν αυτό; Έξαφνα η ήσυχη αυλή αναστατώθηκε. Γαβγίσματα, φυσίγματα, φωνές και στριγλιές γέμισαν τον αέρα. Η γάτα είχε ξεφύγει από τα χέρια της Πουλουδιάς και είχε σκαρφαλώσει στο σβέρκο της, με τις τρίχες ολόρθες, φτύνοντας και φυσώντας, ξετρελαμένη, ενώ ο Ντον και τ' άλλα σκυλιά, όρθια, τραβούσαν τις αλυσίδες τους, σα να ήθελαν να τις σπάσουν και ν' αρπάξουν τον εχθρό.
Η Πουλουδιά ξεφώνιζε, γύρευε να ξεφορτωθεί τη γάτα, και ο Αντώνης μάταια προσπαθούσε να την πιάσει. Παλεύοντας οπισθοχώρησε η Πουλουδιά και η γάτα πήδηξε στον τοίχο και χάθηκε στην αυλή της Ρωσίδας κυρίας της Τιμής.
Ο Αντώνης άρπαξε το μπράτσο της Πουλουδιάς και απότομα την έσυρε στην πόρτα, τη στιγμή που στο πάνω πάτωμα άνοιγαν όλα τα παντζούρια και κεφάλια παρουσιάζουνταν σε διάφορα παράθυρα.
Τρεχάτα είχαν βγει τ' αδέλφια στο δρόμο, αφήνοντας την πόρτα ανοιχτή, και τρύπωσαν στην αυλή τους.
Τρομαγμένα κοιτάχθηκαν.
Η Πουλουδιά μάτωνε από μια τσουγκρανιά στο σβέρκο και ο Αντώνης από άλλη μια στο χτένι του χεριού.
- Δεν πειράζει, είπε ο Αντώνης, χλομός ακόμα αλλά ξαναβρίσκοντας την τόλμη του. Πάμε μέσα να σε πλύνω και δε θα φαίνεται τίποτα.
Μα φαίνουνταν η τσουγκρανιά πάνω από το φρίλι του λαιμού της και, όσο και αν τραβούσε απάνω ο Αντώνης το φουστάνι, πάλι ξανάπεφτε στη θέση του και ξεσκέπαζε το γδαρμένο σβέρκο.
- Τι κουταμάρα να 'χεις κοντά μαλλιά! της είπε. Αν είχες κοτσίδα, θα την ξέπλεκες και δε θα φαίνουνταν τίποτα.
- Και το χέρι σου;
- Αυτό δεν πειράζει, το κρύβω στην τσέπη.
Τα κέφια τους ήταν μουδιασμένα και τα φτερά τους χαμηλωμένα.
- Πώς έκανε η γάτα... είπε συλλογισμένος ο Αντώνης.
Ήταν εκείνο που έλεγε η μις Ράις «Μαντ κατ»1. Αλήθεια, σαν τρελή έκανε!
- Είναι πολύ κακιά και άγρια αυτή η γάτα, αποκρίθηκε τρομαγμένη ακόμα η Πουλουδιά. Νόμιζα πως θα με φάγει...
Της έριξε ο Αντώνης μια στοχαστική ματιά και είπε:
- Ξέρεις... συλλογίζομαι... μήπως εμείς ήμασταν κακοί που πήγαμε να τη ρίξομε στη μύτη των σκύλων.
- Γιατί ήμασταν εμείς κακοί; ρώτησε η Πουλουδιά που μπροστά της ανοίγουνταν ξαφνικά κόσμοι από κουβαριασμένους στοχασμούς. Τι κάναμε;
- Λέγω... ξέρω γω; Η γάτα είναι πιο μικρή από τους σκύλους του βασιλέα. Αν ρίχναμε... ας πούμε, τον Αλέξανδρο που είναι μικρός, σ' ένα μεγάλο Τούρκο, και ο Τούρκος τον αρπούσε στα δόντια του...
- Όχι, Αντώνη! αναφώνησε η Πουλουδιά. Δεν είναι το ίδιο!
- Όχι, δεν είναι ολωσδιόλου το ίδιο... αποκρίθηκε κάπως μπερδεμένος ο Αντώνης, γιατί ο Αλέξανδρος είναι αδελφός μας... Μα η γάτα ήταν μικρή και ο Ντον μεγάλος... και ήταν τρία σκυλιά...
Πολύ άσχημες απορίες κουτρουβαλούσαν στο μυαλό της Πουλουδιάς και άλλες τόσες στσυ Αντώνη. Μα ο Αντώνης δεν αγαπούσε τις στενόχωρες σκέψεις.
- Ουφ! είπε. Κάνει ζέστη εδώ μέσα! Και πρέπει να σκάψομε τον κήπο. Πάμε στην αυλή.
Και ξανάπιασαν το καρφί και τη σπασμένη κεραμίδα κι έσκαψαν, κι έσκαψαν, και γύρισαν όλο το χώμα, όχι μόνο στις πρασιές που περιτριγύριζαν την αυλή, αλλά και σ' όλες τις γλάστρες με τους βασιλικούς, επίσης και σ' ένα βαρελάκι όπου ο θείος είχε φυτέψει μια τριανταφυλλιά που έβγαζε εκατόφυλλα τριαντάφυλλα και που την περιποιούνταν ιδιαίτερα και μόνος αυτός.
Και αφού έσκαψαν καλά καλά και μάδησαν όλα τα φύλλα που τους φαίνουνταν ξερά, μαζί και μερικά χλωρά, της τριανταφυλλιάς του θείου, τους φάνηκε ξαφνικά αυτή σα μαδημένη. Και τότε θυμήθηκε ο Αντώνης πως είχε πει κάποτε ο θείος ότι πληγώνεις το φυτό τραβώντας τα φύλλα.
- Ναι, είπε συλλογισμένη η Πουλουδιά, θα χρειάζουνταν ψαλίδι... Κι έχασα το δικό μου. Κρίμα.
- Πήγαινε να φέρεις της θείας, της είπε ο Αντώνης κόβοντας ακόμα ένα δυο φύλλα που του φαίνουνταν παραμεγαλωμένα.
- Όχι, φοβούμαι, αποκρίθηκε η Πουλουδιά. Θα φωνάζει η θεία.
- Καλά λες. Πάρε της Αλεξάνδρας.
Τρεχάτη μπήκε μέσα η Πουλουδιά, μα σε λίγο παρουσιάστηκε το κεφάλι της στο παράθυρο της εισόδου.
- Δεν το βρίσκω, Αντώνη! του φώναξε.
- Στάσου, έρχομαι, αποκρίθηκε κείνος.
Μα όσο και να σκάλισαν και οι δυο και ν' αναποδογύρισαν τα καλοσυγυρισμένα κουτιά της Αλεξάνδρας, το ψαλίδι δε βρέθηκε.
- Και όμως πρέπει να κόψομε τα κοτσανάκια που μείναν από τα ξερά φύλλα, είπε ο Αντώνης. Φαίνεται ακατάστατη έτσι η τριανταφυλλιά. Στάσου. Θα πάρομε μια στιγμή το ψαλίδι της θείας και θα το βάλομε πάλι στη θέση του. Δε θα πάθει τίποτα.
Μα το πανεράκι της θείας δεν ήταν κάτω.
- Πάμε να δούμε στην κάμαρα της, είπε ο Αντώνης.
- Αχ, Αντώνη, κοίταξε τα χέρια σου! Πώς θα πιάσεις το πανέρι της θείας;
Ο Αντώνης κοίταξε τα σκονισμένα, όλο χώματα χέρια του, και ύστερα τα παπούτσια του, που ήταν στα ίδια χάλια.
- Έχεις δίκαιο, είπε, πάμε πρώτα να καθαριστούμε.
Και, με πλυμένα χέρια και ξεσκονισμένα παπούτσια, δειλά μπήκαν τα δυο αδέλφια στην κάμαρα της θείας.
Η κάμαρα της θείας ήταν το «άγιον των αγίων». Απαγορεύουνταν στα τέσσερα αδέλφια να μπαίνουν μέσα, αν δεν τα φώναζε η θεία. Και η θεία δεν τα φώναζε ποτέ· έβγαινε στην είσοδο, αν είχε να τα μαλώσει ή να τα επιθεωρήσει πριν βγουν. Αλλά στην κάμαρα της δεν ήθελε «ποδαρικά», όπως έλεγε.
Αυτό που έκανε ο Αντώνης, να μπει μέσα με την Πουλουδιά ενόσω έλειπε η θεία, ήταν το άκρον άωτον της τόλμης και της ασέβειας και της αποκοτιάς.
Το ένιωθε η Πουλουδιά, κρεμασμένη στο μπράτσο του, και η καρδιά της χτυπούσε τούμπανο.
- Αντώνη... πάμε να φύγομε... ψιθύρισε χαμηλώνοντας τη φωνή της, σα να βρίσκονταν σε αγιαστήριο. Πάμε, Αντώνη!
- Φοβητσιάρα! Τι φοβάσαι; Στάσου να δούμε, της είπε κείνος. Κοίταξε τι μακριά που φαίνεται η θάλασσα από δω... Να και τα βουνά πέρα, εκεί θα 'ναι η Κηφισιά, που είναι βουνό και δεν είναι βουνό, όπως λέγει η Αλίς.
- Πώς το ξέρεις πως είναι η Κηφισιά; ρώτησε η Πουλουδιά που είχε τρυπώσει κοντά του στο παράθυρο.
Ο Αντώνης σήκωσε τους ώμους του.
- Αφού είπε η Αλίς πως είναι πέρα; Και πέρα άλλο βουνό δεν έχει...
Το επιχείρημα ήταν αναμφισβήτητο. Και όμως...
- Αντώνη... πώς περνά το τρένο τη θάλασσα; ρώτησε η Πουλουδιά.
Ο Αντώνης δεν αποκρίθηκε.
Γύρισε η Πουλουδιά και τον είδε όρθιο στην άλλη άκρη της κάμαρας, εμπρός στην ασκέπαστη ραφτομηχανή της θείας. Πλησίασε βιαστικά.
- Μπα!... Δεν την έκλεισε η θεία... μουρμούρισε.
Ο Αντώνης ρουθούνιζε.
- Την άνοιξα για να τη δω, είπε. Μα... πουφ... βρωμά πετρέλαιο! Να την αφήσομε να ξεμυρίσει;
Με το δάχτυλο έσπρωξε σιγά τη ρόδα.
- Μη, Αντώνη, μην την αγγίζεις! Δε θέλει η θεία! είπε η Πουλουδιά.
Μα η περιέργεια του Αντώνη είχε ξυπνήσει.
- Για να δούμε αν τρυπά η βελόνα, έκανε βάζοντας το δάχτυλο του από κάτω, ενώ με το δεξί του χέρι έπιανε το χερούλι.
Η λαδωμένη ρόδα γύρισε γοργά μ' ένα ζλακ! και η βελόνα τρύπησε πέρα πέρα το δάχτυλο του Αντώνη, χωρίς να ξανασηκωθεί.
- Αντώνη! φώναξε η Πουλουδιά.
- Στάσου ν' ανεβάσω τη βελόνα, είπε χωρίς να ταραχθεί ο Αντώνης, ευτυχώς είναι απέραστη, θα βγει εύκολα...
Γύρισε τη ρόδα και η βελόνα σηκώθηκε ως απάνω, χωρίς όμως και να βγει από το δάχτυλο, που έμενε καρφωμένο.
- Αντώνη! Αχ, Αντώνη, τι έκανες! είπε κλαίγοντας η Πουλουδιά. Πώς θα τη βγάλεις τώρα;
Ο Αντώνης κοίταζε το δάχτυλο του.
- Δε με μέλει που τρυπήθηκα, είπε, μόνο που θα με βρει εδώ η θεία!
Η Πουλουδιά έκλαιγε τώρα με αναφιλητά.
- Αχ, Θεέ μου! Θα σου κόψουν το δάχτυλο, Αντώνη! Πώς θα φύγεις από δω; Αχ, στάσου να φωνάξω την Αφροδίτη...
Με το δεξί του χέρι την άρπαξε ο Αντώνης από το μανίκι.
- Να μην κουνήσεις! πρόσταξε. Και αντί να κλαις, βοήθησε με να βγάλω τη βελόνα!
- Μα πώς; Πώς; έκανε απελπισμένη η Πουλουδιά.
- Να! Βάστα τη ρόδα και γύρισε την αργά αργά, ώσπου ν' ανέβει όσο μπορεί πιο ψηλά η βελόνα. Έλα!
Έκανε η Πουλουδιά όπως της έλεγε και, σαν ανέβηκε ψηλά η βελόνα, σταμάτησε τη ρόδα.
- Στάσου τώρα, της είπε ο Αντώνης, μην ξαναπέσει η ρόδα! και με το δεξή του δείχτη πίεσε κάτω το τρυπημένο νύχι με όλη του τη δύναμη.
- Πονεί; ρώτησε τρέμοντας η Πουλουδιά.
- Άφησε τώρα αν πονεί, ο λόγος είναι να βγει η βελόνα! Βάστα τη ρόδα... Βάστα! Πάει, βγήκε! φώναξε θριαμβευτικά ο Αντώνης.
Και τράβηξε το δάχτυλο του και το έχωσε στο στόμα.
- Ρούφηξε το! Πιπίλισέ το! Δείξε μου το! παρακάλεσε η Πουλουδιά.
Έβγαλε ο Αντώνης το δάχτυλο από το στόμα του και τα δυο αδέλφια είδαν μια στρογγυλή καθαρή τρυπίτσα κόκκινη, στη μέση του νυχιού, και άλλη μια όμοια στο μέσα μέρος του δαχτύλου.
- Πονεί; ρώτησε με αγωνία η Πουλουδιά. Και ξαφνικά:
- Στάσου! φώναξε κι έφυγε σα σαΐτα.
Γύρισε όπως είχε φύγει, τρεχάτη, και τον βρήκε τον Αντώνη στην είσοδο. Βαστούσε ένα μποτιλάκι κι ένα παστρικό κουρελάκι.
- Στάσου, του είπε, θα σου βάλω άρνικα. Η Αφροδίτη προχθές μου έβαλε στο γόνατο και δεν ξεμάτωνε πια. Στάσου.
Ο Αντώνης της έτεινε το τρυπημένο δάχτυλο και, προσέχοντας μην τον πονέσει, κάνοντας τα καλά της, προσπαθώντας και φασαρεύοντας, του το έδεσε η Πουλουδιά, αφού σκόρπισε τη μισή άρνικα στο πάτωμα.
- Και τώρα πάμε γρήγορα κάτω, μη μας δει κανείς εδώ! του είπε με σκηνικά ψιθυρίσματα και περπατήματα στα νύχια και κατασκοπεύσεις στη σκάλα, φουσκωμένη από υπερηφάνεια, πως φρόντιζε κι εξυπηρετούσε τον Αντώνη.
Μα ο Αντώνης, ακόμα και όταν ευχαριστιούνταν, δεν εννοούσε να κυβερνιέται από κορίτσι. Ομολογούσε μέσα του τις υπηρεσίες της αδελφής του και τον ευχαριστούσαν. Μα δεν έπρεπε να της δώσει και πολύ θάρρος, «γιατί τα κορίτσια... ξέρεις... τόσο να τους δώσεις, σε καβαλικεύουν κιόλα». Χρειάζουνταν η Πουλουδιά και λίγη ψυχρολουσία.
- Στάσου, της είπε μεγαλόπρεπα, έχω δουλειά... Και ξαναμπήκε στην κάμαρα της θείας.
Η Πουλουδιά τον ακολούθησε, περίεργη όσο και τρομαγμένη.
- Αχ, Αντώνη, τι θέλεις πια να μπαίνεις εδώ μέσα... Μα την αποπήρε:
- Ποιος θα κλείσει τη μηχανή; Να τη βρει η θεία ξεσκέπαστη;
Η Πουλουδιά όρμησε, άρπαξε το καπάκι κι έκλεισε τη μηχανή πριν προφθάσει ο Αντώνης.
- Έννοια σου! Μην κουράζεσαι! Έννοια σου! ψιθύρισε πασπατεύοντας να στερεώσει το καπάκι που όλο ξανάνοιγε.
Πλησίασε ο Αντώνης, παραμέρισε τα χέρια της και ύστερα κατέβασε ένα σιδεράκι, γύρισε μια βίδα και το καπάκι έμεινε μαγκωμένο.
- Ούτε να κλείσεις μια μηχανή δεν ξέρεις, της είπε.
Η Πουλουδιά, πάντα έτοιμη για επανάσταση, ορτσώθηκε.
- Ναι, μα εσύ την άνοιξες, ώστε το ήξερες! Μεγάλη δουλειά που την ξανάκλεισες! Εγώ δεν ξέρω από μηχανές!
- Κανένα κορίτσι δεν ξέρει από μηχανές, αποφάσισε ο Αντώνης. Το είπε μια μέρα και ο πατέρας, όταν έσπασε ο Στάμος το βάτραχο του, για να δει πώς πηδά. Είπε: «Ωστόσο, τι είναι τ' αγόρια! Αυτός γεννήθηκε μηχανικός!» Δηλαδή, πως κανένα κορίτσι δε γεννιέται μηχανική.
Συλλογισμένη κατέβαινε η Πουλουδιά τη σκάλα με τον αδελφό της.
- Ναι, μα... έκανε.
Γύρευε να θυμηθεί για ποια τέχνη γεννιούνται τα κορίτσια. Μα δε βρήκε.
- Τι ναι μα; Τα κορίτσια είναι περιττά στον κόσμο, είπε κοφτά πάλι ο Αντώνης.
Η Πουλουδιά ξαφνικά θυμήθηκε.
- Καθόλου! αναφώνησε. Ο θείος είπε μια μέρα για την κερα-Ρήνη, που είχε ψήσει σαλιάγκους, «Ωστόσο, αυτή η κερα-Ρήνη γεννήθηκε μαγείρισσα!» Εμείς γεννιούμαστε μαγείρισσες!
- Πφφφ! έκανε ο Αντώνης. Δεν κάνεις εσύ να μου ψήσεις μακαρόνια με κιμά να σε δω;
- Μα εγώ... διαμαρτυρήθηκε αναμμένη η Πουλουδιά. Κοντοστάθηκε γυρεύοντας τι να πει. Και πάλι πήρε φόρα:
- Μα εγώ ξέρω να ξεκουκουτσιάζω βύσσινο! είπε. Εσύ ξέρεις;
- Πφφφ! έκανε πάλι ο Αντώνης. Γυναικείες δουλειές... Τον διέκοψε η Αφροδίτη που έστρωνε τραπέζι στην τραπεζαρία.
- Ελάτε, παιδιά, φώναξε, το φαγί είναι έτοιμο! Περνώντας πίσω από την Πουλουδιά στάθηκε, την καλοκοίταξε και, πιάνοντας το φρίλι του λαιμού της, είπε:
- Γιατί είναι το φουστάνι σου αιματωμένο; Μπρε παιδί μου, ποιος σ' έγδαρε έτσι;
Η Πουλουδιά σήκωσε τους ώμους της να υψώσει και το φόρεμα.
- Η γάτα, είπε σύντομα.
- Ποια γάτα;
- Της Ρωσίδας κυρίας της Τιμής. Ήθελε να παίξει! έκανε τάχα αδιάφορη και κάθισε στο τραπέζι, αντίκρυ στον Αντώνη, όπως το 'κανε ο θείος και η θεία.
Μα η Αφροδίτη σήμερα είχε μάτια εμπρός και πίσω και σε όλο της το κεφάλι.
- Τι έχει το χέρι σου, Αντώνη, και είναι δεμένο; ρώτησε πάλι.
Ο Αντώνης το μισοσήκωσε και πάλι το κατέβασε, τάχα με αδιαφορία και αυτός.
- Δεν είναι τίποτα. Το τρύπησα, είπε.
- Για να δω! Πώς το τρύπησες; Άνοιξε το να δω! Αν είναι πονεμένο, να το βάλομε σε καυτό νερό!
- Δεν είναι ανάγκη, πετάχθηκε και είπε η Πουλουδιά, του το μούσκεψα εγώ με άρνικα!
- Και πού βρήκες την άρνικα;
- Στην κάμαρα σου. Σε είδα προχθές πού την είχες κρύψει. Η Αφροδίτη δίστασε αν έπρεπε να μαλώσει ή να επαινέσει.
Διάλεξε τη μέση οδό.
- Ε, καλά το συλλογίστηκες να του βάλεις άρνικα, είπε. Έβαλες και στην τσουγκρανιά σου;
Και χωρίς να περιμένει απόκριση, πρόσθεσε:
- Άλλη φορά όμως να μου κάνεις τη χάρη να με φωνάζεις και όχι να πηγαίνεις να σκαλίζεις στην κάμαρα μου!
Όλο το απόγεμα πήγε και ήλθε η Αφροδίτη από την κουζίνα στο σπουδαστήριο και από το σπουδαστήριο στην κουζίνα και απορούσε με την ησυχία του σπιτιού.
- Τι πάθαν οι δυο σκανδαλιάρηδες σήμερα; έλεγε και ξανάλεγε της κερα-Ρήνης. Δεν ακούονται! Και να τους δεις, σαν Παναγιές κάθονται και παίζουν ντόμινο, ο ένας αντίκρυ στον άλλο, τόσο φρόνιμα, που απορώ. Κάτι πάλι θα μας ξεσπάσει στο κεφάλι.
Και η κερα-Ρήνη απορούσε και αυτή.
- Μην είναι άρρωστα; της αποκρίνουνταν. Τρελαντώνης και φρονιμάδα δεν παν μαζί! Κάτι θα σκαρφίζεται να μας βγάλει στη μέση το σκάνταλο μυαλό του.
Μα όσο και να παραμόνεψε η Αφροδίτη, καμιάν αταξία δεν είδε.
Και σα χαμήλωσε ο ήλιος και δρόσισε, συγκινημένη από τόση φρονιμάδα, πήγε και πρότεινε στα δυο αδέλφια να κάνουν θαλάσσιο λουτρό, αφού δεν έκαναν το πρωί, και ύστερα να μείνουν μαζί της στην αμμουδιά και να μαζέψουν κοχλαδάκια.
- Φταίγω εγώ τώρα; έλεγε λίγο αργότερα ο Αντώνης, καθισμένος στο σπουδαστήριο με την Πουλουδιά, που είχε πρησμένα τα μάτια από τα πολλά κλάματα. Είχαμε πει να μην κουνήσομε πια από δω, ώσπου να γυρίσει η θεία... Γιατί το ξέρω πως ο διάβολος έχει πολλά ποδάρια. Καθόμασταν όμορφα και καλά στο ντόμινο. Ήταν ανάγκη να μας πάγει στα λουτρά η Αφροδίτη; Και ύστερα να καθίσομε στην άμμο και να πιάσει τόση κουβέντα με τις γειτόνισσες; Και πού να τύχει και ο Μπαρμπαγιάννης ο Κανατάς!
- Και να 'χει και τόσες στάμνες και τόσα κανάτια, ίσα ίσα σήμερα! αναστέναξε η Πουλουδιά.
- Ναι! Και να τις πηγαίνει παραγγελία στο καφενείο! Μα είδες; Είδες τι ωραία που τα είχε δεμένα, αράδες αράδες γύρω στο γαϊδουράκι του; αναφώνησε ο Αντώνης που ενθουσιάστηκε πάλι με την ενθύμηση.
- Τι ήθελες να τ' αγγίξεις! κλαψιάρισε η Πουλουδιά.
- Ήθελα να δω πώς στέκουνταν. Πού να ξέρω εγώ πως το σκοινί ήταν περασμένο μονάχα μες στα χερούλια κάθε στάμνας και πως σα λύσεις μια, πέφτουν όλες! Ήταν κουταμάρα του Μπαρμπαγιάννη!
- Εγώ σου το έλεγα, μην τις αγγίξεις, Αντώνη!
- Το ξέρω κι εγώ τώρα! Μα φταίει ο Μπαρμπαγιάννης Κανατάς! Αντί να μου πει «Φύλαγε το γαϊδουράκι μου, ώσπου να πάγω να πιω νερό», αν μου έλεγε «Δεν είναι δεμένες κόμπο οι στάμνες, και πρόσεχε», εγώ δε θα τις άγγιζα! Μα πες, δε φαίνουνταν δεμένες;
- Ναι, φαίνουνταν, παραδέχθηκε η Πουλουδιά.
- Κι εγώ έτσι νόμιζα και ήθελα να σου δείξω πώς να κάνεις τον τελικό κόμπο. Πού να φανταστώ πως, μόλις λύσω το σκοινί, θα φύγουν όλα, στάμνες και κανάτια!
- Και με τέτοιον κρότο!...
- Χωρατεύεις...
- Πόσα να σπάσανε λες, Αντώνη;
- Ξέρω γω; Όλα θαρρώ.
- Και περιμένει απέξω να 'ρθει ο θείος, να του πληρώσει, λέει, τη ζημιά!
Τα δυο αδέλφια έμειναν συλλογισμένα. Και ρώτησε ο Αντώνης:
- Σαν πόσες δραχμές λες να ζητήσει του θείου; Τέσσερις; Πέντε;
Η Πουλουδιά ξανάρχισε τα κλάματα.
- Πολλές! είπε. Η Αφροδίτη λέγει πως θα θέλει πολλές δραχμές. Αχ! Να είχα κουμπαρά, σαν την Αλίς!
- Κι εγώ! είπε άθυμα ο Αντώνης.
Η Πουλουδιά σφούγγισε τα μάτια της. Σκουτουρεμένη ρώτησε:
- Να ζητήσομε χρήματα της κερα-Ρήνης; Εκείνη έχει πολλά. Κάθε βράδυ της δίνει η θεία.
Ο Αντώνης αργοκούνησε το κεφάλι.
- Ο πατέρας απαγορεύει να ζητούμε χρήματα, είπε.
- Μα δε θα μας τα χαρίσει, θα μας τα δανείσει μόνο.
- Κι αυτό το απαγορεύει ο πατέρας. Έπειτα πώς θα της τα πληρώναμε, αφού εμείς δεν έχομε κουμπαρά; Και ούτε τίποτε άλλο έχομε εμείς.
Η Πουλουδιά αναπήδησε. Της είχε έλθει μια ιδέα.
- Εγώ ξέρω! αναφώνησε. Θα της πουλήσω τα σκουλαρίκια της Αραπίνας μου! Πολλές φορές μου τα ζήτησε κι εγώ δεν ήθελα να της τα δώσω.
- Να της τα πουλήσεις; έκανε ο Αντώνης βλέποντας ξαφνικά καινούριες ελπίδες να φτερουγίζουν μπροστά του. Ναι... αυτό επιτρέπεται... και ο πατέρας πουλά μπαμπάκια στο γραφείο... αυτό είναι εμπόριο...
Η Πουλουδιά είχε τρέξει στη γωνιά όπου αράδιαζε τα δικά της παιχνίδια, άνοιξε το σεντουκάκι της κούκλας της και το άδειασε ολόκληρο στο πάτωμα. Κάτω κάτω πήρε ένα χάρτινο, αρκετά κακομεταχειρισμένο κουτάκι, το άνοιξε και το έδειξε του Αντώνη. - Να, είπε, αυτά τα κόκκινα αχλαδωτά σκουλαρίκια, που μοιάζουν, λέει, κοράλι, αυτά θέλει η κερα-Ρήνη. Πάμε να της τα δείξομε.
Μα η φόρα της κόπηκε μπρος στην κλειστή πόρτα της κουζίνας. Είχε ακούσει πως στο εμπόριο αγοράζεις και πουλάς. Μα με τι τρόπο γίνεται η πράξη δεν το ήξερε. Μουδιασμένη πρόσφερε το κουτί της στον αδελφό της.
- Να, πάρ' τα, Αντώνη! Πες της το εσύ!
- Όχι, εσύ. Δικά σου είναι τα σκουλαρίκια.
- Μα... μα... εγώ δεν ξέρω πώς να της το πω...
- Να, θα πεις: «Τα θέλεις; Τα πουλώ».
- Ναιαιαι; ρώτησε απρόθυμα η Πουλουδιά. Και αυτό, βέβαια, δεν είναι κακό; Επιτρέπεται, Αντώνη;
Ο Αντώνης δεν ήταν και τόσο βέβαιος. Και αυτός από εμπόριο δεν ήξερε καλά. Με το χέρι παραμέρισε το κουτί και τους θησαυρούς της Πουλουδιάς.
- Άσ' τα, είπε, προτιμώ να φάγω ξύλο...
Με ορμή άνοιξε η Πουλουδιά την πόρτα και μπήκε στην κουζίνα.
- Να, κερα-Ρήνη, σου έφερα τα σκουλαρίκια μου και σου τα πουλώ! είπε βιαστικά, σε μια πνοή.
Η κερα-Ρήνη τηγάνιζε κεφτέδες. Χωρίς να γυρίσει ρώτησε:
- Τι κάνεις λέει;
- Σου πουλώ τα σκουλαρίκια της κούκλας μου, κερα-Ρήνη, τα κόκκινα αχλαδάκια...
Η φωνή της Πουλουδιάς έτρεμε λίγο· περίμενε περισσότερο ενθουσιασμό. Η κερα-Ρήνη εξακολουθούσε με το πιρούνι ν' αναποδογυρίζει τους κεφτέδες μες στο τηγάνι. Χωρίς καν να κοιτάξει το απλωμένο δειλό χέρι με το χάρτινο κουτί, φώναξε:
- Αφροδίτη, μη χάσεις το κελεπούρι! Πουλούμε διαμαντικά εδώ μέσα!
Η Αφροδίτη, που κουβέντιαζε με κάποιον στην αυλή, γύρισε και στάθηκε στην ανοιχτή πόρτα.
- Ποιος πουλά; ρώτησε.
- Να, το κορίτσι μας!
- Τι κάνει λέει;
- Μου πουλά σκουλαρίκια!
Είδε η Αφροδίτη τον Αντώνη, στο βάθος της κουζίνας, που μελετούσε έναν έναν τους μπακιρένιους τεντζερέδες στα ράφια, είδε και την Πουλουδιά που, με κόκκινα πρησμένα μάτια και το κουτί της στο χέρι, δεν πολυήξερε αν έπρεπε να μείνει ή να το βάλει στα πόδια, και ρώτησε γλυκά:
- Τι θες, Πουλουδιά;
Με χείλια που έτρεμαν είπε η Πουλουδιά:
- Θέλω να πουλήσω τα σκουλαρίκια της Αραπίνας μου, για να πληρώσομε τον Μπαρμπαγιάννη Κανατά, πριν έλθει ο θείος... είπε και σώπασε πνιγμένη. Η Αφροδίτη γέλασε. Γύρισε κατά την αυλή.
- Μπαρμπαγιάννη! φώναξε. Έλα ν' ακούσεις.
Ένας άντρας ψηλός, με φαρδιά ξανθά μουστάκια, γέμισε με το μεγάλο μπόι του την πόρτα. Ήταν φτωχοντυμένος και ξυπόλυτος και στο κεφάλι φορούσε ένα παλιωμένο πλατύγυρο καπέλο. Στα μαλλιά και στα μουστάκια πολλές άσπρες τρίχες γυάλιζαν, μα ήταν ήρεμο το πρόσωπο του και είχε αρχοντιά η στάση του, καθώς στηρίζουνταν στη μαγκούρα του.
- Τι με θέλεις; ρώτησε.
- Να, πουλούμε χρυσαφικά της κούκλας μας, για να σε πληρώσομε, είπε η Αφροδίτη κάνοντας του το μάτι.
- Για να δούμε τα τζοβαρικά σου! είπε ο Μπαρμπαγιάννης Κανατάς.
Πήρε το κουτί από το χέρι της Πουλουδιάς κι έναν έναν έβγαλε από μέσα τους θησαυρούς της και τους άπλωσε στο τραπέζι.
Η κερα-Ρήνη είχε πλησιάσει με τα δυο της χέρια στους γοφούς.
- Να τα σκουλαρίκια που θέλει να μου πουλήσει! είπε.
Η Πουλουδιά δε μίλησε. Ανήσυχη κοίταζε τα στολίδια της.
- Σκουλαρίκια, ε; είπε ο Μπαρμπαγιάννης εξετάζοντας τα κόκκινα αχλαδάκια. Και τούτο; Τι είναι; Δαχτυλίδι;
- Όχι, είναι το χρυσό βραχιόλι της κούκλας μου, αποκρίθηκε πνιχτά η Πουλουδιά.
- Και τούτο;
- Το διαμαντένιο της χτένι.
- Πωπώ, ομορφιά! Και αμέ τούτες οι κίτρινες φούσκες με το λάστιχο;
- Είναι το άλλο χρυσό βραχιόλι της κούκλας μου.
- Πωπώ, πλούτη! Και τούτη η αλυσίδα με τ' ωρολόγι; Πόσα τα δίνεις όλα μαζί, Πουλουδιά; Ένα φόρτωμα κανάτια; Ε;
Μα η Πουλουδιά δεν ήξερε. Χαμένη γύρισε στον Αντώνη για βοήθεια. Μα ο Αντώνης είχε εξαφανιστεί. Με τα χέρια στις τσέπες, είχε βγει απαρατήρητος από την πόρτα της κουζίνας, στα νύχια πέρασε από το διάδρομο, την τραπεζαρία, βγήκε στη βεράντα και κατέβηκε, στο δρόμο.
Δεν ήξερε γιατί, μα ντρέπουνταν. Ντρέπουνταν την κερα-Ρήνη, την Αφροδίτη, τον Μπαρμπαγιάννη Κανατά, που ήξεραν τώρα όλοι πως η Πουλουδιά, για να μη φάγει αυτός ξύλο, παρέδιδε όλους τους θησαυρούς της. Και όσο περισσότερο ντρέπουνταν, τόσο πιο πετούσε πίσω το κεφάλι του. Και όλη τη μέρα δεν της είχε πει ούτε ένα ευχαριστώ της Πουλουδιάς που είχε βρει τρόπο να φάγει και αυτή τιμωρία και να μην πάγει στην Κηφισιά... Ουφ! Ήταν πνιγερό όμως το σπίτι. Έξω στο δρόμο ανάσαινε τουλάχιστον κανείς καλύτερα. Κατέβηκε σε κάτι βράχους και κοίταξε μακριά τη θάλασσα την ανοιχτή. Είχε βασιλέψει ο ήλιος, κατέβαινε το μούχρωμα και ήταν μοναξιά. Κι εκεί, παρακάτω, στους βρεμένους από τη θάλασσα βράχους, σαν κοίταζες καλά στους νερόλακκους, έβρισκες κάποτε καβούρια. Του ήλθε μια φωτεινή ιδέα. Η Πουλουδιά όλο γύρευε καβούρια και δεν τα έβρισκε ποτέ. Αν της έφερνε εκείνος κανένα;... Και από τα σκουλαρίκια της θα τον προτιμούσε τον κάβουρα.
Πήδηξε ο Αντώνης στους κάτω βράχους, μα γλίστρησε στο βρεμένο μούσκουλο και, ξαφνικά, βρέθηκε ξαπλωμένος μες στα νερά. Την πρώτη στιγμή ζαλίστηκε. Μα η κρύα θάλασσα τον συνέφερε γρήγορα και σηκώθηκε και τινάχθηκε. Ποπό! Ώς τις πλάτες ήταν μούσκεμα! Καινούρια ζημιά! Και μη χειρότερα, αν δε σχίστηκε κιόλα! Ανέβηκε στους βράχους και από κει στο δρόμο. Πονούσε λίγο κάτω εκεί που τελειώνει η ράχη και πονούσε λίγο και στο κεφάλι. Μα ο Αντώνης δε συνήθιζε να παραπονιέται για πόνο. Κοίταξε απάνω, κάτω, μην περνά κανένας γνωστός στο δρόμο και, βλέποντας μοναξιά, ανέβηκε κούτσα κούτσα στη βεράντα και μπήκε στην τραπεζαρία, αφήνοντας λιμνούλες όπου πατούσε. «Μην ήλθε η θεία;» Μα όχι. Όλα ήταν σιωπηλά και σκοτεινά.
Σιωπηλά τρύπωσε κι αυτός στο διάδρομο και από κει γύρισε κατά τη σκάλα. Μα, την ίδια ώρα, η πόρτα της κουζίνας άνοιξε και η Αφροδίτη βγήκε μ' ένα αναμμένο κερί και τον είδε. Ήταν και η Πουλουδιά μαζί της . - Τι κάνεις εδώ, μόνος, Αντώνη; ρώτησε η Αφροδίτη.
- Τίποτα. Πάω στην κάμαρα μου, της αποκρίθηκε κάνοντας για τη σκάλα.
- Κάτσε μια στιγμή, έλα, γεια σου, άναψε μου τα κεριά στη τραπεζαρία, ν' ανάψω εγώ τη λάμπα της σκάλας και είναι αργά. Με τη μωρολογιά του Μπαρμπαγιάννη νύχτωσε πριν το καταλάβω και δεν έβαλα τραπέζι ακόμα...
- Αντώνη! διέκοψε τρομαγμένη η Πουλουδιά. Τι έπαθες;
- Τίποτα. Βράχηκα λίγο στη θάλασσα, αποκρίθηκε ο Αντώνης γυρεύοντας να ξεφύγει από το φως.
- Τι έπαθες; Έπεσες; επανέλαβε όλο και πιο τρομαγμένη η Πουλουδιά. Είσαι όλος αίματα!
- Αίματα; Πού;
- Στάσου! Καλέ, αλήθεια! Παναγιά μου! Πού πήγες; αναφώνησε η Αφροδίτη.
Ακούμπησε το κερί της σε μια καρέγλα και γύρισε τον Αντώνη με την πλάτη στο φως.
- Χτύπησες; Πού χτύπησες; Πωπώ, αίματα!
- Πού; ρώτησε πάλι ο Αντώνης που γύρευε να δει την πλάτη του πάνω από τον ώμο του.
Λαφριά, γοργά σήκωσε η Αφροδίτη τα κοντοκομμένα του μαλλιά στο πίσω μέρος του κεφαλιού του.
- Μα βέβαια! Έσπασες το κεφάλι σου! Τα μαλλιά σου είναι ποτισμένα αίματα! Αχ! Παναγίτσα μου, θα με τρελάνεις εσύ, παιδί μου!
Τον άρπαξε από τους ώμους και, σχεδόν σηκωτό, τον ανέβασε απάνω. Φοβισμένη ακολουθούσε η Πουλουδιά.
- Γρήγορα, άρνικα, πανιά, ξαντό! πρόσταξε η Αφροδίτη. Πουλουδιά, τρέξε! Στο σερτάρι μου έχω ένα μπογαλάκι με το καθαρό ξαντό της κυρίας. Έχει και παστρικά μαντίλια εκεί. Φέρε τα με την άρνικα, ώσπου να τον πλύνω εγώ!
Παθητικά, λίγο ζαλισμένος ακόμα, αφέθηκε ο Αντώνης στα χέρια της τα επιδέξια, που σε λίγα λεπτά τον είχαν πλύνει, επιδέσει, αλλάξει. Στεγνός και παστρικός, με το κεφάλι μαντιλοδεμένο και τα μαλλιά ανακατωμένα, μισοβρεμένα ακόμα, κοίταζε τώρα υπερήφανα από κάτω από τον άσπρο κόμπο, δεμένο στο μέτωπο του, την Πουλουδιά και περίμενε να φύγει η Αφροδίτη, για να τη ρωτήσει τι απέκανε με τα σκουλαρίκια της κούκλας και τα κανάτια του Μπαρμπαγιάννη. Μα έξαφνα ανατρίχιασε. Από κάτω ανέβαινε η φωνή της θείας.
- Τι είναι αυτό το σκοτάδι; Γιατί δεν είναι βαλμένο το τραπέζι;
Ανήσυχα κοιτάχθηκαν τα δυο αδέλφια. Και ξαφνικά, πάλι, θυμωμένη ανέβηκε η φωνή της θείας:
- Καλέ, τι είναι αυτά; Ποιος έχυσε εδώ νερά; Ειρήνη! Αφροδίτη! Πού είστε και οι δυο;
Τρεχάτη κατέβαινε κιόλα η Αφροδίτη τη σκάλα και κατάφθανε βιαστική η κερα-Ρήνη, μαζί με μια μπούφα τηγανίλας που την ακολούθησε από την ανοιγμένη πόρτα της κουζίνας, κι έξι φωνές ακούστηκαν μαζί, που ρωτούσαν, εξηγούσαν, μάλωναν και αναφωνούσαν. Και μέσα σ' όλες ξεχώρισε ήσυχη η φωνή του Αλέξανδρου:
- Έχει και αίματα εδώ, θεία!
Στις μύτες των ποδαριών είχαν βγει τα δυο αδέλφια στη σκάλα και κοίταζαν, από πάνω από την κουπαστή, τη σκοτεινή είσοδο που φωτίζουνταν μόλις από την τραπεζαρία. Γύρευαν να ξεχωρίσουν φωνές και λόγια. Μα τόση φασαρία γίνουνταν, που μόνο μια βοή ανέβαινε στ' αυτιά των δυο τιμωρημένων. Κι έξαφνα, από μέσα από το σκοτάδι, βαρυπατώντας ανέβηκε η κοντοφάρδουλη σκιά του θείου. Βιαστικά υποχώρησαν τ' αδέλφια και μπήκαν στην κάμαρα τους, όπου έκαιε ένα κερί. Μπήκε και ο θείος πίσω τους, χαμογελώντας σαν πάντα, με τα πυκνά του φρύδια σηκωμένα σαν περισπωμένη ανήσυχη.
- Πάλι, Αντώνη, αταξίες και αβαρίες; ρώτησε. Μα δε θα περάσει μια μέρα χωρίς να μας θυμώσεις;
Ένα βήμα πλησίαζε, το πηδηχτό βήμα της θείας, και όλοι μαζεύθηκαν, ακόμα και ο θείος τράβηξε το χαδιάρικο χέρι του από τα ορτσωμένα μαλλιά του Αντώνη.
- Ώστε την ξανάκανες την κουτσουκέλα σου! είπε μπαίνοντας στην κάμαρα η θεία και γυρίζοντας στον ένοχο τα μαύρα της μάτια. Έλα στο φως, να δω τι έκανες πάλι το κεφάλι σου...
Γοργά έλυσε τον επίδεσμο και ντελικάτα, τρυφερή ξαφνικά, σήκωσε το ξαντό κι εξέτασε τη μαυριδερή τρυπίτσα στο κεφάλι πίσω του Αντώνη και σήκωσε προσεκτικά λίγα μαλλιά που είχαν μείνει κολλημένα στην πληγή. Ύστερα, επίσης γοργά, ξανάδεσε το μαντίλι και τα φρύδια της ξανασουρώθηκαν, όμοια με του πατέρα σαν ήταν θυμωμένος.
- Δεν είναι τίποτα, είπε, και θα έπρεπε να σε δείρω που ξαναπήγες στη θάλασσα χωρίς άδεια. Μα να που τιμωρήθηκες μόνος σου και με απάλλαξες από τον κόπο να σου τις βρέξω βραδιάτικα, πρόσθεσε όλο και πιο μαλωσιάρικα.
Και γυρνώντας στην Πουλουδιά, χωρίς να γλυκάνει:
- Εσύ δεν ήξερες να τον εμποδίσεις; Μόλις μείνετε μόνοι, μόνο αταξίες ξέρετε να κάνετε! Άιντε, κατεβείτε τώρα. Ώσπου να ξεντυθούμε, να σας βρούμε όλους καθισμένους στο τραπέζι. Έλα, Ζωρζή.
Σιωπηλά έσβησε ο Αντώνης το κερί και προφθαίνοντας την Πουλουδιά στη σκάλα, πέρασε το χέρι του γύρω στο λαιμό της και κατέβηκε μαζί της. Δεν ήταν στις συνήθειες του Αντώνη τα χάδια και σάστισε και λιγώθηκε η Πουλουδιά, και τον ακολούθησε υποταγμένη, σκλάβα του, έτοιμη να κάνει ό,τι της προστάξει. Μα ο Αντώνης δεν ήταν στη συνηθισμένη του προστατευτική διάθεση. Στάθηκε στο πρώτο πλατύσκαλο και χαμηλόφωνα ρώτησε:
- Πούλησες τα σκουλαρίκια σου;
- Όχι! αποκρίθηκε η Πουλουδιά.
Και, βιαστική, πρόθυμη, πολυλογού, του διηγήθηκε πως δεν μπορούσε ο Μπαρμπαγιάννης Κανατάς ν' αγοράσει τα διαμαντικά της κούκλας της, γιατί μόνος ο βασιλέας μπορούσε, λέει, να πληρώσει τέτοιο θησαυρό. Και αν κι επέμεινε η Πουλουδιά να πάρει ο Μπαρμπαγιάννης τουλάχιστον τ' ωρολόγι, να ξεπληρωθούν οι σπασμένες κανάτες, πάλι δε θέλησε ο Μπαρμπαγιάννης.
- Και μου είπε, εξακολούθησε η Πουλουδιά: «Δεν έπαθαν τίποτα οι κανάτες μου. Τρεις μόνο σπάσανε και σας τις χαρίζω, μια για την κούκλα σου, μια για σένα και μια για τον Αντώνη!» Και μου είπε: «Πες του Αντώνη πως ο Μπαρμπαγιάννης Κανατάς ξέρει από παιχνίδια και σαν ήταν μικρός, ήταν και αυτός ζημιάρης». Και καβαλίκεψε το γαϊδούρι του κι έφυγε.
Περίμενε η Πουλουδιά πως θα χαρεί πολύ ο Αντώνης με τα λόγια της. Μα δε χάρηκε καθόλου. Απεναντίας κατσούφιασε και τράβηξε το χέρι του από το λαιμό της.
- Ο Μπαρμπαγιάννης είπε ψέματα! Και τα κανάτια του σπάσανε όλα! είπε. Τα είδα!
- Μα... πώς... άρχισε η Πουλουδιά. Τη διέκοψε με φούρια ο Αντώνης:
- Σου λέγω πως έσπασαν όλα! Και είπε ψέματα για να με γλιτώσει! Σου λέγω πως είπε ψέματα!
- Μα, Αντώνη... έκανε μουδιασμένη η Πουλουδιά, αν το είπε για να σε γλιτώσει... δεν είναι ψέματα... είπε καλά λόγια...
- Το ίδιο κάνει! Πάλι ψέματα είναι! Κι εγώ το ξέρω! Ουφ! Προτιμώ χίλιες φορές να φάγω ξύλο! Νευριασμένος πρόσθεσε:
- Όλα πήγαν στραβά σήμερα! Πρώτα η γάτα, ύστερα η μηχανή, ύστερα τα κανάτια, ύστερα οι βράχοι, που ήθελα να σου φέρω έναν κάβουρα...
- Αλήθεια, Αντώνη; διέκοψε βουρκωμένη από τη συγκίνηση η Πουλουδιά.
- Ε, και τι, μεγάλο πράμα! έκανε ο Αντώνης. Νομίζεις πως δεν ξέρω γιατί δεν πήγες εσύ στην Κηφισιά;
Μα η κουβέντα γύριζε στην αισθηματολογία. Και ο Αντώνης δεν αγαπούσε τις αισθηματολογίες, ούτε τις στενοχώριες ούτε τις τύψεις και τις λύπες. Χωρίς να περιμένει απάντηση από την ξελιγωμένη Πουλουδιά, κατέβηκε τρεις τρεις τις σκάλες και μπήκε στην τραπεζαρία, όπου περίμενε η Αλεξάνδρα, καθισμένη στο τραπέζι με τον Αλέξανδρο, που φορούσε κιόλα την πετσέτα του γύρω στο λαιμό.
Κοίταξαν και οι δυο τον Αντώνη με κάποιο σεβασμό για το μαντιλοδεμένο του κεφάλι και τα μαλλιά του, σκουλιά-σκουλιά, ορτσωμένα πάνω από τον κόμπο του μαντιλιού.
- Σε μάλωσε η θεία; ρώτησε χαμηλόφωνα η Αλεξάνδρα.
- Όχι πολύ, αποκρίθηκε ο Αντώνης και κάθισε στην καρέγλα του.
Το μάτι της Αλεξάνδρας πήρε ευθύς την τσουγκρανιά του χεριού του.
- Πώς το 'κανες; ρώτησε σκύβοντας για να δει καλύτερα.
0 Αντώνης τράβηξε το χέρι του.
- Δεν είναι τίποτα, είπε, μου το 'κανε η γάτα της Ρωσίδας κυρίας της Τιμής.
- Πώς; Για πες;
- Έτσι. Τσουγκράνισε και την Πουλουδιά στο λαιμό...
- Για να δω, έκανε η Αλεξάνδρα.
Μα η Πουλουδιά, που κατάφθανε την ίδια ώρα, σήκωσε τους ώμους της ως τ' αυτιά της και το φρίλι στο λαιμό του φουστανιού της σκέπασε το γδαρμένο της σβέρκο. Και ο Αντώνης, που δεν ήθελε ρωτήματα και συζητήσεις γύρω σ' αυτό το επεισόδιο, άλλαξε κουβέντα.
- Ήταν η θεία πολύ θυμωμένη σαν είδε τα νερά; ρώτησε.
- Ναι, μα φταίγει η μέλισσα! πέταξε ο Αλέξανδρος.
- Ποια μέλισσα! ρώτησε η Πουλουδιά που κάθισε βιαστικά στο τραπέζι και ξέχασε τσουγκρανιές και προφυλάξεις στην ανυπομονησία της ν' ακούσει τα κηφισιώτικα. - Μια μέλισσα αγκύλωσε τη θεία... άρχισε η Αλεξάνδρα, μα τη διέκοψε ο Αλέξανδρος.
- Και τρέχαμε όλοι για λεμόνι, και πρήστηκε το χέρι της θείας και τρέχανε οι καλόγεροι, κι έγινε μια φασαρίαααα! είπε σε μιαν ανάσα.
- Ήταν καλόγεροι στης Αλίς; Εβραίοι καλόγεροι; ρώτησε ο Αντώνης.
- Ναι... όχι... δηλαδή πήγαμε μεις στους καλόγερους...
- Τι λες, Αλέξανδρε; Τα κάνεις σαλάτα! διόρθωσε η Αλεξάνδρα. Πώς μπορεί να είναι Εβραίοι καλόγεροι;
- Μα πού ήταν οι καλόγεροι; διέκοψε ανυπόμονα ο Αντώνης.
- Στο σπίτι τους, απάνω στο βουνό, και ήταν πεύκα εκεί και νερό... πρόφθασε να πει ο Αλέξανδρος.
Μα με το χέρι τού σκέπασε η Αλεξάνδρα το στόμα.
- Ου ου ου! Όλα στραβά τα λες! Σώπα λιγάκι εσύ, θα τα πω εγώ! Πήγαμε στης θείας της Αλίς πρώτα και φάγαμε κει, στο περιβόλι, και είχε αρνί αλά Κλέφτα. Και ύστερα μας πήραν όλους με τη σούστα...
- Με τι; διέκοψε πάλι ο Αντώνης.
- Με τη σούστα. Είναι ένα αμάξι σαν κάρο με δυο ρόδες και κάγκελα...
- Και διεύθυνε η Αλίς, και είχε ένα άλογο... κι έτρεχε... και μας πετούσε απάνω... και ξαναπέφταμε στους μπάγκους... και ήταν έκτακτα! Μόνο η θεία δεν ήταν καθόλου ευχαριστημένη... είπε βιαστικά ο Αλέξανδρος.
Μα πάλι τον διέκοψε η Αλεξάνδρα:
- Σώπα, Αλέξανδρε, είπα πως εγώ θα τα πω...
- Και διεύθυνε η Αλίς; ρώτησε μαγεμένος ο Αντώνης.
- Ναι. Μα δεν ήταν σπουδαίο πράμα να διευθύνεις. Ήταν γέρικο το άλογο της. Κι εγώ μπορούσα να το διευθύνω, το είπε η ίδια η Αλίς.
- Και λοιπόν; έκανε με λαχτάρα η Πουλουδιά.
- Λοιπόν μας πήρε η Αλίς στην Πεντέλη.
Διακόπηκε η Αλεξάνδρα και είπε, σαστισμένη ακόμα για την ανακάλυψη της:
- Και φαντάσου, Αντώνη, που η Πεντέλη είναι το Πεντελικόν, εκείνο το βουνό που δεν έβρισκες ποτέ στο χάρτη, στην Αλεξάνδρεια, ώσπου θύμωσε η κυρία Σοφία στο μάθημα και σου τράβηξε το αυτί! Και δεν είναι καθόλου άσχημο, όπως είναι στο χάρτη, μια μπάλα με τρίχες, αλλά είναι γεμάτο πεύκα και σκίνους και κουμαριές! Μα δεν είχε πια κούμαρα. Τελείωσαν, και δεν τα γευθήκαμε. Και μας πήγε η Αλίς σ' ένα μοναστήρι στην Πεντέλη...
- Και ήταν μεγάααλα δέντρα! Και ήταν πολλοίοιοι καλόγεροι εκεί, έβαλε πάλι το λόγο του ο Αλέξανδρος.
- Ναι, και τους φοβήθηκε ο Αλέξανδρος, είπε η Αλεξάνδρα.
- Μόνο στην αρχή... διαμαρτυρήθηκε ο Αλέξανδρος, ύστερα δε φοβόμουν πια.
- Τι πήγατε να κάνετε στο μοναστήρι; ρώτησε ο Αντώνης.
- Μας πήγε κει η Αλίς για να πιούμε, γιατί διψούσαμε. Κι έτρεχε νερό πολύ κρύο από μια πηγή, όπου βάλανε μια βρύση. Και είναι ανάμεσα στα πεύκα το μοναστήρι, και από κει πάνω βλέπεις μακριά, μακριά! Και μας πήραν μέσα οι καλόγεροι κι εκεί που καθόμασταν, πέφτει, παφ! ολόκληρο ένα μελίσσι στα γόνατα της θείας!
- Από πού έπεσε; ρώτησε ο Αντώνης.
Από τη στέγη. Δεν το ήξεραν, λέει, οι καλόγεροι πως είχαν φωλιάσει εκεί οι μέλισσες. Κι ένας καλόγερος, μ' ένα καλάθι, παφ! σκέπασε το μελίσσι στα γόνατα της θείας, και ύστερα το γύρισαν ανάποδα, αφού το σκέπασαν πρώτα μ' ένα τηγάνι, και πήραν τις μέλισσες.
- Μα μια μέλισσα... μια μέλισσα... είπε φουριαστά ο Αλέξανδρος, κρύφθηκε μες στις δίπλες του φουστανιού της θείας και δεν το ήξερε η θεία...
- Ναι, δεν την είδαν εκείνη την ώρα, τον ξαναδιέκοψε η Αλεξάνδρα, μα έξαφνα, αφού ξαναβγήκαμε έξω και μας έδωσαν οι καλόγεροι μέλι...
- Στην κηρήθρα! φώναξε ο Αλέξανδρος.
- Ναι, στην κηρήθρα, εξακολούθησε η Αλεξάνδρα, και μας έδωσαν ψωμί ζεστό, ακόμα και βούτυρο άσπρο σαν κρέμα. Κι εκεί που τρώγαμε, βγάζει μια φωνή η θεία: «Μια μέλισσα... με τσίμπησε μια μέλισσα!...» και όλοι πετάχθηκαν απάνω, ο θείος, οι καλόγεροι...
- Και φώναζε η θεία «λεμόνι... λεμόνι...» και τίναζε το χέρι της έτσι. «Λεμόνι... λεμόνι...» πρόφθασε και είπε πάλι ο Αλέξανδρος, τινάζοντας κι εκείνος το χέρι του στον αέρα. Και τρέχαμε όλοι, και φωνάζαμε και μεις «λεμόνι, λεμόνι», κι έτρεξε ένας καλόγερος και πήδηξε από πάνω από έναν μπάγκο, κι έπεσε ο μπάγκος, κι έπεσε και ο καλόγερος, και σηκώθηκε το ράσο του και, φαντάσου, φορούσε πανταλόνι σαν το θείο! Και τα παπούτσια του, αντί κορδόνια, ήταν δεμένα με σπάγκο! Και τρέξαν οι άλλοι καλόγεροι να τον σηκώσουν, και φωνάζαμε μεις «λεμόνι, λεμόνι», κι έγινε μια φασαρίααα...
Και γύρω στο τραπέζι έγινε φασαρία. Όλα μαζί τ' αδέλφια γελούσαν, ρωτούσαν, εξηγούσαν, τόσο που δεν άκουσαν τα βήματα στη σκάλα. Κι έξαφνα ακούστηκε η φωνή της θείας:
- Σερβίρισε, Αφροδίτη!
Μεμιάς κόπηκαν γέλια και φασαρίες. Τα τέσσερα αδέλφια ξαναγύρισαν στην πραγματικότητα, φρόνιμα και σωπασμένα, ο Αντώνης με το γδαρμένο χέρι στην τσέπη, η Πουλουδιά καμπουριασμένη, σηκώνοντας όσο μπορούσε τους ώμους, μη φανεί η τσουγκρανιά της γάτας. Στο τραπέζι διηγήθηκε ο θείος την εκδρομή τους στην Κηφισιά, μαζί και το τσίμπημα της μέλισσας. Μα οι μεγάλοι δεν ξέρουν ποτέ να διηγηθούν καλά, γιατί λένε πάντα μόνο τα βαρετά, την ώρα, τον ανήφορο, την κούραση, τη σκόνη, την ωραία θέα, το κρύο νερό, πόσα χρόνια είναι χτισμένο το μοναστήρι, πόσοι καλόγεροι είναι μέσα, και ξεχνούν όλα τα λαχταριστά, σαν την τούμπα του καλόγερου, το πανταλόνι κάτω από το ράσο, τους σπάγκους στα παπούτσια.
Και σαν τελείωσε ο θείος, ρώτησε, τραβώντας λαφριά το αυτί του Αντώνη που κάθουνταν πλάγι του:
- Και σεις οι δυο, τι κάνατε όλη μέρα;
Ο Αντώνης έχωσε προφυλακτικά τα δυο πληγωμένα του χέρια στις τσέπες.
- Σκάψαμε τον κήπο και καθαρίσαμε τα ξερά φύλλα, είπε.
- Ε, μπράβο σας! αναφώνησε ο θείος. Για μια φορά κάνατε καλή δουλειά!
- Και... καμιάν αταξία; Καμιάν άλλη αταξία από το σπασμένο κεφάλι του Αντώνη δεν κάματε; ρώτησε υποψιάρικα η θεία.
Οι δυο ένοχοι κοιτάχθηκαν χωρίς ν' απαντήσουν. Μα βιαστικά πρόλαβε και αποκρίθηκε η Αφροδίτη:
- Όχι, κυρία... ήταν πολύ φρόνιμα. Όλο τ' απόγεμα έπαιζαν ντόμινο.
- Δεύτερη ψευτιά σήμερα, από καλοσύνη, είπε ο Αντώνης της Πουλουδιάς, σαν ανέβηκαν στην κάμαρα τους.
- Τι ψευτιά; ρώτησε η Αλεξάνδρα. Ποιος είπε ψέματα;
Με τα χέρια πίσω στη ράχη και τα πόδια ανοιχτά, κοίταζε ο Αντώνης την ήσυχη θάλασσα, πέρα από την ανοιχτή πόρτα του μπαλκονιού.
- Ποιος είπε ψέματα; ξαναρώτησε η Αλεξάνδρα την Πουλουδιά.
Μα η Πουλουδιά δεν αποκρίθηκε. Και είπε ο Αντώνης:
- Η Αφροδίτη είπε ψέματα. Έσπασα όλες τις στάμνες του Μπαρμπαγιάννη Κανατά!
Μεγάλη συγκίνηση στο ακροατήριο. Και η Πουλουδιά, που με την ομολογία του Αντώνη ξεδένουνταν από τη σιωπή της, έδωσε δρόμο στη γλώσσα της και διηγήθηκε, με τη συνηθισμένη της πολυλογία, την περιέργεια του Αντώνη, το λύσιμο του σκοινιού, το κατρακύλισμα, τον κρότο σα σπάζανε τα κανάτια, και κατέληξε στην άρνηση του Μπαρμπαγιάννη Κανατά να πάρει τ' ωρολόγι της Αραπίνας της.
Ο Αντώνης, που την άκουγε σκυθρωπός, ξαφνικά ανησύχησε. Γύρισε και τη φώναξε:
- Άκου δω, Πουλουδιά!
Πρόθυμη έτρεξε κείνη κοντά του και, αγκαλιάζοντας την για δεύτερη φορά από το λαιμό, την τράβηξε προς το μπαλκόνι.
- Μην πεις για τη μηχανή, και μην πεις για τη γάτα και τον Ντον! ψιθύρισε. Μην τα πεις ούτε της Αλεξάνδρας!
Με το κεφάλι τού έκανε κείνη νόημα πως κατάλαβε και ξαναμπήκε μαζί του στην κάμαρα, φουσκωμένη από υπερηφάνεια για το μυστικό που είχε μαζί του απέναντι και της Αλεξάνδρας ακόμα, που ήταν πάντα κόμμα του, και κάνοντας την αδιάφορη, μην καταλάβει τίποτα η μεγάλη αδελφή.
Μα η Αλεξάνδρα είχε άλλες έννοιες. Δεν τους πρόσεχε. Είχε καθίσει στο κρεβάτι της, με τα πόδια κρεμαστά και τα χέρια σταυρωμένα στα γόνατα της, και είπε συλλογισμένη:
- Δεν πρέπει να κάνεις πια αταξίες, Αντώνη, και να είσαι πάντα τιμωρημένος. Μας χάλασες ολωνών τη μέρα μας σήμερα και δεν άξιζε τίποτα η εκδρομή μας!
- Εγώ το ήξερα! φώναξε η Πουλουδιά.
- Τι ήξερες;
- Πως θα 'ναι άσχημη η εκδρομή σας. Γι' αυτό δεν πήγα!
Η Αλεξάνδρα κατέβηκε αργά από το κρεβάτι της και, συλλογισμένη, κάθισε σ' ένα σκαμνί και άρχισε να βγάζει τα παπούτσια της.
- Όχι, δεν ήταν άσχημη η εκδρομή μας, είπε, μα δε διασκεδάσαμε καθόλου, ούτε ο Αλέξανδρος ούτε γω, γιατί λείπατε οι δυο σας και δε γίνουνταν παιχνίδι σωστό. Ήταν πολύ βαρετό. Δεν είναι αλήθεια, Αλέξανδρε;
Ο Αλέξανδρος δεν το είχε αντιληφθεί ως τώρα. Μα τα λόγια της αδελφής του του έδειξαν ξαφνικά το χάος της ημέρας.
- Ναι, είπε σταυρώνοντας κι εκείνος τα χέρια του στα γόνατα, ήταν πολύ βαρετό... και ήταν πολύ άσχημο.
- Εγώ το ήξερα, είπε πάλι η Πουλουδιά τινάζοντας το κεφάλι της με ύφος σπουδαίο, και γι' αυτό δεν άφησα να μου σγουράνουν τα μαλλιά χθες βράδυ.
- Μα δεν πρέπει ούτε συ να το ξανακάνεις, είπε η μεγάλη αδελφή.
- Εγώ θα το ξανακάνω, αποκρίθηκε με απόφαση η Πουλουδιά. Εμείς παίξαμε ωραία. Δεν είναι αλήθεια, Αντώνη;
- Ουφ, πάμε να κοιμηθούμε! αναφώνησε ο Αντώνης. Καθόλου δεν παίξαμε ωραία, και όλο αναποδιές και ψευτιές ήταν η μέρα!
Η Πουλουδιά ξαναμαζεύθηκε στο καυκί της, μουδιασμένη και ψυχρολουσμένη. Και μελαγχολικά γδύθηκαν τ' αδέλφια και μπήκαν στα κρεβάτια τους, κάτω από τις κουνουπιέρες τους.
Τη νύχτα κακοκοιμήθηκε ο Αντώνης. Είδε όνειρα με καράβια, φουρτούνες, κανάτια τρυπημένα απ' όπου έτρεχαν, έτρεχαν, έτρεχαν νερά αστέρευτα, που πλημμύριζαν την τραπεζαρία και καταπόντιζαν τη σκάλα και γέμιζαν την κάμαρα της θείας κι έπαιρναν τη ραφτομηχανή της, και μες στο μεγάλο κακό βρίσκουνταν μπροστά του η θεία με τα θυμωμένα μάτια του πατέρα και τα σουρωμένα του φρύδια κι έλεγε αγριεμένη: «Έσπασες τη βελόνα της μηχανής!»
Και φώναξε ο Αντώνης: «Όχι!» Και τον ξύπνησε η φωνή του. Και σαν είδε τον ήλιο που χύνουνταν από την μπαλκονόπορτα και είδε πως ήταν στεγνή η κάμαρα και ήσυχη και πως κοιμούνταν τ' αδέλφια του, ήλθε πάλι η καρδιά του στη θέση της και πήδηξε κάτω από το κρεβάτι του, χαρούμενος κι έτοιμος για μεγάλα καταπιάσματα.
- Κακό όνειρο! είπε δυνατά.
- Τι; ρώτησε η Αλεξάνδρα από μέσα από την κουνουπιέρα της, τεντώνοντας χέρια και ράχη.
- Τίποτα, αποκρίθηκε ο Αντώνης, είδα ένα άσχημο όνειρο! Η Πουλουδιά είχε σηκώσει την κουνουπιέρα της και κατέβαινε κατσουφιασμένη από το κρεβάτι της.
- Κι εγώ είδα άσχημο όνειρο, είπε.
- Για πες το! έκανε πάλι η Αλεξάνδρα.
Τίποτα δεν την ενδιέφερε τόσο, όσο τα όνειρα των αδελφών της, που τα εξηγούσε ύστερα η κερα-Ρήνη. Γιατί αυτή δεν έβλεπε ποτέ κανένα κι έτσι δεν πρόλεγε τίποτα για κείνην ο Ονειροκρίτης.
Και κάθισε στο κρεβάτι και αγκάλιασε τα γόνατα της, όλη προσοχή.
- Για πες το! επανέλαβε.
Μα η Πουλουδιά δε θέλησε τίποτα να πει, ούτε στην κρεβατοκάμαρα ούτε στη θάλασσα ούτε στο δρόμο.
Μόνο σα μαζεύθηκαν τ' αδέλφια στην ταπεζαρία για τον πρωινό καφέ και κατάφερε να ξεμοναχιάσει τον Αντώνη, του ξεμολογήθηκε:
- Είδα στ' όνειρο μου πως πέθανε ο Μπαρμπαγιάννης Κανατάς. Και πέθανε, λέει, από πείνα, γιατί δεν είχε πια δραχμές, αφού σπάσαμε όλα του τα κανάτια!
Και χάλασαν πάλι τα κέφια του Αντώνη τόσο, που στο τραπέζι ξέχασε να ζητήσει δεύτερη φορά σύκα.
Κακόκεφα, γρινιάρικα άφησε την Αφροδίτη να του βάλει φρέσκο επίδεσμο στο κεφάλι και κατέβηκε στην αυλή με το θείο, που έκανε κάθε πρωί το γύρο του, πότιζε τους βασιλικούς κι έχυνε το κατακάθι του πρωινού καφέ, ως δυναμωτικό, στη ρίζα της αγαπημένης εκατόφυλλης τριανταφυλλιάς του.
Μα ο Αντώνης δεν τον παρακολούθησε, όπως το συνήθιζε, στη δουλειά του, ούτε κοίταξε την τριανταφυλλιά ούτε ζήτησε να γεμίσει το ποτιστήρι ούτε πρόσεξε τις παρατηρήσεις του θείου, ούτε άκουσε τ' αγανακτισμένα επιφωνήματα του. Σκυμμένος έξω από τη μισάνοιχτη αυλόπορτα, ακροάζουνταν με όλη του τη δύναμη, μήπως και κατά τύχη ακούσει το τσικ τσικ των κανατιών του Μπαρμπαγιάννη Κανατά, που δεν περνούσε ποτέ το πρωί, μα που τον ήθελε ο Αντώνης να έλθει σήμερα, για να βεβαιωθεί πως ήταν ζωντανός και πως βγήκε ψεύτικο τ' όνειρο της Πουλουδιάς.
Μα σαν ένιωσε πως του τραβούν το αυτί και ξιπασμένος ανατινάχθηκε και γύρισε, είδε μπροστά του το θείο, κόκκινο και θυμωμένο όπως δεν τον είχε δει ποτέ! - Γιατί το έκανες αυτό; ρώτησε ο θείος.
- Τι έκανα, θείε;
- Σκότωσες την τριανταφυλλιά μου!
- Εγώ;
- Ναι, εσύ! Έλα να τη δεις!
Και πήγε ο Αντώνης και την είδε. Η καημένη η τριανταφυλλιά, με τρία τέσσερα μαραμένα φυλλαράκια, που κρέμουνταν θλιβερά στα κλωνάρια της, στέκουνταν μισογερμένη μες στο βαρέλι της, σαν έτοιμη να λιγοθυμήσει.
- Ποιος την έσπασε; ρώτησε ο Αντώνης σαστισμένος. Όχι εγώ, θείε, αλήθεια σας λέγω!
- Εσύ δεν την έσκαψες χθες;
- Ναι, εγώ και η Πουλουδιά.
- Με τι τη σκάψατε;
- Εγώ είχα ένα καρφί και η Πουλουδιά ένα κεραμίδι.
- Ωραία! Και της κόψατε τις ρίζες της κι έγειρε και τσάκισε. Και τα φύλλα της, γιατί της τα κόψατε;
- Γιατί ήταν μαύρα στις άκρες, σα μαραμένα, και μερικά είχαν τρύπες από τους σαλιάγκους.
- Και δεν ξέρεις πως το φυτό αναπνέει από τα φύλλα; Και πως σαν τους τα κόψεις όλα, πεθαίνει; Και πως, έστω και αν είναι λίγο μαύρα στις άκρες, τα φύλλα τού είναι απαραίτητα;
Ο Αντώνης δεν το ήξερε. Και στέκουνταν τώρα σα φονιάς εμπρός στο θύμα του, ζεματισμένος, ανίκανος να διορθώσει το κακό.
Μα ο θυμός του θείου δε βαστούσε ποτέ πολλή ώρα.
- Έλα, δεν το ήθελες, το ξέρω, του είπε. Μα φαντάζομαι πως και τ' άλλα φυτά δε θα καλοπέρασαν με το καρφί και την κεραμίδα. Πάμε να δούμε.
Και τα είδαν. Πεδίο μάχης μετά το μακελειό ήταν οι ως χθες συγυρισμένες και λουλουδοσπαρμένες πρασιές στα ριζότοιχα της αυλής· ανάπηροι ήταν όλοι οι βασιλικοί της θείας, που κουτσοστέκουνταν ακόμα, αποκαμωμένοι, σαν ανεμοδαρμένοι, κρεμνώντας τα μαραζιασμένα φυλλαράκια τους έξω από τις γλάστρες τους.
- Βλέπεις, Αντώνη, και η κηπουρική έχει την τέχνη της, είπε ο θείος, και καλό είναι να μην καταπιανόμαστε τέχνες που δεν τις ξέρομε. Φώναξε και την Πουλουδιά να της τα πω κι εκείνης.
Ο Αντώνης κοκκίνισε.
- Δε φταίγει εκείνη, είπε, γιατί δεν ήξερε, κι εγώ της είπα να σκάψει το χώμα πολύ βαθιά και πολύ κοντά στα λουλούδια.
Με τα χέρια κάτω από το βεστόνι του και τα κοντά παχιά του πόδια ανοιχτά, τον κοίταζε ο θείος, τα μάτια του στενεμένα στο αγαθό του χαμόγελο.
- Ώστε ο μαστροχαλαστής είσαι συ! Και τη μαστοριά σου φρόντισες να τη μάθεις και σ' άλλους! έκανε.
Η καλόκαρδη ειρωνεία του θείου γκρέμισε μεμιάς τη συνηθισμένη αυτοπεποίθηση του Αντώνη. Στρίβοντας τα χέρια του το ένα μες στο άλλο ομολόγησε:
- Έκανα και άλλη ζημιά χθες, μεγαλύτερη!
- Σε καλό σου! Τι έκανες;
- Έσπασα όλες τις στάμνες του Μπαρμπαγιάννη Κανατά!
- Μπρε ζημιάρη! Πώς το 'κανες;
Με δυο λόγια, του διηγήθηκε ο Αντώνης πως πέρασε ο Μπαρμπαγιάννης Κανατάς με πολλές στάμνες, που τις πήγαινε στο καφενείο, πάνω στο λόφο. Και σαν τον άφησε μόνο να φυλάγει το γαϊδούρι του, θέλησε κείνος να μάθει της Πουλουδιάς να δένει κόμπο το σκοινί.
- Μα τι μανία σ' έπιασε να δασκαλεύεις; αναφώνησε ο θείος. Και τι είπε ο Μπαρμπαγιάννης Κανατάς; Του πλήρωσες τουλάχιστον τις στάμνες του;
Ο Αντώνης κρέμασε το κεφάλι.
- Όχι, είπε. Και πρόσθεσε:
- Δεν έχομε κουμπαρά και λεφτά!
- Λοιπόν θα ζημιώσει ο Μπαρμπαγιάννης Κανατάς; Και πώς θα πάρει ψωμί, που του κατέστρεψες το κεφάλαιο του;
- Ήθελε η Πουλουδιά να πουλήσει τα σκουλαρίκια της κούκλας της, για να τον πληρώσει, μα δεν τ' αγόρασε η κερα-Ρήνη, είπε ο Αντώνης. Ύστερα ήθελε να χαρίσει τ' ωρολόγι της του Μπαρμπαγιάννη Κανατά, μα ούτε κείνος δεν το πήρε. Ήταν, λέει, πολύτιμο. Και σπάσανε, λέει, μόνο τρεις στάμνες και μας τις χάριζε.
- Και ήταν αλήθεια;
- Όχι. Είχαν σπάσει όλες. Το είπε έτσι.
Το χαμόγελο του θείου είχε φαρδύνει από τη μια φαβορίτα στην άλλη. Πήρε από την τσέπη το πορτοφόλι του κι έβγαλε από μέσα ένα χαρτονόμισμα, το δίπλωσε και το έδωσε του Αντώνη.
- Να το βάλεις σ' ένα φάκελο, είπε, και να γράψεις παστρικά σ' ένα χαρτί: «Ο ζημιάρης Τρελαντώνης ευχαριστεί τον Μπαρμπαγιάννη Κανατά για τη μεγάλη του ευγένεια, και θα προσπαθήσει άλλη φορά να μη γυρεύει να ξεφυτρώνει εκεί που δεν τον σπέρνουν!»
Ο Αντώνης δίπλωνε και ξεδίπλωνε το χαρτονόμισμα.
- Θείε... είναι ανάγκη να βάλω ζημιάρης και Τρελαντώνης και ξεφυτρώνει; ρώτησε διστακτικά.
- Μήπως προτιμάς να του το πεις προφορικά;
Σήκωσε ο Αντώνης το κεφάλι και αντάμωσε τα γελαστά μάτια του θείου.
- Διάλεξε ένα από τα δυο, όποιο θέλεις, είπε ο θείος.
Ο Αντώνης θα διάλεγε το ξύλο της θείας. Μα ντράπηκε να το πει. Τ' ακόλουθα όμως λόγια του θείου μαλάκωσαν λίγο το πληγωμένο του φιλότιμο.
- Μπορούσα να σε δείρω, του είπε -ο θείος δεν έδερνε ποτέ- μ' αυτό δε θα διόρθωνε τη ζημιά σου, και δεν είναι δίκαιο ο Μπαρμπαγιάννης Κανατάς να ζημιωθεί για τις αταξίες σου. Άιντε, πήγαινε τώρα και κάνε με κουράγιο την τιμωρία σου. Να έχεις έννοια, σαν περάσει τ' απόγεμα ο Μπαρμπαγιάννης Κανατάς, να του δώσεις εσύ ο ίδιος το φάκελο σου.
- Και αν δεν περάσει;
- Θα περάσει, αφού έχει να πάγει στάμνες στο καφενείο. Εκείνη η μέρα έσυρε μακριά σα δέκα μέρες.
Τα τέσσερα αδέλφια, με την αράδα, είχαν κρεμαστεί στο παράθυρο ή έβγαιναν κάθε λίγο στη βεράντα, μήπως και δουν από μακριά τον Μπαρμπαγιάννη Κανατά ή μήπως ακούσουν τα κανάτια του να κάνουν το συνηθισμένο τους τσικ τσικ, πριν ακόμα φανεί εκείνος και το γαϊδούρι του. Μα, προς το βράδυ πια, η αγωνία τους είχε φθάσει στο κατακόρυφο. Χωρίστηκαν σε δυο στρατόπεδα και βγήκαν όλα στο δρόμο, η Αλεξάνδρα, με τον Αλέξανδρο από το μέρος της βεράντας και της θάλασσας, ο Αντώνης με την Πουλουδιά από το μέρος της αυλής, πίσω από το σπίτι.
Μα μόλις έκαναν λίγα βήματα, στάθηκαν μουδιασμένα τα δυο αδέλφια.
Παρακάτω, στη σκιά του τοίχου, κάθουνταν η βασιλική παρέα γύρω σ' ένα τραπέζι.
- Και τώρα τι θα κάνομε; ψιθύρισε η Πουλουδιά.
Μια στιγμή δίστασε ο Αντώνης. Αλλά ευθύς πάλι αποφάσισε και μοίρασε τις στρατηγικές θέσεις.
- Εσύ θα σταθείς εκεί, σ' αυτή την πέτρα! πρόσταξε. Και, αν δεις τον Μπαρμπαγιάννη Κανατά να έρχεται από την Καστέλα...
- Μα θα με δει ο βασιλέας και η βασίλισσα... Και είναι εκεί και τ' αγόρια, και η βασιλοπούλα Αλεξάνδρα, και...
- Δεν πειράζει, αποφάσισε ο Αντώνης, πρέπει να σταθείς εκεί να παραφυλάγεις, κι εγώ φυλάγω από δω...
Τρεχάτος, με πλατείς πήδους, κατάφθασε ένας μεγάλος σκύλος, πήδηξε πάνω στον Αντώνη και του έβαλε τα πόδια στους ώμους κουνώντας χαρούμενα την ουρά του. - Ο Ντον! αναφώνησε η Πουλουδιά.
Την ίδια ώρα, από το παρακάτω τραπέζι, ακούστηκε μια σφυριγματιά και συνάμα η ξενική φωνή του βασιλέα:
- Ντον! Έλα δω! Και πρόσθεσε:
- Μη φοβάσαι, παιδί μου, αυτά είναι χάδια που σου κάνει! Μα ο Ντον δεν εννοούσε ν' αφήσει τον παλιό του φίλο, μιας και τον ξαναβρήκε. Σηκώθηκε ο βασιλέας, ξανασφύριξε του Ντον και φώναξε:
- Ελάτε δω, παιδιά, και θα 'ρθει κι εκείνος!
Ο Αντώνης έσπρωξε την Πουλουδιά με τον άγκωνά του.
- Πήγαινε! ψιθύρισε. Το είπε ο βασιλέας!
- Όχι χωρίς εσένα! Μας φώναξε και τους δυο! αποκρίθηκε φοβισμένη η Πουλουδιά.
Νευρικά έσιαξε ο Αντώνης το ναυτικό κολάρο του, τράβηξε στα ίσια της την πάντα στραβή γραβάτα του και, θέλοντας και μη, με την Πουλουδιά και τον Ντον, που εξακολουθούσε να πηδά γύρω τους, σίμωσε το βασιλικό τραπέζι. Μαγεμένη κοίταζε η Πουλουδιά τη βασίλισσα, ολόασπρη στο μουσελινένιο, όλο κανονέδες φόρεμα της, με φρίλια στον ανοιχτό της λαιμό και στα κοντά μανίκια, χωρίς καπέλο, με μόνο μια βελουδένια μαύρη κορδέλα γύρω στα ξανθά της μαλλιά. Κοντά της κάθουνταν η μεγάλη βασιλοπούλα, σοβαρή, λίγο απόμακρη, και πλάγι της η Ρωσίδα κυρία της Τιμής, και παρακάτω ένα δυο αξιωματικοί. Μα ο Αντώνης είχε κολλήσει τα μάτια του στα τρία βασιλόπουλα, όρθια στην αράδα, με τη ράχη στον τοίχο, σα σκάλα, ο διάδοχος πρώτος, ύστερα ο δεύτερος, ύστερα ο τρίτος, και οι τρεις στα άσπρα, με σκούρα μπλου ναυτικά κολάρα και πλατιά ναυτικά ψάθινα καπέλα. Και τόσο ήταν απορροφημένος με τη θέα αυτή, που ξιπάστηκε σαν τον ρώτησε ο βασιλέας:
- Τι έπαθες κι έχεις δεμένο το κεφάλι;
Το είχε ξεχάσει ο Αντώνης το κεφάλι του. Αυθόρμητα σήκωσε το χέρι να βγάλει το μαντίλι. Μα του το έπιασε η βασίλισσα.
- Δεν πρέπει! του είπε γλυκά. Μην το αγγίζεις!
- Μα γιατί είναι δεμένο το κεφάλι σου; επανέλαβε ο βασιλέας.
Αποκρίθηκε ο Αντώνης κοκκινίζοντας:
- Έπεσα χθες.
Η μικρή βασιλοπούλα, που κυνηγούσε το τόπι της, πλησίασε ν' ακούσει.
- Χτύπησες; ρώτησε περίεργη.
Γύρισε ο Αντώνης και την είδε, μα δεν αποκρίθηκε. Όλη αυτή η συντροφιά τον στενοχωρούσε, τον έκανε δειλό, ντροπαλό, προπάντων τα τρία μεγάλα αγόρια αραδιασμένα στον τοίχο, που κοίταζαν και άκουαν ακατάδεχτα. Και του μιλούσε ο βασιλέας κι έπρεπε ν' απαντήσει, και τ' αγόρια όλο τον κοίταζαν και όλο άκουαν.
- Χτύπησε; ρώτησε η μικρή βασιλοπούλα γυρνώντας στην Πουλουδιά.
Αυτή ήταν μικρή, καθόλου σπουδαία σαν την όμορφη αδελφή της, και μπορούσε κανείς να της μιλήσει.
- Ναι, είπε η Πουλουδιά, ξαναβρίσκοντας τη συνηθισμένη της πολυλογία, πήγε στη θάλασσα και κατέβηκε στους βράχους να μου πιάσει έναν κάβουρα, και...
- Και τον έπιασε; ρώτησε με λαχτάρα η μικρή βασιλοπούλα.
Μα την τράβηξε η βασίλισσα πλάγι της και μαζεύθηκε ντροπαλή πάλι η Πουλουδιά. Κι έλεγε του Αντώνη ο βασιλέας:
- Τι θέλεις να του πεις του Μπαρμπαγιάννη Κανατά;
- Θέλω... ο θείος μου μου έδωσε... έχω κάτι να του δώσω... έκανε ο Αντώνης και σώπασε.
- Να του δώσεις; Τι, χρήματα; Μα δεν είναι φτωχός ο Μπαρμπαγιάννης Κανατάς.
Ο Αντώνης σήκωσε το κεφάλι ξαφνισμένος.
- Είναι πολύ φτωχός, είπε, δεν έχει ούτε παπούτσια. Ο βασιλέας γέλασε.
- Όταν πουλά στάμνες, δε φορεί παπούτσια, είπε, και φορεί ρούχα παλιά και μπαλωμένα. Μα σαν πάγει στο Ζάππειο... Ξέρεις το τραγούδι του; ρώτησε.
- Μάλιστα, είπε ο Αντώνης δειλά.
- Πες το λοιπόν!
Ο Αντώνης γύρισε στην Πουλουδιά.
- Και συ το ξέρεις. Πες το συ, έκανε όλο και πιο στενοχωρεμένος.
- Όχι, εσύ, είπε τρομαγμένη η Πουλουδιά.
- Πείτε το μαζί, είπε η βασίλισσα.
Και, χαδιάρικα, βόλεψε τα πάντα ξεβολεμένα μαλλιά της Πουλουδιάς. Δεν ήταν τρόπος να το ξεφύγουν. Και με φωνές που έτρεμαν, σαν κατσικάκια, άρχισαν τα δυο αδέλφια μαζί:
«Μπάρμπαγιάννη με τις στά-α-μνες και με τα κανάτια σου, και με τα κανάτια σον, να χαρώ τα μάτια σον.
Πρό-σεξε μη σε γελά-α-σει κα-μιά όμορφη κυρά και σου φάει το γαϊδούρι και σ' αφήσει την ουρά.
Μπάρ-μπαγιάννη σε λατρέ-ε-βω και θα σ' αγαπώ πιστά, Μπαρμπαγιάννη Κανατά, Μπαρμπαγιάννη Κανατά, που φορείς ψηλό καπέ- ε-λο και παπούτσια γυαλιστά...»
- Βλέπεις λοιπόν που δεν είναι φτωχός, αφού φορεί παπούτσια γυαλιστά και ψηλό καπέλο; διέκοψε ο βασιλέας.
Ο Αντώνης κοντοστάθηκε. Μπερδεμένος είπε:
- Μα δεν είναι αλήθεια, είναι μόνο τραγούδι. Κοροϊδευτικά τον ρώτησε ο βασιλέας:
- Εσύ δεν πας ποτέ στο Ζάππειο, στας Αθήνας;
- Όχι, ποτέ.
- Ναι, πάμε στας Αθήνας, αντίκοψε η Πουλουδιά, πήγαμε μια φορά σ' ένα μαγαζί για να δοκιμάσομε όλοι παπούτσια, δε θυμάσαι;...
- Λες ανοησίες, της είπε χαμηλόφωνα ο Αντώνης.
- Και ξέρεις και άλλα τραγούδια; ρώτησε η βασίλισσα. Μα ο Αντώνης ήταν αποφασισμένος να μην πει άλλο.
- Δεν ξέρω κανένα καλά, αποκρίθηκε.
Η Πουλουδιά όμως, που είχε πάρει θάρρος στο μεταξύ, σαν είδε πως γελούσαν οι αξιωματικοί, είπε:
- Εγώ ξέρω πολλά. Ξέρω κι ελληνικά, ξέρω και αγγλικά.
- Κες κ' ελ ντι; ρώτησε η Ρωσίδα κυρία της Τιμής.
Κάτι αποκρίθηκε η βασίλισσα σε ξένη γλώσσα και, μαζεμένη πάλι, κοίταζε η Πουλουδιά μια τη μια και μια την άλλη, χωρίς να καταλαβαίνει τι έλεγαν. Και της είπε η βασίλισσα:
- Ρωτά η κυρία αν ξέρεις κανένα γαλλικό τραγούδι.
- Όχι, αποκρίθηκε η Πουλουδιά, μα ξέρω ένα φράγκικο.
- Τι φράγκικο;
- Έτσι, φράγκικο. Δεν είναι ούτε ελληνικό ούτε αγγλικό.
- Για πες το! έκανε ο βασιλέας. Και το είπε η Πουλουδιά:
«Πι-πον-ντο, αλαρέ-βε-ράνσε
Λια-κεν-ντιε κιγκουβέρν λα Φράνσε.
Αλό μεζαμί,
Λα γκερ ντελαφινί,
Πι-πον-ντο, αλαρί-βε-ζό».
Όλοι γύρω στο τραπέζι, αξιωματικοί και κυρίες, γελούσαν τώρα ξεκαρδισμένοι, προς μεγάλη δυσαρέσκεια του Αντώνη που υποψιάζουνταν ότι περιγελούσαν την Πουλουδιά, ενώ εκείνη τίποτα δε σκάμπαζε.
- Και τι θα πει αυτό; ρώτησε ο βασιλέας που φαινόταν να διασκεδάζει πολύ.
- Δεν ξέρω, αποκρίθηκε η Πουλουδιά, το λέμε για να δούμε ποιος θα βγει έξω στο κυνηγητό. Και είναι φράγκικο. Έτσι λέγει η Αλίς.
- Και ποια είναι η Αλίς;
Με το κεφάλι έδειξε η Πουλουδιά κατά τα παρακάτω σπίτια.
- Είναι ένα κορίτσι που κάθεται πλάγι μας, αποκρίθηκε. Ένας αξιωματικός, άσπρα ντυμένος και με μακριές καστανές μουστάκες, ρώτησε:
- Ξέρεις και κανένα άλλο ξενικό να μας πεις;
Ο Αντώνης της έγνεψε: «Όχι!» Μα η Πουλουδιά είχε πάρει φόρα.
- Ξέρω, αποκρίθηκε.
- Για πες το, είπε ο βασιλέας. Είναι φράγκικο σαν το άλλο που είπες;
- Όχι, είναι γοριτσιάνικο.
Τρομάρα τον έπιασε τον Αντώνη. Και αυτό θα το πει;
- Και πού τα ξέρεις εσύ τα γοριτσιάνικα; ρώτησε πάλι ο βασιλέας.
- Μου τα έμαθε η Φραντσέσκα, η παραμάνα του Αλέξανδρου.
- Και ο Αλέξανδρος ποιος είναι;
- Ο αδελφός μου.
- Αγόρι είναι το πιο μικρό σου αδελφάκι; Που φορεί ένα τόσο όμορφα κεντημένο φουστανάκι; ρώτησε η βασίλισσα.
- Μάλιστα. Του το κέντησε η μαμά μας, προθυμοποιήθηκε να την πληροφορήσει η Πουλουδιά.
Ο Αντώνης έφριξε. Όλα τώρα τα οικογενειακά τους θα τα πει η Πουλουδιά; Έριξε μια ματιά στα τρία αγόρια, ακουμπισμένα στον τοίχο, και πάλι τα είδε ακίνητα και ακατάδεχτα, που μισοχαμογελούσαν με οίκτο. Άθελα έκανε ένα βήμα πίσω, να βγει, αυτός τουλάχιστον, από τη βολή των ματιών τους. Θέλησε να παρασύρει και την Πουλουδιά. Μ' αυτή ούτε τον κοίταζε. Κι έλεγε ο βασιλέας:
- Μπράβο! Μπράβο της μαμάς σου! Και πες μας λοιπόν το γοριτσιάνικο.
Και άρχισε η Πουλουδιά μ' όλη της τη φωνή:
«Τις Μαρίτσκα μόγια, γιες τερέτιτς μαμ...»
Πωπώ, ντροπή! Δεν ήξερε ο Αντώνης πού να κρυφθεί. Να ξεφωνίζει έτσι η αδελφή του, μπρος στο βασιλέα και τη βασίλισσα, αυτό το τραγούδι που κανένα αδέλφι δεν ήθελε πια να το πει, αφότου η παραμάνα κάποιου άλλου μωρού, Γοριτσιάνα και αυτή, τους είχε περιγελάσει πως τα 'λεγαν όλα στραβά και δε θα πει τίποτα το τραγούδι τους! Και τώρα γελούσε ο βασιλέας, και γελούσε η βασίλισσα, και γελούσαν οι αξιωματικοί, που ο ένας μάλιστα ακούμπησε στο σπαθί του με τα δυο του χέρια για να γελάσει πιο βολικά, και γελούσε η Ρωσίδα κυρία της Τιμής, όλοι γελούσαν και την περιγελούσαν, ακόμα και η μεγάλη βασιλοπούλα, που είχε σηκώσει ακατάδεχτα το πιγούνι της, και μόνη η Πουλουδιά δεν το έβλεπε, παρά εξακολουθούσε να ξεφωνίζει: «...Γιες τερέτιτς κούπενζέ, κούπενζέ, κούπενζέ, γιες τερέτιτς γκρίλενζέ...» Τόσο ντράπηκε ο Αντώνης, που έκανε δυο βήματα προς το σπίτι του και άλλα δυο. Έριξε πίσω του μια ματιά και είδε πως τον κοίταζε ο διάδοχος, ακατάδεχτα και αυτός σαν την αδελφή του. Και το 'βαλε ο Αντώνης στα πόδια και δε στάθηκε παρά στην αυλή του, κι εκεί πια ανέπνευσε ελεύθερα. Ουφ! Τουλάχιστον εκεί δεν έβλεπε την ανόητη την Πουλουδιά...
Πίσω του ξανάνοιξε η πόρτα της αυλής. Γύρισε φουρκισμένος να τα ψάλει της Πουλουδιάς. Μα δεν ήταν η Πουλουδιά, παρά μόνο ο ταχυδρόμος, που του έτεινε ένα διπλωμένο και κολλημένο χαρτί.
- Τηλεγράφημα, δώσ' το μέσα, είπε του Αντώνη.
Και ξαναβγήκε βιαστικός.
Την ίδια ώρα, τρεχάτος κατάφθανε ο Αλέξανδρος από μέσα από το σπίτι, κατακόκκινος από τη βία και τη λαχτάρα.
- Έλα, Αντώνη, γρήγορα! Η θεία έφυγε κι έρχεται ο Μπαρμπαγιάννης Κανατάς!
Στο διάδρομο τους σκουντούφλησε η Αλεξάνδρα, άλλο τόσο αναμμένη, που κατάφθανε να τους βιάσει να προφθάσουν.
- Γρήγορα! Γρήγορα! Έρχεται ο Μπαρμπαγιάννης Κανατάς!
Κι έτρεξαν στη βεράντα.
Μακριά, στον κατήφορο, φαίνουνταν τωόντι η πλατύγυρη σχισμένη ψάθα του Μπαρμπαγιάννη, πλάγι στο γαϊδούρι του, που, φορτωμένο όσο και χθες, ανέβαινε με τον αφέντη του, χωρίς βία, κατά τα σπίτια του Τσίλερ. Νευρικός τον κοίταζε ο Αντώνης, μισοχαρούμενος, μισοντροπιασμένος για το χαρτί που ήταν μέσα στο φάκελο. Και άλλο τόσο νευρική κοίταζε η Αλεξάνδρα, που ήξερε τι ήταν το χαρτί του Αντώνη, και μάλιστα του το είχε ριγώσει, για να το γράψει εκείνος ίσια. Και πλάγι τους ο Αλέξανδρος, σκαρφαλωμένος στα κάγκελα και σκύβοντας πάνω από την κουπαστή, για να βλέπει πιο καλά, τους έλεγε κάθε κίνηση του Μπαρμπαγιάννη, μήπως και δεν τον προφθάσει ο Αντώνης.
- Τώρα στρίβει ένα τσιγάρο... τώρα το κολλά... πρόσεχε, Αντώνη, μη μας περάσει...
Και σαν έφθασε ο Μπαρμπαγιάννης στη γωνιά των σπιτιών του Τσίλερ, κατέβηκε ο Αντώνης στο δρόμο, έτρεξε στον Μπαρμπαγιάννη, του έδωσε το φάκελο και ξανάφυγε σα σαΐτα. Ίσια μες στην τραπεζαρία μπήκε ο Αντώνης γυρεύοντας να κρύψει τη συγκίνηση που τον έκανε να λαχανιάζει. Τρεχάτη και λαχανιασμένη ανέβηκε και η Αλεξάνδρα με τον Αλέξανδρο από το δρόμο και τρύπωσε κι εκείνη στην τραπεζαρία.
- Τι σου είπε ο Μπαρμπαγιάννης Κανατάς; ρώτησε.
Μα ο Αντώνης δεν αποκρίθηκε. Κρυφά, από το ανοιχτό παράθυρο, παραμόνευε να δει τον Μπαρμπαγιάννη που, ήσυχος, σα να μην είχε συμβεί τίποτα, ανέβαινε τον ανήφορο. Σαν έφθασε μπρος στη βεράντα, σήκωσε ο Μπαρμπαγιάννης τα μάτια του στα παράθυρα και, με την άκρη των δαχτύλων του, άγγιξε το γύρο της ψάθας του.
- Γεια σου, Αντώνη, Τρελαντώνη, κι ευχαριστώ! φώναξε.
Ο Αντώνης τέντωνε το λαιμό του να δει χωρίς να φαίνεται. Και τον είδε που ανέβαινε ως το παλάτι, τραβούσε ήσυχα το δρόμο του και χάνουνταν στο γύρισμα του δρόμου. Τότε και μόνο τόλμησε να ξαναβγεί στη βεράντα και ν' αναπνεύσει ελεύθερα.
Συγκινημένη τον ακολούθησε η Αλεξάνδρα με τον Αλέξανδρο στη βεράντα.
- Τι σου είπε, Αντώνη; Ε; Πες, τι σου είπε; έκανε με λαχτάρα.
- Ποιοοος; ρώτησε η Πουλουδιά ξεφυτρώνοντας ξαφνικά μεταξύ της Αλεξάνδρας και του Αντώνη· βαστούσε τα χέρια της πίσω, σα να γύρευε να κρύψει κάτι.
- Από πού έρχεσαι; Πού ήσουν και άργησες τόσο; ρώτησε η Αλεξάνδρα.
- Μήπως πέρασε ο Μπαρμπαγιάννης Κανατάς; έκανε ξαφνισμένη η Πουλουδιά.
- Ναι. Τώρα, αποκρίθηκε ο Αλέξανδρος.
- Αχ, τι κρίμα! Γιατί δε με φωνάξατε;
- Ας ήσουν εδώ! είπε ο Αντώνης μπουρινιασμένος ξαφνικά.
- Και πως δεν ήμουν; έκανε αδιάφορα η Πουλουδιά. Δες τι σας φέρνω!
Θριαμβευτικά άνοιξε τα χέρια της και παρουσίασε καμιά δεκαριά μπισκότα «Μαρί».
- Πού τα βρήκες; ρώτησε η Αλεξάνδρα που τα τρελαίνουνταν.
- Μου τα 'δωσε η βασίλισσα!
- Αλήθεια; έκανε μαγεμένος ο Αλέξανδρος. Η Πουλουδιά ακτινοβολούσε.
- Μου έδωσε και τούτο! είπε.
Έχωσε το χέρι της στην τσέπη της κι έβγαλε ένα μακρύ, ελικτό κοχλάδι, γαλάζιο και γυαλιστερό, με κόκκινες πιτσιλάδες.
- Και τούτο!
Και με άλλη βουτιά στην τσέπη, έβγαλε ένα κόκκινο μεταξωτό μαξιλαράκι.
- Και μου είπε να ράψω το κοχλάδι στο μαξιλαράκι και να το βάλω στην τουαλέτα μας, για να τη θυμούμαι, λέει, εξακολούθησε η Πουλουδιά, όλο και με πιότερη έξαψη. Και ύστερα μου είπε: «Να, πάρε και δυο μπισκότα!» Μα εγώ δεν τα έπαιρνα. Και μου είπε: «Δε σ' αρέσουν;» Και είπα: «Ναι, μ' αρέσουν. Μα θα μου τα φάνε τ' αδέλφια μου!» Κι εκείνη είπε: «Πάρε τα λοιπόν όλα!» Και μου άδειασε το πιάτο...
- Πουλουδιά!!! αναφώνησε φρικιασμένη η Αλεξάνδρα. Η Πουλουδιά κοντοστάθηκε.
- Ε... Τι; έκανε ανήσυχη.
- Δεν ντρέπεσαι! της είπαν συγχρόνως τα δυο μεγαλύτερα αδέλφια.
- Γιατί; ο ενθουσιασμός της Πουλουδιάς είχε πέσει ξαφνικά, άρχιζε να τρομάζει. Τι έκανα;
- Ζητιάνεψες μπισκότα! είπε ο Αντώνης.
- Και ξευτέλισες τ' αδέλφια σου, τάχα πως σου τρων τα μπισκότα σου! πρόσθεσε η Αλεξάνδρα.
- Και μας ντρόπιασες όλους, και τους τέσσερις! είπε ο Αντώνης. Σα να μην έφτανε η πρώτη ντροπή, να τραγουδήσεις το «Τις Μαρίτσκα μόγια»!
- Τραγούδησες το «Τις Μαρίτσκα μόγια»; έκανε πνιγμένη από τη σύγχυση της η Αλεξάνδρα.
Ο Αλέξανδρος, που δεν είχε πει τίποτα, θεώρησε σωστό να λάβει μέρος κι εκείνος στη γενική αγανάκτηση. Έσμιξε τα χέρια του και ανεβοκατέβασε το σγουρό του κεφάλι δυο και τρεις φορές και είπε κι εκείνος με φρίκη, που δεν είχε όμως και πολλή αγριότητα:
- Το «Τις Μαρίτσκα μόγια»! Πωπώ!
Η Πουλουδιά κοίταζε μια τον ένα, μια τον άλλο και μια τα μπισκότα στα χέρια της, ζαλισμένη από τη γενική αποδοκιμασία που γύριζε το θρίαμβο της σε καταστροφή. Και ξαφνικά πέταξε τα μπισκότα στο σιδερένιο τραπεζάκι κι έμπηξε τα κλάματα.
Ομιλίες πολλές και βήματα ακούστηκαν στο δρόμο· ήταν οι Ευέλπιδες που περνούσαν.
Μα τόσο έκλαιγε η Πουλουδιά, που ούτε τους άκουσε.
Η Αλεξάνδρα έσκυψε, όλο μάτια, να δει τα «καναρίνια» που διάβαιναν. Ένας Εύελπις γύρισε, την είδε και φώναξε:
- Έλα, έλα μαζί μας!
Ντροπιασμένη τραβήχθηκε η Αλεξάνδρα και κρύφθηκε ανακούρκουδα πίσω από τις περικοκλάδες και δεν τόλμησε να ξανασηκωθεί να τους κοιτάξει, γιατί μερικοί απ' αυτούς γέλασαν και τρεις τέσσερις μάλιστα ξαναφώναξαν: «Έλα, λοιπόν, κοριτσούδι!...» Και συνάμα κάτι κρότοι ανέβηκαν, σα χαστούκια, πνιγμένες αντεγκλήσεις και θυμωμένα λόγια.
Όταν ξεθαρρεύτηκε και πέρασε το κεφάλι της πάνω από την καγκελαρία, η ουρά των Ευελπίδων έστριφτε στο γύρισμα του βράχου και στο δρόμο, σκονισμένος, με στραπατσαρισμένα τα ρούχα του, σιάζοντας τον τσαλακωμένο του γιακά, ήταν ο Γιάννης. Μουρμουρίζοντας μες στα δόντια του, ανέβηκε στη βεράντα.
- Γιατί τον έδειρες; Τι σου έκανε; ρώτησε ο Αντώνης.
- Εμένα τίποτα, αποκρίθηκε ο Γιάννης.
- Λοιπόν γιατί τον χτύπησες;
- Έτσι θ' αφήσω να μιλάει ένας ξένος στην εξαδέλφη μου; Τ' αδέλφια στάθηκαν λίγο σαστισμένα. Δεν ήξεραν πως δεν επιτρέπεται να μιλά ξένος σ' εξαδέλφες.
Και είπε ο Γιάννης:
- Θα του 'σπανα τα μούτρα του, αν δεν ανακατώνουνταν ο αξιωματικός.
Και βλέποντας την απορία των εξαδέλφων του, είπε πάλι:
- Έτσι μιλούν στο δρόμο σε κορίτσια; Ποιος το παραδέχεται; Μια μέρα περπατούσα με την Κλειώ και την Κατίνα και κάποιος άγνωστος πέρασε και τις χαιρέτησε, και τον έδειρα και αυτόν.
Τα τέσσερα αδέλφια τον κοίταζαν τώρα με μάτια και στόμα ανοιχτά. Και από το θαυμασμό της ξέχασε η Πουλουδιά τα κλάματα. Διστακτικά ρώτησε η Αλεξάνδρα:
- Είναι κακό να σε χαιρετά ένας άγνωστος;
- Είναι πρόστυχο, είπε ο Γιάννης.
Και ακούμπησε σ' ένα στύλο της σκεπής και σταύρωσε τα πόδια του, με όλη τη σπουδαιότητα που του έδιναν, απέναντι των εξαδέλφων του, οι πολλαπλές του γνώσεις. Το κύρος του επιβλήθηκε πάλι στα τέσσερα αδέλφια. Ακόμα και ο Αντώνης αισθάνθηκε την άγνοια του. Μα δεν ήθελε και να το δείξει. Μ' έναν πήδο καβαλίκεψε την ξύλινη κουπαστή της βεράντας και με φιάκα ρώτησε τον Γιάννη:
- Γνωρίζεις εσύ τον Μπαρμπαγιάννη Κανατά; Με το πιγούνι έδειξε ο Γιάννης κατά τον ανήφορο.
- Πέρασε τώρα, αποκρίθηκε.
- Το ξέρω. Μιλήσαμε μαζί... δηλαδή... έκανε ο Αντώνης που φαντάζουνταν έτσι να κάνει πολλή εντύπωση στον εξάδελφο του.
Μα ο Γιάννης είπε:
- Και σε ποιον δε μιλά αυτός; Ακόμα και στο βασιλέα λέγει «εσύ».
Ο Αντώνης πήδηξε χάμω.
- Αλήθεια; έκανε. Και πώς τον λέγει; Γεώργιε;
- Όχι, μπούφο! Τον λέγει, σαν όλους, «μεγαλειότατε». Μα τον λέγει «εσύ».
- Πώς το ξέρεις; ρώτησε θαυμάζοντας η Αλεξάνδρα.
- Τον άκουσα. Μια μέρα που περνούσε αυτός και στέκουνταν ο βασιλέας στον ανήφορο, ρώτησε ο βασιλέας: «Γιατί δε φορείς σήμερα ψηλό καπέλο και παπούτσια γυαλιστά, Μπαρμπαγιάννη;» Κι εκείνος του αποκρίθηκε: «Τα φορώ, όπως και συ το λοφίο σου, μεγαλειότατε, στις μεγάλες περιστάσεις!» Και γέλασε ο βασιλέας.
Όλα μαζί τ' αδέλφια θαύμασαν.
- Αλήθεια, στις εορτές φορεί ο βασιλέας λοφίο, Γιάννη; ρώτησε η Αλεξάνδρα.
Μα τη διέκοψε ο Αντώνης.
- Αλήθεια είναι πως φορεί ο Μπαρμπαγιάννης Κανατάς ψηλό καπέλο και παπούτσια γυαλιστά; ρώτησε.
- Βέβαια, κάθε Κυριακή. Όλη την εβδομάδα τον βλέπεις κουρελιάρη και ξυπόλυτο. Μα την Κυριακή το απόγεμα γίνεται κύριος, βάζει σκούρα ρούχα, ψηλό καπέλο και λουστρίνια, παίρνει στο χέρι ένα μπαστούνι με ασημένιο χερούλι και κάνει τη φιάκα του στο Ζάππειο.
Τ' αδέλφια τ' άκουαν και τους φαίνουνταν σαν παραμύθι της Χαλιμάς.
- Γι' αυτό είπε ο βασιλέας για το Ζάππειο! έκανε η Πουλουδιά.
- Τι είπε ο βασιλέας; ρώτησε ο Γιάννης. Μα ο Αντώνης την πρόλαβε πριν απαντήσει.
- Κάλλιο να μην τ' αναφέρεις! της είπε. Και στάθηκε η Πουλουδιά αποσβολωμένη.
Την είδε ο Γιάννης, κατάλαβε πως κάποιος καβγάς ετοιμάζεται και δεν επέμεινε. Έσπρωξε πίσω το ψάθινο καπέλο του, που στάθηκε σα δόξα αγίου γύρω στο στρογγυλό του πρόσωπο, κι έχωσε τα χέρια του στις τσέπες του. Με το πιγούνι πάλι έδειξε κατά το σιδερένιο τραπέζι, πίσω από την Πουλουδιά.
- Για ποιον είναι αυτά τα μπισκότα; ρώτησε.
- Για κανένα, είπε περιφρονητικά ο Αντώνης. Είναι ντροπιασμένα μπισκότα.
Η Πουλουδιά ανατινάχθηκε.
- Καθόλου! φώναξε κατακόκκινη. Είναι δικά μου και θα τα φάγω μονάχη!
Ο Αντώνης άπλωσε το χέρι πάνω στα καταδικασμένα μπισκότα.
- Σαν τα φας, θα ντροπιαστείς διπλά... άρχισε. Μα ένας μπάτσος της Πουλουδιάς τον διέκοψε. Εξαγριωμένος για την προσβολή που του έγινε μπρος στον Γιάννη, γύρισε ο Αντώνης και την έπιασε από την ποδιά της.
- Και τώρα, για να μάθεις, θα πεις μόνη σου του Γιάννη ποιος σου τα έδωσε και γιατί! την πρόσταξε.
- Δεν το λέγω! Άφησε με!
- Θα το πεις!
- Δεν το λέγω!
- Δεν το λες; Τότε θα πω εγώ στον Γιάννη τι είπες μια μέρα γι' αυτόν!
- Κι εγώ θα πω για τη ραφτομηχανή!
- Τι με μέλει; Πες το! Πεισμωμένη είπε και η Πουλουδιά:
- Κι εμένα δε με μέλει. Πες το!
Την έμελε και την παραέμελε. Μα, μ' όλη της τη φούρκα, θυμήθηκε πως πάντα την αφόπλιζε ο Αντώνης με την ίδια απάντηση.
- Τι; Δε σε μέλει; αναφώνησε ο Αντώνης. Να το πω λοιπόν; Η Πουλουδιά έτρεμε από ανησυχία, μα το είχε πει πια.
- Πες το, δε με μέλει! επανέλαβε. Και το είπε ο Αντώνης:
- Είπε για σένα, Γιάννη, πως, σα θα μεγαλώσει, θα σε πάρει!
Η Πουλουδιά δεν το περίμενε. Της ήλθε κόλπος, τόσο, που ούτε για τη ραφτομηχανή δεν μπόρεσε να πει. Με τα μάτια σκυμμένα, μα το κεφάλι πεισματάρικα πεταμένο πίσω, δάγκανε τα χείλια της, για να μην ξεσπάσει στα κλάματα.
Και σιγανή ακούστηκε η φωνή του Γιάννη που έλεγε τραγουδιστά:
- Μακά-αρι!...
Της φάνηκε ξαφνικά πως άνοιξαν τα ουράνια. Τι; Δεν την κορόιδευε ο Γιάννης; Ουφ! Τι ξελάφρωμα!
Στον ενθουσιασμό της, μάζεψε όλα τα «Μαρί», σκορπισμένα στο τραπεζάκι, και τα πρόσφερε του Γιάννη.
- Σου τα χαρίζω όλα! είπε και θριαμβευτικά γύρισε στον Αντώνη, που στέκουνταν μπερδεμένος για την τροπή που είχαν πάρει τα πράματα. Δε θα φας ούτε ένα! του είπε. - Ούτε τα θέλω ούτε ο Γιάννης δεν τα θέλει, πράματα που ζητιάνεψες από τη βασίλισσα...
- Δε ζητιάνεψα!
- Ναι, ζητιάνεψες! επικύρωσε ο Αλέξανδρος, αφού είπες, είπες... Τι είπε, Αλεξάνδρα;
- Της έδωσε η βασίλισσα δυο και είπε η Πουλουδιά: «Θα μου τα φαν τ' αδέλφια μου!» Και της έδωσε η βασίλισσα όλα όσα ήταν στο πιάτο! επεξήγησε η μεγάλη αδελφή ντροπιασμένη.
Μα ο Γιάννης δε φάνηκε να ένιωσε την ντροπή που είχε πέσει, με τα λόγια της Πουλουδιάς, σ' όλη την οικογένεια. Έβαλε δυο μπισκότα μαζί στο στόμα του και είπε μπουκωμένος:
- Πολύ καλά έκανε, αφού θα της τα τρώγατε!
Πάει το γόητρο του Γιάννη! Γκρεμίστηκε, τσακίστηκε, χάθηκε.
Κανένας δεν του αποκρίθηκε. Μόνη η Πουλουδιά είπε, χωρίς πολλή πεποίθηση όμως:
- Βέβαια... αφού θα μου τα τρώγατε...
Σαν έφυγε ο Γιάννης κι έμειναν τ' αδέλφια μόνα, σχολίασαν τη διαγωγή του με πολύ μαύρα χρώματα.
- Ακούς, λέει, να φάγει τα ντροπιασμένα μπισκότα! είπε ο Αντώνης.
- Και να πει πως έκανε καλά η Πουλουδιά να τα ζητήσει! πρόσθεσε η Αλεξάνδρα.
- Και να μην ντραπεί! είπε πάλι ο Αντώνης.
- Και ούτε να μας δώσει κι εμάς! διαμαρτυρήθηκε ο Αλέξανδρος.
Μα τον αποπήρε ο Αντώνης.
- Δεν ντρέπεσαι; Τέτοια μπισκότα! φώναξε.
Ο Αλέξανδρος ντράπηκε πολύ. Μα δεν ήξερε καλά γιατί. Και είπε σηκώνοντας το κεφάλι η Αλεξάνδρα:
- Το μόνο που μας ξεπλένει είναι ίσα ίσα που δεν τα φάγαμε, ούτε και η Πουλουδιά που τα ζήτησε. Τουλάχιστον έτσι ξεπλένεται κι εκείνη.
Μόνη η Πουλουδιά δεν είχε μιλήσει. Όσο ήταν παρών ο Γιάννης αισθάνουνταν κάπως σίγουρη και ικανοποιημένη. Μα, μιας και είχε φύγει ο Γιάννης κι έμειναν μεταξύ τους τ' αδέλφια, της φάνηκε πως ξέπεφτε η αξία του, οι αποφάσεις του δεν είχαν πια τη σπουδαιότητα που φαίνουνταν να έχουν την ώρα που τις βεβαίωνε.
Τα λόγια της Αλεξάνδρας της ήλθαν ουρανοκατέβατα, της έδωσαν αέρα. Σήκωσε πάλι το κεφάλι και είπε στερεώνοντας τη φωνή της:
- Ναι, καλύτερα που δεν τα φάγαμε τα μπισκότα. Και η κερα-Ρήνη είπε πως, για να μου δώσουν τόσα, θα ήταν ταγκά...
Με αγανάκτηση τη διέκοψε ο Αντώνης:
- Δεν ντρέπεσαι! Τα μπισκότα του βασιλέα!
Όλα μαζί τ' αδέλφια τής ρίχθηκαν πάλι, και σώπασε η Πουλουδιά ντροπιασμένη, αποθαρρυμένη.
Δεν είχε τύχη σήμερα. Λόγια και πράξεις, όλα της έβγαιναν ξινά.
Και όταν τη ρώτησε η Αλεξάνδρα «Τι ήταν που ήθελες να πεις πριν για τη ραφτομηχανή;», απογοητευμένη αποκρίθηκε: «Τίποτα». Αν το λεγε, θα της έβγαινε κι αυτό στραβό. Θα συμμαχούσε η Αλεξάνδρα με τον Αντώνη και δε θα της έλεγε ο Αντώνης τίποτε άλλη φορά. Και σώπασε. Και μπήκαν μέσα τ' αδέλφια της κι έμεινε μόνη η Πουλουδιά, με μια μεγάλη όρεξη για κλάματα που δύσκολα τα συγκρατούσε. Μα γιατί; Τι της έφταιγε; Ούτε μπάτης γρουσούζης φυσούσε ούτε...
Στο σιδερένιο τραπέζι είχε μείνει ριγμένο το βασιλικό γαλάζιο κοχλάδι με τις κόκκινες πιτσιλάδες και το κόκκινο μεταξωτό μαξιλαράκι. Αυτά ήταν τα γρουσούζικα! Αυτά τα είχαν κάνει όλα... Τ' άρπαξε κι έτρεξε να τα ρίξει στο δρόμο. Η Αφροδίτη στέκουνταν στο πεζοδρόμιο και σιγοκουβέντιαζε με την τραπεζιέρα της Αλίς. Άκουσε τα βήματα και σήκωσε το κεφάλι.
- Τι θέλεις, Πουλουδιά; ρώτησε.
- Τίποτα, αποκρίθηκε η Πουλουδιά κι έκανε να υποχωρήσει κατά την τραπεζαρία. Μα στην πόρτα βρήκε την κερα-Ρήνη που γύρευε την Αφροδίτη.
Την είδε κακόκεφη, γέλασε και της είπε:
- Έλα, τι έχεις πάλι; Μπουρινάκια;
- Όχι... μα... έκανε η Πουλουδιά, όλο και πιο έτοιμη «ν' ανοίξει τις βρύσες», καθώς έλεγε ο Αντώνης.
Η κερα-Ρήνη της έδωσε μια φιλική σπρωξιά.
- Έλα, της είπε, είσαι πάλι στις κακές σου! Μα έχω τρόπο να σε γλυκάνω. Τι μου δίνεις, να σου δώσω εγώ μια κουταλιά σταφύλι γλυκό, που τώρα το κατέβασα από τη φωτιά;
Σταφύλι γλυκό! Το πιο αγαπημένο της! Τα κέφια της Πουλουδιάς ξαναγύρισαν μεμιάς. Αυθόρμητα τέντωσε το χέρι της με τα βασιλικά της δώρα.
- Σου τα δίνω αυτά! είπε ολόκαρδα. Πάρ' τα! Μου τα χάρισε η βασίλισσα κι εγώ σου τα χαρίζω σένα, δεν τα θέλω, είναι γρουσούζικα!
Και πήγε στην κουζίνα και της έδωσε η κερα-Ρήνη ολόκληρο ένα πιατάκι γλυκό, τόσο είχε χαρεί με τα βασιλικά δώρα της Πουλουδιάς.
Η κακή μέρα από το πρωί φαίνεται! Θα δείτε πως όλα θα παν στραβά σήμερα! είπε ο Αντώνης στ' αδέλφια του, πηγαίνοντας στα λουτρά δυο μέρες αργότερα. Και αλήθεια είχε αρχίσει άσχημα η μέρα, από την ώρα που έπεσε ο Αλέξανδρος μες στην μπηγμένη κουνουπιέρα του και πήγε ο Αντώνης να τον ξεσκαλώσει και κατρακύλησε ο Αλέξανδρος ως το αντικρινό ποδάρι του κρεβατιού κι έκανε στο μέτωπο μια μελανιά που φούσκωσε σαν καρύδι.
Και δεν πρόφθασαν να κατέβουν τ' αδέλφια τη σκάλα, και να σου η γάτα της Ρωσίδας κυρίας της Τιμής, που έκλεψε το κασέρι του θείου από το τραπέζι της τραπεζαρίας, και της πέταξε ο Αντώνης ένα ασημένιο κουτάλι που, αντί να βρει τη γάτα, βρήκε τη γυαλόπορτα και κατέβασε, βροντοκοπώντας, ένα ολόκληρο τζάμι. Και βγήκε η θεία με την καμιζόλα της και, μ' όλες τις διαμαρτυρίες του πως δεν έφταιγε αυτός, έφαγε ο Αντώνης την κατσάδα, μαζί κι έναν μπάτσο από το παχύ χεράκι της θείας, και ζεματισμένος ξεκίνησε με τ' αδέλφια του για τα λουτρά.
Μα κι εκεί η γρουσουζιά εξακολούθησε. Ενώ στη σκάλα έβρεχε προσεκτικά η Αλεξάνδρα το μέτωπο της, μην ξεσγουράνει τα κατσαρά της, γυρίζει ο Αντώνης να δει ένα παιδί που νοίκιαζε κολοκύθες, για να κολυμπήσει, λέει, στα βαθιά, και γλιστρά και πάρ' τον κάτω, μαζί και την Αλεξάνδρα, στον πάτο της θάλασσας. Χάλασε ο κόσμος στα λουτρά.
- Σώστε! Ελεήστε! Πνίγονται τα παιδιά!
Δεν πνίγηκαν, γιατί τους ανέβαιναν τα νερά ως τα γόνατα. Μα παν τα κατσαρά. Και δε φθάνει αυτό, μόνο κόλλησε μια τσούχτρα στην πλάτη της Πουλουδιάς, που έβαλε τις φωνές, και, για να τη γλιτώσει, ο Αντώνης τη βούτηξε και αυτήν, και παν και αυτηνής τα κατσαρά. Και, φουρκισμένη τότε η Αφροδίτη, πήρε πηλό και τους έλουσε και των τριών τα μαλλιά στη θάλασσα, και μόνο το ξανθό κεφάλι του Αλέξανδρου γλίτωσε από την οργή της, γιατί ήταν δεμένο μ' ένα μεταξωτό μαντίλι του θείου, που πλάκωνε σφιχτά ένα ασημένιο τάλιρο απάνω στη μελανιά του.
- Κι ακόμα τι έχομε να τραβήξομε! είπε ο Αντώνης, γυρίζοντας από τα λουτρά, στις αδελφές του που πήγαιναν μπροστά μαζί του, ενώ φορτωμένη λουτρικά ακολουθούσε η Αφροδίτη, βαστώντας τον Αλέξανδρο από το χέρι. Τι έχομε να τραβήξομε! Η θεία είναι κιόλα θυμωμένη και η μέρα μόλις αρχίζει!
Στη βεράντα, σαν έφθασαν, ήταν κόσμος. Η Κατίνα και η Κλειώ συζητούσαν με τη θεία που, κόκκινη και αναμμένη, έλεγε και ξανάλεγε:
- Δεν είναι δυνατόν! Σας λέγω πως δεν είναι δυνατόν! Ζωρζή! Έλα έξω! Άκουσε τι λεν τα κορίτσια!
Ο θείος Ζωρζής βγήκε στη βεράντα την ίδια ώρα που ανέβαιναν τα τέσσερα αδέλφια με την Αφροδίτη.
- Τι τρέχει; ρώτησε λίγο μουδιασμένος.
Ο θείος Ζωρζής πάντα μούδιαζε σαν εξάπτουνταν η θεία Μαριέτα. Και βλέποντας τ' ανίψια του, χαμογέλασε το φαρδύ του χαμόγελο.
- Καλώς τα παιδιά, είπε, μπείτε να πάρετε το πρόγευμα σας...
- Άκουσε τώρα δω! διέκοψε η θεία. Τα κορίτσια επιμένουν πως φθάνουν οι δικοί μας από την Αλεξάνδρεια...
- Έφθασαν, θεία! διέκοψε η Κατίνα μ' ένα νάζι του κεφαλιού της.
- Μα πώς το ξέρεις, μπρε παιδάκι μου;
- Αφού πήγε η μητέρα με τον πατέρα κάτω, στο λιμένα, να τους παραλάβουν!
Τα τέσσερα αδέλφια έμειναν εμβρόντητα. Ο θείος Ζωρζής επίσης. Μα η θεία δεν πείθουνταν.
- Αφού έρχονται να κατοικήσουν εδώ, δε θα μας ειδοποιούσαν πρώτα εμάς; Να ετοιμάσομε την κάμαρα τους;
- Μα σας τηλεγράφησαν! Το δικό μας τηλεγράφημα λέγει: «Ειδοποιούμεν Ζωρζήν».
Η θεία γύρισε απότομα.
- Ζωρζή, έλαβες εσύ τηλεγράφημα;
Ο θείος αργοκούνησε το σταχτί κεφάλι του.
- Δεν έλαβα τίποτα, είπε. Και ρώτησε:
- Πότε το λάβατε σεις;
- Προχθές το απόγεμα, αποκρίθηκε η Κλειώ.
Μα έξαφνα έγινε κάτι. Ο Αντώνης έπαθε σα λόξιγκα κι έχωσε τα χέρια του στις τσέπες του. Γύρισαν όλοι και τον είδαν κατακόκκινο, που πασπάτευε, με χέρια που έτρεμαν, ανάμεσα στους θησαυρούς της τσέπης του κι έβγαζε ένα χαρτί διπλωμένο ακόμα, μα σε κακή κατάσταση. Μαύρο, τσαλακωμένο, σχισμένο, μουντζουρωμένο, σα να μην έφθαναν τα χάλια του, μες στις δίπλες του είχε χωθεί ένα κομμάτι μασημένη μαστίχα και πλακώθηκε και αυτή και κόλλησε κι έγινε πίτα.
- Το... το τηλεγράφημα... εγώ το πήρα... μπουρδούμπισε ο Αντώνης, κόκκινος σαν αστακός.
Ο θείος και οι δυο εξαδέλφες έμπηξαν τα γέλια. Μα τα μάτια της θείας έβγαλαν σπίθες, και οι δυο αδελφές του Αντώνη λες και μίκρεψαν, ζάρωσαν, ήθελαν να τις καταπιεί η γη, μαζί με τον Αντώνη, μήπως ξεφύγουν από το θυμό τη θείας, που προμηνύουνταν τρομερός.
- Πώς τόλμησες... άρχισε η θεία.
Μα ο θείος είχε πάρει το κουρελόχαρτο από τα κρεμασμένα χέρια του Αντώνη, το ξεκόλλησε από τη μαστίχα, το άνοιξε και διάβασε: «Φεύγομε σήμερον Αργολίδα, καλήν αντάμωσιν - Μανόλης».
Σήκωσε ο θείος τα ζαρωμένα γελαστά του ματιά στον Αντώνη και ρώτησε:
- Μπρε διαβολάκι, από πότε το έχεις στην τσέπη και δε μιλάς;
- Το... το... τραύλισε ο Αντώνης, από προχθές... το απόγεμα...
Μα η θεία μπήκε στη μέση.
- Χωρατεύεις κιόλα μαζί του, Ζωρζή;... διέκοψε και, γυρνώντας στον άφωνο Αντώνη μάτια φορτωμένα αστροπελέκια, ρώτησε: Από πού το πήρες;
- Δεν το πήρα... μου το έδωσε ο ταχυδρόμος... και περνούσε ο Μπαρμπαγιάννης Κανατάς και...
- Στη σοφίτα! Αμέσως στη σοφίτα! πρόσταξε η θεία, χωρίς καν να τον ακούσει. Τιμωρία! Και θα φθάσουν οι γονείς σου και δε θα είσαι δω να τους υποδεχθείς! Στη σοφίτα! Αμέσως!
Σα διέταζε η θεία, κανένας δεν τολμούσε ν' αντισταθεί. Και γέρνοντας στους ώμους του, με σκυφτό κεφάλι, μπήκε ο Αντώνης στο σπίτι. Μα, μιας και βγήκε από τη βολή των ματιών της θείας, ο Αντώνης επαναστάτησε. Τι, θα έφθαναν οι γονείς του και δε θα ήταν αυτός εκεί να τους δει; Και θα μάθαιναν αμέσως αμέσως αταξίες, κατσάδες, τιμωρίες... Ωωωω!...
Πέταξε ο Αντώνης πάνω το κεφάλι του. Αυτή τη φορά, όχι, δε θα υπακούσει και ας τον δείρει η θεία, σα θέλει. Θα πάγει αυτός στο λιμένα... ήξερε το δρόμο... και αν δεν τον ήξερε, θα τον ξανάβρισκε, αφού από κει ήλθε με τ' αδέλφια του, σαν έφθασαν στον Πειραιά... Και θα τους υποδέχουνταν τους γονείς του, αυτός πρώτος. Και ύστερα... ό,τι βρέξει ας κατεβάσει.
Μπήκε στην είσοδο, είδε τη σκάλα έρημη, άκουσε την κερα- Ρήνη που σκάλιζε τη φωτιά της και, ξεγλιστρώντας κατά την πίσω πόρτα, βγήκε στην αυλή και από κει στο δρόμο. Η βεράντα τώρα και η τραπεζαρία βούιζαν από τις διαταγές της θείας.
- Αμέσως, Αφροδίτη, ακουμπά τα λουτρικά... Όχι εδώ, στην κάμαρα πάνω... Κατίνα, πάρε συ τα κλειδιά μου, άνοιξε την ντολάπα του λινού, βγάλε σεντόνια, πεσκίρια, μαξιλαροθήκες... Κλειώ, τρέχα πες της κερα-Ρήνης να ξεπεταχτεί να πάρει ψάρι... να το κάνει, πες, αλά Σπετσιώτα, που του αρέσει του θείου Μανόλη... Στάσου, Αφροδίτη, πού είσαι; Φέρε πιάτα, φλιτζάνια, ίσως να μην προγευμάτισαν ακόμα... Και, αλήθεια, ούτε τα παιδιά δεν προγευμάτισαν. Αλεξάνδρα, Πουλουδιά, Αλέξανδρε, αμέσως βγάλτε τα καπέλα σας...
Διακόπηκε ξαφνισμένη:
- Τι κεφάλια είναι αυτά; Γιατί δεν κάνατε κατσαρά χθες βράδυ; αναφώνησε.
- Κάναμε, μα... μα... ψέλλισε η Αλεξάνδρα κοιτάζοντας απελπισμένη την Πουλουδιά που, με σκυφτό κεφάλι, από κάτω από τα φρύδια της, έγνεφε του Αλέξανδρου «Μην πεις...».
Μπήκε στη μέση η Αφροδίτη βιαστικά:
- Τις έλουσα στη θάλασσα, είπε, ήταν ελεεινά τα μαλλιά τους και δεν ήξερα πως φθάνουν οι κύριοι...
- Τι ανοησίες! Τις έλουσες χθες! διέκοψε η θεία.
- Ξαναλερώθηκαν, κυρία, ήταν ζέστη χθες, επέμεινε η Αφροδίτη.
- Το πέτυχες! Και τώρα θα τις δει σ' αυτά τα χάλια η μαμά τους, που τις θέλει πάντα τυποδεμένες... και ο Αλέξανδρος με δεμένο το κεφάλι... μπράβο, ωραία μας τα κατάφερε ο Αντώνης...
- Ε, ξέχασε μια φορά και αυτός, είπε καλόκαρδα ο θείος. Μα τον κεραυνοβόλησε μια ματιά της θείας, και σιωπηλά κάθισε στο πρόγευμα και ξεδίπλωσε την πετσέτα του. Ο Αλέξανδρος είχε σκαρφαλώσει στην καρέγλα πλάγι του.
- Και ο Αντώνης; ρώτησε χαμηλόφωνα. Δε θα φάγει, θείε, ο Αντώνης;
Με τα μάτια, γελαστά του έγνεψε ο θείος, κι έγνεψε και στις δυο αδελφές να καθίσουν, ενώ θεία, εξαδέλφες και Αφροδίτη σκορπίζουνταν σ' όλο το σπίτι για να ετοιμάσουν την υποδοχή των γονέων. Τ' αδέλφια πήραν αέρα.
- Θείε, ρώτησε η Αλεξάνδρα, να πάρω στη σοφίτα τον καφέ του Αντώνη;
- Σιγά σιγά, αποκρίθηκε ο θείος, μη θυμώσουμε πάλι τη θεία. Ίσως μπορέσομε να την καταφέρομε να τον συγχωρήσει.
Και σαν κατέβηκε η θεία, με το πράσινο μεταξωτό φόρεμα της, βιαστική, παχουλή, πηδηχτή, καπελωμένη και γαντωμένη, ζεσταμένη από τη βία, μα ευχαριστημένη που ετοιμάστηκε πια η κάμαρα του μουσαφίρη, βρήκε την ώρα κατάλληλη ο θείος και μεσίτεψε για συγχώρηση...
- Ας έχει χάρη που έρχουνται οι γονείς του, ειδεμή... αποκρίθηκε η θεία, ας έχει χάρη! Μα γρήγορα, Ζωρζή, ήλθε το αμάξι, πάμε, μήπως τους προφθάσομε...
Είχε βγει κιόλα στη βεράντα. Δειλά την ακολούθησε η Αλεξάνδρα.
- Να του πούμε να έλθει κάτω, θεία; ρώτησε.
Η θεία είχε κατέβει τα μισά σκαλοπάτια. Μισογύρισε και είπε:
- Πες του πως για χατίρι της μαμάς σας... ναι, τον συγχωρώ αυτή τη φορά! Μα είναι η τελευταία...
Τα υπόλοιπα χάθηκαν μέσα στην κουκούλα, κι έκλεισε η πόρτα πίσω από το θείο. Μα πάλι παρουσιάστηκε το κεφάλι της θείας στο παράθυρο.
- Φρόνιμα, παιδιά! φώναξε. Η Κατίνα και η Κλειώ μας περιμένουν...
Και ξεκίνησε το βαρύ λαντό και ο κρότος σκέπασε τη φωνή της.
Τρεχάτη μπήκε η Αλεξάνδρα στην τραπεζαρία φωνάζοντας:
- Τον συγχώρησε η θεία! Πάμε να τον φέρομε!
Και οι δυο αδελφές πηλάλα ανέβηκαν τη σκάλα, με την Κλειώ πίσω τους, που έπαιρνε τρία τρία τα σκαλοπάτια. Μα σαν έφθασαν ξεφωνίζοντας «Αντώνη! Αντώνη! Έλα κάτω!», η σοφίτα ήταν άδεια, ο Αντώνης είχε εξαφανιστεί. Μεγάλο σούσουρο έγινε στο σπίτι. Ο Αντώνης χάθηκε, ο Αντώνης δεν ήταν πουθενά, ούτε στη σοφίτα ούτε στην αυλή ούτε στην κάμαρα του ούτε στο καρβουναριό. Και μαζεύθηκαν αδέλφια κι εξαδέλφες, και κατάφθασαν Αφροδίτες και κερα-Ρήνες, και καθένας έλεγε το «μήπως» του. - Μήπως πήγε στης Αλίς; έκανε η Αλεξάνδρα.
- Ή πάλι στου βασιλέα; αντίκοψε η Πουλουδιά.
Η Κατίνα, που κοίταζε κατά τον ανήφορο, γύρισε αργά.
- Έτσι πάτε σεις στου βασιλέα; ρώτησε σηκώνοντας τα καλογραμμένα φρύδια της.
- Ναι... όχι... ίσως... μπουρδούμπισε η Πουλουδιά γυρεύοντας μάταια να πάρει πίσω τα λόγια που της είχαν ξεφύγει.
- Όχι, ποτέ! Ποτέ δεν πάμε στου βασιλέα! διαμαρτυρήθηκε η Αλεξάνδρα γυρνώντας αυστηρά στην αδελφή της. Γιατί λες «πάλι»;
- Είπα ίσως... ίσως να δει τον Ντον... απέξω... όχι να ξαναμπεί στην αυλή... και πάλι τα 'χασε η Πουλουδιά και στάθηκε.
- Ξανά; Λοιπόν πηγαίνει κάποτε; ξεκαρδίστηκε και είπε η Κλειώ.
Μα η κερα-Ρήνη μ' ένα λόγο της άλλαξε τον αέρα κι έριξε τρόμο σ' όλες τις όψες.
- Ξανά! Ξανά! είπε κουνώντας το φακιολοδεμένο της κεφάλι. Μήπως ξαναπήγε σε καμιά βάρκα! Μήπως θαλασσοπνίγεται αυτή την ώρα ο Τρελαντώνης μας...
Η Αφροδίτη χλόμιασε. Με το χέρι σκίασε τα μάτια της και κοίταξε τη θάλασσα που τρεμοσάλευε, τυφλωτικά φωτισμένη, στο ηλιοπύρι.
- Όχι, όχι! είπε. Είναι σκάνταλος ο Αντώνης, μα παράκουος δεν είναι...
Η φωνή της, που έτρεμε λιγάκι, τρόμαξε τ' αδέλφια περισσότερο ακόμα και από τα λόγια της κερα-Ρήνης.
- Μήπως πήγε να τιμωρήσει τη γάτα; έριξε ένα λόγο ο Αλέξανδρος.
- Ποια γάτα; ρώτησε με καινούριες ελπίδες η Κλειώ.
- Της Ρωσίδας κυρίας της Τιμής, εξήγησε ο Αλέξανδρος, ενθουσιασμένος που έπιασε ο λόγος του. Έκλεψε το πρωί το τυρί του θείου...
- Πάμε να δούμε! αναφώνησε η Κλειώ. Και όλοι πάλι σκορπίστηκαν.
Μα σαν πήγε η Κλειώ στης Ρωσίδας κυρίας της Τιμής και η κερα-Ρήνη στο βασιλικό μαγειρείο και η Αλεξάνδρα στης Αλίς και η Κατίνα, η Πουλουδιά, η Αφροδίτη και ο Αλέξανδρος έψαξαν το σπίτι από τις κρεβατοκάμαρες ως το πλυσταριό και ξανά τη σοφίτα και το καρβουναριό, και ξαναγύρισαν πάλι στη βεράντα και βεβαιώθηκαν πως ο Αντώνης δεν ήταν πουθενά, η ανησυχία έγινε τρόμος και ο τρόμος απελπισία.
- Σταθείτε όλοι εδώ! Πάγω να δω και παρακάτω! είπε η Αφροδίτη κατεβαίνοντας στο δρόμο.
- Κι εγώ μαζί σου! είπε η Κλειώ πηδώντας δυο δυο τα σκαλοπάτια.
- Εσύ, Κατίνα, φύλαγε τα μικρά! φώναξε η Αφροδίτη.
Και ρίχνοντας την ποδιά της στο κεφάλι της, βιαστικά πήρε τον κατήφορο με την Κλειώ που ξεσκούφωτη, πήγαινε πλάγι της. Μα δεν έκαναν πολύ δρόμο. Δεν είχαν προλάβει ακόμα τον κατήφορο και μπροστά τους είδαν ένα ναυτόπουλο μακρολέλεκα, στ' άσπρα, και πλάγι του ένα μικρότερο με κοντά παντελόνια αγόρι που το βαστούσε ο μακρολέλεκας από το μπράτσο. Πάλι σκίασε η Αφροδίτη τα μάτια της να δει πιο καλά, μα την πρόλαβε η Κλειώ.
- Να τον! αναφώνησε. Και είναι με τον Γιάννη!
Ναι, ήταν ο Γιάννης και, πλάγι του, αργά ανέβαινε ο Αντώνης. Μα δεν είχε ο Αντώνης το γνωστό πετειναρίστικό του αέρα. Πήγαινε με πεσμένα τα φτερά και κρεμασμένο το κεφάλι. Και σαν τον έφθασαν οι δυο γυναίκες, είδαν πως το πρόσωπο του και τα ρούχα του ήταν όλο αίματα.
- Μη χειρότερα! έκανε η Αφροδίτη και δεν μπόρεσε να πει άλλο.
Μα της είπε ο Γιάννης, καθησυχαστικά:
- Δεν είναι τίποτα! Πιάστηκε σε πετροπόλεμο κι έφαγε μια πέτρα...
Καινούριο σούσουρο έγινε στη βεράντα σαν έφθασαν. Ακόμα και η Κατίνα έχασε το πάσο της.
- Τι έπαθε;
- Πώς το 'κανε;
- Έχει πληγή στο μέτωπο!
- Αντώνη, ματώθηκες!
Ο Αντώνης δεν απαντούσε σε κανένα. Σα μισοζαλισμένος, κάθουνταν στην κουνιστή πολυθρόνα της θείας και κοίταζε μια τον έναν, μια τον άλλο και αφήνουνταν στα γοργά χέρια της Αφροδίτης, και σιωπηλά έπινε το δροσερό από τη στάμνα νερό που του είχε φέρει η κερα-Ρήνη.
Και, όπως τη μέρα που τον δάγκασε ο Ντον, όλες φασάρευαν γύρω του, τραπεζιέρα, μαγείρισσα, εξαδέλφες και αδελφές, ποια θα τον πρωτοπλύνει, ποια θα του πρωτοφέρει άρνικα, ξαντό, μαντίλια. Και στο τέλος του έδεσαν το μέτωπο, κι αυτή τη φορά ήταν ο κόμπος από πίσω. Και γονατιστός πλάγι στην πολυθρόνα, ακίνητος, κρατούσε ο Αλέξανδρος μ' ευλάβεια, σα δισκοπότηρο, μια καθαρή φορεσιά.
Και όταν πια, πλυμένος, καθαρισμένος, μαντιλοδεμένος και αλλαγμένος, ξανακάθισε ο Αντώνης στην κουνιστή της θείας πολυθρόνα, ρώτησε η Κλειώ:
Και ποιος σου έριξε την πέτρα;
Μα ο Αντώνης δε μίλησε. Και πήρε το λόγο ο Γιάννης και είπε:
- Κάτι χαμίνια, μαγκόπαιδα μεγάλα, που είχαν μπλέξει σε πετροπόλεμο με μια τσούρμα μαρίδα.
Συγκινημένη χάιδεψε η Αφροδίτη το κεφάλι του Αντώνη.
- Το καημένο! είπε πονόψυχα.
Η κερα-Ρήνη όμως, που με τα χέρια στους γοφούς άκουε και παρακολουθούσε, ρώτησε:
- Μα πώς βρέθηκες εκεί, κυρ Αντώνη; Η θεία σου σε είχε στείλει στη σοφίτα!
Ο Αντώνης δεν αποκρίθηκε.
- Αλήθεια, Αντώνη, πώς βρέθηκες στο δρόμο; ρώτησε η Αλεξάνδρα.
- Εμείς σε γυρεύαμε παντού, σ' όλο το σπίτι... πρόσθεσε η Πουλουδιά.
- Γιατί βγήκες έξω, Αντώνη, επανέλαβε η Αλεξάνδρα, αφού έπρεπε να είσαι στη σοφίτα;
- Γιατί... γιατί, ξέσπασε ο Αντώνης ξαναβρίσκοντας τη φωνή του στην αγανάκτηση του, γιατί δεν ήθελα να είμαι τιμωρημένος, που θα 'ρχουνταν οι γονείς... και πήγα στο λιμένα...
Αστροπελέκι έπεσε στο ακροατήριο.
- Στο λιμένα!
- Μόνος!
- Το 'κανες αυτό!
- Βρήκες το δρόμο!
Τ' αδέλφια του Αντώνη ήταν έτοιμα να προσκυνήσουν. Τους φάνηκε ξαφνικά πως το μαντιλοδεμένο του κεφάλι ακτινοβολούσε.
Ο Αντώνης ήταν φωστήρας! Ο Αντώνης ήταν ήρωας, άξιος να καταπιαστεί τα πιο μεγάλα πράματα!
Μα δεν πρόφθασε ο Αντώνης να χαρεί τη δόξα του. Ρώτησε η Κατίνα:
- Και γιατί γύρισες μόνος σου; Γιατί δεν ήλθες με τους θείους;
Και αποκρίθηκε γελώντας ο Γιάννης:
- Καλέ, εδώ, λίγο παρακάτω τον βρήκα! Και είπε ο Αντώνης, μαζεμένος πάλι:
- Ναι, δεν πρόφθασα να τους βρω! Δεν πρόφθασα ν' ανέβω στο βαπόρι!
- Καλέ, δε λες πως βγήκες στα τρυφερίτσια και σε πιάσανε με τις πέτρες! χαχάνισε η κερα-Ρήνη. Τι μας κρένεις για λιμάνια και βαπόρια; Θα πήγαινες τώρα συ...
- Ναι! Θα πήγαινα! διέκοψε ο Αντώνης με αγανάκτηση. Και θα 'βρισκα το δρόμο μια χαρά!
Τ' αδέλφια θαύμασαν πάλι. Μα η κερα-Ρήνη τους έκοψε τη φόρα:
- Και γιατί δεν πήγε η αφεντιά σου;
- Γιατί ήταν κάτι παιδιά που έπαιζαν ένα παιχνίδι και στάθηκα να δω, είπε ο Αντώνης, κι έπιαναν σκλάβους και τους ξεσκλάβωναν οι άλλοι...
- Έπαιζαν σκλαβάκια, βρε μπούφο! Αμπάριζες δηλαδή! διέκοψε ο Γιάννης.
- Αμπάριζες! Έπαιζαν αμπάριζες! αναφώνησε αναμμένη η Κλειώ. Και δεν μπήκες και συ στο παιχνίδι, Αντώνη!
Ο ενθουσιασμός της Κλειώς ντρόπιασε τον Αντώνη.
- Δεν ήξερα πώς το παίζουν... άρχισε, μα τον διέκοψε η Κλειώ.
- Είχαν καλό αρχηγό; ρώτησε.
- Καλέ, ήταν μαρίδα! αποκρίθηκε ακατάδεχτα ο Γιάννης. Και τους βαλαν εμπρός τα χαμίνια, γιατί ήταν όλα τόσα δα...
- Καθόλου! φώναξε ο Αντώνης και πετάχθηκε από την πολυθρόνα της θείας. Ήταν ένας μικρός που έτρεχε και ξεσκλάβωνε όλους! Μα ήλθε ένας μεγάλος, που δεν ήταν του παιχνιδιού, και του έδωσε μια τρικλοποδιά, έτσι...
Έδωσε και ο Αντώνης μια τρικλοποδιά στο σιδερένιο τραπέζι που έπεσε με πάταγο στις πλάκες της βεράντας και ο κρότος σκέπασε όλα τα ξεφωνητά.
Η κερα-Ρήνη έφυγε τρεχάτη, σκεπάζοντας τ' αυτιά της, και η Αφροδίτη πετάχθηκε, σήκωσε το τραπέζι κι έσπρωξε τον Αντώνη στην κουνιστή πολυθρόνα της θείας.
- Αν δεν κάτσεις ήσυχος, του είπε μαλωσιάρικα, θα σπάσεις και τις πλάκες και τα δικά μας κεφάλια! Στάσου ν' ακούσει η θεία σου πως πιάστηκες με χαμίνια του δρόμου, και να δεις τι έχεις να πάθεις!
- Γιατί; ρώτησε η Κλειώ. Και πρόσθεσε:
- Δεν έχει να πάθει τίποτα ο Αντώνης! Τι έκανε κακό;
- Μπράβο, μπράβο, Κλειώ! Έτσι του λες και παίρνει θάρρος! αναφώνησε η Αφροδίτη. Εγώ νίβω τα χέρια μου πια! Κάνετε σεις καλά!
Και μπήκε στην τραπεζαρία μουρμουρίζοντας και φοβερίζοντας και άρχισε να σηκώνει το τραπέζι.
Η Κλειώ είχε δώσει μια σπρωξιά στην πολυθρόνα της θείας Μαριέτας, που έγειρε βαθιά πίσω και βούτηξε πάλι εμπρός.
- Ουφ! έκανε σκασμένη.
- Έχει δίκαιο η Αφροδίτη! αποφάσισε η Κατίνα.
- Καθόλου! διέκοψε η Κλειώ. Κι εγώ αν έβλεπα να παίζουν αμπάριζες, θα έμπαινα στο παιχνίδι. Καλά έκανες, Αντώνη...
Με το χέρι αναποδογύρισε τα μαλλιά του, τα σήκωσε όλα όρθια πάνω από το μαντιλοδεμένο του μέτωπο.
- Να, τώρα είσαι ωραίος και μ' αρέσεις, μοιάζεις σκαντζόχοιρος! είπε τσαχπίνικα. Και μ' αρέσεις, γιατί όλο αταξίες κάνεις!
Η Αλεξάνδρα και η Πουλουδιά στάθηκαν φρικιασμένες. Ήταν πρώτη φορά που άκουαν τέτοια ηθική. Και ο Αλέξανδρος, που είχε βγάλει μαντίλι και τάλιρο και φεγγοβολούσε με μια μεγάλη μελανιά στο μέτωπο, έμεινε με το στόμα ανοιχτό. Όλοι κοίταζαν την Κλειώ ταραγμένοι. Ακόμα και ο Αντώνης δεν ήξερε τι στάση να πάρει, γιατί δεν ήταν βέβαιος αν κορόιδευε η Κλειώ ή αν εννοούσε όσα έλεγε. Μόνος ο Γιάννης, ακουμπισμένος στον τοίχο, με τα χέρια πίσω του, κρυφογελούσε σιωπηλά.
- Ναι, μ' αρέσεις εσύ, είπε μάγκικα η Κλειώ, γιατί δεν είσαι φρόνιμος και δεν κάνεις τον φρόνιμο. Σπάζεις τζάμια, σπάζεις κεφάλια, προπάντων το δικό σου, τα βάζεις με μαγκόπαιδα δυο φορές μεγαλύτερα σου, τραβάς τ' αυτιά του Ντον, κάνεις όλες τις αταξίες που κάνουν τα κακά παιδιά στα βιβλία!
- Και... και αυτό σ' αρέσει; ρώτησε σαστισμένη η Αλεξάνδρα που ένιωθε μέσα της να κλονίζονται όλα όσα ήξερε για το καλό και το κακό.
- Μ' αρέσει, είπε η Κλειώ, γιατί δεν είναι υποκριτής... Και είναι παλικαράκι!
Μια στιγμή τ' αδέλφια στάθηκαν να συλλογιστούν και να ζυγίσουν αυτά που είπε η μεγάλη εξαδέλφη. Και είπε η Κλειώ:
- Σα βρέθηκε αυτός ο μικρούτσικος Αντώνης... γιατί μαρίδα είναι και αυτός... ανάμεσα σε μεγάλα χαμίνια, δεν το 'στριψε, μόνο τα 'βαλε μαζί τους. Μ' αρέσει που στάθηκε και μετρήθηκε μ' αυτούς κι έφαγε την πέτρα! Η Κατίνα έγειρε πάλι πίσω το κεφάλι της.
- Αυτά δεν είναι καμώματα φρόνιμου παιδιού, είπε μεγαλόπρεπα.
- Βέβαια όχι! είπε ή Κλειώ. Μα δεν είναι φρόνιμος ο Αντώνης, είναι πετειναράκι, και πιάνοντας τον από το πιγούνι: Εσύ μ' αρέσεις, επανέλαβε, επειδή είσαι άτακτος και είσαι και παλικάρι! Κάνεις όλες τις αταξίες, μα δε φοβάσαι και να τις φας! Και γι' αυτό μ' αρέσεις, μ' αρέσεις!
Ο Αντώνης τράβηξε το πιγούνι του από το χέρι της εξαδέλφης του, μισοντροπιασμένος μισοευχαριστημένος, χωρίς να πολυκαταλαβαίνει τι ήταν ωραίο στην αταξία του. Έριξε μια λοξή ματιά στ' αδέλφια του, γυρεύοντας κάπου να στηριχθεί, μ' αντάμωσε το βλέμμα της Αλεξάνδρας τόσο φορτωμένο καταδίκη, που τα έχασε ολότελα. Τον είδε η Κλειώ κι έμπηξε τα γέλια. Και πιάνοντας το κεφάλι του ανάμεσα στα χέρια της, τον φίλησε. Αυτό πια τον αποτελείωσε. Τον Αντώνη! Να τον φιλήσει κορίτσι! Και μπρος στ' αδέλφια του κιόλα! Και σα να μην έφθανε αυτό, έμπηξε και ο Γιάννης τα γέλια! Τα πράματα θα τελείωναν άσχημα, ίσως μ' επανάσταση.
Μα την ίδια στιγμή έγινε σούσουρο, Αφροδίτη και κερα-Ρήνη πετάχθηκαν έξω και κατέβηκαν στο δρόμο όπου, τρίζοντας και στενάζοντας, βουτώντας και κυλώντας, κατάφθαναν δυο λαντά φορτωμένα ανθρώπους και σεντούκια και σταμάτησαν εμπρός στη βεράντα. Αδέλφια κι εξαδέλφια κατρακύλησαν τη σκάλα και χύθηκαν στο δρόμο με φωνές και αλαλαγμούς.
Μόνος ο Αντώνης έμεινε στην πολυθρόνα της θείας Μαριέτας, ανήσυχος, αβέβαιος αν έπρεπε να κατέβει ή να περιμένει την μπόρα εκεί που κάθουνταν. Άκουσε τη φωνή της μαμάς που ρωτούσε: «Μπα! Τι έπαθες, Αλέξανδρε; Και πού είναι ο Αντώνης;» και την είδε που ανέβαινε τρεχάτη, χαρούμενη, κρατώντας τον Αλέξανδρο στην αγκαλιά και τις δυο αδελφές κρεμασμένες στο άλλο της χέρι. Πίσω, γελαστή και ασπροντυμένη, ανέβαινε η θεία Αργίνη. Τότε δε βάσταξε ο Αντώνης. Πετάχθηκε πάνω, χύθηκε στη μαμά του, την αγκάλιασε από τη μέση και ακούμπησε το μέτωπο του στη φούστα της για να κρύψει τα μάτια του που, ήθελε δεν ήθελε, βούρκωναν.
- Τι έπαθες, Αντώνη, χτύπησες; αναφώνησε η μαμά βάζοντας χάμω τον Αλέξανδρο και πιάνοντας στα δυο της χέρια το μαντιλοδεμένο κεφάλι του Αντώνη.
Πηδηχτή και ζεσταμένη ανέβαινε η θεία Μαριέτα με τα εξαδέλφια.
- Πάλι! αναφώνησε σαστισμένη. Πού πληγώθηκες; Έλα να δω!
- Δεν είναι τίποτα, είπε ο Γιάννης, έφαγε μια πέτρα. Επιφωνήματα, ρωτήματα, σύγχυση κι εξηγήσεις, με κάποια χασμωδία, βούιζαν εδώ, εκεί, παντού, όταν, αφού πλήρωσε τ' αμάξια και παρέδωσε στην Αφροδίτη τις αποσκευές, ανέβηκε ο πατέρας στη βεράντα με τους δυο θείους.
Είδε το μελανιασμένο μέτωπο του Αλέξανδρου, το δεμένο κεφάλι του Αντώνη και είπε μισομαλώνοντας μισογελώντας:
- Μα τι πάθαν τα δυο μου αγόρια; Κούτρισαν ο ένας με τον άλλο σαν αυγά του Πάσχα;
Και τότε, τινάζοντας τα δυο της παχιά χεράκια, είπε η θεία Μαριέτα:
- Να παραλάβεις τώρα εσύ το γιο σου, Μανόλη! Εγώ είδα και απόειδα! Τρελαντώνη, Λωλαντώνη τον λέγει η κερα-Ρήνη, μ' αλήθεια, όρια πια δεν έχει η τρέλα του. Πιάστηκε, λέει, σε πετροπόλεμο με χαμίνια του δρόμου κι έσπασε το κεφάλι του.
Μα πώς βρέθηκε στο δρόμο ούτ' εγώ δεν ξέρω.
- Ακόμα δε φθάσαμε, Αντώνη, και από τώρα αταξίες... έκανε θλιμμένη η μαμά.
Μα τη διέκοψε ο θείος Γιώργης:
- Στάσου, Βιργινία, να δούμε πρώτα, είπε.
Και τράβηξε τον Αντώνη ανάμεσα στα γόνατα του, του έλυσε το μαντίλι και ξεσκέπασε μια τρίγωνη τρυπίτσα κόκκινη, μεταξύ στα δυο φρύδια. Την εξέτασε, ζούλησε το μέτωπο ολόγυρα και είπε γελαστά:
- Άιντε, είναι η πρώτη του πολέμου λαβωματιά. Ώσπου να παντρευτεί, θα του περάσει!
Και στη μαμά, που έσκυβε απάνω του ανήσυχη, είπε ζωηρά:
- Δέσε του το κεφάλι, Βιργινία, και μην ανησυχείς. Δε θα πεθάνει τούτη τη φορά!
Μα τα φρύδια του πατέρα έμεναν σουρωμένα, τα μαύρα μάτια του απειλούσαν βροντές και αστραπές.
- Πώς έφαγες την πέτρα; ρώτησε.
- Ήταν πετροπόλεμος, είπε μουδιασμένος ο Αντώνης, και βρέθηκα κι εγώ στη μέση... και μου έριξε ένα παιδί μια σπασμένη κεραμίδα...
- Τ' ακούς; Τ' ακούς; Και του είναι απαγορευμένο να παίζει στο δρόμο με άγνωστα παιδιά! διέκοψε η θεία.
Τα πράματα έπαιρναν πολύ άσχημη όψη. Τ' αδέλφια του Αντώνη άρχισαν να τρέμουν. Πετάχθηκε τότε η Κλειώ και είπε:
- Σα βρεθείς στη μέση, θεία μου, δεν μπορείς να μην πολεμήσεις και συ. Σας βεβαιώνω πως και ο Γιάννης το ίδιο θα έκανε.
- Δηλαδή το ίδιο έκανα! διόρθωσε ο Γιάννης.
- Τι; Ανακατώθηκες στον πετροπόλεμο; Έριξες και συ πέτρες; ρώτησε σαστισμένη η θεία Μαριέτα.
- Και βέβαια έριξα, κι έφαγα μερικές, μα όχι στο κεφάλι.
Ο Αντώνης ήταν πιο άτυχος και την έφαγε στο πρόσωπο. Αγανακτισμένη γύρισε η θεία Μαριέτα στη θεία Αργίνη.
- Και το επιτρέπεις εσύ; ρώτησε. Η θεία Αργίνη γέλασε.
- Όχι, είπε, δεν το επιτρέπω, και το ξέρει ο Γιάννης. Και δε θα έπαιζε πετροπόλεμο χωρίς ανάγκη. Κάτι θα 'τυχε. Πες, Γιάννη, πώς έγινε;
Και είπε ο Γιάννης:
- Ήταν κάτι χαμίνια, κοτζά αγόρια, που πιάστηκαν με μια τσούρμα μικρά, μαρίδα τόση δα, και τη βάλανε μπροστά. Τα μικρά διαφεντεύθηκαν τότε με πέτρες, έριξαν και οι μεγάλοι και άναψε ο πετροπόλεμος. Μπήκε στη μάχη και ο Αντώνης, τον είδα από μακριά κι έτρεξα κι εγώ, κι έριξα κι εγώ πέτρες και τους σκόρπισα: Αυτό ήταν όλο!
- Τ' ακούς; Τ' ακούς, Μανόλη; αναφώνησε η θεία Μαριέτα.
- Τ' ακούω, είπε ήσυχα ο πατέρας.
Και κοιτάζοντας τον Αντώνη από κάτω από τα πυκνά του φρύδια, ρώτησε:
- Ένα πράμα ήθελα να ξέρω. Γιάννη, σαν είδες τον Αντώνη να ρίχνει πέτρες, σε ποιο στρατόπεδο πολεμούσε; Με τη μαρίδα ή με τα χαμίνια;
- Με τη μαρίδα, βέβαια! Μπήκε στη μάχη την ώρα που υποχωρούσαν οι μικροί και τις έτρωγαν!
- Φαντάσου τι μπορούσε να πάθει... έκανε η μαμά. Μα τη διέκοψε ο πατέρας:
- Ε, καλά! είπε ξεσουρώνοντας τα φρύδια του. Αν ήταν με τη μαρίδα, χαλάλι του, και ας πάθαινε. Αν μου έλεγαν όμως, Αντώνη, πως πήγες με τους πιο δυνατούς, θα τελείωνε άσχημα η σημερινή μας συνάντηση. Μα, μιας και πολέμησες με τους μικρούς, που τις έτρωγαν κιόλα από τους μεγάλους, όχι μόνο δε θα σε τιμωρήσω, μα και θα σου πω πως έκανες καλά. Και τώρα, έλα να με φιλήσεις!
Ουφ! Τι ξαλάφρωμα για τ' αδέλφια του Αντώνη! Και για τον Αντώνη τι καμάρι τα λόγια του πατέρα! Όλοι μαζί μιλούσαν, φώναζαν, γελούσαν. Και μυστικά τσίμπησε σιγά ο Αντώνης το μπράτσο της Κλειώς και της είπε:
- Εσύ πρώτη είπες έναν καλό λόγο... Εσύ άξιζε να είσαι αγόρι!
- Γιατί; ρώτησε ξεκαρδισμένη η Κλειώ. Τα κορίτσια δε λεν σωστά λόγια; Ή μήπως γιατί είπα πως μ' αρέσεις, πως είσαι πετειναράκι και παλικάρι;
- Μα εσύ δε φοβήθηκες να μιλήσεις της θείας! είπε ο Αντώνης. Εσύ είσαι παλικάρι, είσαι σαν άντρας!
- Α, μπράβο! έκανε η Κλειώ. Και οι γυναίκες, νομίζεις, δεν είναι παλικάρια; Αμέ η Μπουμπουλίνα; Αμέ η Μαντώ Μαυρογένη; Αμέ η Μόσχω Τζαβέλλα; Αυτές δεν ήταν παλικάρια;
Ο Αντώνης δεν είχε ακούσει ούτε τη Μαντώ Μαυρογένη ούτε τη Μόσχω Τζαβέλλα και την Μπουμπουλίνα την ήξερε μόνο σα φιγούρα καραβιού, όρθια στην πλώρη, με φουσκωμένα τα πανιά πίσω της. Έτσι την είχε δει πάντα σ' ένα άδετο κακοτυπωμένο και κουρελιασμένο βιβλίο του Στάμου, που είχε πει της Πουλουδιάς μια μέρα, σαν κόπηκε κι έκλαιγε: «Πώς θα γίνεις Μπουμπουλίνα, αν κλαις για λίγο αίμα;» Μα τι έκανε η Μπουμπουλίνα δεν ήξερε, γιατί δεν το ήξερε ούτε ο Στάμος. Και λίγο ντροπιασμένος για την άγνοια του, ρώτησε ο Αντώνης:
- Και τι κάναν αυτές και ήταν παλικάρια;
Μα δεν πρόφθασε η Κλειώ ν' αποκριθεί. Άπλωσε η θεία Αργίνη το χέρι της και τράβηξε τον Αντώνη κοντά της.
- Θα τις μάθεις όλες τώρα, τις ηρωίδες της Επανάστασης, είπε γελαστά, και αυτές και άλλες και άλλους. Θα σου τα πει όλα ο Γιάννης, που τα ξέρει απέξω κι ανακατωτά, τώρα που θα μας μείνεις. Και στις παύσεις θα 'χομε μεις άλλο ένα μεγάλο αγόρι στο σπίτι.
Ο Αντώνης δεν κατάλαβε. Γύρισε στον πατέρα και στη μαμά τα σαστισμένα μάτια του.
- Ε, βέβαια, είναι πια μεγάλο αγόρι, είπε ο θείος Ζωρζής χαϊδεύοντας τις φαβορίτες του και χαμογελώντας με το πλατύ του χαμόγελο, είναι πια καιρός να πάγει σχολείο.
Στη σάστισή του ο Αντώνης ξαναβρήκε τη φωνή του.
- Θα πάγω σχολείο, μπαμπά; φώναξε. Ο πατέρας γέλασε.
- Αμέ γιατί, νομίζεις, ήλθαμε; Για να σου βρούμε σχολείο! αποκρίθηκε.
Τα γαλανά μάτια της μαμάς είχαν βουρκώσει.
- Λυπάσαι; ρώτησε.
- Αχ, όχι!
Του ξέφυγε του Αντώνη η φωνή του και στάθηκε ντροπιασμένος, διστακτικός για τη χαρά του, την ώρα που βούρκωνε η μαμά. Μα ο πατέρας έβαλε τα πράματα στη θέση τους.
- Βέβαια και δε λυπάται, έστω και αν χωρίζεται από μας. Στο σχολείο θα μάθει έναν κόσμο πράματα και θα έχει συμμαθητές και φίλους...
- Και θα παίζομε σκλαβάκια! φώναξε ο Αντώνης διακόπτοντας τον πατέρα του, στον ενθουσιασμό του απάνω.
- Και θα μάθεις πρώτα πρώτα πειθαρχία και να μη διακόπτεις τους μεγαλύτερους σου, παρατήρησε η θεία Μαριέτα.
- Θα μάθει να είναι και πιο φρόνιμος ελπίζω, πρόσθεσε ο μπαμπάς σουρώνοντας λαφριά τα φρύδια του. Η θεία σου μου λέγει...
- Πως είναι λίγο σκάνταλος, διέκοψε η θεία Αργίνη, με το γλυκό χαμόγελο της. Μα στο σχολείο όλα αυτά θα διορθωθούν. Και ο Γιάννης ήταν σκάνταλος. Και όμως τώρα φρονίμεψε και μ' ακούει. Ε, Γιάννη;
Ο Γιάννης δε μίλησε. Χαμογέλασε μόνο κι έγειρε πίσω το κεφάλι του με το νάζι της Κατίνας.
- Όλα τ' αγόρια έχουν ανάγκη από σχολείο. Στρώνει το χαρακτήρα, είπε ο θείος ο γιατρός και χαμογέλασε κι εκείνος κουνώντας πάνω κάτω το κεφάλι. Αν δεν τριφτείς με συντρόφους και αν δε φας μερικές καρπαζιές... δε γίνεσαι άνθρωπος. Άιντε, έλα, Αργίνη. Μας περιμένουν τα μικρά. Κατίνα, Κλειώ, Γιάννη, εμπρός, πάμε σπίτι. Χαμηλόφωνα, με μια φιλική σπρωξιά στον Αντώνη, είπε η Κλειώ:
- Θα τις φας, μα και θα τις δώσεις, ε, Αντώνη; Και πετροπόλεμο, ξέρεις... παίζουν και στα σχολεία...
Του έκανε μαριόλικα το μάτι και ακολούθησε τη θεία Αργίνη που, από τη σκάλα της βεράντας, γύριζε να τη φωνάξει. Πού να κοιμηθούν εκείνο το βράδυ τα τέσσερα αδέλφια! Καθισμένα στα κρεβάτια τους, με τις κουνουπιέρες πεταμένες πίσω, είχαν στήσει συμβούλιο. Το φως του φεγγαριού, που χύνουνταν στην κάμαρα από τη διάπλατα ανοιγμένη μπαλκονόπορτα, άσπριζε τα χαρτιά, τυλιγμένα στα μαλλιά των κοριτσιών, το μαντιλοδεμένο κεφάλι του Αντώνη και ξεχώριζε σκιερή στο μέτωπο του Αλέξανδρου την πρωινή του μελανιά. Αγκαλιάζοντας από πάνω από το μακρύ του νυχτικό τα σηκωμένα γόνατα του και διακόπτοντας των μεγάλων το συμβούλιο, ρώτησε ο Αλέξανδρος:
- Αντώνη, πώς θα γίνεις περιβολάρης της θείας της Αλίς στην Κηφισιά, αφού θα πας στο σχολείο του Βούλγαρη;
Αποφασιστικά αποκρίθηκε ο Αντώνης:
- Εγώ δε θα γίνω περιβολάρης!
- Θα γίνεις λοιπόν καπετάνιος; Μα πώς θα πηγαίνεις με τη βάρκα, αφού το σχολείο είναι στην Αθήνα και η θάλασσα είναι εδώ;
- Ούτε καπετάνιος δε θα γίνω! διέκοψε ο Αντώνης. Θα γίνω αξιωματικός και θα πολεμώ όλη μέρα.
Και ανάβοντας με τα ίδια του τα λόγια, εξακολούθησε όλο και με περισσότερη έξαψη:
- Σήμερα πολέμησα και σήμερα κατάλαβα τι χάζι έχει αυτό που είπε η Κλειώ, να τρως καρπαζιές και να τις δίνεις...
Και κάνοντας ξένο κεφάλι το ένα του γόνατο, του τράβηξε μια καρπαζιά, ύστερα στο άλλο και πάλι στο πρώτο: «Να, έτσι, παφ εσύ και παφ κι εσύ, παφ κι εγώ», κι έδινε και μια στο σβέρκο του, και πάλι στο άλλο του γόνατο, «παφ κι εσύ», και ύστερα στον ώμο του, ολάκερη μάχη γίνουνταν από τον Αντώνη εναντίον του Αντώνη. Και τότε η Πουλουδιά έσπασε πρώτη τον κανόνα. Ο ενθουσιασμός του Αντώνη τη συνεπήρε τόσο, που κρέμασε ένα πόδι έξω από τα σεντόνια, ύστερα και το άλλο, τη μιμήθηκε ο Αλέξανδρος, τον ακολούθησε η Αλεξάνδρα, κι έξαφνα βρέθηκαν τα τρία αδέλφια καθισμένα πάνω στο ένα κρεβάτι, του Αντώνη που, ανασηκωμένος ανάμεσα τους μ' ενθουσιασμό ακράτητο και χειρονομίες μπόλικες, ξαναπαράσταινε τους πρωινούς του ηρωισμούς.
Άκουαν τα κορίτσια και θαύμαζαν. Άκουε ο Αλέξανδρος και θαύμαζε κι εκείνος. Και τώρα που θ' αποχωρίζουνταν τον Αντώνη, δεν τους πείραζε να του δείξουν πως αναγνώριζαν την υπεροχή του, την τόλμη του, την ατρομησιά και τη γρηγοράδα του. Κι έλεγε ο Αντώνης και άκουαν τ' αδέλφια του, και σηκώθηκε ο Αντώνης όρθιος και ξαναπολέμησε όλο τον πρωινό πετροπόλεμο και κάτι περισσότερο. Κι έτρεψε σε φυγή όλα τα χαμίνια της πρωινής μάχης και άλλα τόσα της φαντασίας του. Και σαν είδε τον εαυτό του μόνο και νικητή, ανάμεσα στα θαμπωμένα από τα κατορθώματα του αδέλφια του, δε βάσταξε. Έβαλε κάτω το κεφάλι του κι έκανε μια τούμπα ξεφωνίζοντας:
- Ζήτωωω!...
Μα στον ενθουσιασμό του δεν πρόφθασε να μετρήσει την απόσταση, και τα πόδια του βρόντησαν στα σίδερα του κρεβατιού, που γκρεμοτσακίστηκαν με πάταγο στο πάτωμα. Και όπου φύγει φύγει τ' άλλα τρία αδέλφια, που ξαναχώθηκαν άψε σβήσε κάτω από τα σεντόνια τους. Και γέμισε η κάμαρα κόσμο. Μαμά, θεία, θείος, πατέρας, Αφροδίτη, κερα-Ρήνη, σαν από μαγεία βρέθηκαν όλοι στη μέση. Τα τρία αδέλφια ήταν στα κρεβάτια τους, μα οι κουνουπιέρες είχαν μείνει στυλωμένες, και ο Αντώνης, λίγο ζαλισμένος από τούμπα και κρότους, κάθουνταν στο χαλασμένο του κρεβάτι άφωνος σαν ψάρι. Η μαμά και η θεία, τρομαγμένες, γύρευαν λαβωμένους και σκοτωμένους. Ο θείος, μ' ένα κερί στο χέρι, μισογελούσε και ο πατέρας μισοσούφρωνε τα δασιά του φρύδια.
- Έπεσε το σίδερο του κρεβατιού; ρώτησε. Κανένας δε μίλησε.
Κι η κερα-Ρήνη πλησίασε, έπιασε τα δυο πόδια του Αντώνη, τα σήκωσε και όλοι είδαν στο καθένα από ένα πλατύ γδάρσιμο που μάτωνε και κοκκίνιζε τα σεντόνια.
- Τον χτύπησε το σίδερο πέφτοντας! Αχ, το καημένο! αναφώνησε η θεία.
Κι έτρεξε η Αφροδίτη κι έφερε πάλι άρνικα, ξαντό και μαντίλια κι έδεσε τα πληγωμένα πόδια, όπως είχε δέσει το πρωί το πληγωμένο κεφάλι, και μαμά και θεία πλάγιασαν τρυφερά τον Αντώνη στο ξαναφτιαγμένο του κρεβάτι, με μαντιλοδεμένα κορυφή και πόδια. Και σαν τον φίλησαν και τον φασάρεψαν και τον χάιδεψαν και του κατέβασαν την κουνουπιέρα του και τις κουνουπιέρες των αδελφών του, και τον παρηγόρησαν για τις καινούριες του πληγές, μαμά και θεία τού ευχήθηκαν περαστικά και βγήκαν στις μύτες των ποδαριών, πίσω από τον πατέρα και το θείο. Κάμποση ώρα τα τέσσερα αδέλφια έμειναν σιωπηλά, λίγο σαστισμένα για την τροπή που είχαν πάρει τα πράματα και λίγο ντροπιασμένα για την απίστευτη ατιμωρησία. Και πρώτος ο Αλέξανδρος έκοψε τη σιωπή με τα ψιθυρίσματα του:
- Αντώνη, είπε χαμηλόφωνα, εσύ δεν ξέρεις τίποτα. Εσύ είπες σήμερα πως η κακή μέρα από το πρωί φαίνεται, και όμως σήμερα ήταν η πιο ωραία μέρα! Ήλθαν οι γονείς και μας έφεραν εμάς τουφέκια και σπαθιά, και κουζίνα της Αλεξάνδρας, και φλιτζάνια και πιάτα της Πουλουδιάς, και κανένας δε σε μάλωσε για τον πετροπόλεμο. Και τώρα που έσπασες το κρεβάτι σου, πάλι κανένας δε σε μάλωσε...
Τον διέκοψε ο Αντώνης:
- Και πρώτον δεν είπε κανένας πως έσπασα εγώ το κρεβάτι, αποκρίθηκε ξεχνώντας να μιλήσει σιγά. Είπε ο θείος πως ήταν παλιό κι έσπασε μόνο του! Και ύστερα, εσύ να μην ξεφυτρώνεις εκεί που δε σε σπέρνουν...
- Τι τρέχει απάνω πάλι; ακούστηκε η ανήσυχη φωνή της μαμάς από κάτω κι ευθύς η απάντηση της Αφροδίτης από πάνω:
- Τίποτα, κυρία Βιργινία, εγώ συγυρίζω.
Και μπαίνοντας στην κάμαρα, θυμωμένα ψιθύρισε η Αφροδίτη:
- Θα ησυχάσετε, θηρία; Ή να φωνάξω τον μπαμπά να του πω πως έκανες μια τούμπα κι έσπασες το κρεβάτι; Θαρρείς πως δεν το κατάλαβε η κερα-Ρήνη, και ας μη μίλησε; Αντώνη, Τρελαντώνη, Ζουρλαντώνη, Λωλαντώνη, καλά σε λέγει η κερα-Ρήνη! Θα μας τρελάνεις όλους! Κοιμήσου αμέσως!
Όλα τ' αδέλφια ζάρωσαν. Γύρισε και ο Αντώνης από τον τοίχο κι έκλεισε τα μάτια του. Αυτή η κερα-Ρήνη! Τίποτα ωστόσο δεν της ξέφευγε! Μα θα της ξεφύγει αυτός τώρα που θα πάγει σχολείο! Αχ! σαν πάγει σχολείο... Θα είναι πια με αγόρια... όλο με αγόρια... θα παίζουν πάλι σκλαβάκια... θα πολεμούν όλη μέρα... θα σπάζουν κεφάλια... θα παλεύουν, θα τραβούν σπαθιές, τουφεκιές, κανονιές... θα... θα... Και τον πήρε ο ύπνος με χίλια όνειρα ηρωικά.
EOT;
    /*
    *** START: FULL LICENSE ***
        Creative Commons Legal Code
        Attribution-ShareAlike 3.0 Unported
    
    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE
    LEGAL SERVICES. DISTRIBUTION OF THIS LICENSE DOES NOT CREATE AN
    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS
    INFORMATION ON AN "AS-IS" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES
    REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR
    DAMAGES RESULTING FROM ITS USE. License
        THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS
    CREATIVE COMMONS PUBLIC LICENSE ("CCPL" OR "LICENSE"). THE WORK IS
    PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE
    WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS
    PROHIBITED.
        BY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND
    AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS
    LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU
    THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH
    TERMS AND CONDITIONS.
        1. Definitions
        "Adaptation" means a work based upon the Work, or upon the Work and
    other pre-existing works, such as a translation, adaptation,
    derivative work, arrangement of music or other alterations of a
    literary or artistic work, or phonogram or performance and includes
    cinematographic adaptations or any other form in which the Work may be
    recast, transformed, or adapted including in any form recognizably
    derived from the original, except that a work that constitutes a
    Collection will not be considered an Adaptation for the purpose of
    this License. For the avoidance of doubt, where the Work is a musical
    work, performance or phonogram, the synchronization of the Work in
    timed-relation with a moving image ("synching") will be considered an
    Adaptation for the purpose of this License. "Collection" means a
    collection of literary or artistic works, such as encyclopedias and
    anthologies, or performances, phonograms or broadcasts, or other works
    or subject matter other than works listed in Section 1(f) below,
    which, by reason of the selection and arrangement of their contents,
    constitute intellectual creations, in which the Work is included in
    its entirety in unmodified form along with one or more other
    contributions, each constituting separate and independent works in
    themselves, which together are assembled into a collective whole. A
    work that constitutes a Collection will not be considered an
    Adaptation (as defined below) for the purposes of this License.
    "Creative Commons Compatible License" means a license that is listed
    at http://creativecommons.org/compatiblelicenses that has been
    approved by Creative Commons as being essentially equivalent to this
    License, including, at a minimum, because that license: (i) contains
    terms that have the same purpose, meaning and effect as the License
    Elements of this License; and, (ii) explicitly permits the relicensing
    of adaptations of works made available under that license under this
    License or a Creative Commons jurisdiction license with the same
    License Elements as this License. "Distribute" means to make available
    to the public the original and copies of the Work or Adaptation, as
    appropriate, through sale or other transfer of ownership. "License
    Elements" means the following high-level license attributes as
    selected by Licensor and indicated in the title of this License:
    Attribution, ShareAlike. "Licensor" means the individual, individuals,
    entity or entities that offer(s) the Work under the terms of this
    License. "Original Author" means, in the case of a literary or
    artistic work, the individual, individuals, entity or entities who
    created the Work or if no individual or entity can be identified, the
    publisher; and in addition (i) in the case of a performance the
    actors, singers, musicians, dancers, and other persons who act, sing,
    deliver, declaim, play in, interpret or otherwise perform literary or
    artistic works or expressions of folklore; (ii) in the case of a
    phonogram the producer being the person or legal entity who first
    fixes the sounds of a performance or other sounds; and, (iii) in the
    case of broadcasts, the organization that transmits the broadcast.
    "Work" means the literary and/or artistic work offered under the terms
    of this License including without limitation any production in the
    literary, scientific and artistic domain, whatever may be the mode or
    form of its expression including digital form, such as a book,
    pamphlet and other writing; a lecture, address, sermon or other work
    of the same nature; a dramatic or dramatico-musical work; a
    choreographic work or entertainment in dumb show; a musical
    composition with or without words; a cinematographic work to which are
    assimilated works expressed by a process analogous to cinematography;
    a work of drawing, painting, architecture, sculpture, engraving or
    lithography; a photographic work to which are assimilated works
    expressed by a process analogous to photography; a work of applied
    art; an illustration, map, plan, sketch or three-dimensional work
    relative to geography, topography, architecture or science; a
    performance; a broadcast; a phonogram; a compilation of data to the
    extent it is protected as a copyrightable work; or a work performed by
    a variety or circus performer to the extent it is not otherwise
    considered a literary or artistic work. "You" means an individual or
    entity exercising rights under this License who has not previously
    violated the terms of this License with respect to the Work, or who
    has received express permission from the Licensor to exercise rights
    under this License despite a previous violation. "Publicly Perform"
    means to perform public recitations of the Work and to communicate to
    the public those public recitations, by any means or process,
    including by wire or wireless means or public digital performances; to
    make available to the public Works in such a way that members of the
    public may access these Works from a place and at a place individually
    chosen by them; to perform the Work to the public by any means or
    process and the communication to the public of the performances of the
    Work, including by public digital performance; to broadcast and
    rebroadcast the Work by any means including signs, sounds or images.
    "Reproduce" means to make copies of the Work by any means including
    without limitation by sound or visual recordings and the right of
    fixation and reproducing fixations of the Work, including storage of a
    protected performance or phonogram in digital form or other electronic
    medium. 2. Fair Dealing Rights. Nothing in this License is intended to
    reduce, limit, or restrict any uses free from copyright or rights
    arising from limitations or exceptions that are provided for in
    connection with the copyright protection under copyright law or other
    applicable laws.
        3. License Grant. Subject to the terms and conditions of this License,
    Licensor hereby grants You a worldwide, royalty-free, non-exclusive,
    perpetual (for the duration of the applicable copyright) license to
    exercise the rights in the Work as stated below:
        to Reproduce the Work, to incorporate the Work into one or more
    Collections, and to Reproduce the Work as incorporated in the
    Collections; to create and Reproduce Adaptations provided that any
    such Adaptation, including any translation in any medium, takes
    reasonable steps to clearly label, demarcate or otherwise identify
    that changes were made to the original Work. For example, a
    translation could be marked "The original work was translated from
    English to Spanish," or a modification could indicate "The original
    work has been modified."; to Distribute and Publicly Perform the Work
    including as incorporated in Collections; and, to Distribute and
    Publicly Perform Adaptations. For the avoidance of doubt:
        Non-waivable Compulsory License Schemes. In those jurisdictions in
    which the right to collect royalties through any statutory or
    compulsory licensing scheme cannot be waived, the Licensor reserves
    the exclusive right to collect such royalties for any exercise by You
    of the rights granted under this License; Waivable Compulsory License
    Schemes. In those jurisdictions in which the right to collect
    royalties through any statutory or compulsory licensing scheme can be
    waived, the Licensor waives the exclusive right to collect such
    royalties for any exercise by You of the rights granted under this
    License; and, Voluntary License Schemes. The Licensor waives the right
    to collect royalties, whether individually or, in the event that the
    Licensor is a member of a collecting society that administers
    voluntary licensing schemes, via that society, from any exercise by
    You of the rights granted under this License. The above rights may be
    exercised in all media and formats whether now known or hereafter
    devised. The above rights include the right to make such modifications
    as are technically necessary to exercise the rights in other media and
    formats. Subject to Section 8(f), all rights not expressly granted by
    Licensor are hereby reserved.
        4. Restrictions. The license granted in Section 3 above is expressly
    made subject to and limited by the following restrictions:
        You may Distribute or Publicly Perform the Work only under the terms
    of this License. You must include a copy of, or the Uniform Resource
    Identifier (URI) for, this License with every copy of the Work You
    Distribute or Publicly Perform. You may not offer or impose any terms
    on the Work that restrict the terms of this License or the ability of
    the recipient of the Work to exercise the rights granted to that
    recipient under the terms of the License. You may not sublicense the
    Work. You must keep intact all notices that refer to this License and
    to the disclaimer of warranties with every copy of the Work You
    Distribute or Publicly Perform. When You Distribute or Publicly
    Perform the Work, You may not impose any effective technological
    measures on the Work that restrict the ability of a recipient of the
    Work from You to exercise the rights granted to that recipient under
    the terms of the License. This Section 4(a) applies to the Work as
    incorporated in a Collection, but this does not require the Collection
    apart from the Work itself to be made subject to the terms of this
    License. If You create a Collection, upon notice from any Licensor You
    must, to the extent practicable, remove from the Collection any credit
    as required by Section 4(c), as requested. If You create an
    Adaptation, upon notice from any Licensor You must, to the extent
    practicable, remove from the Adaptation any credit as required by
    Section 4(c), as requested. You may Distribute or Publicly Perform an
    Adaptation only under the terms of: (i) this License; (ii) a later
    version of this License with the same License Elements as this
    License; (iii) a Creative Commons jurisdiction license (either this or
    a later license version) that contains the same License Elements as
    this License (e.g., Attribution-ShareAlike 3.0 US)); (iv) a Creative
    Commons Compatible License. If you license the Adaptation under one of
    the licenses mentioned in (iv), you must comply with the terms of that
    license. If you license the Adaptation under the terms of any of the
    licenses mentioned in (i), (ii) or (iii) (the "Applicable License"),
    you must comply with the terms of the Applicable License generally and
    the following provisions: (I) You must include a copy of, or the URI
    for, the Applicable License with every copy of each Adaptation You
    Distribute or Publicly Perform; (II) You may not offer or impose any
    terms on the Adaptation that restrict the terms of the Applicable
    License or the ability of the recipient of the Adaptation to exercise
    the rights granted to that recipient under the terms of the Applicable
    License; (III) You must keep intact all notices that refer to the
    Applicable License and to the disclaimer of warranties with every copy
    of the Work as included in the Adaptation You Distribute or Publicly
    Perform; (IV) when You Distribute or Publicly Perform the Adaptation,
    You may not impose any effective technological measures on the
    Adaptation that restrict the ability of a recipient of the Adaptation
    from You to exercise the rights granted to that recipient under the
    terms of the Applicable License. This Section 4(b) applies to the
    Adaptation as incorporated in a Collection, but this does not require
    the Collection apart from the Adaptation itself to be made subject to
    the terms of the Applicable License. If You Distribute, or Publicly
    Perform the Work or any Adaptations or Collections, You must, unless a
    request has been made pursuant to Section 4(a), keep intact all
    copyright notices for the Work and provide, reasonable to the medium
    or means You are utilizing: (i) the name of the Original Author (or
    pseudonym, if applicable) if supplied, and/or if the Original Author
    and/or Licensor designate another party or parties (e.g., a sponsor
    institute, publishing entity, journal) for attribution ("Attribution
    Parties") in Licensor's copyright notice, terms of service or by other
    reasonable means, the name of such party or parties; (ii) the title of
    the Work if supplied; (iii) to the extent reasonably practicable, the
    URI, if any, that Licensor specifies to be associated with the Work,
    unless such URI does not refer to the copyright notice or licensing
    information for the Work; and (iv) , consistent with Ssection 3(b), in
    the case of an Adaptation, a credit identifying the use of the Work in
    the Adaptation (e.g., "French translation of the Work by Original
    Author," or "Screenplay based on original Work by Original Author").
    The credit required by this Section 4(c) may be implemented in any
    reasonable manner; provided, however, that in the case of a Adaptation
    or Collection, at a minimum such credit will appear, if a credit for
    all contributing authors of the Adaptation or Collection appears, then
    as part of these credits and in a manner at least as prominent as the
    credits for the other contributing authors. For the avoidance of
    doubt, You may only use the credit required by this Section for the
    purpose of attribution in the manner set out above and, by exercising
    Your rights under this License, You may not implicitly or explicitly
    assert or imply any connection with, sponsorship or endorsement by the
    Original Author, Licensor and/or Attribution Parties, as appropriate,
    of You or Your use of the Work, without the separate, express prior
    written permission of the Original Author, Licensor and/or Attribution
    Parties. Except as otherwise agreed in writing by the Licensor or as
    may be otherwise permitted by applicable law, if You Reproduce,
    Distribute or Publicly Perform the Work either by itself or as part of
    any Adaptations or Collections, You must not distort, mutilate, modify
    or take other derogatory action in relation to the Work which would be
    prejudicial to the Original Author's honor or reputation. Licensor
    agrees that in those jurisdictions (e.g. Japan), in which any exercise
    of the right granted in Section 3(b) of this License (the right to
    make Adaptations) would be deemed to be a distortion, mutilation,
    modification or other derogatory action prejudicial to the Original
    Author's honor and reputation, the Licensor will waive or not assert,
    as appropriate, this Section, to the fullest extent permitted by the
    applicable national law, to enable You to reasonably exercise Your
    right under Section 3(b) of this License (right to make Adaptations)
    but not otherwise. 5. Representations, Warranties and Disclaimer
        UNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING,
    LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR
    WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED,
    STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF
    TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE,
    NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY,
    OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE.
    SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES,
    SO SUCH EXCLUSION MAY NOT APPLY TO YOU.
        6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY
    APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY
    LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR
    EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK,
    EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
        7. Termination
        This License and the rights granted hereunder will terminate
    automatically upon any breach by You of the terms of this License.
    Individuals or entities who have received Adaptations or Collections
    from You under this License, however, will not have their licenses
    terminated provided such individuals or entities remain in full
    compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will
    survive any termination of this License. Subject to the above terms
    and conditions, the license granted here is perpetual (for the
    duration of the applicable copyright in the Work). Notwithstanding the
    above, Licensor reserves the right to release the Work under different
    license terms or to stop distributing the Work at any time; provided,
    however that any such election will not serve to withdraw this License
    (or any other license that has been, or is required to be, granted
    under the terms of this License), and this License will continue in
    full force and effect unless terminated as stated above. 8.
    Miscellaneous
        Each time You Distribute or Publicly Perform the Work or a Collection,
    the Licensor offers to the recipient a license to the Work on the same
    terms and conditions as the license granted to You under this License.
    Each time You Distribute or Publicly Perform an Adaptation, Licensor
    offers to the recipient a license to the original Work on the same
    terms and conditions as the license granted to You under this License.
    If any provision of this License is invalid or unenforceable under
    applicable law, it shall not affect the validity or enforceability of
    the remainder of the terms of this License, and without further action
    by the parties to this agreement, such provision shall be reformed to
    the minimum extent necessary to make such provision valid and
    enforceable. No term or provision of this License shall be deemed
    waived and no breach consented to unless such waiver or consent shall
    be in writing and signed by the party to be charged with such waiver
    or consent. This License constitutes the entire agreement between the
    parties with respect to the Work licensed here. There are no
    understandings, agreements or representations with respect to the Work
    not specified here. Licensor shall not be bound by any additional
    provisions that may appear in any communication from You. This License
    may not be modified without the mutual written agreement of the
    Licensor and You. The rights granted under, and the subject matter
    referenced, in this License were drafted utilizing the terminology of
    the Berne Convention for the Protection of Literary and Artistic Works
    (as amended on September 28, 1979), the Rome Convention of 1961, the
    WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms
    Treaty of 1996 and the Universal Copyright Convention (as revised on
    July 24, 1971). These rights and subject matter take effect in the
    relevant jurisdiction in which the License terms are sought to be
    enforced according to the corresponding provisions of the
    implementation of those treaty provisions in the applicable national
    law. If the standard suite of rights granted under applicable
    copyright law includes additional rights not granted under this
    License, such additional rights are deemed to be included in the
    License; this License is not intended to restrict the license of any
    rights under applicable law. Creative Commons Notice
        Creative Commons is not a party to this License, and makes no warranty
    whatsoever in connection with the Work. Creative Commons will not be
    liable to You or any party on any legal theory for any damages
    whatsoever, including without limitation any general, special,
    incidental or consequential damages arising in connection to this
    license. Notwithstanding the foregoing two (2) sentences, if Creative
    Commons has expressly identified itself as the Licensor hereunder, it
    shall have all rights and obligations of Licensor.
        Except for the limited purpose of indicating to the public that the
    Work is licensed under the CCPL, Creative Commons does not authorize
    the use by either party of the trademark "Creative Commons" or any
    related trademark or logo of Creative Commons without the prior
    written consent of Creative Commons. Any permitted use will be in
    compliance with Creative Commons' then-current trademark usage
    guidelines, as may be published on its website or otherwise made
    available upon request from time to time. For the avoidance of doubt,
    this trademark restriction does not form part of the License.
        Creative Commons may be contacted at http://creativecommons.org/.
        */
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   <?php

namespace Faker\Provider\en_AU;

/**
 * Class Address
 * @see http://www.ipaustralia.gov.au/about-us/corporate/address-standards/
 * @package Faker\Provider\en_AU
 */
class Address extends \Faker\Provider\en_US\Address
{
    protected static $cityPrefix = array('North', 'East', 'West', 'South', 'New', 'Lake', 'Port', 'St.');

    protected static $buildingNumber = array('###', '##', '#');

    protected static $buildingLetters = array('A','B','C','D');

    protected static $streetSuffix = array(
        'Access', 'Alley', 'Alleyway', 'Amble', 'Anchorage', 'Approach', 'Arcade', 'Artery', 'Avenue', 'Basin', 'Beach', 'Bend', 'Block', 'Boulevard', 'Brace', 'Brae', 'Break', 'Bridge', 'Broadway', 'Brow', 'Bypass', 'Byway', 'Causeway', 'Centre', 'Centreway', 'Chase', 'Circle', 'Circlet', 'Circuit', 'Circus', 'Close', 'Colonnade', 'Common', 'Concourse', 'Copse', 'Corner', 'Corso', 'Court', 'Courtyard', 'Cove', 'Crescent', 'Crest', 'Cross', 'Crossing', 'Crossroad', 'Crossway', 'Cruiseway', 'Cul-de-sac', 'Cutting', 'Dale', 'Dell', 'Deviation', 'Dip', 'Distributor', 'Drive', 'Driveway', 'Edge', 'Elbow', 'End', 'Entrance', 'Esplanade', 'Estate', 'Expressway', 'Extension', 'Fairway', 'Fire Track', 'Firetrail', 'Flat', 'Follow', 'Footway', 'Foreshore', 'Formation', 'Freeway', 'Front', 'Frontage', 'Gap', 'Garden', 'Gardens', 'Gate', 'Gates', 'Glade', 'Glen', 'Grange', 'Green', 'Ground', 'Grove', 'Gully', 'Heights', 'Highroad', 'Highway', 'Hill', 'Interchange', 'Intersection', 'Junction', 'Key', 'Landing', 'Lane', 'Laneway', 'Lees', 'Line', 'Link', 'Little', 'Lookout', 'Loop', 'Lower', 'Mall', 'Meander', 'Mew', 'Mews', 'Motorway', 'Mount', 'Nook', 'Outlook', 'Parade', 'Park', 'Parklands', 'Parkway', 'Part', 'Pass', 'Path', 'Pathway', 'Piazza', 'Place', 'Plateau', 'Plaza', 'Pocket', 'Point', 'Port', 'Promenade', 'Quad', 'Quadrangle', 'Quadrant', 'Quay', 'Quays', 'Ramble', 'Ramp', 'Range', 'Reach', 'Reserve', 'Rest', 'Retreat', 'Ride', 'Ridge', 'Ridgeway', 'Right Of Way', 'Ring', 'Rise', 'River', 'Riverway', 'Riviera', 'Road', 'Roads', 'Roadside', 'Roadway', 'Ronde', 'Rosebowl', 'Rotary', 'Round', 'Route', 'Row', 'Rue', 'Run', 'Service Way', 'Siding', 'Slope', 'Sound', 'Spur', 'Square', 'Stairs', 'State Highway', 'Steps', 'Strand', 'Street', 'Strip', 'Subway', 'Tarn', 'Terrace', 'Thoroughfare', 'Tollway', 'Top', 'Tor', 'Towers', 'Track', 'Trail', 'Trailer', 'Triangle', 'Trunkway', 'Turn', 'Underpass', 'Upper', 'Vale', 'Viaduct', 'View', 'Villas', 'Vista', 'Wade', 'Walk', 'Walkway', 'Way', 'Wynd'
    );

    protected static $postcode = array(
        // as per https://en.wikipedia.org/wiki/Postcodes_in_Australia
        // NSW
        '1###',
        '20##', '21##', '22##', '23##', '24##', '25##',
        '2619', '262#', '263#', '264#', '265#', '266#', '267#', '268#', '269#', '27##', '28##',
        '292#', '293#', '294#', '295#', '296#', '297#', '298#', '299#',
        // ACT
        '02##',
        '260#', '261#',
        '290#', '291#', '2920',
        // VIC
        '3###',
        '8###',
        // QLD
        '4###',
        '9###',
        // SA
        '5###',
        // WA
        '6###',
        // TAS
        '7###',
        // NT
        '08##',
        '09##',
    );

    protected static $state = array(
        'Australian Capital Territory', 'New South Wales', 'Northern Territory', 'Queensland', 'South Australia', 'Tasmania', 'Victoria', 'Western Australia'
    );

    protected static $stateAbbr = array(
        'ACT', 'NSW', 'NT', 'QLD', 'SA', 'TAS', 'VIC', 'WA'
    );

    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{streetName}}',
        '{{buildingNumber}}{{buildingLetter}} {{streetName}}',
        '{{secondaryAddress}} {{buildingNumber}} {{streetName}}',
    );

    protected static $secondaryAddressFormats = array(
        'Apt. ###',
        'Flat ##',
        'Suite ###',
        'Unit ##',
        'Level #',
        '### /',
        '## /',
        '# /',
    );

    /**
     * Returns a sane building letter
     * @example B
     */
    public static function buildingLetter()
    {
        return static::toUpper(static::randomElement(static::$buildingLetters));
    }

    /**
     * Returns a sane city prefix
     * @example West
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    /**
     * Returns a sane street suffix
     * @example Beach
     */
    public static function streetSuffix()
    {
        return static::randomElement(static::$streetSuffix);
    }

    /**
     * Returns a sane state
     * @example New South Wales
     */
    public static function state()
    {
        return static::randomElement(static::$state);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    <?php

namespace Faker\Provider\en_AU;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    protected static $formats = array(
        // Local calls
        '#### ####',
        '####-####',
        '####.####',
        '########',

        // National dialing
        '0{{areaCode}} #### ####',
        '0{{areaCode}}-####-####',
        '0{{areaCode}}.####.####',
        '0{{areaCode}}########',

        // Optional parenthesis
        '(0{{areaCode}}) #### ####',
        '(0{{areaCode}})-####-####',
        '(0{{areaCode}}).####.####',
        '(0{{areaCode}})########',

        // International drops the 0
        '+61 {{areaCode}} #### ####',
        '+61-{{areaCode}}-####-####',
        '+61.{{areaCode}}.####.####',
        '+61{{areaCode}}########',
    );

    // 04 Mobile telephones (Australia-wide) mostly commonly written 4 - 3 - 3 instead of 2 - 4 - 4
    protected static $mobileFormats = array(
        '04## ### ###',
        '04##-###-###',
        '04##.###.###',
        '+61 4## ### ###',
        '+61-4##-###-###',
        '+61.4##.###.###',
    );

    protected static $areacodes = array(
        '2', '3', '7', '8'
    );

    public static function mobileNumber()
    {
        return static::numerify(static::randomElement(static::$mobileFormats));
    }

    public static function areaCode()
    {
        return static::numerify(static::randomElement(static::$areacodes));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             <?php

namespace Faker\Provider\en_CA;

/**
 * Extend US class since most fields share the same format
 */

class Address extends \Faker\Provider\en_US\Address
{
    protected static $postcode = array('?#? #?#', '?#?-#?#', '?#?#?#');

    protected static $postcodeLetters = array('A','B','C','E','G','H','J','K','L','M','N','P','R','S','T','V','X','Y');

    protected static $province = array(
        'Alberta', 'British Columbia', 'Manitoba', 'New Brunswick', 'Newfoundland and Labrador', 'Northwest Territories', 'Nova Scotia', 'Nunavut', 'Ontario', 'Prince Edward Island', 'Quebec', 'Saskatchewan', 'Yukon Territory',
    );

    protected static $provinceAbbr = array(
        'AB', 'BC', 'MB', 'NB', 'NL', 'NT', 'NS', 'NU', 'ON', 'PE', 'QC', 'SK', 'YT'
    );

    protected static $addressFormats = array(
        "{{streetAddress}}\n{{city}}, {{provinceAbbr}}  {{postcode}}",
    );

    /**
     * @example 'Ontario'
     */
    public static function province()
    {
        return static::randomElement(static::$province);
    }

    /**
     * @example 'ON'
     */
    public static function provinceAbbr()
    {
        return static::randomElement(static::$provinceAbbr);
    }

    /**
     * Returns a postalcode-safe letter
     * @example A1B 2C3
     */
    public static function randomPostcodeLetter()
    {
        return static::randomElement(static::$postcodeLetters);
    }

    /**
     * @example A1B 2C3
     */
    public static function postcode()
    {
        $string = static::randomElement(static::$postcode);

        $string = preg_replace_callback('/\#/u', 'static::randomDigit', $string);
        $string = preg_replace_callback('/\?/u', 'static::randomPostcodeLetter', $string);

        return static::toUpper($string);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    <?php

namespace Faker\Provider\en_GB;

class Address extends \Faker\Provider\Address
{
    protected static $cityPrefix = array('North', 'East', 'West', 'South', 'New', 'Lake', 'Port');
    protected static $citySuffix = array('town', 'ton', 'land', 'ville', 'berg', 'burgh', 'borough', 'bury', 'view', 'port', 'mouth', 'stad', 'furt', 'chester', 'mouth', 'fort', 'haven', 'side', 'shire');
    protected static $buildingNumber = array('###', '##', '#');
    protected static $streetSuffix = array(
        'Alley', 'Avenue', 'Branch', 'Bridge', 'Brook', 'Brooks', 'Burg', 'Burgs', 'Bypass', 'Camp', 'Canyon', 'Cape', 'Causeway', 'Center', 'Centers', 'Circle', 'Circles', 'Cliff', 'Cliffs', 'Club', 'Common', 'Corner', 'Corners', 'Course', 'Court', 'Courts', 'Cove', 'Coves', 'Creek', 'Crescent', 'Crest', 'Crossing', 'Crossroad', 'Curve', 'Dale', 'Dam', 'Divide', 'Drive', 'Drive', 'Drives', 'Estate', 'Estates', 'Expressway', 'Extension', 'Extensions', 'Fall', 'Falls', 'Ferry', 'Field', 'Fields', 'Flat', 'Flats', 'Ford', 'Fords', 'Forest', 'Forge', 'Forges', 'Fork', 'Forks', 'Fort', 'Garden', 'Gardens', 'Gateway', 'Glen', 'Glens', 'Green', 'Greens', 'Grove', 'Groves', 'Harbour', 'Harbours', 'Haven', 'Heights', 'Highway', 'Hill', 'Hills', 'Hollow', 'Inlet', 'Island', 'Islands', 'Isle', 'Junction', 'Junctions', 'Key', 'Keys', 'Knoll', 'Knolls', 'Lake', 'Lakes', 'Land', 'Landing', 'Lane', 'Light', 'Lights', 'Loaf', 'Lock', 'Locks', 'Locks', 'Lodge', 'Lodge', 'Loop', 'Manor', 'Manors', 'Meadow', 'Meadows', 'Mews', 'Mill', 'Mills', 'Motorway', 'Mount', 'Mountain', 'Mountains', 'Neck', 'Orchard', 'Oval', 'Overpass', 'Park', 'Parks', 'Parkway', 'Parkways', 'Pass', 'Passage', 'Path', 'Pike', 'Pine', 'Pines', 'Place', 'Plain', 'Plains', 'Plaza', 'Point', 'Points', 'Port', 'Ports', 'Radial', 'Ramp', 'Ranch', 'Rapid', 'Rapids', 'Rest', 'Ridge', 'Ridges', 'River', 'Road', 'Road', 'Roads', 'Roads', 'Route', 'Row', 'Rue', 'Run', 'Shoal', 'Shoals', 'Shore', 'Shores', 'Spring', 'Springs', 'Springs', 'Spur', 'Spurs', 'Square', 'Square', 'Squares', 'Squares', 'Station', 'Station', 'Stream', 'Stream', 'Street', 'Streets', 'Summit', 'Terrace', 'Throughway', 'Trace', 'Track', 'Trafficway', 'Trail', 'Tunnel', 'Turnpike', 'Underpass', 'Union', 'Unions', 'Valley', 'Valleys', 'Via', 'Viaduct', 'View', 'Views', 'Village', 'Villages', 'Ville', 'Vista', 'Vista', 'Walk', 'Walks', 'Wall', 'Way', 'Ways', 'Well', 'Wells'
    );

    protected static $postcode = array(
        'DD8 1LR','HU7 4FE','SG6 1PR','DN40 3PT','PO21 3JR','BN13 3DN','B23 5RS','W5 5PA','ML12 6XR','WR2 4HQ','TR16 6EU','TF4 2NU',
        'HU8 8SH','TS24 7QA','SE11 5SD','WV99 1TL','TR16 5TN','NP16 6QT','BT60 3QU','TA24 6LB','TS23 1AD','W1G 9PN','WA1 4PJ','CM22 6DR',
        'BL7 8BW','FK2 8DB','LL65 4LN','LL21 0RG','SP6 1NH','EN1 4AE','WR5 1DG','NW6 9FA','NG18 3AZ','N14 5HW','CO9 3JZ','CW12 1BP',
        'BT41 2RX','CT6 9AR','ST10 4JQ','HD9 7ED','SW6 1LG','KY10 3RL','LA8 9RA','RH20 2LH','WF9 2JY','N11 1RH','BT78 2JU','ME6 5PD',
        'CB22 7PT','BS4 2BH','NR10 3QE','ST3 5SH','WA5 1QF','B17 0LW','WA7 1EN','SP3 6WD','LL48 6SE','MK3 7SA','CV34 4DF','CW1 5PG',
        'BN41 1PT','TS22 5AN','ST3 2HB','L25 8SJ','ST14 5JJ','L36 3RN','S2 3BQ','HR7 4AT','PH6 2HW','RH10 7RT','RM12 5EJ','IV2 5EG',
        'RH19 9GG','BD4 7HP','GL3 4TA','BS23 3YE','SN2 7TE','CB2 3EN','B27 6SF','AB53 4RJ','W4 3JU','SK14 1SB','PO14 4NH','CB9 9EE',
        'WF1 5HR','LL55 4TE','BH12 2EN','LE2 9HY','EX32 2BA','BS31 3HT','PE25 1AA','G61 3HA','EX12 2WH','OX4 1GF','DY2 9EU','CO1 1QR',
        'CH45 6UP','ME14 4NL','SE1P 5NT','LE3 9LB','BT66 7RR','BT5 5ED','NG17 1BH','GU1 2SB','SW15 4AF','AL5 1SZ','B63 4JQ','OL12 6RA',
        'RH12 1AS','TN6 2QU','CO12 3SQ','E1 4QJ','TW5 0XT','ST10 1JW','BL9 8LE','CH1 4EZ','SA71 5BP','HR9 9AJ','SA6 6DH','ML9 3BS',
        'TW12 2RA','EH26 0LE','E12 5QJ','M46 9XG','CO6 3EG','ST16 3AP','WN6 8BX','WR14 2YU','DG11 3JQ','TN14 5GD','TW15 3EQ','SW8 4TE',
        'DE55 5SF','DT6 9BF','TN31 7BY','SA19 9BR','HD9 4DH','IP21 4TN','CT14 7EW','DE65 5JX','B10 9JS','AL1 1SZ','CF39 0LH','SW20 8JY',
        'HP1 9HT','M44 6ZR','SW19 1BB','HP13 7TG','IP16 4UL','SE1 7DB','BN12 6HW','WF10 2AL','AL3 8RN','RG14 2EL','ME8 6QQ','W14 8AZ',
        'BT49 0NJ','WS11 1ZY','CR5 2DP','LS17 8LP','DL15 8GH','W1G 9PZ','CA6 5YS','WN2 3RS','L39 3LJ','BT47 2QQ','CT13 0PW','BL8 2ND',
        'RM9 4UT','GU7 9SD','WN3 6DQ','AB22 8ZW','LE11 9DA','EX16 6BS','DE65 6JG','GL55 6HT','BS24 7AH','LS26 8UF','PO6 4FH','CT5 3HQ',
        'CW11 5SY','MK16 0FL','RG19 8JZ','SP1 1NE','SG18 0HL','HA7 1HB','TW4 7JP','BT15 3FB','LN5 9WR','SK2 5XT','NP18 3TF','NE33 5SQ',
        'L40 4LA','LU7 4SW','WV99 1RG','EC3P 3AY','CW5 6DY','CR2 8EN','PO11 0JY','IP33 9GD','WA3 3UR','WD3 3LY','CT6 7HL','TN15 8JE',
        'L35 5JA','CF23 0EL','TR13 0DP','GL14 2NW','W1D 4PR','SY5 0AR','NP4 8LA','CH45 7RH','S35 4FX','PL20 6JB','NW1 6AB','AB41 7HB',
        'S72 7HG','RG27 8PG','TA1 3TF','FK3 8EP','MK43 7LX','BT79 7AQ','L9 9BL','PE28 5US','PO4 8NU','WF4 3QZ','SE23 3RG','NN5 7AR',
        'L15 6UE','CA4 9QG','RH9 8DR','KT18 5DN','AB11 5QE','L2 2TX','NE20 0RB','TF3 2BG','NW2 2SH','IG10 3JT','HR9 7GB','N10 3DS',
        'PA3 4NH','W8 7EY','HP19 9BW','KA1 3TU','SE26 6JG','SL3 9LU','L38 9EB','M15 6QL','BN6 8DA','PE27 5PP','LS16 8EE','AB15 4YR',
        'CM0 7HA','SY11 4LB','IG1 3TR','NE63 8EL','CR5 3DN','NW4 4XL','BL9 6QT','KT24 6NU','EH37 5TF','SO16 9RJ','B62 8RS','PL28 8QJ',
        'E9 5LR','BR6 9XJ','M25 3BY','M20 1BT','SE18 7QX','DD1 2NF','NR31 8NS','BH31 6AF','TN23 5PR','TN12 9PU','HR8 2JJ','KT6 5DX',
        'HX3 0NS','SN7 8NR','SY7 8AQ','CV8 1LS','NR34 9ET','BD23 3EU','YO11 3JN','BH11 9NE','CM3 3AE','KA3 7PR','DE15 9DU','PR8 9LB',
        'GL53 7EN','OX15 4HW','TS19 9ES','G65 9BG','SE15 6FE','B37 7RA','BT51 3NQ','YO32 9SX','M50 3TU','LL14 5NR','PO35 5XS','W5 9TG',
        'BD24 0LF','KT22 7UE','GL1 2SZ','HP5 2ED','TN11 8HT','LA12 0HX','N5 1WP','TS10 3NS','B98 7JU','SY23 4LA','PR7 5PY','YO7 1SP',
        'HR9 7XU','ST3 1EQ','AL9 5DL','DT11 0JD','KT17 1DJ','HP6 5AY','NR8 5BD','PO37 6NN','YO31 8WU','CF48 2SR','BD23 1UY','HU12 8HG',
        'ML3 8PH','CO5 9BJ','BD9 4EF','G71 7PA','TF1 1HU','G74 3LB','CM16 6TT','BS8 4UR','B92 8HS','EH4 5LQ','GU1 2PB','FK8 1LD','S70 4DN',
        'BT93 6AB','RM15 4AP','HU14 3EB','CH63 4JT','M34 2JG','LU3 1HQ','TD1 2BX','PE23 4LZ','S66 8JW','RG8 0UN','YO31 0UQ','OX11 8JJ',
        'TS18 1NS','ME19 6QD','PL15 8US','SG5 3JJ','TN34 9GL','LL18 3RP','SK13 1LP','KA7 1TH','NG8 4EN','B68 8PE','EX14 1QF','RG14 2NL',
        'NG9 3FL','KA13 7NR','PR8 4RH','BB4 5TZ','SA5 4EA','TD8 6PQ','B44 8SR','GU16 6EL','AB31 5ZD','TA4 2EY','WR2 4RX','TF4 2JW',
        'RM14 3PA','DD3 8ES','CA28 6HA','IP22 1JW','S70 5RT','RM16 3EW','G77 6DL','TR15 1PH','DN2 5AU','ML11 9BQ','PE16 6RY','SW6 2WG',
        'PL7 4AJ','MK17 9QX','SL7 3PB','BL6 6YT','NG24 2PB','RG30 4AJ','DT7 3SY','YO21 1HX','BH8 8BP','DE11 0SD','S81 0HT','WD6 5QD',
        'BT25 2HD','CW5 6QF','S6 1WR','RM20 1WN','CF62 3HX','CB2 8HH','NE10 8JX','SL4 1YB','WV5 9BS','G83 0SH','M45 8AF','WR1 2HZ',
        'LU2 7LJ','SK6 7QN','TR10 8QN','HA3 7SF','LL12 9NR','G69 7EA','L25 2NW','PL2 2DD','DN15 9AU','HA1 2AG','LS2 9ND','HD9 6PH',
        'DH3 2NB','OL12 7TX','NG5 1HT','S64 0BU','EX20 1ER','RG40 4RX','B47 5EE','NE29 7BG','SM3 9QR','NG17 4JY','CF23 7EW','GU10 4HE',
        'NP44 4PE','MK9 2AD','S49 1YZ','PO8 0LJ','BD18 4LP','SW2 3DJ','SP4 6JS','OL16 3NA','IP7 5SS','PO17 5HZ','RH15 9TE','ME15 0JU',
        'LS25 2AY','BT46 5NR','YO19 6BL','M28 7XP','W6 7PR','NE29 0AT','TR19 6DX','LE3 0BF','BS6 9HE','SA18 1HW','DD8 4EX','BT35 7PB',
        'PE29 2HJ','LS1 9QA','BN14 7AR','BS5 8PJ','OX3 7PJ','W6 7AN','S60 2PT','G12 9BH','IP5 1LR','B26 3SX','PE21 8PT','RM14 2LD',
        'PL9 9NN','NG20 0JZ','W1K 7AF','AB31 4DX','PL1 4EH','IP19 0NS','LS28 9NF','CH64 3TH','G13 1XN','NG5 1JR','W10 6DY','BS27 3XD',
        'ST21 6SR','PL4 9RB','BA15 2QE','TR20 9RG','NG34 9HJ','BD22 9DN','LE4 4JR','KA9 2RN','W1G 6JQ','B14 5TF','SA16 0HY','N8 7AU',
        'LE17 5PD','PE25 2RA','SE19 2BG','OX12 8PJ','DY5 3EH','NG19 7QJ','G43 1HQ'
    );

    protected static $county = array(
        'Aberdeenshire', 'Anglesey', 'Angus', 'Argyll', 'Ayrshire', 'Banffshire', 'Bedfordshire', 'Berwickshire', 'Breconshire', 'Buckinghamshire', 'Bute', 'Caernarvonshire', 'Caithness', 'Cambridgeshire', 'Cardiganshire', 'Carmarthenshire', 'Cheshire', 'Clackmannanshire', 'Cornwall', 'Isles of Scilly', 'Cumbria', 'Denbighshire', 'Derbyshire', 'Devon', 'Dorset', 'Dumbartonshire', 'Dumfriesshire', 'Durham', 'East Lothian', 'East Sussex', 'Essex', 'Fife', 'Flintshire', 'Glamorgan', 'Gloucestershire', 'Greater London', 'Greater Manchester', 'Hampshire', 'Hertfordshire', 'Inverness', 'Kent', 'Kincardineshire', 'Kinross-shire', 'Kirkcudbrightshire', 'Lanarkshire', 'Lancashire', 'Leicestershire', 'Lincolnshire', 'London', 'Merionethshire', 'Merseyside', 'Midlothian', 'Monmouthshire', 'Montgomeryshire', 'Moray', 'Nairnshire', 'Norfolk', 'North Yorkshire', 'Northamptonshire', 'Northumberland', 'Nottinghamshire', 'Orkney', 'Oxfordshire', 'Peebleshire', 'Pembrokeshire', 'Perthshire', 'Radnorshire', 'Renfrewshire', 'Ross & Cromarty', 'Roxburghshire', 'Selkirkshire', 'Shetland', 'Shropshire', 'Somerset', 'South Yorkshire', 'Staffordshire', 'Stirlingshire', 'Suffolk', 'Surrey', 'Sutherland', 'Tyne and Wear', 'Warwickshire', 'West Lothian', 'West Midlands', 'West Sussex', 'West Yorkshire', 'Wigtownshire', 'Wiltshire', 'Worcestershire'
    );

    protected static $country = array(
        'Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra', 'Angola', 'Anguilla', 'Antarctica (the territory South of 60 deg S)', 'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba', 'Australia', 'Austria', 'Azerbaijan',
        'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Bouvet Island (Bouvetoya)', 'Brazil', 'British Indian Ocean Territory (Chagos Archipelago)', 'British Virgin Islands', 'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
        'Cambodia', 'Cameroon', 'Canada', 'Cape Verde', 'Cayman Islands', 'Central African Republic', 'Chad', 'Chile', 'China', 'Christmas Island', 'Cocos (Keeling) Islands', 'Colombia', 'Comoros', 'Congo', 'Congo', 'Cook Islands', 'Costa Rica', 'Cote d\'Ivoire', 'Croatia', 'Cuba', 'Cyprus', 'Czech Republic',
        'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic',
        'Ecuador', 'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia',
        'Faroe Islands', 'Falkland Islands (Malvinas)', 'Fiji', 'Finland', 'France', 'French Guiana', 'French Polynesia', 'French Southern Territories',
        'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Gibraltar', 'Greece', 'Greenland', 'Grenada', 'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea', 'Guinea-Bissau', 'Guyana',
        'Haiti', 'Heard Island and McDonald Islands', 'Holy See (Vatican City State)', 'Honduras', 'Hong Kong', 'Hungary',
        'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Isle of Man', 'Israel', 'Italy',
        'Jamaica', 'Japan', 'Jersey', 'Jordan',
        'Kazakhstan', 'Kenya', 'Kiribati', 'Korea', 'Korea', 'Kuwait', 'Kyrgyz Republic',
        'Lao People\'s Democratic Republic', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libyan Arab Jamahiriya', 'Liechtenstein', 'Lithuania', 'Luxembourg',
        'Macao', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Martinique', 'Mauritania', 'Mauritius', 'Mayotte', 'Mexico', 'Micronesia', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Montserrat', 'Morocco', 'Mozambique', 'Myanmar',
        'Namibia', 'Nauru', 'Nepal', 'Netherlands Antilles', 'Netherlands', 'New Caledonia', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Niue', 'Norfolk Island', 'Northern Mariana Islands', 'Norway',
        'Oman',
        'Pakistan', 'Palau', 'Palestinian Territories', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Pitcairn Islands', 'Poland', 'Portugal', 'Puerto Rico',
        'Qatar',
        'Reunion', 'Romania', 'Russian Federation', 'Rwanda',
        'Saint Barthelemy', 'Saint Helena', 'Saint Kitts and Nevis', 'Saint Lucia', 'Saint Martin', 'Saint Pierre and Miquelon', 'Saint Vincent and the Grenadines', 'Samoa', 'San Marino', 'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia (Slovak Republic)', 'Slovenia', 'Solomon Islands', 'Somalia', 'South Africa', 'South Georgia and the South Sandwich Islands', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Svalbard & Jan Mayen Islands', 'Swaziland', 'Sweden', 'Switzerland', 'Syrian Arab Republic',
        'Taiwan', 'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo', 'Tokelau', 'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu',
        'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom', 'United States of America', 'United States Minor Outlying Islands', 'United States Virgin Islands', 'Uruguay', 'Uzbekistan',
        'Vanuatu', 'Venezuela', 'Vietnam',
        'Wallis and Futuna', 'Western Sahara',
        'Yemen',
        'Zambia', 'Zimbabwe'
    );

    protected static $cityFormats = array(
        '{{cityPrefix}} {{firstName}}{{citySuffix}}',
        '{{cityPrefix}} {{firstName}}',
        '{{firstName}}{{citySuffix}}',
        '{{lastName}}{{citySuffix}}',
    );
    protected static $streetNameFormats = array(
        '{{firstName}} {{streetSuffix}}',
        '{{lastName}} {{streetSuffix}}'
    );
    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{streetName}}',
        '{{buildingNumber}} {{streetName}}',
        "{{secondaryAddress}}\n{{streetName}}",
    );
    protected static $addressFormats = array(
        "{{streetAddress}}\n{{city}}\n{{postcode}}",
    );
    protected static $secondaryAddressFormats = array('Flat ##', 'Flat ##?', 'Studio ##', 'Studio ##?');

    /**
     * @example 'East'
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    /**
     * @example 'Flat 350'
     */
    public static function secondaryAddress()
    {
        return static::bothify(static::randomElement(static::$secondaryAddressFormats));
    }

    /**
     * @example 'Hampshire'
     */
    public static function county()
    {
        return static::randomElement(static::$county);
    }

    /**
     *
     * @example 'N6 5AA'
     */
    public static function postcode()
    {
        return static::randomElement(static::$postcode);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         <?php

namespace Faker\Provider\en_GB;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
    );

    /**
     * @link http://www.ons.gov.uk/ons/rel/vsob1/baby-names--england-and-wales/2013/index.html
     */
    protected static $firstNameMale = array(
        'Aaron', 'Adam', 'Adrian', 'Aiden', 'Alan', 'Alex', 'Alexander', 'Alfie', 'Andrew', 'Andy', 'Anthony', 'Archie', 'Arthur',
        'Barry', 'Ben', 'Benjamin', 'Bradley', 'Brandon', 'Bruce',
        'Callum', 'Cameron', 'Charles', 'Charlie', 'Chris', 'Christian', 'Christopher', 'Colin', 'Connor', 'Craig',
        'Dale', 'Damien', 'Dan', 'Daniel', 'Darren', 'Dave', 'David', 'Dean', 'Dennis', 'Dominic', 'Duncan', 'Dylan',
        'Edward', 'Elliot', 'Elliott', 'Ethan',
        'Finley', 'Frank', 'Fred', 'Freddie',
        'Gary', 'Gavin', 'George', 'Gordon', 'Graham', 'Grant', 'Greg',
        'Harley', 'Harrison', 'Harry', 'Harvey', 'Henry',
        'Ian', 'Isaac',
        'Jack', 'Jackson', 'Jacob', 'Jake', 'James', 'Jamie', 'Jason', 'Jayden', 'Jeremy', 'Jim', 'Joe', 'Joel', 'John', 'Jonathan', 'Jordan', 'Joseph', 'Joshua',
        'Karl', 'Keith', 'Ken', 'Kevin', 'Kieran', 'Kyle',
        'Lee', 'Leo', 'Lewis', 'Liam', 'Logan', 'Louis', 'Lucas', 'Luke',
        'Mark', 'Martin', 'Mason', 'Matthew', 'Max', 'Michael', 'Mike', 'Mohammed', 'Muhammad',
        'Nathan', 'Neil', 'Nick', 'Noah',
        'Oliver', 'Oscar', 'Owen',
        'Patrick', 'Paul', 'Pete', 'Peter', 'Philip',
        'Quentin',
        'Ray', 'Reece', 'Riley', 'Rob', 'Ross', 'Ryan',
        'Samuel', 'Scott', 'Sean', 'Sebastian', 'Stefan', 'Stephen', 'Steve',
        'Theo', 'Thomas', 'Tim', 'Toby', 'Tom', 'Tony', 'Tyler',
        'Wayne', 'Will', 'William',
        'Zachary', 'Zach'
    );

    protected static $firstNameFemale = array(
        'Abbie', 'Abigail', 'Adele', 'Alexa', 'Alexandra', 'Alice', 'Alison', 'Amanda', 'Amber', 'Amelia', 'Amy', 'Anna', 'Ashley', 'Ava',
        'Beth', 'Bethany', 'Becky',
        'Caitlin', 'Candice', 'Carlie', 'Carmen', 'Carole', 'Caroline', 'Carrie', 'Charlotte', 'Chelsea', 'Chloe', 'Claire', 'Courtney',
        'Daisy', 'Danielle', 'Donna',
        'Eden', 'Eileen', 'Eleanor', 'Elizabeth', 'Ella', 'Ellie', 'Elsie', 'Emily', 'Emma', 'Erin', 'Eva', 'Evelyn', 'Evie',
        'Faye', 'Fiona', 'Florence', 'Francesca', 'Freya',
        'Georgia', 'Grace',
        'Hannah', 'Heather', 'Helen', 'Helena', 'Hollie', 'Holly',
        'Imogen', 'Isabel', 'Isabella', 'Isabelle', 'Isla', 'Isobel',
        'Jade', 'Jane', 'Jasmine', 'Jennifer', 'Jessica', 'Joanne', 'Jodie', 'Julia', 'Julie', 'Justine',
        'Karen', 'Karlie', 'Katie', 'Keeley', 'Kelly', 'Kimberly', 'Kirsten', 'Kirsty',
        'Laura', 'Lauren', 'Layla', 'Leah', 'Leanne', 'Lexi', 'Lilly', 'Lily', 'Linda', 'Lindsay', 'Lisa', 'Lizzie', 'Lola', 'Lucy',
        'Maisie', 'Mandy', 'Maria', 'Mary', 'Matilda', 'Megan', 'Melissa', 'Mia', 'Millie', 'Molly',
        'Naomi', 'Natalie', 'Natasha', 'Nicole', 'Nikki',
        'Olivia',
        'Patricia', 'Paula', 'Pauline', 'Phoebe', 'Poppy',
        'Rachel', 'Rebecca', 'Rosie', 'Rowena', 'Roxanne', 'Ruby', 'Ruth',
        'Sabrina', 'Sally', 'Samantha', 'Sarah', 'Sasha', 'Scarlett', 'Selina', 'Shannon', 'Sienna', 'Sofia', 'Sonia', 'Sophia', 'Sophie', 'Stacey', 'Stephanie','Suzanne', 'Summer',
        'Tanya', 'Tara', 'Teagan', 'Theresa', 'Tiffany', 'Tina', 'Tracy',
        'Vanessa', 'Vicky', 'Victoria',
        'Wendy',
        'Yasmine', 'Yvette', 'Yvonne',
        'Zoe',
    );

    /**
     * @link http://surname.sofeminine.co.uk/w/surnames/most-common-surnames-in-great-britain.html
     */
    protected static $lastName = array(
        'Adams', 'Allen', 'Anderson',
        'Bailey', 'Baker', 'Bell', 'Bennett', 'Brown', 'Butler',
        'Campbell', 'Carter', 'Chapman', 'Clark', 'Clarke', 'Collins', 'Cook', 'Cooper', 'Cox',
        'Davies', 'Davis',
        'Edwards', 'Ellis', 'Evans',
        'Fox',
        'Graham', 'Gray', 'Green', 'Griffiths',
        'Hall', 'Harris', 'Harrison', 'Hill', 'Holmes', 'Hughes', 'Hunt', 'Hunter',
        'Jackson', 'James', 'Johnson', 'Jones',
        'Kelly', 'Kennedy', 'Khan', 'King', 'Knight',
        'Lee', 'Lewis', 'Lloyd',
        'Marshall', 'Martin', 'Mason', 'Matthews', 'Miller', 'Mitchell', 'Moore', 'Morgan', 'Morris', 'Murphy', 'Murray',
        'Owen',
        'Palmer', 'Parker', 'Patel', 'Phillips', 'Powell', 'Price',
        'Reid', 'Reynolds', 'Richards', 'Richardson', 'Roberts', 'Robertson', 'Robinson', 'Rogers', 'Rose', 'Ross', 'Russell',
        'Saunders', 'Scott', 'Shaw', 'Simpson', 'Smith', 'Stevens', 'Stewart',
        'Taylor', 'Thomas', 'Thompson', 'Turner',
        'Walker', 'Walsh', 'Ward', 'Watson', 'White', 'Wilkinson', 'Williams', 'Wilson', 'Wood', 'Wright',
        'Young',
    );
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      <?php

namespace Faker\Provider\en_GB;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    protected static $formats = array(
        '+44(0)##########',
        '+44(0)#### ######',
        '+44(0)#########',
        '+44(0)#### #####',
        '0##########',
        '0#########',
        '0#### ######',
        '0#### #####',
        '0### ### ####',
        '0### #######',
        '(0####) ######',
        '(0####) #####',
        '(0###) ### ####',
        '(0###) #######',
    );

    /**
     * An array of en_GB mobile (cell) phone number formats
     * @var array
     */
    protected static $mobileFormats = array(
      // Local
      '07#########',
      '07### ######',
      '07### ### ###'
    );

    /**
     * Return a en_GB mobile phone number
     * @return string
     */
    public static function mobileNumber()
    {
        return static::numerify(static::randomElement(static::$mobileFormats));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 <?php

namespace Faker\Provider\en_HK;

class Address extends \Faker\Provider\Address
{
    protected static $country = array('Hong Kong');

    protected static $syllables = array(
        'A', 'Ai', 'Ak', 'Am', 'An', 'Ang', 'Ap', 'At', 'Au',
        'Cha', 'Chai', 'Chak', 'Cham', 'Chan', 'Chang', 'Chap', 'Chat', 'Chau',
        'Che', 'Chek', 'Cheng', 'Cheuk', 'Cheung',
        'Chi', 'Chik', 'Chim', 'Chin', 'Ching', 'Chip', 'Chit', 'Chiu',
        'Cho', 'Choi', 'Chok', 'Chong', 'Chou',
        'Chue', 'Chuen', 'Chuet', 'Chui', 'Chuk', 'Chun', 'Chung', 'Chut',
        'E', 'Ei',
        'Fa', 'Fai', 'Fak', 'Fan', 'Fang', 'Fat', 'Fau',
        'Fe', 'Fei', 'Fo', 'Fok', 'Fong',
        'Fu', 'Fui', 'Fuk', 'Fun', 'Fung', 'Fut',
        'Ha', 'Hai', 'Hak', 'Ham', 'Han', 'Hang', 'Hap', 'Hat', 'Hau',
        'Hei', 'Hek', 'Heng', 'Heu', 'Heung',
        'Hik', 'Him', 'Hin', 'Hing', 'Hip', 'Hit', 'Hiu',
        'Ho', 'Hoi', 'Hok', 'Hon', 'Hong', 'Hot', 'Hou',
        'Huen', 'Huet', 'Hui', 'Huk', 'Hung',
        'Ka', 'Kai', 'Kak', 'Kam', 'Kan', 'Kang', 'Kap', 'Kat', 'Kau',
        'Ke', 'Kei', 'Kek', 'Keng', 'Keu', 'Keuk', 'Keung',
        'Kik', 'Kim', 'Kin', 'King', 'Kip', 'Kit', 'Kiu',
        'Ko', 'Koi', 'Kok', 'Kon', 'Kong', 'Kot', 'Kou',
        'Ku', 'Kuen', 'Kuet', 'Kui', 'Kuk', 'Kun', 'Kung', 'Kut',
        'Kwa', 'Kwai', 'Kwak', 'Kwan', 'Kwang', 'Kwat', 'Kwik', 'Kwing', 'Kwo', 'Kwok', 'Kwong',
        'La', 'Lai', 'Lak', 'Lam', 'Lan', 'Lang', 'Lap', 'Lat', 'Lau',
        'Le', 'Lei', 'Lek', 'Leng', 'Leuk', 'Leung',
        'Li', 'Lik', 'Lim', 'Lin', 'Ling', 'Lip', 'Lit', 'Liu',
        'Lo', 'Loi', 'Lok', 'Long', 'Lou',
        'Luen', 'Luet', 'Lui', 'Luk', 'Lun', 'Lung', 'Lut',
        'Ma', 'Mai', 'Mak', 'Man', 'Mang', 'Mat', 'Mau',
        'Me', 'Mei', 'Meng',
        'Mi', 'Mik', 'Min', 'Ming', 'Mit', 'Miu',
        'Mo', 'Mok', 'Mong', 'Mou',
        'Mui', 'Muk', 'Mun', 'Mung', 'Mut',
        'Na', 'Nai', 'Nam', 'Nan', 'Nang', 'Nap', 'Nat', 'Nau',
        'Ne', 'Nei', 'Neung',
        'Ng', 'Nga', 'Ngai', 'Ngak', 'Ngam', 'Ngan', 'Ngang', 'Ngap', 'Ngat', 'Ngau',
        'Ngit',
        'Ngo', 'Ngoi', 'Ngok', 'Ngon', 'Ngong', 'Ngou',
        'Ni', 'Nik', 'Nim', 'Nin', 'Ning', 'Nip', 'Niu',
        'No', 'Noi', 'Nok', 'Nong', 'Nou', 'Nuen',
        'Nui', 'Nuk', 'Nung', 'Nut',
        'O', 'Oi', 'Ok', 'On', 'Ong', 'Ou',
        'Pa', 'Pai', 'Pak', 'Pam', 'Pan', 'Pang', 'Pat', 'Pau',
        'Pe', 'Pei', 'Pek', 'Peng',
        'Pik', 'Pin', 'Ping', 'Pit', 'Piu',
        'Po', 'Poi', 'Pok', 'Pong', 'Pou',
        'Pui', 'Puk', 'Pun', 'Pung', 'Put',
        'Sa', 'Sai', 'Sak', 'Sam', 'San', 'Sang', 'Sap', 'Sat', 'Sau',
        'Se', 'Sei', 'Sek', 'Seng', 'Seuk', 'Seung',
        'Sha', 'Shai', 'Shak', 'Sham', 'Shan', 'Shang', 'Shap', 'Shat', 'Shau',
        'She', 'Shei', 'Shek', 'Sheng', 'Sheuk', 'Sheung',
        'Shi', 'Shik', 'Shim', 'Shin', 'Shing', 'Ship', 'Shit', 'Shiu',
        'Sho', 'Shoi', 'Shok', 'Shong', 'Shou',
        'Shue', 'Shuen', 'Shuet', 'Shui', 'Shuk', 'Shun', 'Shung', 'Shut',
        'Sik', 'Sim', 'Sin', 'Sing', 'Sip', 'Sit', 'Siu',
        'So', 'Soi', 'Sok', 'Song', 'Sou',
        'Sue', 'Suen', 'Suet', 'Sui', 'Suk', 'Sun', 'Sung', 'Sut',
        'Sze',
        'Ta', 'Tai', 'Tak', 'Tam', 'Tan', 'Tang', 'Tap', 'Tat', 'Tau',
        'Te', 'Tei', 'Tek', 'Teng', 'Teu', 'Teuk',
        'Tik', 'Tim', 'Tin', 'Ting', 'Tip', 'Tit', 'Tiu',
        'To', 'Toi', 'Tok', 'Tong', 'Tou',
        'Tsa', 'Tsai', 'Tsak', 'Tsam', 'Tsan', 'Tsang', 'Tsap', 'Tsat', 'Tsau',
        'Tse', 'Tsek', 'Tseng', 'Tseuk', 'Tseung',
        'Tsik', 'Tsim', 'Tsin', 'Tsing', 'Tsip', 'Tsit', 'Tsiu',
        'Tso', 'Tsoi', 'Tsok', 'Tsong', 'Tsou',
        'Tsue', 'Tsuen', 'Tsuet', 'Tsui', 'Tsuk', 'Tsun', 'Tsung', 'Tsut',
        'Tsz',
        'Tuen', 'Tuet', 'Tui', 'Tuk', 'Tun', 'Tung', 'Tut',
        'Uk', 'Ung',
        'Wa', 'Wai', 'Wak', 'Wan', 'Wang', 'Wat',
        'Wik', 'Wing',
        'Wo', 'Wok', 'Wong', 'Wu',
        'Wui', 'Wun', 'Wut', 'Ya',
        'Yai', 'Yak', 'Yam', 'Yan', 'Yap', 'Yat', 'Yau',
        'Ye', 'Yeng', 'Yeuk', 'Yeung', 'Yi',
        'Yik', 'Yim', 'Yin', 'Ying', 'Yip', 'Yit', 'Yiu',
        'Yo',
        'Yue', 'Yuen', 'Yuet', 'Yui', 'Yuk', 'Yun', 'Yung',
    );

    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{streetName}}',
        '{{buildingNumber}} {{village}}',
        'Block {{buildingNumber}}, {{estate}}',
    );

    protected static $addressFormats = array(
        "{{streetAddress}}\n{{town}}\n{{city}}",
    );

    protected static $villageNameFormats = array(
        '{{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{villageSuffix}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{town}}',
        '{{town}} {{villageSuffix}}',
    );

    protected static $estateNameFormats = array(
        '{{syllable}} {{syllable}} {{estateSuffix}}',
        '{{syllable}} {{syllable}} {{estateSuffix}}',
        '{{syllable}} {{syllable}} {{estateSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{estateSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{estateSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{estateSuffix}}',
        '{{town}} {{estateSuffix}}',
    );


    protected static $villageSuffixes = array('Village', 'Tsuen', 'San Tsuen', 'New Village', 'Wai');

    protected static $estateSuffixes = array('Estate', 'Court');

    protected static $streetNameFormats = array(
        '{{syllable}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{direction}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{syllable}} {{direction}} {{streetSuffix}}',
        '{{syllable}} {{syllable}} {{streetSuffix}} {{direction}}',
        '{{syllable}} {{syllable}} {{syllable}} {{streetSuffix}} {{direction}}',
        '{{englishStreetName}} {{streetSuffix}}',
        '{{englishStreetName}} {{streetSuffix}} {{direction}}',
    );

    protected static $englishStreetNames = array(
        "King's", "Queen's", "Nathan", "Robinson", "Kingston", "Irving", "Bonham", "Salisbury",
        "Tonkin", "Nanking", "Peking", "Canton", "Amoy", "Shanghai"
    );

    protected static $streetSuffix = array(
        'Road', 'Road', 'Road', 'Street', 'Street', 'Street', 'Lane',
        'Circuit', 'Avenue', 'Path', 'Square',
    );

    protected static $directions = array('North', 'East', 'South', 'West');

    protected static $cities = array('Hong Kong', 'Kowloon', 'New Territories');

    protected static $towns = array(
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        '{{syllable}} {{syllable}} {{syllable}}',
        'Aberdeen',
        'Stanley',
        'Victoria',
    );

    public function city()
    {
        return static::randomElement(static::$cities);
    }

    public function town()
    {
        return $this->generator->parse(static::randomElement(static::$towns));
    }

    public function syllable()
    {
        return static::randomElement(static::$syllables);
    }

    public function direction()
    {
        return static::randomElement(static::$directions);
    }

    public function englishStreetName()
    {
        return static::randomElement(static::$englishStreetNames);
    }

    public function villageSuffix()
    {
        return static::randomElement(static::$villageSuffixes);
    }

    public function estateSuffix()
    {
        return static::randomElement(static::$estateSuffixes);
    }

    public function village()
    {
        return $this->generator->parse(static::randomElement(static::$villageNameFormats));
    }

    public function estate()
    {
        return $this->generator->parse(static::randomElement(static::$estateNameFormats));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       <?php

namespace Faker\Provider\en_HK;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    protected static $formats = array('2#######', '3#######', '5#######', '6#######', '9#######');
    protected static $mobileFormats = array('5#######', '6#######', '9#######');
    protected static $landlineFormats = array('2#######', '3#######');
    protected static $faxFormats = array('7#######');

    /**
     * Return an en_HK mobile phone number
     * @return string
     */
    public static function mobileNumber()
    {
        return static::numerify(static::randomElement(static::$mobileFormats));
    }

    /**
     * Return an en_HK landline number
     * @return string
     */
    public static function landlineNumber()
    {
        return static::numerify(static::randomElement(static::$landlineFormats));
    }

    /**
     * Return an en_HK fax number
     * @return string
     */
    public static function faxNumber()
    {
        return static::numerify(static::randomElement(static::$faxFormats));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    <?php

namespace Faker\Provider\en_IN;

class Address extends \Faker\Provider\Address
{
    protected static $city = array(
        'Agra','Ahmedabad','Ajmer','Alwar',
        'Bengaluru','Bhubhaneshwar','Bhopal','Bikaner',
        'Chennai','Chandigarh',
        'Darjeeling','Dehra Dun','Delhi',
        'Faridabad',
        'Gandhinagar','Guwahati','Gangtok','Gurgaon',
        'Hyderabad','Hisar',
        'Indore',
        'Jaipur','Jodhpur','Jammu','Jamnagar','Jabalpur',
        'Kolkata','Kanpur','Kota','Kochi',
        'Ludhiana','Lucknow',
        'Mumbai','Meerut','Mysore',
        'Nagpur','Nashik','Noida','New Delhi',
        'Pune','Patna','Panaji','Pilani','Pondicherry',
        'Ratlam','Raipur','Ranchi','Rajkot',
        'Surat','Simla','Srinagar',
        'Thiruvananthapuram','Trichy',
        'Udaipur',
        'Vishakhapattanam','Vadodara',
        'Warangal',
    );

    protected static $state = array(
        
        // States
        'Andhra Pradesh', 'Arunachal Pradesh', 'Assam',
        'Bihar',
        'Chhattisgarh',
        'Goa', 'Gujarat',
        'Haryana', 'Himachal Pradesh',
        'Jammu and Kashmir',
        'Jharkhand',
        'Karnataka', 'Kerala',
        'Madhya Pradesh', 'Maharashtra', 'Manipur', 'Meghalaya', 'Mizoram',
        'Nagaland',
        'Odisha',
        'Punjab',
        'Rajasthan',
        'Sikkim',
        'Tamil Nadu', 'Telangana', 'Tripura',
        'Uttar Pradesh', 'Uttarakhand',
        'West Bengal',
        
        // Union Territories
        'Andaman and Nicobar Islands',
        'Chandigarh',
        'Dadra and Nagar Haveli', 'Daman and Diu', 'Delhi',
        'Lakshadweep',
        'Puducherry'
    );

    protected static $stateAbbr = array(
       'AP', 'AR', 'AS', 'BR', 'CG', 'GA', 'GJ', 'HR', 'HP', 'JK', 'JH', 'KA', 'KL', 'MP', 'MH', 'MN', 'ML', 'MZ', 'NL', 'OD', 'PB', 'RJ', 'SK', 'TN', 'TS', 'TR', 'UP', 'UK', 'WB', 'AN', 'CH', 'DN', 'DD', 'DL', 'LD', 'PY'
    );

    protected static $country = array(
        'Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra', 'Angola', 'Anguilla', 'Antarctica (the territory South of 60 deg S)', 'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba', 'Australia', 'Austria', 'Azerbaijan',
        'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Bouvet Island (Bouvetoya)', 'Brazil', 'British Indian Ocean Territory (Chagos Archipelago)', 'British Virgin Islands', 'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
        'Cambodia', 'Cameroon', 'Canada', 'Cape Verde', 'Cayman Islands', 'Central African Republic', 'Chad', 'Chile', 'China', 'Christmas Island', 'Cocos (Keeling) Islands', 'Colombia', 'Comoros', 'Congo', 'Congo', 'Cook Islands', 'Costa Rica', 'Cote d\'Ivoire', 'Croatia', 'Cuba', 'Cyprus', 'Czech Republic',
        'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic',
        'Ecuador', 'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia',
        'Faroe Islands', 'Falkland Islands (Malvinas)', 'Fiji', 'Finland', 'France', 'French Guiana', 'French Polynesia', 'French Southern Territories',
        'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Gibraltar', 'Greece', 'Greenland', 'Grenada', 'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea', 'Guinea-Bissau', 'Guyana',
        'Haiti', 'Heard Island and McDonald Islands', 'Holy See (Vatican City State)', 'Honduras', 'Hong Kong', 'Hungary',
        'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Isle of Man', 'Israel', 'Italy',
        'Jamaica', 'Japan', 'Jersey', 'Jordan',
        'Kazakhstan', 'Kenya', 'Kiribati', 'Korea', 'Korea', 'Kuwait', 'Kyrgyz Republic',
        'Lao People\'s Democratic Republic', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libyan Arab Jamahiriya', 'Liechtenstein', 'Lithuania', 'Luxembourg',
        'Macao', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Martinique', 'Mauritania', 'Mauritius', 'Mayotte', 'Mexico', 'Micronesia', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Montserrat', 'Morocco', 'Mozambique', 'Myanmar',
        'Namibia', 'Nauru', 'Nepal', 'Netherlands Antilles', 'Netherlands', 'New Caledonia', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Niue', 'Norfolk Island', 'Northern Mariana Islands', 'Norway',
        'Oman',
        'Pakistan', 'Palau', 'Palestinian Territories', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Pitcairn Islands', 'Poland', 'Portugal', 'Puerto Rico',
        'Qatar',
        'Reunion', 'Romania', 'Russian Federation', 'Rwanda',
        'Saint Barthelemy', 'Saint Helena', 'Saint Kitts and Nevis', 'Saint Lucia', 'Saint Martin', 'Saint Pierre and Miquelon', 'Saint Vincent and the Grenadines', 'Samoa', 'San Marino', 'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia (Slovak Republic)', 'Slovenia', 'Solomon Islands', 'Somalia', 'South Africa', 'South Georgia and the South Sandwich Islands', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Svalbard & Jan Mayen Islands', 'Swaziland', 'Sweden', 'Switzerland', 'Syrian Arab Republic',
        'Taiwan', 'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo', 'Tokelau', 'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu',
        'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom', 'United States of America', 'United States Minor Outlying Islands', 'United States Virgin Islands', 'Uruguay', 'Uzbekistan',
        'Vanuatu', 'Venezuela', 'Vietnam',
        'Wallis and Futuna', 'Western Sahara',
        'Yemen',
        'Zambia', 'Zimbabwe'
    );
    protected static $localityName = array(
        'Aundh','Andheri',
        'Borivali','Bandra',
        'Chinchwad','Chandpole','Churchgate','Cyber City',
        'Dadar','Deccan Gymkhana',
        'Goregaon',
        'Hadapsar','Harmada','Hinjewadi',
        'Kormangala','Kharadi',
        'Marathahalli','Model Town','Mansarovar','Malad',
        'Sodala',
        'Virar','Vikhroli',
        'Yerwada','Yeshwanthpura',
    );
    protected static $areaSuffix = array(
        ' Nagar','Pur','Garh','Gunj',' Chowk',
    );
    protected static $postcode = array(
        '1#####','2#####','3#####','4#####','5#####',
    );
    protected static $localityFormats = array(
        '{{firstName}}{{areaSuffix}}',
        '{{localityName}}'
    );
    protected static $addressFormats = array(
        '{{streetAddress}} {{city}} - {{postcode}}',
    );
    protected static $societySuffix = array(
        'Society','Apartments','Heights','Villas',
    );
    protected static $societyNameFormat = array(
        '{{firstName}} {{societySuffix}}'
    );
    protected static $streetAddressFormats = array(
        
        '{{buildingNumber}}, {{locality}},',
        '{{buildingNumber}}, {{societyName}}, {{locality}}',
    );
    public function societySuffix()
    {
        return static::randomElement(static::$societySuffix);
    }
    /**
     * @example Shanti Apartments
     */
    public function societyName()
    {
        return $this->generator->parse(static::randomElement(static::$societyNameFormat));
    }
    /**
     * @example Mumbai
     */
    public function city()
    {
        return static::randomElement(static::$city);
    }
    /**
     * @example Vaishali Nagar
     */
    public function locality()
    {
        return $this->generator->parse(static::randomElement(static::$localityFormats));
    }
    /*
     * @example Kharadi
     */
    public function localityName()
    {
        return $this->generator->parse(static::randomElement(static::$localityName));
    }
    /**
     * @example Nagar
     */
    public function areaSuffix()
    {
        return static::randomElement(static::$areaSuffix);
    }

    /**
     * @example 'Delhi'
     */
    public static function state()
    {
        return static::randomElement(static::$state);
    }

    /**
     * @example 'DL'
     */
    public static function stateAbbr()
    {
        return static::randomElement(static::$stateAbbr);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  <?php

namespace Faker\Provider\en_IN;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{middleNameMale}} {{lastName}}',
        '{{firstNameMale}} {{middleNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameMale}} {{lastName}}',
    );

    /**
     * @link http://www.indiaonlinepages.com/babynames/
     */
    protected static $firstNameMale = array(
        'Aayushman', 'Amrit', 'Anand', 'Abhinav', 'Anil', 'Animesh', 'Arpit', 'Akhil', 'Ajinkya', 'Aniruddh', 'Arun', 'Atul', 'Ajay', 'Abhishek', 'Aditya', 'Ajeet', 'Akshay', 'Arjun', 'Arvind', 'Aadil', 'Aadish', 'Amir', 'Aarif', 'Aatif', 'Abbas', 'Abdul', 'Aslam', 'Azhar', 'Anees', 'Alex', 'Albert',
        'Bahadur', 'Baldev', 'Baalkrishan', 'Balaji', 'Bharat', 'Bhola', 'Bijoy', 'Binod', 'Biren', 'Bishnu', 'Baber', 'Binoya', 'Brock',
        'Chitranjan', 'Chirag', 'Chinmay', 'Charandeep', 'Chand', 'Charlie',
        'Deep', 'Dinesh', 'Devendra', 'Deepesh', 'Dhiraj', 'Darpan', 'Dhanush', 'Daanish', 'David',
        'Ekbal', 'Ehsaan', 'Elias', 'Emran', 'Eddie',
        'Fakaruddin', 'Faisal', 'Faraz', 'Fardeen', 'Feroz',
        'Ganesh', 'Govind', 'Giaan', 'Ghanshyam', 'Gaurav', 'Gauransh', 'Gajendra', 'Gulzar', 'Ghalib',
        'Hari', 'Himesh', 'Hemendra', 'Hanuman', 'Hetan', 'Hrishikesh', 'Himanshu', 'Habib', 'Hassan', 'Harbhajan', 'Harpreet',
        'Ibrahim', 'Iqbal', 'Ishat',
        'Jatin', 'Jagat', 'Jagdish', 'Jaswant', 'Jawahar', 'Jamshed', 'Javed', 'Jobin', 'Jack', 'John',
        'Kartik', 'Koushtubh', 'Kirti', 'Kushal', 'Kailash', 'Kalyan', 'Krishna', 'Kamlesh', 'Kalpit', 'Kabeer', 'Karim',
        'Lalit', 'Lakshmi', 'Labeen',
        'Mohan', 'Mukund', 'Mohan', 'Mohit', 'Manish', 'Moti', 'Mowgli', 'Mohanlal', 'Mitesh', 'Manoj', 'Monin', 'Mahmood', 'Malik', 'Mehul', 'Mustafa', 'Manpreet', 'Mukul', 'Munaf', 'Marlo',
        'Nitin', 'Nayan', 'Naresh', 'Neerendra', 'Nirmal', 'Narayan', 'Nakul', 'Naval', 'Natwar', 'Naseer', 'Nazir', 'Nawab, ',
        'Parveen', 'Pravin', 'Pranab', 'Prabhat', 'Pradeep', 'Prasoon', 'Preet', 'Pranay', 'Parvez', 'Pirzada', 'Peter',
        'Omar', 'Obaid', 'Owais',
        'Qabeel', 'Qabool', 'Qadim',
        'Radhe', 'Radheshyam', 'Raj', 'Raju', 'Rajendra', 'Rajesh', 'Ram', 'Ratan', 'Ram Gopal', 'Rupesh', 'Rupal', 'Ramesh', 'Ricky', 'Rehman', 'Rahim', 'Rashid', 'Raghavan',
        'Somnath', 'Sushant', 'Samir', 'Sumit', 'Shashank', 'Sirish', 'Satish', 'Saurabh', 'Subhash', 'Suraj', 'Surya', 'Sahil', 'Sohail', 'Satishwar', 'Srinivasan', 'Sharad', 'Sai', 'Siddharth', 'Sid', 'Suresh',
        'Tarun', 'Tanay', 'Tushar', 'Tabeed', 'Taahid',
        'Umesh', 'Uday', 'Ujwal', 'Umar', 'Usman',
        'Vivek', 'Vijay', 'Vikrant', 'Vijayent', 'Vicky', 'Varun', 'Virat', 'Venkat',
        'Wahid', 'Wafiq', 'Wafa',
        'Yadu', 'Yadunandan', 'Yash', 'Yogesh',
        'Zaad', 'Zahir', 'Zeeshan',
    );

    protected static $firstNameFemale = array(
        'Aabha', 'Aarti', 'Aarushi', 'Aastha', 'Aayushi', 'Aditi', 'Afreen', 'Aisha', 'Aishwarya', 'Akanksha', 'Akhila', 'Alaknanda', 'Alka', 'Alpa', 'Anshu', 'Ambika', 'Ananya', 'Amrita', 'Amolika', 'Anjana', 'Ankita', 'Anshula', 'Anusha', 'Aruna', 'Astha', 'Avantika',
        'Babita', 'Basanti', 'Bagwati', 'Bhaagyasree', 'Bhairavi', 'Bhanupriya', 'Binita', 'Bimla',
        'Chameli', 'Charu', 'Chhavi', 'Chitra', 'Chhaya', 'Chandni',
        'Damini', 'Devika', 'Dipti', 'Divya', 'Drishti', 'Diya',
        'Esha',
        'Falguni', 'Farah', 'Fatima',
        'Gayatri', 'Geetanjali', 'Gowri', 'Gulab', 'Gunjan',
        'Heena', 'Heer', 'Hema', 'Himani', 'Hira', 'Hina',
        'Indrani', 'Isha', 'Indira',
        'Jagruti', 'Jasmin', 'Jayshree', 'Jiya', 'Juhi', 'Jyoti', 'Julie',
        'Kalpana', 'Kalyani', 'Kamini', 'Kasturi', 'Kiran', 'Komal', 'Kusum', 'Krishna', 'Kanika', 'Kasturba', 'Kunti', 'Kajal', 'Kajol', 'Kirti', 'Kim',
        'Lata', 'Lalita', 'Leela', 'Leelawati', 'Lakshmi', 'Laveena',
        'Madhu', 'Madhavi', 'Maya', 'Mayawati', 'Megha', 'Mona', 'Mridula', 'Mukti', 'Meghana', 'Manjari', 'Mukti', 'Mini', 'Munni', 'Monica',
        'Nagma', 'Naina', 'Nalini', 'Namita', 'Nancy', 'Nandini', 'Namita', 'Narmada', 'Neela', 'Neha', 'Nidhi', 'Nikita', 'Nilam', 'Nilima', 'Nishi', 'Nishita', 'Nupoor', 'Nutan', 'Nitika', 'Niyati', 'Nupur', 'Navami', 'Nishtha',
        'Padama', 'Padmini', 'Payal', 'Poonam', 'Prabha', 'Priyanka', 'Pushpa', 'Pooja', 'Prerna', 'Pamela', 'Pinky', 'Parminder', 'Preshita',
        'Radha', 'Radhika', 'Ragini', 'Rakhi', 'Richa', 'Riddhi', 'Ritika', 'Riya', 'Rohini', 'Roma', 'Ruchi', 'Rachel', 'Rita', 'Rosey', 'Rimi', 'Runjhun',
        'Sabina', 'Sameera', 'Sameedha', 'Sapna', 'Sara', 'Seema', 'Shanti', 'Sheetal', 'Shobha', 'Savita', 'Smriti', 'Sneha', 'Sona', 'Sunita', 'Supriya', 'Sushmita', 'Swati', 'Sweta', 'Shweta', 'Sukriti',
        'Tanuja', 'Tejaswani', 'Tulsi', 'Trishana', 'Teena',
        'Uma', 'Urmi', 'Urmila', 'Urvashi', 'Usha', 'Upasana',
        'Vineeta', 'Vimala', 'Veena', 'Vaishali',
        'Yamini', 'Yasmin',
        'Zeenat', 'Zara',
    );

    /**
     * @link http://genealogy.familyeducation.com/browse/origin/indian
     */
    protected static $lastName = array(
        'Acharya','Agarwal','Agate','Aggarwal','Agrawal','Ahluwalia','Ahuja','Amble','Amin','Anand','Andra','Anne','Anthony','Apte','Arora','Arya','Atwal','Aurora',
        'Babu','Badal','Badami','Bahl','Bahri','Bail','Bains','Bajaj','Bajwa','Bakshi','Bal','Bala','Balakrishnan','Balan','Balasubramanian','Balay','Bali','Bandi','Banerjee','Banik','Bansal','Barad','Baral','Baria','Barman','Basak','Bassi','Basu','Bath','Batra','Batta','Bava','Bawa','Bedi','Beharry','Behl','Ben','Bera','Bhagat','Bhakta','Bhalla','Bhandari','Bhardwaj','Bhargava','Bhasin','Bhat','Bhatia','Bhatnagar','Bhatt','Bhattacharyya','Bhatti','Bhavsar','Bir','Biswas','Biyani','Binnani','Boase','Bobal','Bora','Borah','Borde','Borra','Bose','Brahmbhatt','Brar','Buch','Bumb','Butala',
        'Chacko','Chad','Chada','Chadha','Chahal','Chakrabarti','Chakraborty','Chana','Chand','Chanda','Chander','Chandra','Chandran','Char','Chatterjee','Chaudhari','Chaudhary','Chaudhry','Chaudhuri','Chaudry','Chauhan','Chawla','Cheema','Cherian','Chhabra','Chia','Chohan','Chokshi','Chopra','Choudhary','Choudhry','Choudhury','Chowdhury','Comar','Contractor',
        'Dad','Dada','Dalal','Dani','Dar','Dara','Das','Dasgupta','Dash','Dass','Date','Datta','Dave','Dayal','De','Deep','Deo','Deol','Desai','Deshmukh','Deshpande','Devan','Devi','Dewan','Dey','Dhaliwal','Dhar','Dhawan','Dhillon','Dhingra','Dial','Din','Divan','Dixit','Doctor','Dodiya','Dora','Doshi','Dua','Dube','Dubey','Dugal','Dugar','Dutt','Dutta','D’Alia','Dyal',
        'Edwin',
        'Gaba','Gade','Gagrani','Gala','Gandhi','Ganesan','Ganesh','Ganguly','Gara','Garde','Garg','George','Gera','Ghose','Ghosh','Gill','Gobin','Goda','Goel','Gokhale','Gola','Gole','Golla','Gopal','Goswami','Gour','Goyal','Grewal','Grover','Guha','Gulati','Gupta',
        'Halder','Handa','Hans','Hari','Harjo','Hayer','Hayre','Hegde','Hora',
        'Inani','Issac','Iyengar','Iyer',
        'Jacob','Jaggi','Jain','Jani','Jayaraman','Jha','Jhaveri','Johal','Joshi',
        'Kabra','Kadakia','Kade','Kakar','Kala','Kale','Kalita','Kalla','Kamdar','Kanda','Kannan','Kant','Kapadia','Kapoor','Kapur','Kar','Kara','Karan','Kari','Karnik','Karpe','Kashyap','Kata','Kaul','Kaur','Keer','Khalsa','Khan','Khanna','Khare','Khatri','Khosla','Khurana','Kibe','Kohli','Konda','Korpal','Koshy','Kota','Kothari','Krish','Krishna','Krishnamurthy','Krishnan','Kulkarni','Kumar','Kumer','Kunda','Kurian','Kuruvilla',
        'Lachman','Lad','Lal','Lala','Lall','Lalla','Lanka','Lata','Lodi','Loke','Loyal','Luthra',
        'Madan','Magar','Mahabir','Mahadeo','Mahajan','Mahal','Maharaj','Maheshwari','Majumdar','Malhotra','Mall','Mallick','Malpani','Mammen','Mand','Manda','Mandal','Mander','Mane','Mangal','Mangat','Mani','Mann','Mannan','Manne','Maraj','Masih','Master','Mathai','Mathew','Mathur','Matthai','Meda','Mehan','Mehra','Mehrotra','Mehta','Meka','Memon','Menon','Merchant','Minhas','Mishra','Misra','Mistry','Mital','Mitra','Mittal','Mitter','Modi','Mody','Mogul','Mohabir','Mohan','Mohanty','Morar','More','Mukherjee','Mukhopadhyay','Muni','Munshi','Murthy','Murty','Mutti',
        'Nadig','Nadkarni','Nagar','Nagarajan','Nagi','Nagy','Naidu','Naik','Nair','Nanda','Narain','Narang','Narasimhan','Narayan','Narayanan','Narine','Naruka','Narula','Natarajan','Nath','Natt','Nawal','Nayak','Nayar','Nazareth','Nigam','Nori',
        'Oak','Om','Oommen','Oza',
        'Padmanabhan','Pai','Pal','Palan','Pall','Palla','Panchal','Pandey','Pandit','Pandya','Pant','Pardeshi','Parekh','Parikh','Parmar','Parmer','Parsa','Patel','Pathak','Patil','Patla','Pau','Peri','Persad','Persaud','Philip','Pillai','Pillay','Pingle','Prabhakar','Prabhu','Pradhan','Prakash','Prasad','Prashad','Puri','Purohit',
        'Radhakrishnan','Raghavan','Rai','Raj','Raja','Rajagopal','Rajagopalan','Rajan','Raju','Ram','Rama','Ramachandran','Ramakrishnan','Raman','Ramanathan','Ramaswamy','Ramesh','Ramkissoon','Ramnarine','Rampersad','Rampersaud','Ramroop','Ramson','Rana','Randhawa','Ranganathan','Rao','Rastogi','Ratta','Rattan','Ratti','Rau','Raval','Ravel','Ravi','Ray','Reddy','Rege','Rout','Roy',
        'Sabharwal','Sachar','Sachdev','Sachdeva','Sagar','Saha','Sahni','Sahota','Saini','Salvi','Sama','Sami','Sampath','Samra','Samuel','Sandal','Sandhu','Sane','Sangha','Sanghvi','Sani','Sankar','Sankaran','Sant','Saraf','Saran','Sarin','Sarkar','Sarma','Sarna','Sarraf','Sastry','Sathe','Savant','Sawhney','Saxena','Sehgal','Sekhon','Sem','Sen','Sengupta','Seshadri','Seth','Sethi','Setty','Sha','Shah','Shan','Shankar','Shanker','Sharaf','Sharma','Shenoy','Shere','Sheth','Shetty','Shroff','Shukla','Sibal','Sidhu','Sing','Singh','Singhal','Sinha','Sodhi','Solanki','Som','Soman','Somani','Sodhani','Soni','Sood','Sridhar','Srinivas','Srinivasan','Srivastava','Subramaniam','Subramanian','Sule','Sundaram','Sunder','Sur','Sura','Surana','Suresh','Suri','Swaminathan','Swamy',
        'Tailor','Tak','Talwar','Tandon','Taneja','Tank','Tara','Tata','Tella','Thaker','Thakkar','Thakur','Thaman','Thomas','Tiwari','Toor','Tripathi','Trivedi',
        'Upadhyay','Uppal','Usman',
        'Vaidya','Vala','Varghese','Varkey','Varma','Varty','Varughese','Vasa','Venkataraman','Venkatesh','Verma','Vig','Virk','Viswanathan','Vohra','Vora','Vyas',
        'Wable','Wadhwa','Wagle','Wali','Walia','Walla','Warrior','Wason',
        'Yadav','Yogi','Yohannan',
        'Zacharia','Zachariah',
    );

    /**
     * @link http://www.indianchild.com/indian_middle_names.htm
     */
    protected static $middleNameMale = array(
        'Dev','Chandra','Kumar','Lal','Prasad','Raj','Singh','Rao','Ram','Pratap','Bhai',
    );
    
    /**
     * Return male middle name
     *
     * @example 'Kumar'
     *
     * @access public
     *
     * @return string Middle name
     */
    public function middleNameMale()
    {
        return static::randomElement(static::$middleNameMale);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          <?php

namespace Faker\Provider\en_IN;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    protected static $formats = array(
        '+91 ## ########',
        '+91 ### #######',
        '0## ########',
        '0### #######'
    );

    /**
     * An array of en_IN mobile (cell) phone number formats
     * @var array
     */
    protected static $mobileFormats = array(
        '+91 9#########',
        '+91 8#########',
        '+91 7#########',
        '09#########',
        '08#########',
        '07#########'
    );

    /**
     * Return a en_IN mobile phone number
     * @return string
     */
    public static function mobileNumber()
    {
        return static::numerify(static::randomElement(static::$mobileFormats));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               <?php

namespace Faker\Provider\en_NG;

class Address extends \Faker\Provider\Address
{
    protected static $postcode = array('#####', '## ###');

    private static $county = array(
        'Abuja', 'Abia', 'Adamawa', 'Akwa Ibom', 'Anambra',
        'Bauchi', 'Bayelsa', 'Benue', 'Borno',
        'Cross River',
        'Delta',
        'Ebonyi', 'Edo', 'Ekiti', 'Enugu', 'Gombe',
        'Imo', 'Jigawa',
        'Kaduna', 'Kano', 'Katsina', 'Kebbi', 'Kogi', 'Kwara',
        'Lagos',
        'Nasarawa', 'Niger',
        'Ogun', 'Ondo', 'Osun', 'Oyo',
        'Plateau',
        'Rivers',
        'Sokoto',
        'Taraba',
        'Yobe',
        'Zamfara'
    );

    protected static $country = array(
        'Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra', 'Angola', 'Anguilla', 'Antarctica (the territory South of 60 deg S)', 'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba', 'Australia', 'Austria', 'Azerbaijan',
        'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Bouvet Island (Bouvetoya)', 'Brazil', 'British Indian Ocean Territory (Chagos Archipelago)', 'British Virgin Islands', 'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
        'Cambodia', 'Cameroon', 'Canada', 'Cape Verde', 'Cayman Islands', 'Central African Republic', 'Chad', 'Chile', 'China', 'Christmas Island', 'Cocos (Keeling) Islands', 'Colombia', 'Comoros', 'Congo', 'Congo', 'Cook Islands', 'Costa Rica', 'Cote d\'Ivoire', 'Croatia', 'Cuba', 'Cyprus', 'Czech Republic',
        'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic',
        'Ecuador', 'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia',
        'Faroe Islands', 'Falkland Islands (Malvinas)', 'Fiji', 'Finland', 'France', 'French Guiana', 'French Polynesia', 'French Southern Territories',
        'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Gibraltar', 'Greece', 'Greenland', 'Grenada', 'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea', 'Guinea-Bissau', 'Guyana',
        'Haiti', 'Heard Island and McDonald Islands', 'Holy See (Vatican City State)', 'Honduras', 'Hong Kong', 'Hungary',
        'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Isle of Man', 'Israel', 'Italy',
        'Jamaica', 'Japan', 'Jersey', 'Jordan',
        'Kazakhstan', 'Kenya', 'Kiribati', 'Korea', 'Korea', 'Kuwait', 'Kyrgyz Republic',
        'Lao People\'s Democratic Republic', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libyan Arab Jamahiriya', 'Liechtenstein', 'Lithuania', 'Luxembourg',
        'Macao', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Martinique', 'Mauritania', 'Mauritius', 'Mayotte', 'Mexico', 'Micronesia', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Montserrat', 'Morocco', 'Mozambique', 'Myanmar',
        'Namibia', 'Nauru', 'Nepal', 'Netherlands Antilles', 'Netherlands', 'New Caledonia', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Niue', 'Norfolk Island', 'Northern Mariana Islands', 'Norway',
        'Oman',
        'Pakistan', 'Palau', 'Palestinian Territories', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Pitcairn Islands', 'Poland', 'Portugal', 'Puerto Rico',
        'Qatar',
        'Reunion', 'Romania', 'Russian Federation', 'Rwanda',
        'Saint Barthelemy', 'Saint Helena', 'Saint Kitts and Nevis', 'Saint Lucia', 'Saint Martin', 'Saint Pierre and Miquelon', 'Saint Vincent and the Grenadines', 'Samoa', 'San Marino', 'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia (Slovak Republic)', 'Slovenia', 'Solomon Islands', 'Somalia', 'South Africa', 'South Georgia and the South Sandwich Islands', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Svalbard & Jan Mayen Islands', 'Swaziland', 'Sweden', 'Switzerland', 'Syrian Arab Republic',
        'Taiwan', 'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo', 'Tokelau', 'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu',
        'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom', 'United States of America', 'United States Minor Outlying Islands', 'United States Virgin Islands', 'Uruguay', 'Uzbekistan',
        'Vanuatu', 'Venezuela', 'Vietnam',
        'Wallis and Futuna', 'Western Sahara',
        'Yemen',
        'Zambia', 'Zimbabwe'
    );

    private static $regions = array(
        'Abakaliki', 'Abeokuta', 'Akure', 'Asaba', 'Awka',
        'Bauchi',
        'Calabar', 'City',
        'Damaturu', 'Dutse',
        'Ekiti', 'Enugu',
        'Gombe', 'Gusau',
        'Ibadan', 'Ikeja', 'Ilorin',
        'Jalingo', 'Jos',
        'Kaduna', 'Kano', 'Katsina', 'Kebbi',
        'Lafia', 'Lokoja',
        'Maiduguri', 'Makurdi', 'Minna',
        'Oshogbo', 'Owerri',
        'Port-Harcourt',
        'Sokoto',
        'Umuahia', 'Uyo',
        'Yenagoa', 'Yola'
    );

    /**
     * Randomly returns a Nigerian state or county.
     *
     * @example 'Lagos'
     *
     * @return string
     */
    public static function county()
    {
        return static::randomElement(static::$county);
    }

    /**
     * Randomly returns a Nigerian region of a state.
     *
     * @example 'Ikeja'
     *
     * @return string
     */
    public static function region()
    {
        return static::randomElement(static::$regions);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    <?php

// data source

namespace Faker\Provider\en_NG;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{lastName}}'
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameFemale}} {{lastName}}'
    );

    /**
     * An array of typical Nigerian male firstnames.
     * @link https://andela-celisha-wigwe.github.io/names.html
     */
    protected static $firstNameMale = array(
        'Abimbola','Abisola','Abisoye','Adeboye','Adedayo','Adegoke', 'Akande', 'Akanni', 'Alade', 'Ayinde', 'Azubuike',
        'Banji', 'Bankole', 'Buchi', 'Bukola',
        'Chinedu', 'Chisom', 'Chukwu',
        'Damilare', 'Damilola', 'Danjuma',
        'Ebiowei', 'Emeka', 'Emmanuel', 'Esse',
        'Funmilade', 'Funmilayo',
        'Gbeminiyi', 'Gbemisola',
        'Habiba', 'Ifeanyichukwu',
        'Ikenna', 'Ikhidie', 'Ireti',
        'Jadesola', 'Johnson',
        'Kayode', 'Kemi', 'Kubra', 'Kubura',
        'Lolade',
        'Makinwa', 'Mohammed', 'Musa', 'Muyiwa',
        'Nnamdi',
        'Olaide', 'Olufunmi', 'Olumide', 'Oluwunmi', 'Onoriode',
        'Remilekun', 'Rotimi',
        'Shade', 'Shalewa', 'Sname',
        'Tari', 'Temitope', 'Titilope', 'Tobiloba', 'Toke', 'Tomiloba', 'Tope',
        'Uzodimma',
        'Wale',
        'Yakubu', 'Yusuf', 'Yusuf',
    );

    /**
     * @link https://andela-celisha-wigwe.github.io/names.html
     */
    protected static $firstNameFemale = array(
        'Adaugo', 'Akunna', 'Aminat', 'Aminu', 'Augustina', 'Ayebatari',
        'Cherechi', 'Chiamaka', 'Chimamanda', 'Chinyere', 'Chizoba',
        'Ebiere', 'Efe',
        'Fatima', 'Ifeoma',
        'Ifunanya', 'Isioma',
        'Jolayemi',
        'Lola',
        'Obioma', 'Omawunmi', 'Omolara', 'Onome',
        'Rasheedah',
        'Sekinat', 'Simisola', 'Sumayyah',
        'Titi', 'Titilayo', 'Toluwani',
        'Zainab'
    );

    /**
     * @link https://andela-celisha-wigwe.github.io/names.html
     */
    protected static $lastName = array(
        'Abiodun', 'Abiola', 'Abodunrin', 'Abosede', 'Adaobi', 'Adebayo', 'Adegboye', 'Adegoke', 'Ademayowa', 'Ademola', 'Adeniyan', 'Adeoluwa', 'Aderinsola', 'Aderonke', 'Adesina', 'Adewale', 'Adewale', 'Adewale', 'Adewunmi', 'Adewura', 'Adeyemo', 'Afolabi', 'Afunku', 'Agboola', 'Agboola', 'Agnes', 'Aigbiniode', 'Ajakaiye', 'Ajose-adeogun', 'Akeem-omosanya', 'Akerele', 'Akintade', 'Aligbe', 'Amaechi', 'Aminat', 'Aremu', 'Atanda', 'Ayisat', 'Ayobami', 'Ayomide', 'Ayomide',
        'Babalola', 'Babatunde', 'Balogun', 'Bamisebi', 'Bello', 'Busari',
        'Chibike', 'Chibuike', 'Chidinma', 'Chidozie', 'Christian', 'Clare',
        'David', 'David',
        'Ebubechukwu', 'Egbochukwu', 'Ehigiator', 'Ekwueme', 'Elebiyo', 'Elizabeth', 'Elizabeth', 'Elizabeth', 'Emmanuel', 'Emmanuel', 'Esther',
        'Funmilayo',
        'Gbadamosi', 'Gbogboade', 'Grace',
        'Habeeb', 'Hanifat', 'Isaac',
        'Ismail', 'Isokun', 'Isreal', 'Iyalla',
        'Jamiu', 'Jimoh', 'Joshua', 'Justina',
        'Katherine', 'Kayode', 'Kayode', 'Kimberly',
        'Ladega', 'Latifat', 'Lawal', 'Leonard',
        'Makuachukwu', 'Maryam', 'Maryjane', 'Mayowa', 'Miracle', 'Mobolaji', 'Mogbadunade', 'Motalo', 'Muinat', 'Mukaram', 'Mustapha', 'Mutiat',
        'Ndukwu', 'Ngozi', 'Nojeem', 'Nwachukwu', 'Nwogu', 'Nwuzor',
        'Obiageli', 'Obianuju', 'Odunayo', 'Odunayo', 'Ogunbanwo', 'Ogunwande', 'Okonkwo', 'Okunola', 'Oladeji', 'Oladimeji', 'Olaoluwa', 'Olasunkanmi', 'Olasunkanmi-fasayo', 'Olawale', 'Olubukola', 'Olubunmi', 'Olufeyikemi', 'Olumide', 'Olutola', 'Oluwakemi', 'Oluwanisola', 'Oluwaseun', 'Oluwaseyi', 'Oluwashina', 'Oluwatosin', 'Omobolaji', 'Omobolanle', 'Omolara', 'Omowale', 'Onohinosen', 'Onose', 'Onyinyechukwu', 'Opeyemi', 'Osuagwu', 'Oyebola', 'Oyelude', 'Oyinkansola',
        'Peter',
        'Sabdat', 'Saheed', 'Salami', 'Samuel', 'Sanusi', 'Sarah', 'Segunmaru', 'Sekinat', 'Sulaimon', 'Sylvester',
        'Taiwo', 'Tamunoemi', 'Tella', 'Temitope', 'Tolulope',
        'Uchechi',
        'Wasiu', 'Wilcox', 'Wuraola',
        'Yaqub', 'Yussuf'
    );
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              <?php

namespace Faker\Provider\en_NG;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    protected static $formats = array(
      // Local
      '0703#######',
      '0704#######',
      '0705#######',
      '0706#######',
      '0707#######',
      '0708#######',
      '0709#######',
      '0802#######',
      '0803#######',
      '0804#######',
      '0805#######',
      '0806#######',
      '0807#######',
      '0808#######',
      '0809#######',
      '0810#######',
      '0811#######',
      '0812#######',
      '0813#######',
      '0814#######',
      '0815#######',
      '0816#######',
      '0817#######',
      '0818#######',
      '0819#######',
      '0902#######',
      '0903#######',
      '0905#######',
      '0908#######',
      '0909#######',
      
      '+234703#######',
      '+234704#######',
      '+234705#######',
      '+234706#######',
      '+234707#######',
      '+234708#######',
      '+234709#######',
      '+234802#######',
      '+234803#######',
      '+234804#######',
      '+234805#######',
      '+234806#######',
      '+234807#######',
      '+234808#######',
      '+234809#######',
      '+234810#######',
      '+234811#######',
      '+234812#######',
      '+234813#######',
      '+234814#######',
      '+234815#######',
      '+234816#######',
      '+234817#######',
      '+234818#######',
      '+234819#######',
      '+234902#######',
      '+234903#######',
      '+234905#######',
      '+234908#######',
      '+234909#######',

      '0703 ### ####',
      '0704 ### ####',
      '0705 ### ####',
      '0706 ### ####',
      '0707 ### ####',
      '0708 ### ####',
      '0709 ### ####',
      '0802 ### ####',
      '0803 ### ####',
      '0804 ### ####',
      '0805 ### ####',
      '0806 ### ####',
      '0807 ### ####',
      '0808 ### ####',
      '0809 ### ####',
      '0810 ### ####',
      '0811 ### ####',
      '0812 ### ####',
      '0813 ### ####',
      '0814 ### ####',
      '0815 ### ####',
      '0816 ### ####',
      '0817 ### ####',
      '0818 ### ####',
      '0819 ### ####',
      '0902 ### ####',
      '0903 ### ####',
      '0905 ### ####',
      '0908 ### ####',
      '0909 ### ####',
      
      '+234 703 ### ####',
      '+234 704 ### ####',
      '+234 705 ### ####',
      '+234 706 ### ####',
      '+234 707 ### ####',
      '+234 708 ### ####',
      '+234 709 ### ####',
      '+234 802 ### ####',
      '+234 803 ### ####',
      '+234 804 ### ####',
      '+234 805 ### ####',
      '+234 806 ### ####',
      '+234 807 ### ####',
      '+234 808 ### ####',
      '+234 809 ### ####',
      '+234 810 ### ####',
      '+234 811 ### ####',
      '+234 812 ### ####',
      '+234 813 ### ####',
      '+234 814 ### ####',
      '+234 815 ### ####',
      '+234 816 ### ####',
      '+234 817 ### ####',
      '+234 818 ### ####',
      '+234 819 ### ####',
      '+234 902 ### ####',
      '+234 903 ### ####',
      '+234 905 ### ####',
      '+234 908 ### ####',
      '+234 909 ### ####',
    );
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                <?php

namespace Faker\Provider\en_NZ;

class Address extends \Faker\Provider\en_US\Address
{

    /**
     * An array of en_NZ (New Zealand) building number formats
     * @var array
     */
    protected static $buildingNumber = array('#', '##', '###');

    /**
     * An array of en_NZ (New Zealand) street suffixes
     * @var array
     */
    protected static $streetSuffix = array(
        'Avenue', 'Close', 'Court', 'Crescent', 'Drive', 'Esplanade', 'Grove', 'Heights', 'Highway', 'Hill', 'Lane', 'Line', 'Mall', 'Parade', 'Place', 'Quay', 'Rise', 'Road', 'Square', 'Street', 'Terrace', 'Way'
    );

    /**
     * City suffixes
     * @var array
     */
    protected static $citySuffix = array('ville', 'ston');

    /**
     * City formats
     * @var array
     */
    protected static $cityFormats = array('{{firstName}}{{citySuffix}}');

    /**
     * An array of en_NZ (New Zealand) regions
     * @see http://en.wikipedia.org/wiki/Regions_of_New_Zealand
     * @var array
     */
    protected static $region = array(
        'Auckland', 'Bay of Plenty', 'Canterbury', 'Gisborne', 'Hawkes Bay', 'Manawatu-Whanganui', 'Marlborough', 'Nelson', 'Northland', 'Otago', 'Southland', 'Taranaki', 'Tasman', 'Waikato', 'Wellington', 'West Coast'
    );

    /**
     * An array of en_NZ (New Zealand) poscode formats
     * @var array
     */
    protected static $postcode = array('####');

    /**
     * An array of en_NZ (New Zealand) address formats
     * @var array
     */
    protected static $addressFormats = array('{{buildingNumber}} {{streetName}}, {{city}}, {{region}}, {{postcode}}');

    /**
     * An array of en_NZ (New Zealand) street address formats
     * @var array
     */
    protected static $streetAddressFormats = array('{{buildingNumber}} {{streetName}}');

    /**
     * Return a en_NZ (New Zealand) postcode
     * @return string
     */
    public static function postcode()
    {
        return static::numerify(static::randomElement(static::$postcode));
    }

    /**
     * Return a en_NZ (New Zealand) region
     * @return string
     */
    public static function region()
    {
        return static::randomElement(static::$region);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               <?php

namespace Faker\Provider\en_NZ;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    /**
     * An array of en_NZ landline phone number formats
     * @var array
     */
    protected static $formats = array(
        // National Calls
        '{{areaCode}}{{beginningNumber}}######',
        '{{areaCode}} {{beginningNumber}}## ####'
    );

    /**
     * An array of en_NZ mobile (cell) phone number formats
     * @var array
     */
    protected static $mobileFormats = array(
        // Local
        '02########',
        '02#########',
        '02# ### ####',
        '02# #### ####'
    );

    /**
     * An array of toll free phone number formats
     * @var array
     */
    protected static $tollFreeFormats = array(
        '0508######',
        '0508 ######',
        '0508 ### ###',
        '0800######',
        '0800 ######',
        '0800 ### ###',
    );

    /**
     * An array of en_NZ landline area codes
     * @var array
     */
    protected static $areaCodes = array(
        '02', '03', '04', '06', '07', '09'
    );

    /**
     * An array of en_NZ landline beginning numbers
     * @var array
     */
    protected static $beginningNumbers = array(
        '2', '3', '4', '5', '6', '7', '8', '9'
    );

    /**
     * Return a en_NZ mobile phone number
     * @return string
     */
    public static function mobileNumber()
    {
        return static::numerify(static::randomElement(static::$mobileFormats));
    }

    /**
     * Return a en_NZ toll free phone number
     * @return string
     */
    public static function tollFreeNumber()
    {
        return static::numerify(static::randomElement(static::$tollFreeFormats));
    }

    /**
     * Return a en_NZ landline area code
     * @return string
     */
    public static function areaCode()
    {
        return static::numerify(static::randomElement(static::$areaCodes));
    }

    /**
     * Return a en_NZ landline beginning number
     * @return string
     */
    public static function beginningNumber()
    {
        return static::numerify(static::randomElement(static::$beginningNumbers));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      <?php

namespace Faker\Provider\en_PH;

class Address extends \Faker\Provider\en_US\Address
{
    protected static $streetNameFormats = array(
        '{{lastName}} {{streetSuffix}}'
    );

    //http://en.wikipedia.org/wiki/Postal_addresses_in_the_Philippines
    protected static $addressFormats = array(
        '{{streetAddress}}, {{barangay}}, {{city}} {{postcode}} {{province}}', '{{streetAddress}}, {{municipality}} {{postcode}} {{province}}'
    );

    protected static $buildingNumber = array('##A', '##', '##A/##', '##/##');
    protected static $postcode = array('####');

    //http://en.wikipedia.org/wiki/Provinces_of_the_Philippines
    protected static $province = array(
        'Abra', 'Agusan del Norte', 'Agusan del Sur', 'Aklan', 'Albay',
        'Antique', 'Apayao', 'Aurora', 'Basilan', 'Bataan', 'Batanes',
        'Batangas', 'Benguet', 'Biliran', 'Bohol', 'Bukidnon', 'Bulacan',
        'Cagayan', 'Camarines Norte', 'Camarines Sur', 'Camiguin', 'Capiz',
        'Catanduanes', 'Cavite', 'Cebu', 'Compostela Valley', 'Cotabato',
        'Davao del Norte', 'Davao del Sur', 'Davao Oriental',
        'Dinagat Islands', 'Eastern Samar', 'Guimaras', 'Ifugao',
        'Ilocos Norte', 'Ilocos Sur', 'Iloilo', 'Isabela', 'Kalinga',
        'La Union', 'Laguna', 'Lanao del Norte', 'Lanao del Sur',
        'Leyte', 'Maguindanao', 'Marinduque', 'Masbate',
        'Misamis Occidental', 'Misamis Oriental',
        'Mountain Province', 'Negros Occidental', 'Negros Oriental',
        'Northern Samar', 'Nueva Ecija', 'Nueva Vizcaya',
        'Occidental Mindoro', 'Oriental Mindoro', 'Palawan',
        'Pampanga', 'Pangasinan', 'Quezon', 'Quirino', 'Rizal',
        'Romblon', 'Samar', 'Sarangani', 'Siquijor', 'Sorsogon',
        'South Cotabato', 'Southern Leyte', 'Sultan Kudarat', 'Sulu',
        'Surigao del Norte', 'Surigao del Sur', 'Tarlac',
        'Tawi-Tawi', 'Zambales', 'Zamboanga del Norte',
        'Zamboanga del Sur', 'Zamboanga Sibugay', 'Metro Manila'
    );

    //http://en.wikipedia.org/wiki/List_of_cities_in_the_Philippines
    protected static $city = array(
        'Caloocan', 'Las Piñas', 'Makati', 'Malabon', 'Mandaluyong',
        'Manila', 'Marikina', 'Muntinlupa', 'Navotas', 'Parañaque', 'Pasay',
        'Pasig', 'Quezon City', 'San Juan', 'Taguig', 'Valenzuela',
        'Butuan', 'Cabadbaran', 'Bayugan', 'Legazpi', 'Ligao', 'Tabaco',
        'Isabela', 'Lamitan', 'Balanga', 'Batangas City', 'Lipa', 'Tanauan',
        'Baguio', 'Tagbilaran', 'Malaybalay', 'Valencia', 'Malolos',
        'Meycauayan', 'San Jose del Monte', 'Tuguegarao', 'Iriga', 'Naga',
        'Roxas', 'Bacoor', 'Cavite City', 'Dasmariñas', 'Imus', 'Tagaytay',
        'Trece Martires', 'Bogo', 'Carcar', 'Cebu City', 'Danao', 'Lapu-Lapu',
        'Mandaue', 'Naga', 'Talisay', 'Toledo', 'Kidapawan', 'Panabo', 'Samal',
        'Tagum', 'Davao City', 'Digos', 'Mati', 'Borongan', 'Batac', 'Laoag',
        'Candon', 'Vigan', 'Iloilo City', 'Passi', 'Cauayan', 'Ilagan',
        'Santiago', 'Tabuk', 'San Fernando', 'Biñan', 'Cabuyao', 'Calamba',
        'San Pablo', 'Santa Rosa', 'San Pedro', 'Iligan', 'Marawi', 'Baybay',
        'Ormoc', 'Tacloban', 'Cotabato City', 'Masbate City', 'Oroquieta',
        'Ozamiz', 'Tangub', 'Cagayan de Oro', 'El Salvador', 'Gingoog',
        'Bacolod', 'Bago', 'Cadiz', 'Escalante', 'Himamaylan', 'Kabankalan',
        'La Carlota', 'Sagay', 'San Carlos', 'Silay', 'Sipalay', 'Talisay',
        'Victorias', 'Bais', 'Bayawan', 'Canlaon', 'Dumaguete', 'Guihulngan',
        'Tanjay', 'Cabanatuan', 'Gapan', 'Muñoz', 'Palayan', 'San Jose',
        'Calapan', 'Puerto Princesa', 'Angeles', 'Mabalacat',
        'San Fernando', 'Alaminos', 'Dagupan', 'San Carlos',
        'Urdaneta', 'Lucena', 'Tayabas', 'Antipolo','Calbayog', 'Catbalogan',
        'Sorsogon City', 'General Santos', 'Koronadal', 'Maasin', 'Tacurong',
        'Surigao City', 'Bislig', 'Tandag', 'Tarlac City','Olongapo',
        'Dapitan', 'Dipolog', 'Pagadian', 'Zamboanga City'
    );

    //http://en.wikipedia.org/wiki/List_of_Philippine_cities_and_municipalities_by_population
    protected static $municipality = array(
        'Bangued', 'Boliney', 'Bucay', 'Bucloc', 'Daguioman', 'Danglas',
        'Dolores', 'La Paz', 'Lacub', 'Lagangilang', 'Lagayan', 'Langiden',
        'Licuan-Baay', 'Luba', 'Malibcong', 'Manabo', 'Peñarrubia',
        'Pidigan', 'Pilar', 'Sallapadan', 'San Isidro', 'San Juan',
        'San Quintin', 'Tayum', 'Tineg', 'Tubo', 'Villaviciosa',
        'Butuan City', 'Cabadbaran City', 'Buenavista', 'Carmen',
        'Jabonga', 'Kitcharao', 'Las Nieves', 'Magallanes',
        'Nasipit', 'Remedios T. Romualdez', 'Santiago', 'Tubay',
        'Bayugan City', 'Bunawan', 'Esperanza', 'La Paz', 'Loreto',
        'Prosperidad', 'Rosario', 'San Francisco', 'San Luis',
        'Santa Josefa', 'Sibagat', 'Talacogon', 'Trento', 'Veruela',
        'Altavas', 'Balete', 'Banga', 'Batan', 'Buruanga', 'Ibajay',
        'Kalibo', 'Lezo', 'Libacao', 'Madalag', 'Makato', 'Malay',
        'Malinao', 'Nabas', 'New Washington', 'Numancia', 'Tangalan',
        'Legazpi City', 'Ligao City', 'Tabaco City', 'Bacacay', 'Camalig',
        'Daraga', 'Guinobatan', 'Jovellar', 'Libon', 'Malilipot', 'Malinao',
        'Manito', 'Oas', 'Pio Duran', 'Polangui', 'Rapu-Rapu',
        'Santo Domingo', 'Anini-y', 'Barbaza', 'Belison', 'Bugasong',
        'Caluya', 'Culasi', 'Hamtic', 'Laua-an', 'Libertad', 'Pandan',
        'Patnongon', 'San Jose', 'San Remigio', 'Sebaste', 'Sibalom',
        'Tibiao', 'Tobias Fornier', 'Valderrama', 'Calanasan', 'Conner',
        'Flora', 'Kabugao', 'Luna', 'Pudtol', 'Santa Marcela', 'Baler',
        'Casiguran', 'Dilasag', 'Dinalungan', 'Dingalan', 'Dipaculao',
        'Maria Aurora', 'San Luis', 'Isabela City', 'Lamitan City', 'Akbar',
        'Al-Barka', 'Hadji Mohammad Ajul', 'Hadji Muhtamad', 'Lantawan',
        'Maluso', 'Sumisip', 'Tabuan-Lasa', 'Tipo-Tipo', 'Tuburan',
        'Ungkaya Pukan', 'Balanga City', 'Abucay', 'Bagac', 'Dinalupihan',
        'Hermosa', 'Limay', 'Mariveles', 'Morong', 'Orani', 'Orion', 'Pilar',
        'Samal', 'Basco', 'Itbayat', 'Ivana', 'Mahatao', 'Sabtang', 'Uyugan',
        'Batangas City', 'Lipa City', 'Tanauan City', 'Agoncillo',
        'Alitagtag', 'Balayan', 'Balete', 'Bauan', 'Calaca', 'Calatagan',
        'Cuenca', 'Ibaan', 'Laurel', 'Lemery', 'Lian', 'Lobo', 'Mabini',
        'Malvar', 'Mataas na Kahoy', 'Nasugbu', 'Padre Garcia', 'Rosario',
        'San Jose', 'San Juan', 'San Luis', 'San Nicolas', 'San Pascual',
        'Santa Teresita', 'Santo Tomas', 'Taal', 'Talisay', 'Taysan',
        'Tingloy', 'Tuy', 'Baguio City', 'Atok', 'Bakun', 'Bokod', 'Buguias',
        'Itogon', 'Kabayan', 'Kapangan', 'Kibungan', 'La Trinidad',
        'Mankayan', 'Sablan', 'Tuba', 'Tublay', 'Almeria', 'Biliran',
        'Cabucgayan', 'Caibiran', 'Culaba', 'Kawayan', 'Maripipi', 'Naval',
        'Tagbilaran City', 'Alburquerque', 'Alicia', 'Anda', 'Antequera',
        'Baclayon', 'Balilihan', 'Batuan', 'Bien Unido', 'Bilar',
        'Buenavista', 'Calape', 'Candijay', 'Carmen', 'Catigbian', 'Clarin',
        'Corella', 'Cortes', 'Dagohoy', 'Danao', 'Dauis', 'Dimiao', 'Duero',
        'Garcia Hernandez', 'Getafe', 'Guindulman', 'Inabanga', 'Jagna',
        'Lila', 'Loay', 'Loboc', 'Loon', 'Mabini', 'Maribojoc', 'Panglao',
        'Pilar', 'President Carlos P. Garcia', 'Sagbayan', 'San Isidro',
        'San Miguel', 'Sevilla', 'Sierra Bullones', 'Sikatuna', 'Talibon',
        'Trinidad', 'Tubigon', 'Ubay', 'Valencia', 'Malaybalay City',
        'Valencia City', 'Baungon', 'Cabanglasan', 'Damulog', 'Dangcagan',
        'Don Carlos', 'Impasug-ong', 'Kadingilan', 'Kalilangan', 'Kibawe',
        'Kitaotao', 'Lantapan', 'Libona', 'Malitbog', 'Manolo Fortich',
        'Maramag', 'Pangantucan', 'Quezon', 'San Fernando', 'Sumilao',
        'Talakag', 'Malolos City', 'Meycauayan City',
        'San Jose del Monte City', 'Angat', 'Balagtas', 'Baliuag', 'Bocaue',
        'Bulacan', 'Bustos', 'Calumpit', 'Doña Remedios Trinidad',
        'Guiguinto', 'Hagonoy', 'Marilao', 'Norzagaray', 'Obando', 'Pandi',
        'Paombong', 'Plaridel', 'Pulilan', 'San Ildefonso', 'San Miguel',
        'San Rafael', 'Santa Maria', 'Tuguegarao City', 'Abulug', 'Alcala',
        'Allacapan', 'Amulung', 'Aparri', 'Baggao', 'Ballesteros', 'Buguey',
        'Calayan', 'Camalaniugan', 'Claveria', 'Enrile', 'Gattaran',
        'Gonzaga', 'Iguig', 'Lal-lo', 'Lasam', 'Pamplona', 'Peñablanca',
        'Piat', 'Rizal', 'Sanchez-Mira', 'Santa Ana', 'Santa Praxedes',
        'Santa Teresita', 'Santo Niño', 'Solana', 'Tuao', 'Basud',
        'Capalonga', 'Daet', 'Jose Panganiban', 'Labo', 'Mercedes',
        'Paracale', 'San Lorenzo Ruiz', 'San Vicente', 'Santa Elena',
        'Talisay', 'Vinzons', 'Iriga City', 'Naga City', 'Baao', 'Balatan',
        'Bato', 'Bombon', 'Buhi', 'Bula', 'Cabusao', 'Calabanga',
        'Camaligan', 'Canaman', 'Caramoan', 'Del Gallego', 'Gainza',
        'Garchitorena', 'Goa', 'Lagonoy', 'Libmanan', 'Lupi', 'Magarao',
        'Milaor', 'Minalabac', 'Nabua', 'Ocampo', 'Pamplona', 'Pasacao',
        'Pili', 'Presentacion', 'Ragay', 'Sagñay', 'San Fernando',
        'San Jose', 'Sipocot', 'Siruma', 'Tigaon', 'Tinambac', 'Catarman',
        'Guinsiliban', 'Mahinog', 'Mambajao', 'Sagay', 'Roxas City',
        'Cuartero', 'Dao', 'Dumalag', 'Dumarao', 'Ivisan', 'Jamindan',
        'Ma-ayon', 'Mambusao', 'Panay', 'Panitan', 'Pilar', 'Pontevedra',
        'President Roxas', 'Sapi-an', 'Sigma', 'Tapaz', 'Bagamanoc', 'Baras',
        'Bato', 'Caramoran', 'Gigmoto', 'Pandan', 'Panganiban', 'San Andres',
        'San Miguel', 'Viga', 'Virac', 'Bacoor City', 'Cavite City',
        'Dasmariñas City', 'Imus City', 'Tagaytay City',
        'Trece Martires City', 'Alfonso', 'Amadeo', 'Carmona',
        'General Mariano Alvarez', 'General Emilio Aguinaldo',
        'General Trias', 'Indang', 'Kawit', 'Magallanes', 'Maragondon',
        'Mendez', 'Naic', 'Noveleta', 'Rosario', 'Silang', 'Tanza',
        'Ternate', 'Bogo City', 'Cebu City', 'Carcar City', 'Danao City',
        'Lapu-Lapu City', 'Mandaue City', 'Naga City', 'Talisay City',
        'Toledo City', 'Alcantara', 'Alcoy', 'Alegria', 'Aloguinsan',
        'Argao', 'Asturias', 'Badian', 'Balamban', 'Bantayan', 'Barili',
        'Boljoon', 'Borbon', 'Carmen', 'Catmon', 'Compostela', 'Consolacion',
        'Cordoba', 'Daanbantayan', 'Dalaguete', 'Dumanjug', 'Ginatilan',
        'Liloan', 'Madridejos', 'Malabuyoc', 'Medellin', 'Minglanilla',
        'Moalboal', 'Oslob', 'Pilar', 'Pinamungahan', 'Poro', 'Ronda',
        'Samboan', 'San Fernando', 'San Francisco', 'San Remigio',
        'Santa Fe', 'Santander', 'Sibonga', 'Sogod', 'Tabogon', 'Tabuelan',
        'Tuburan', 'Tudela', 'Compostela', 'Laak', 'Mabini',
        'Maco', 'Maragusan', 'Mawab', 'Monkayo', 'Montevista', 'Nabunturan',
        'New Bataan', 'Pantukan', 'Kidapawan City', 'Alamada', 'Aleosan',
        'Antipas', 'Arakan', 'Banisilan', 'Carmen', 'Kabacan', 'Libungan',
        'M\'lang', 'Magpet', 'Makilala', 'Matalam', 'Midsayap', 'Pigkawayan',
        'Pikit', 'President Roxas', 'Tulunan', 'Panabo City', 'Samal City',
        'Tagum City', 'Asuncion', 'Braulio E. Dujali', 'Carmen', 'Kapalong',
        'New Corella', 'San Isidro', 'Santo Tomas', 'Talaingod',
        'Davao City', 'Digos City', 'Bansalan', 'Don Marcelino', 'Hagonoy',
        'Jose Abad Santos', 'Kiblawan', 'Magsaysay', 'Malalag', 'Malita',
        'Matanao', 'Padada', 'Santa Cruz', 'Santa Maria', 'Sarangani',
        'Sulop', 'Mati City', 'Baganga', 'Banaybanay', 'Boston', 'Caraga',
        'Cateel', 'Governor Generoso', 'Lupon', 'Manay', 'San Isidro',
        'Tarragona', 'Basilisa', 'Cagdianao', 'Dinagat', 'Libjo', 'Loreto',
        'San Jose', 'Tubajon', 'Borongan City', 'Arteche', 'Balangiga',
        'Balangkayan', 'Can-avid', 'Dolores', 'General MacArthur',
        'Giporlos', 'Guiuan', 'Hernani', 'Jipapad', 'Lawaan', 'Llorente',
        'Maslog', 'Maydolong', 'Mercedes', 'Oras', 'Quinapondan', 'Salcedo',
        'San Julian', 'San Policarpo', 'Sulat', 'Taft', 'Buenavista',
        'Jordan', 'Nueva Valencia', 'San Lorenzo', 'Sibunag', 'Aguinaldo',
        'Alfonso Lista', 'Asipulo', 'Banaue', 'Hingyon', 'Hungduan',
        'Kiangan', 'Lagawe', 'Lamut', 'Mayoyao', 'Tinoc', 'Batac City',
        'Laoag City', 'Adams', 'Bacarra', 'Badoc', 'Bangui', 'Banna',
        'Burgos', 'Carasi', 'Currimao', 'Dingras', 'Dumalneg', 'Marcos',
        'Nueva Era', 'Pagudpud', 'Paoay', 'Pasuquin', 'Piddig', 'Pinili',
        'San Nicolas', 'Sarrat', 'Solsona', 'Vintar', 'Candon City',
        'Vigan City', 'Alilem', 'Banayoyo', 'Bantay', 'Burgos', 'Cabugao',
        'Caoayan', 'Cervantes', 'Galimuyod', 'Gregorio Del Pilar',
        'Lidlidda', 'Magsingal', 'Nagbukel', 'Narvacan', 'Quirino',
        'Salcedo', 'San Emilio', 'San Esteban', 'San Ildefonso', 'San Juan',
        'San Vicente', 'Santa', 'Santa Catalina', 'Santa Cruz',
        'Santa Lucia', 'Santa Maria', 'Santiago', 'Santo Domingo', 'Sigay',
        'Sinait', 'Sugpon', 'Suyo', 'Tagudin', 'Iloilo City', 'Passi City',
        'Ajuy', 'Alimodian', 'Anilao', 'Badiangan', 'Balasan', 'Banate',
        'Barotac Nuevo', 'Barotac Viejo', 'Batad', 'Bingawan', 'Cabatuan',
        'Calinog', 'Carles', 'Concepcion', 'Dingle', 'Dueñas', 'Dumangas',
        'Estancia', 'Guimbal', 'Igbaras', 'Janiuay', 'Lambunao', 'Leganes',
        'Lemery', 'Leon', 'Maasin', 'Miagao', 'Mina', 'New Lucena', 'Oton',
        'Pavia', 'Pototan', 'San Dionisio', 'San Enrique', 'San Joaquin',
        'San Miguel', 'San Rafael', 'Santa Barbara', 'Sara', 'Tigbauan',
        'Tubungan', 'Zarraga', 'Cauayan City', 'Ilagan City',
        'Santiago City', 'Alicia', 'Angadanan', 'Aurora', 'Benito Soliven',
        'Burgos', 'Cabagan', 'Cabatuan', 'Cordon', 'Delfin Albano',
        'Dinapigue', 'Divilacan', 'Echague', 'Gamu', 'Jones', 'Luna',
        'Maconacon', 'Mallig', 'Naguilian', 'Palanan', 'Quezon', 'Quirino',
        'Ramon', 'Reina Mercedes', 'Roxas', 'San Agustin', 'San Guillermo',
        'San Isidro', 'San Manuel', 'San Mariano', 'San Mateo', 'San Pablo',
        'Santa Maria', 'Santo Tomas', 'Tumauini', 'Tabuk City', 'Balbalan',
        'Lubuagan', 'Pasil', 'Pinukpuk', 'Rizal', 'Tanudan', 'Tinglayan',
        'San Fernando City', 'Agoo', 'Aringay', 'Bacnotan', 'Bagulin',
        'Balaoan', 'Bangar', 'Bauang', 'Burgos', 'Caba', 'Luna', 'Naguilian',
        'Pugo', 'Rosario', 'San Gabriel', 'San Juan', 'Santo Tomas',
        'Santol', 'Sudipen', 'Tubao', 'Biñan City', 'Cabuyao City',
        'Calamba City', 'San Pablo City', 'Santa Rosa City',
        'Nature and Science City of Los Baños', 'San Pedro', 'Alaminos',
        'Bay', 'Calauan', 'Cavinti', 'Famy', 'Kalayaan', 'Liliw', 'Luisiana',
        'Lumban', 'Mabitac', 'Magdalena', 'Majayjay', 'Nagcarlan', 'Paete',
        'Pagsanjan', 'Pakil', 'Pangil', 'Pila', 'Rizal', 'Santa Cruz',
        'Santa Maria', 'Siniloan', 'Victoria', 'Iligan City', 'Bacolod',
        'Baloi', 'Baroy', 'Kapatagan', 'Kauswagan', 'Kolambugan', 'Lala',
        'Linamon', 'Magsaysay', 'Maigo', 'Matungao', 'Munai', 'Nunungan',
        'Pantao Ragat', 'Pantar', 'Poona Piagapo', 'Salvador', 'Sapad',
        'Sultan Naga Dimaporo', 'Tagoloan', 'Tangcal', 'Tubod',
        'Marawi City', 'Bacolod-Kalawi', 'Balabagan', 'Balindong', 'Bayang',
        'Binidayan', 'Buadiposo-Buntong', 'Bubong', 'Bumbaran', 'Butig',
        'Calanogas', 'Ditsaan-Ramain', 'Ganassi', 'Kapai', 'Kapatagan',
        'Lumba-Bayabao', 'Lumbaca-Unayan', 'Lumbatan', 'Lumbayanague',
        'Madalum', 'Madamba', 'Maguing', 'Malabang', 'Marantao', 'Marogong',
        'Masiu', 'Mulondo', 'Pagayawan', 'Piagapo', 'Poona Bayabao',
        'Pualas', 'Saguiaran', 'Sultan Dumalondong', 'Picong', 'Tagoloan II',
        'Tamparan', 'Taraka', 'Tubaran', 'Tugaya', 'Wao', 'Baybay City',
        'Ormoc City', 'Tacloban City', 'Abuyog', 'Alangalang', 'Albuera',
        'Babatngon', 'Barugo', 'Bato', 'Burauen', 'Calubian', 'Capoocan',
        'Carigara', 'Dagami', 'Dulag', 'Hilongos', 'Hindang', 'Inopacan',
        'Isabel', 'Jaro', 'Javier', 'Julita', 'Kananga', 'La Paz', 'Leyte',
        'MacArthur', 'Mahaplag', 'Matag-ob', 'Matalom', 'Mayorga', 'Merida',
        'Palo', 'Palompon', 'Pastrana', 'San Isidro', 'San Miguel',
        'Santa Fe', 'Tabango', 'Tabontabon', 'Tanauan', 'Tolosa', 'Tunga',
        'Villaba', 'Cotabato City', 'Ampatuan', 'Barira', 'Buldon', 'Buluan',
        'Datu Abdullah Sangki', 'Datu Anggal Midtimbang',
        'Datu Blah T. Sinsuat', 'Datu Hoffer Ampatuan', 'Datu Montawal',
        'Datu Odin Sinsuat', 'Datu Paglas', 'Datu Piang', 'Datu Salibo',
        'Datu Saudi-Ampatuan', 'Datu Unsay', 'General Salipada K. Pendatun',
        'Guindulungan', 'Kabuntalan', 'Mamasapano', 'Mangudadatu', 'Matanog',
        'Northern Kabuntalan', 'Pagalungan', 'Paglat', 'Pandag', 'Parang',
        'Rajah Buayan', 'Shariff Aguak', 'Shariff Saydona Mustapha',
        'South Upi', 'Sultan Kudarat', 'Sultan Mastura',
        'Sultan sa Barongis', 'Talayan', 'Talitay', 'Upi', 'Boac',
        'Buenavista', 'Gasan', 'Mogpog', 'Santa Cruz', 'Torrijos',
        'Masbate City', 'Aroroy', 'Baleno', 'Balud', 'Batuan', 'Cataingan',
        'Cawayan', 'Claveria', 'Dimasalang', 'Esperanza', 'Mandaon',
        'Milagros', 'Mobo', 'Monreal', 'Palanas', 'Pio V. Corpuz', 'Placer',
        'San Fernando', 'San Jacinto', 'San Pascual', 'Uson', 'Manila',
        'Caloocan', 'Las Piñas', 'Makati', 'Malabon', 'Mandaluyong',
        'Marikina', 'Muntinlupa', 'Navotas', 'Parañaque', 'Pasay', 'Pasig',
        'Quezon City', 'San Juan', 'Taguig', 'Valenzuela', 'Pateros',
        'Oroquieta City', 'Ozamiz City', 'Tangub City', 'Aloran',
        'Baliangao', 'Bonifacio', 'Calamba', 'Clarin', 'Concepcion',
        'Don Victoriano Chiongbian', 'Jimenez', 'Lopez Jaena', 'Panaon',
        'Plaridel', 'Sapang Dalaga', 'Sinacaban', 'Tudela', 'Cagayan de Oro',
        'El Salvador City', 'Gingoog City', 'Alubijid', 'Balingasag',
        'Balingoan', 'Binuangan', 'Claveria', 'Gitagum', 'Initao', 'Jasaan',
        'Kinoguitan', 'Lagonglong', 'Laguindingan', 'Libertad', 'Lugait',
        'Magsaysay', 'Manticao', 'Medina', 'Naawan', 'Opol', 'Salay',
        'Sugbongcogon', 'Tagoloan', 'Talisayan', 'Villanueva', 'Barlig',
        'Bauko', 'Besao', 'Bontoc', 'Natonin', 'Paracelis', 'Sabangan',
        'Sadanga', 'Sagada', 'Tadian', 'Bacolod City', 'Bago City',
        'Cadiz City', 'Escalante City', 'Himamaylan City', 'Kabankalan City',
        'La Carlota City', 'Sagay City', 'San Carlos City', 'Silay City',
        'Sipalay City', 'Talisay City', 'Victorias City', 'Binalbagan',
        'Calatrava', 'Candoni', 'Cauayan', 'Enrique B. Magalona',
        'Hinigaran', 'Hinoba-an', 'Ilog', 'Isabela', 'La Castellana',
        'Manapla', 'Moises Padilla', 'Murcia', 'Pontevedra', 'Pulupandan',
        'Salvador Benedicto', 'San Enrique', 'Toboso', 'Valladolid',
        'Bais City', 'Bayawan City', 'Canlaon City', 'Guihulngan City',
        'Dumaguete City', 'Tanjay City', 'Amlan', 'Ayungon', 'Bacong',
        'Basay', 'Bindoy', 'Dauin', 'Jimalalud', 'La Libertad', 'Mabinay',
        'Manjuyod', 'Pamplona', 'San Jose', 'Santa Catalina', 'Siaton',
        'Sibulan', 'Tayasan', 'Valencia', 'Vallehermoso', 'Zamboanguita',
        'Allen', 'Biri', 'Bobon', 'Capul', 'Catarman', 'Catubig', 'Gamay',
        'Laoang', 'Lapinig', 'Las Navas', 'Lavezares', 'Lope de Vega',
        'Mapanas', 'Mondragon', 'Palapag', 'Pambujan', 'Rosario',
        'San Antonio', 'San Isidro', 'San Jose', 'San Roque', 'San Vicente',
        'Silvino Lobos', 'Victoria', 'Cabanatuan City', 'Gapan City',
        'Palayan City', 'San Jose City', 'Science City of Muñoz', 'Aliaga',
        'Bongabon', 'Cabiao', 'Carranglan', 'Cuyapo', 'Gabaldon',
        'General Mamerto Natividad', 'General Tinio', 'Guimba', 'Jaen',
        'Laur', 'Licab', 'Llanera', 'Lupao', 'Nampicuan', 'Pantabangan',
        'Peñaranda', 'Quezon', 'Rizal', 'San Antonio', 'San Isidro',
        'San Leonardo', 'Santa Rosa', 'Santo Domingo', 'Talavera',
        'Talugtug', 'Zaragoza', 'Alfonso Castaneda', 'Ambaguio', 'Aritao',
        'Bagabag', 'Bambang', 'Bayombong', 'Diadi', 'Dupax del Norte',
        'Dupax del Sur', 'Kasibu', 'Kayapa', 'Quezon', 'Santa Fe', 'Solano',
        'Villaverde', 'Abra de Ilog', 'Calintaan', 'Looc', 'Lubang',
        'Magsaysay', 'Mamburao', 'Paluan', 'Rizal', 'Sablayan', 'San Jose',
        'Santa Cruz', 'Calapan City', 'Baco', 'Bansud', 'Bongabong',
        'Bulalacao', 'Gloria', 'Mansalay', 'Naujan', 'Pinamalayan', 'Pola',
        'Puerto Galera', 'Roxas', 'San Teodoro', 'Socorro', 'Victoria',
        'Puerto Princesa City', 'Aborlan', 'Agutaya', 'Araceli', 'Balabac',
        'Bataraza', 'Brooke\'s Point', 'Busuanga', 'Cagayancillo', 'Coron',
        'Culion', 'Cuyo', 'Dumaran', 'El Nido', 'Kalayaan', 'Linapacan',
        'Magsaysay', 'Narra', 'Quezon', 'Rizal', 'Roxas', 'San Vicente',
        'Sofronio Española', 'Taytay', 'Angeles City', 'San Fernando City',
        'Mabalacat City', 'Apalit', 'Arayat', 'Bacolor', 'Candaba',
        'Floridablanca', 'Guagua', 'Lubao', 'Macabebe', 'Magalang',
        'Masantol', 'Mexico', 'Minalin', 'Porac', 'San Luis', 'San Simon',
        'Santa Ana', 'Santa Rita', 'Santo Tomas', 'Sasmuan', 'Alaminos City',
        'Dagupan City', 'San Carlos City', 'Urdaneta City', 'Agno',
        'Aguilar', 'Alcala', 'Anda', 'Asingan', 'Balungao', 'Bani',
        'Basista', 'Bautista', 'Bayambang', 'Binalonan', 'Binmaley',
        'Bolinao', 'Bugallon', 'Burgos', 'Calasiao', 'Dasol', 'Infanta',
        'Labrador', 'Laoac', 'Lingayen', 'Mabini', 'Malasiqui', 'Manaoag',
        'Mangaldan', 'Mangatarem', 'Mapandan', 'Natividad', 'Pozzorubio',
        'Rosales', 'San Fabian', 'San Jacinto', 'San Manuel', 'San Nicolas',
        'San Quintin', 'Santa Barbara', 'Santa Maria', 'Santo Tomas',
        'Sison', 'Sual', 'Tayug', 'Umingan', 'Urbiztondo', 'Villasis',
        'Lucena City', 'Tayabas City', 'Agdangan', 'Alabat', 'Atimonan',
        'Buenavista', 'Burdeos', 'Calauag', 'Candelaria', 'Catanauan',
        'Dolores', 'General Luna', 'General Nakar', 'Guinayangan', 'Gumaca',
        'Infanta', 'Jomalig', 'Lopez', 'Lucban', 'Macalelon', 'Mauban',
        'Mulanay', 'Padre Burgos', 'Pagbilao', 'Panukulan', 'Patnanungan',
        'Perez', 'Pitogo', 'Plaridel', 'Polillo', 'Quezon', 'Real',
        'Sampaloc', 'San Andres', 'San Antonio', 'San Francisco',
        'San Narciso', 'Sariaya', 'Tagkawayan', 'Tiaong', 'Unisan',
        'Aglipay', 'Cabarroguis', 'Diffun', 'Maddela', 'Nagtipunan',
        'Saguday', 'Antipolo City', 'Angono', 'Baras', 'Binangonan',
        'Cainta', 'Cardona', 'Jalajala', 'Morong', 'Pililla', 'Rodriguez',
        'San Mateo', 'Tanay', 'Taytay', 'Teresa', 'Alcantara', 'Banton',
        'Cajidiocan', 'Calatrava', 'Concepcion', 'Corcuera', 'Ferrol',
        'Looc', 'Magdiwang', 'Odiongan', 'Romblon', 'San Agustin',
        'San Andres', 'San Fernando', 'San Jose', 'Santa Fe', 'Santa Maria',
        'Calbayog City', 'Catbalogan City', 'Almagro', 'Basey', 'Calbiga',
        'Daram', 'Gandara', 'Hinabangan', 'Jiabong', 'Marabut', 'Matuguinao',
        'Motiong', 'Pagsanghan', 'Paranas', 'Pinabacdao', 'San Jorge',
        'San Jose De Buan', 'San Sebastian', 'Santa Margarita', 'Santa Rita',
        'Santo Niño', 'Tagapul-an', 'Talalora', 'Tarangnan', 'Villareal',
        'Zumarraga', 'Alabel', 'Glan', 'Kiamba', 'Maasim', 'Maitum',
        'Malapatan', 'Malungon', 'Enrique Villanueva', 'Larena', 'Lazi',
        'Maria', 'San Juan', 'Siquijor', 'Sorsogon City', 'Barcelona',
        'Bulan', 'Bulusan', 'Casiguran', 'Castilla', 'Donsol', 'Gubat',
        'Irosin', 'Juban', 'Magallanes', 'Matnog', 'Pilar', 'Prieto Diaz',
        'Santa Magdalena', 'General Santos City', 'Koronadal City',
        'Polomolok', 'Banga', 'Lake Sebu', 'Norala', 'Santo Niño',
        'Surallah', 'T\'boli', 'Tampakan', 'Tantangan', 'Tupi',
        'Maasin City', 'Anahawan', 'Bontoc', 'Hinunangan', 'Hinundayan',
        'Libagon', 'Liloan', 'Limasawa', 'Macrohon', 'Malitbog',
        'Padre Burgos', 'Pintuyan', 'Saint Bernard', 'San Francisco',
        'San Juan', 'San Ricardo', 'Silago', 'Sogod', 'Tomas Oppus',
        'Tacurong City', 'Bagumbayan', 'Columbio', 'Esperanza', 'Isulan',
        'Kalamansig', 'Lambayong', 'Lebak', 'Lutayan', 'Palimbang',
        'President Quirino', 'Senator Ninoy Aquino', 'Banguingui',
        'Hadji Panglima Tahil', 'Indanan', 'Jolo', 'Kalingalan Caluang',
        'Lugus', 'Luuk', 'Maimbung', 'Old Panamao', 'Omar', 'Pandami',
        'Panglima Estino', 'Pangutaran', 'Parang', 'Pata', 'Patikul',
        'Siasi', 'Talipao', 'Tapul', 'Surigao City', 'Alegria', 'Bacuag',
        'Burgos', 'Claver', 'Dapa', 'Del Carmen', 'General Luna',
        'Gigaquit', 'Mainit', 'Malimono', 'Pilar', 'Placer', 'San Benito',
        'San Francisco', 'San Isidro', 'Santa Monica', 'Sison', 'Socorro',
        'Tagana-an', 'Tubod', 'Bislig City', 'Tandag City', 'Barobo',
        'Bayabas', 'Cagwait', 'Cantilan', 'Carmen', 'Carrascal', 'Cortes',
        'Hinatuan', 'Lanuza', 'Lianga', 'Lingig', 'Madrid', 'Marihatag',
        'San Agustin', 'San Miguel', 'Tagbina', 'Tago', 'Tarlac City',
        'Anao', 'Bamban', 'Camiling', 'Capas', 'Concepcion', 'Gerona',
        'La Paz', 'Mayantoc', 'Moncada', 'Paniqui', 'Pura', 'Ramos',
        'San Clemente', 'San Jose', 'San Manuel', 'Santa Ignacia',
        'Victoria', 'Bongao', 'Languyan', 'Mapun', 'Panglima Sugala',
        'Sapa-Sapa', 'Sibutu', 'Simunul', 'Sitangkai', 'South Ubian',
        'Tandubas', 'Turtle Islands', 'Olongapo City', 'Botolan', 'Cabangan',
        'Candelaria', 'Castillejos', 'Iba', 'Masinloc', 'Palauig',
        'San Antonio', 'San Felipe', 'San Marcelino', 'San Narciso',
        'Santa Cruz', 'Subic', 'Dapitan City', 'Dipolog City', 'Bacungan',
        'Baliguian', 'Godod', 'Gutalac', 'Jose Dalman', 'Kalawit',
        'Katipunan', 'La Libertad', 'Labason', 'Liloy', 'Manukan', 'Mutia',
        'Piñan', 'Polanco', 'President Manuel A. Roxas', 'Rizal', 'Salug',
        'Sergio Osmeña Sr.', 'Siayan', 'Sibuco', 'Sibutad', 'Sindangan',
        'Siocon', 'Sirawai', 'Tampilisan', 'Pagadian City', 'Zamboanga City',
        'Aurora', 'Bayog', 'Dimataling', 'Dinas', 'Dumalinao', 'Dumingag',
        'Guipos', 'Josefina', 'Kumalarang', 'Labangan', 'Lakewood',
        'Lapuyan', 'Mahayag', 'Margosatubig', 'Midsalip', 'Molave', 'Pitogo',
        'Ramon Magsaysay', 'San Miguel', 'San Pablo', 'Sominot', 'Tabina',
        'Tambulig', 'Tigbao', 'Tukuran', 'Vincenzo A. Sagun', 'Alicia',
        'Buug', 'Diplahan', 'Imelda', 'Ipil', 'Kabasalan', 'Mabuhay',
        'Malangas', 'Naga', 'Olutanga', 'Payao', 'Roseller Lim', 'Siay',
        'Talusan', 'Titay', 'Tungawan'
    );

    protected static $barangay = array(
        'Poblacion'
    );

    public function province()
    {
        return static::randomElement(static::$province);
    }

    public function city()
    {
        return static::randomElement(static::$city);
    }

    public function municipality()
    {
        return static::randomElement(static::$municipality);
    }

    public function barangay()
    {
        return static::randomElement(static::$barangay);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       <?php

namespace Faker\Provider\en_PH;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    // http://en.wikipedia.org/wiki/Telephone_numbers_in_the_Philippines
    protected static $mobileFormats = array(
        '+63 (813) ###-####', '+63 (817) ###-####', '+63 (900) ###-####',
        '+63 (905) ###-####', '+63 (906) ###-####', '+63 (907) ###-####',
        '+63 (908) ###-####', '+63 (909) ###-####', '+63 (910) ###-####',
        '+63 (911) ###-####', '+63 (912) ###-####', '+63 (915) ###-####',
        '+63 (916) ###-####', '+63 (917) ###-####', '+63 (918) ###-####',
        '+63 (919) ###-####', '+63 (920) ###-####', '+63 (921) ###-####',
        '+63 (922) ###-####', '+63 (923) ###-####', '+63 (925) ###-####',
        '+63 (926) ###-####', '+63 (927) ###-####', '+63 (928) ###-####',
        '+63 (929) ###-####', '+63 (930) ###-####', '+63 (931) ###-####',
        '+63 (932) ###-####', '+63 (933) ###-####', '+63 (934) ###-####',
        '+63 (935) ###-####', '+63 (936) ###-####', '+63 (937) ###-####',
        '+63 (938) ###-####', '+63 (939) ###-####', '+63 (940) ###-####',
        '+63 (942) ###-####', '+63 (943) ###-####', '+63 (944) ###-####',
        '+63 (946) ###-####', '+63 (947) ###-####', '+63 (948) ###-####',
        '+63 (949) ###-####', '+63 (971) ###-####', '+63 (973) ###-####',
        '+63 (974) ###-####', '+63 (975) ###-####', '+63 (977) ###-####',
        '+63 (978) ###-####', '+63 (979) ###-####', '+63 (980) ###-####',
        '+63 (989) ###-####', '+63 (994) ###-####', '+63 (996) ###-####',
        '+63 (997) ###-####', '+63 (998) ###-####', '+63 (999) ###-####',
        
        '(0813) ###-####', '(0817) ###-####', '(0900) ###-####',
        '(0905) ###-####', '(0906) ###-####', '(0907) ###-####',
        '(0908) ###-####', '(0909) ###-####', '(0910) ###-####',
        '(0911) ###-####', '(0912) ###-####', '(0915) ###-####',
        '(0916) ###-####', '(0917) ###-####', '(0918) ###-####',
        '(0919) ###-####', '(0920) ###-####', '(0921) ###-####',
        '(0922) ###-####', '(0923) ###-####', '(0925) ###-####',
        '(0926) ###-####', '(0927) ###-####', '(0928) ###-####',
        '(0929) ###-####', '(0930) ###-####', '(0931) ###-####',
        '(0932) ###-####', '(0933) ###-####', '(0934) ###-####',
        '(0935) ###-####', '(0936) ###-####', '(0937) ###-####',
        '(0938) ###-####', '(0939) ###-####', '(0940) ###-####',
        '(0942) ###-####', '(0943) ###-####', '(0944) ###-####',
        '(0946) ###-####', '(0947) ###-####', '(0948) ###-####',
        '(0949) ###-####', '(0971) ###-####', '(0973) ###-####',
        '(0974) ###-####', '(0975) ###-####', '(0977) ###-####',
        '(0978) ###-####', '(0979) ###-####', '(0980) ###-####',
        '(0989) ###-####', '(0994) ###-####', '(0996) ###-####',
        '(0997) ###-####', '(0998) ###-####', '(0999) ###-####',
    );

    /**
     * Return a en_PH mobile phone number
     * @return string
     */
    public static function mobileNumber()
    {
        return static::numerify(static::randomElement(static::$mobileFormats));
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                INDX( 	 �[l            (   �  �         h ��              t     ` L          W%��ok�l���ok�l���ok�W%��ok�                        e n _ G B p h z     ` L          F��ok�N^��ok�N^��ok�F��ok�                        e n _ H K p h ~     ` L          ����ok��p�ok��p�ok�����ok�                        e n _ I N p h �     ` L          �p�ok�.�#�ok�.�#�ok��p�ok�                        e n _ N G p h �     ` L          ��%�ok��o/�ok��o/�ok���%�ok�                       e n _ N Z p h �     ` L          �o/�ok�� @�ok�� @�ok��o/�ok�                        e n _ P H p h �     ` L          !�B�ok���U�ok���U�ok�!�B�ok�                        e n _ S G p h �     ` L          c�W�ok��v�ok��v�ok�c�W�ok�                        e n _ U G p h �     ` L          �Xy�ok�����ok�����ok��Xy�ok�                        e n _ U S p h �     ` L          �A��ok��{��ok��{��ok��A��ok�                        e n _ Z A p  �     ` L          ����ok�R�
�ok�R�
�ok�����ok�                        e s _ A R p h �     ` L          �*�ok�27�ok�27�ok��*�ok�                        e s _ E S p h �     ` L          5C�ok�F�f�ok�F�f�ok�5C�ok�                        e s _ P E p h �     ` L          �Ci�ok� ���ok� ���ok��Ci�ok�                        e s _ V E p h �     ` L           ���ok�_���ok�_���ok� ���ok�                        f a _ I R p h      h R          ��q�ok  Uze���t��<���q�ok� �      ޾               F i l e . p h p       �     ` L          !S��ok�R���ok�R���ok�!S��ok�                        f i _ F I o r �     ` L          R���ok�|��ok�|��ok�R���ok�                        f r _ B E o r �     ` L          ��ok�vMU�ok�vMU�ok���ok�                        f r _ C A o r �     ` L          D_h�ok��p��ok��p��ok�D_h�ok�                        f r _ C H o r                    !Ӝ�ok�Y�.�]%�!Ӝ�ok�!Ӝ�ok                         f r _ F R o r �     ` L          �E��ok���l�]%��E��ok��E��ok�                        h e _ I L o r �     ` L          	�ok�U���]%�	�ok�	�ok�                        h r _ H R o r      p \          ���ok� Uze���t��<����ok� 0      k%               H t m l L o r e m . p h p     �     ` L          �3�ok���]%��3�ok��3�ok�                        h u _ H U . p �     ` L          lT`�ok����]%�lT`�ok�lT`�ok�                       h y _ A M . p �     ` L          �܈�ok��
�]%��܈�ok��܈�ok�                        i d _ I D . p      h T          \{��ok� Uze��Aw��<�\{��ok�                     	 I m a g e . p h p          p Z          ���ok� Uze�0�y��<����ok� @      `=               I n t e r n e t . p h p            ` L          ���ok���7�]%����ok����ok�                        i s _ I S . p      ` L          @���ok�jAg�]%�@���ok�@���ok�                       i t _ C H . p      ` L          �C��ok��,��]%��C��ok��C��ok�                        i t _ I T . p      h T          �R��ok� Uze��|��<��R��ok�        �              	 L o r e m . p h p          x d          ۠��ok� Uze��|��<�۠��ok� @      54               M i s c e l l a n e o u s . p h p          h X          :*��ok� Uze��h~��<�:*��ok� 0      �-               P a y m e n t . p h p      h V          ����ok� Uze��ʀ��<�����ok�       E             
 P e r s o n . p h p        p `          ���ok� Uze��ʀ��<����ok�                      P h o n e N u m b e r . p h p      h R          c���ok� Uze��-���<�c���ok�        �               T e x t . p h p            p \          P��ok� Uze������<�P��ok�        �               U s e r A g e n t . p h p          h R          ���ok� Uze����<����ok�       �               U u i d . p h p                                                    <?php

namespace Faker\Provider\en_SG;

class Address extends \Faker\Provider\Address
{

    // http://en.wikipedia.org/wiki/Singapore_Post#Address_format
    protected static $streetNumber = array('##', '###');

    // http://en.wikipedia.org/wiki/Singapore_Post#Address_format
    protected static $blockNumber = array(
        'Blk ##',
        'Blk ###',
        'Blk ###A',
        'Blk ###B',
        'Blk ###C',
        'Blk ###D',
        'Blk ###E',
        'Blk ###F',
        'Blk ###G',
        'Blk ###H',
    );

    // http://www.streetdirectory.com/asia_travel/travel/street/alphabet2/
    protected static $streetSuffix = array(
        'Alley', 'Avenue',
        'Bridge',
        'Crescent',
        'Drive',
        'Grove',
        'Highway', 'Hill',
        'Lane', 'Link',
        'Park', 'Place',
        'Quay',
        'Road',
        'Walk', 'Way',
    );

    // http://www.streetdirectory.com/asia_travel/travel/street/alphabet2/
    protected static $streetPrefix = array(
        'Jalan',
    );

    // http://www.streetdirectory.com/asia_travel/travel/street/alphabet2/
    // http://remembersingapore.org/2011/04/04/old-names-of-places/
    protected static $streetName = array(
        'Adam', 'Airport', 'Alexandra', 'Aljunied', 'Ampang', 'Ann Siang', 'Angus', 'Anson', 'Armenian',
        'Balmoral', 'Battery', 'Bencoolen',
        'Collyer', 'Clarke', 'Church', 'Cecil', 'Cross', 'Chulia', 'Cheang Hong Lim', 'Chin Swee', 'Choon Guan',
        'Devonshire', 'Dublin', 'Duxton', 'D\'Almeida',
        'East Coast', 'Eden', 'Edgware', 'Eunos',
        'Fifth', 'First', 'Funan', 'Fullerton',
        'George', 'Glasgow', 'Grange',
        'Havelock', 'High', 'Hylam',
        'International Business', 'International', 'Irving',
        'Jubilee',
        'Kensington Park', 'Kitchener', 'Knights',
        'Lancaster', 'Leicester', 'Lengkok Bahru', 'Lim Teck Kim',
        'Malay', 'Market', 'Middle', 'Malabar', 'Merchant', 'Mohammed Sultan',
        'Napier', 'Nathan', 'Newton',
        'Ocean', 'One Tree', 'Orchard', 'Outram', 'Ophir',
        'Pekin', 'Peng Siang', 'Prince Edward', 'Palmer',
        'Quality', 'Queen',
        'Raffles', 'Robinson', 'Rochor', 'Regent', 'Ridley', 'River Valley',
        'Sixth', 'Somerset', 'Stanley', 'Stamford', 'Shenton', 'Sultan',
        'Telok Ayer', 'Temple', 'Thomson', 'Unity', 'Victoria', 'Xilin', 'York', 'Zion',
    );

    protected static $streetAddressFormats = array(
        '{{streetPrefix}} {{streetName}}',
        '{{streetName}} {{streetSuffix}}',
    );

    protected static $floorNumber = array(
        '##', '0#',
    );

    protected static $apartmentNumber = array(
        '##', '###',
    );

    // http://en.wikipedia.org/wiki/Singapore_Post#Address_format
    protected static $addressFormats = array(
        "{{streetNumber}} {{streetAddress}}\n{{townName}} {{postcode}}",
        "{{blockNumber}} {{streetAddress}}\n{{floorNumber}} {{apartmentNumber}}\n{{townName}} {{postcode}}",
    );

    protected static $townName = 'SINGAPORE';

    protected static $postcode = array('######');

    protected static $country = array(
        'SINGAPORE',
    );

    public function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }

    public function streetNumber()
    {
        return static::numerify(static::randomElement(static::$streetNumber));
    }

    public function blockNumber()
    {
        return static::numerify(static::randomElement(static::$blockNumber));
    }

    public function floorNumber()
    {
        return static::randomElement(static::$floorNumber);
    }

    public function apartmentNumber()
    {
        return static::randomElement(static::$apartmentNumber);
    }

    public function townName()
    {
        return static::$townName;
    }
}
                                                                                                                                                                                                                                                                     <?php

namespace Faker\Provider\en_SG;

class PhoneNumber extends \Faker\Provider\PhoneNumber
{
    protected static $internationalCodePrefix = array(
        '+65',
        '65',
    );

    protected static $zeroToEight = array(0, 1, 2, 3, 4, 5, 6, 7, 8);

    protected static $oneToNine = array(1, 2, 3, 4, 5, 6, 7, 8, 9);

    protected static $mobileNumberFormats = array(
        '{{internationalCodePrefix}}9{{zeroToEight}}## ####',
        '{{internationalCodePrefix}} 9{{zeroToEight}}## ####',
        '9{{zeroToEight}}## ####',
        '{{internationalCodePrefix}}8{{oneToNine}}## ####',
        '{{internationalCodePrefix}} 8{{oneToNine}}## ####',
        '8{{oneToNine}}## ####',
        '{{internationalCodePrefix}}7{{oneToNine}}## ####',
        '{{internationalCodePrefix}} 7{{oneToNine}}## ####',
        '7{{oneToNine}}## ####',
    );

    protected static $fixedLineNumberFormats = array(
        '{{internationalCodePrefix}}6### ####',
        '{{internationalCodePrefix}} 6### ####',
        '6### ####',
    );

    // http://en.wikipedia.org/wiki/Telephone_numbers_in_Singapore#Numbering_plan
    protected static $formats = array(
        '{{mobileNumber}}',
        '{{fixedLineNumber}}',
    );

    protected static $voipNumber = array(
        '{{internationalCodePrefix}}3### ####',
        '{{internationalCodePrefix}} 3### ####',
        '3### ####',
    );

    protected static $tollFreeInternationalNumber = array(
        '800 ### ####'
    );

    protected static $tollFreeLineNumber = array(
        '1800 ### ####'
    );

    protected static $premiumPhoneNumber = array(
        '1900 ### ####'
    );

    public function tollFreeInternationalNumber()
    {
        return static::randomElement(static::$tollFreeInternationalNumber);
    }

    public function tollFreeLineNumber()
    {
        return static::randomElement(static::$tollFreeLineNumber);
    }

    public function premiumPhoneNumber()
    {
        return static::randomElement(static::$premiumPhoneNumber);
    }

    public function mobileNumber()
    {
        $format = static::randomElement(static::$mobileNumberFormats);

        return static::numerify($this->generator->parse($format));
    }

    public function fixedLineNumber()
    {
        $format = static::randomElement(static::$fixedLineNumberFormats);

        return static::numerify($this->generator->parse($format));
    }

    public function voipNumber()
    {
        $format = static::randomElement(static::$voipNumber);

        return $this->generator->parse($format);
    }

    public function internationalCodePrefix()
    {
        $format = static::randomElement(static::$internationalCodePrefix);

        return $this->generator->parse($format);
    }

    public function zeroToEight()
    {
        return static::randomElement(static::$zeroToEight);
    }

    public function oneToNine()
    {
        return static::randomElement(static::$oneToNine);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 <?php

namespace Faker\Provider\en_UG;

class Address extends \Faker\Provider\en_US\Address
{
    protected static $cityFormats = array(
        '{{cityName}}'
    );

    /**
     * @link http://en.wikipedia.org/wiki/List_of_cities_and_towns_in_Uganda
     */
    protected static $cityName = array(
        'Alebtong','Abim','Adjumani','Amolatar','Amuria','Amuru','Apac','Arua',
        'Bombo','Budaka','Bugembe','Bugiri','Bukedea','Bulisa','Buikwe','Bundibugyo',
        'Busembatya','Bushenyi','Busia','Busolwe','Butaleja','Buwenge',
        'Dokolo',
        'Entebbe',
        'Fort Portal',
        'Gulu',
        'Hima','Hoima',
        'Ibanda','Iganga','Isingiro',
        'Jinja',
        'Kaabong','Kabale','Kaberamaido','Kabwohe','Kagadi','Kakinga','Kakiri','Kalangala','Kaliro',
        'Kalisizo','Kalongo','Kalungu','Kampala','Kamuli','Kanoni','Kamwenge','Kanungu','Kapchorwa',
        'Kasese','Katakwi','Kayunga','Kibaale','Kiboga','Kihiihi','Kiira','Kiruhura','Kiryandongo',
        'Kisoro','Kitgum','Koboko','Kotido','Kumi','Kyenjojo','Kyotera',
        'Lira','Lugazi','Lukaya','Luwero','Lwakhakha','Lwengo','Lyantonde',
        'Malaba','Manafwa','Masaka','Masindi','Masindi Port','Matugga','Mayuge','Mbale','Mbarara',
        'Mitooma','Mityana','Mpigi','Mpondwe','Moroto','Moyo','Mubende','Mukono','Mutukula',
        'Nagongera','Nakaseke','Nakasongola','Nakapiripirit','Namutumba','Nansana','Nebbi','Ngora',
        'Njeru','Nkokonjeru','Ntungamo',
        'Oyam',
        'Pader','Paidha','Pakwach','Pallisa',
        'Rakai','Rukungiri',
        'Sembabule','Sironko','Soroti',
        'Tororo',
        'Wakiso','Wobulenzi',
        'Yumbe'
    );

    /**
     * @link http://en.wikipedia.org/wiki/Category:Districts_of_Uganda
     */
    protected static $district = array(
        'Abim','Adjumani','Agago','Alebtong','Amolatar','Amudat','Amuria','Amuru','Apac','Arua',
        'Budaka','Bududa','Bugiri','Buhweju','Buikwe','Bukedea','Bukomansimbi','Bukwo','Bulambuli',
        'Buliisa','Bundibugyo','Bushenyi','Busia','Butaleja','Butambala','Buvuma','Buyende',
        'Dokolo',
        'Gomba','Gulu',
        'Hoima',
        'Ibanda','Iganga','Isingiro',
        'Jinja',
        'Kaabong','Kabale','Kabarole','Kaberamaido','Kalangala','Kaliro','Kalungu','Kampala','Kamuli',
        'Kamwenge','Kanungu','Kapchorwa','Kasese','Katakwi','Kayunga','Kibaale','Kiboga','Kibuku',
        'Kigezi','Kiruhura','Kiryandongo','Kisoro','Kitgum','Koboko','Kole','Kotido','Kumi','Kween',
        'Kyankwanzi','Kyegegwa','Kyenjojo',
        'Lamwo','Lira','Luuka','Luweero','Lwengo','Lyantonde',
        'Manafwa','Maracha','Maracha-Terego','Masaka','Masindi','Mayuge','Mbale','Mbarara','Mitooma',
        'Mityana','Moroto','Moyo','Mpigi','Mubende','Mukono',
        'Nakapiripirit','Nakaseke','Nakasongola','Namayingo','Namutumba','Napak','Nebbi','Ngora',
        'Ntoroko','Ntungamo','Nwoya',
        'Otuke','Oyam',
        'Pader','Pallisa',
        'Rakai','Rubirizi','Rukungiri',
        'Sembabule','Serere','Sheema','Sironko','Soroti',
        'Tororo',
        'Wakiso',
        'Yumbe',
        'Zombo'
    );

    protected static $postcode = array( '#', "##", "###", "####", "#####" );

    protected static $region = array( 'Central', 'East', 'North', 'West' );

    /**
     * @example 'Fort Portal'
     */
    public static function cityName()
    {
        return static::randomElement(static::$cityName);
    }

    /**
     * @example 'Kampala'
     */
    public static function district()
    {
        return static::randomElement(static::$district);
    }

    /**
     * @example 'East'
     */
    public static function region()
    {
        return static::randomElement(static::$region);
    }
}
                                                                                                                                                                                                                                                                                                                                                         <?php

namespace Faker\Provider\en_UG;

class Person extends \Faker\Provider\Person
{
    /**
     * It is very common in Uganda for people to arrange their names as
     * lastname(surname) firstname
     */
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{lastName}} {{firstNameMale}}',
        '{{firstNameMale}} {{lastNameMale}}',
        '{{lastNameMale}} {{firstNameMale}}'
    );

    /**
     * It is very common in Uganda for people to arrange their names as
     * lastname(surname) firstname
     */
    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{lastName}} {{firstNameFemale}}',
        '{{firstNameFemale}} {{lastNameFemale}}',
        '{{lastNameFemale}} {{firstNameFemale}}'
    );

    protected static $firstNameMale = array(
        'Aaron','Abdul','Abdullah','Abraham','Adam','Agustin','Ahmad','Ahmed','Akeem','Albert','Alex','Alfred','Ali','Allan','Allen','Alvin','Amani','Ambrose','Amos','Anderson','Andrew','Angel','Anthony','Arnold','Arthur','Austin',
        'Barnet','Barry','Ben','Benjamin','Bennie','Benny','Bernard','Berry','Berta','Bertha','Bill','Billy','Bobby','Boyd','Bradley','Brian','Bruce',
        'Caesar','Caleb','Carol','Cecil','Charles','Charlie','Chris','Christian','Christopher','Cleveland','Clifford','Clinton','Collin','Conrad',
        'Dan','Daren','Dave','David','Dax','Denis','Dennis','Derek','Derick','Derrick','Don','Donald','Douglas','Dylan',
        'Earnest','Eddie','Edgar','Edison','Edmond','Edmund','Edward','Edwin','Elias','Elijah','Elliot','Emanuel','Emmanuel','Eric','Ernest','Ethan','Eugene','Ezra',
        'Felix','Francis','Frank','Frankie','Fred',
        'Gaetano','Gaston','Gavin','Geoffrey','George','Gerald','Gideon','Gilbert','Glen','Godfrey','Graham','Gregory',
        'Hans','Harold','Henry','Herbert','Herman','Hillary','Howard',
        'Ian','Isaac','Isaiah','Ismael',
        'Jabari','Jack','Jackson','Jacob','Jamaal','Jamal','Jasper','Jayson','Jeff','Jeffery','Jeremy','Jimmy','Joe','Joel','Joesph','Johathan','John','Johnathan','Johnny','Johnson','Jonathan','Jordan','Joseph','Joshua','Julian','Julio','Julius','Junior',
        'Kaleb','Keith','Kelly','Kelvin','Ken','Kennedy','Kenneth','Kevin','Kim',
        'Lawrence','Lewis','Lincoln','Lloyd','Luis','Luther',
        'Mackenzie','Martin','Marvin','Mathew','Mathias','Matt','Maurice','Max','Maxwell','Mckenzie','Micheal','Mike','Milton','Mitchel','Mitchell','Mohamed','Mohammad','Mohammed','Morris','Moses','Muhammad','Myles',
        'Nasir','Nat','Nathan','Newton','Nicholas','Nick','Nicklaus','Nickolas','Nicolas','Noah','Norbert',
        'Oscar','Owen',
        'Patrick','Paul','Peter','Philip',
        'Rashad','Rasheed','Raul','Ray','Raymond','Reagan','Regan','Richard','Richie','Rick','Robb','Robbie','Robert','Robin','Roger','Rogers','Ronald','Rowland','Royal','Ryan',
        'Sam','Samson','Sean','Shawn','Sid','Sidney','Solomon','Steve','Stevie','Stewart','Stuart',
        'Taylor','Theodore','Thomas','Timmy','Timothy','Titus','Tom','Tony','Travis','Trevor','Troy','Trystan','Tyler','Tyson',
        'Victor','Vince','Vincent','Vinnie',
        'Walter','Warren','Wilford','Wilfred','Will','William','Willis','Willy','Wilson'
    );

    protected static $firstNameFemale = array(
        'Abigail','Adela','Adrianna','Adrienne','Aisha','Alice','Alisha','Alison','Amanda','Amelia','Amina','Amy','Anabel','Anabelle','Angela','Angelina','Angie','Anita','Anna','Annamarie','Anne','Annette','April','Arianna','Ariela','Asha','Ashley','Ashly','Audrey','Aurelia',
        'Barbara','Beatrice','Bella','Bernadette','Beth','Bethany','Bethel','Betsy','Bette','Bettie','Betty','Blanche','Bonita','Bonnie','Brenda','Bridget','Bridgette','Carissa','Carol','Carole','Carolina','Caroline','Carolyn','Carolyne','Catharine','Catherine','Cathrine','Cathryn','Cathy','Cecelia','Cecile','Cecilia','Charity','Charlotte','Chloe','Christina','Christine','Cindy','Claire','Clara','Clarissa','Claudine','Cristal','Crystal','Cynthia',
        'Dahlia','Daisy','Daniela','Daniella','Danielle','Daphne','Daphnee','Daphney','Darlene','Deborah','Destiny','Diana','Dianna','Dina','Dolly','Dolores','Donna','Dora','Dorothy','Dorris',
        'Edna','Edwina','Edyth','Elizabeth','Ella','Ellen','Elsa','Elsie','Emelia','Emilia','Emilie','Emily','Emma','Emmanuelle','Erica','Esta','Esther','Estella','Eunice','Eva','Eve','Eveline','Evelyn',
        'Fabiola','Fatima','Fiona','Flavia','Flo','Florence','Frances','Francesca','Francisca','Frida',
        'Gabriella','Gabrielle','Genevieve','Georgiana','Geraldine','Gertrude','Gladys','Gloria','Grace','Gracie',
        'Helen','Hellen','Hilda','Hillary','Hope',
        'Imelda','Isabel','Isabell','Isabella','Isabelle',
        'Jackie','Jacklyn','Jacky','Jaclyn','Jacquelyn','Jane','Janelle','Janet','Jaquelin','Jaqueline','Jenifer','Jennifer','Jessica','Joan','Josephine','Joy','Joyce','Juanita','Julia','Juliana','Julie','Juliet','Justine',
        'Katarina','Katherine','Katheryn','Katrina',
        'Laura','Leah','Leila','Lilian','Lillian','Lilly','Lina','Linda','Lisa','Lora','Loraine','Lucie','Lucy','Lulu','Lydia',
        'Mabel','Maggie','Mandy','Margaret','Margarete','Margret','Maria','Mariah','Mariam','Marian','Mariana','Mariane','Marianna','Marianne','Marie','Marilyne','Marina','Marion','Marjorie','Marjory','Marlene','Mary','Matilda','Maudie','Maureen','Maya','Meagan','Melisa','Melissa','Melody','Michele','Michelle','Minerva','Minnie','Miracle','Monica',
        'Nadia','Naomi','Naomie','Natalia','Natalie','Natasha','Nichole','Nicole','Nina','Nora',
        'Pamela','Patience','Patricia','Pauline','Pearl','Phoebe','Phyllis','Pink','Pinkie','Priscilla','Prudence',
        'Rachael','Rachel','Rebeca','Rebecca','Rhoda','Rita','Robyn','Rose','Rosemary','Ruth','Ruthe','Ruthie',
        'Sabina','Sabrina','Salma','Samantha','Sandra','Sandy','Sarah','Serena','Shakira','Sharon','Sheila','Sierra','Sonia','Sonya','Sophia','Sophie','Stacey','Stacy','Stella','Susan','Susana','Susanna','Susie','Suzanne','Sylvia',
        'Tabitha','Teresa','Tess','Theresa','Tia','Tiffany','Tina','Tracy','Trinity','Trisha','Trudie','Trycia',
        'Ursula',
        'Valentine','Valerie','Vanessa','Veronica','Vickie','Vicky','Victoria','Viola','Violet','Violette','Viva','Vivian','Viviane','Vivianne','Vivien','Vivienne',
        'Wanda','Wendy','Whitney','Wilma','Winifred',
        'Yvette','Yvonne',
        'Zita','Zoe'
    );

    protected static $lastNameMale = array(
        'Mubiru','Muwanguzi','Muwonge',
        'Nsamba',
        'Obol','Odeke','Okumu','Okumuringa','Opega','Opio','Orishaba','Osiki','Ouma',
        'Sekandi','Semande','Serwanga','Ssebatta','Ssebugulu','Ssebunya','Ssebuuma','Ssebyala','Ssegawa','Ssekabira','Ssekanjako','Ssekate','Ssekibuule','Ssekidde','Ssekiranda','Ssekitooleko','Ssekubulwa','Ssempija','Ssempungu','Ssemwezi','Ssendege','Ssenjovu','Ssenkaali','Ssentezza','Ssentongo','Sserubiri','Sseruyinda','Ssettende',
    );

    protected static $lastNameFemale = array(
        'Abol','Adeke','Aketch','Akoth','Akumu','Aol','Apega','Apio','Auma','Awori','Ayo',
        'Babirye',
        'Chandiru',
        'Dushime',
        'Kabatesi','Kabonesa','Kaitesi','Kakiiza','Kakuze','Kaliisa','Karungi','Katusiime','Kebirungi','Kyomi','Kyoshabire',
        'Mahoro','Murungi',
        'Nabaale','Nabaggala','Nabakooza','Nabaloga','Nabankema','Nabasirye','Nabaweesi','Nabayunga','Nabbona','Nabise','Nabukeera','Nabunya','Nabuufu','Nabuuso','Nabwami','Nakaayi','Nakabugo','Nakabuye','Nakafeero','Nakalanzi','Nakalunda','Nakasinde','Nakasolya','Nakasumba','Nakato','Nakaweesa','Nakazibwe','Nakiboneka','Nakidde','Nakigozi','Nakiguli','Nakimbugwe','Nakimuli','Nakinobe','Nakiridde','Nakisige','Nakitende','Nakiyemba','Nakku','Nakyagaba','Nakyanzi','Nalubuga','Nalubwama','Nalukwago','Naluyima','Nalweyiso','Nalwoga','Namaganda','Namagembe','Namatovu','Nambi','Nambogo','Nambooze','Nambuusi','Namenya','Namiiro','Namirembe','Nampemba','Nampijja','Namubiru','Namuddu','Namugenyi','Namugwanya','Namukwaya','Namuleme','Namulindwa','Namutebi','Nankindu','Nankinga','Nanteeza','Nantongo','Nanvule','Nanyanzi','Nanyombi','Nanyondo','Nanyonjo','Nassimwba','Nazziwa','Ndagire'
    );

    protected static $lastName = array(
        'Abayisenga','Agaba','Ahebwe','Aisu','Akankunda','Akankwasa','Akashaba','Akashabe','Ampumuza','Ankunda','Asasira','Asiimwe','Atuhe','Atuhire','Atukunda','Atukwase','Atwine','Aurishaba',
        'Badru','Baguma','Bakabulindi','Bamwiine','Barigye','Bbosa','Bisheko','Biyinzika','Bugala','Bukenya','Buyinza','Bwana','Byanyima','Byaruhanga',
        'Ddamulira',
        'Gamwera',
        'Ijaga','Isyagi',
        'Kaaya','Kabanda','Kabuubi','Kabuye','Kafeero','Kagambira','Kakooza','Kalumba','Kanshabe','Kansiime','Kanyesigye','Kareiga','Kasekende','Kasumba','Kateregga','Katusiime','Kawooya','Kawuki','Kayemba','Kazibwe','Kibirige','Kiconco','Kiganda','Kijjoba','Kirabira','Kirabo','Kirigwajjo','Kisitu','Kitovu','Kityamuwesi','Kivumbi','Kiwanuka','Kyambadde',
        'Lunyoro',
        'Mbabazi','Migisha','Mugisa','Mugisha','Muhwezi','Mukalazi','Mulalira','Munyagwa','Murungi','Mushabe','Musinguzi','Mutabuza','Muyambi','Mwesige','Mwesigye',
        'Nabasa','Nabimanya','Nankunda','Natukunda','Nayebare','Nimukunda','Ninsiima','Nkoojo','Nkurunungi','Nuwagaba','Nuwamanya','Nyeko',
        'Obol','Odeke','Okumu','Okumuringa','Opega','Orishaba','Osiki','Ouma',
        'Rubalema','Rusiimwa','Rwabyoma',
        'Tamale','Tendo','Tizikara','Tuhame','Tumusiime','Tumwebaze','Tumwesigye','Tumwiine','Turyasingura','Tusiime','Twasiima','Twesigomwe',
        'Wasswa','Wavamuno','Were'
    );

    public function lastName($gender = null)
    {
        if ($gender === static::GENDER_MALE) {
            return static::lastNameMale();
        }
        if ($gender === static::GENDER_FEMALE) {
            return static::lastNameFemale();
        }

        return static::randomElement(static::$lastName);
    }

    public static function lastNameMale()
    {
        return static::randomElement(static::$lastNameMale);
    }

    public static function lastNameFemale()
    {
        return static::randomElement(static::$lastNameFemale);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    <?php

namespace Faker\Provider\en_US;

class Address extends \Faker\Provider\Address
{
    protected static $cityPrefix = array('North', 'East', 'West', 'South', 'New', 'Lake', 'Port');
    protected static $citySuffix = array('town', 'ton', 'land', 'ville', 'berg', 'burgh', 'borough', 'bury', 'view', 'port', 'mouth', 'stad', 'furt', 'chester', 'mouth', 'fort', 'haven', 'side', 'shire');
    protected static $buildingNumber = array('%####', '%###', '%##');
    protected static $streetSuffix = array(
        'Alley', 'Avenue', 'Branch', 'Bridge', 'Brook', 'Brooks', 'Burg', 'Burgs', 'Bypass', 'Camp', 'Canyon', 'Cape', 'Causeway', 'Center', 'Centers', 'Circle', 'Circles', 'Cliff', 'Cliffs', 'Club', 'Common', 'Corner', 'Corners', 'Course', 'Court', 'Courts', 'Cove', 'Coves', 'Creek', 'Crescent', 'Crest', 'Crossing', 'Crossroad', 'Curve', 'Dale', 'Dam', 'Divide', 'Drive', 'Drive', 'Drives', 'Estate', 'Estates', 'Expressway', 'Extension', 'Extensions', 'Fall', 'Falls', 'Ferry', 'Field', 'Fields', 'Flat', 'Flats', 'Ford', 'Fords', 'Forest', 'Forge', 'Forges', 'Fork', 'Forks', 'Fort', 'Freeway', 'Garden', 'Gardens', 'Gateway', 'Glen', 'Glens', 'Green', 'Greens', 'Grove', 'Groves', 'Harbor', 'Harbors', 'Haven', 'Heights', 'Highway', 'Hill', 'Hills', 'Hollow', 'Inlet', 'Inlet', 'Island', 'Island', 'Islands', 'Islands', 'Isle', 'Isle', 'Junction', 'Junctions', 'Key', 'Keys', 'Knoll', 'Knolls', 'Lake', 'Lakes', 'Land', 'Landing', 'Lane', 'Light', 'Lights', 'Loaf', 'Lock', 'Locks', 'Locks', 'Lodge', 'Lodge', 'Loop', 'Mall', 'Manor', 'Manors', 'Meadow', 'Meadows', 'Mews', 'Mill', 'Mills', 'Mission', 'Mission', 'Motorway', 'Mount', 'Mountain', 'Mountain', 'Mountains', 'Mountains', 'Neck', 'Orchard', 'Oval', 'Overpass', 'Park', 'Parks', 'Parkway', 'Parkways', 'Pass', 'Passage', 'Path', 'Pike', 'Pine', 'Pines', 'Place', 'Plain', 'Plains', 'Plains', 'Plaza', 'Plaza', 'Point', 'Points', 'Port', 'Port', 'Ports', 'Ports', 'Prairie', 'Prairie', 'Radial', 'Ramp', 'Ranch', 'Rapid', 'Rapids', 'Rest', 'Ridge', 'Ridges', 'River', 'Road', 'Road', 'Roads', 'Roads', 'Route', 'Row', 'Rue', 'Run', 'Shoal', 'Shoals', 'Shore', 'Shores', 'Skyway', 'Spring', 'Springs', 'Springs', 'Spur', 'Spurs', 'Square', 'Square', 'Squares', 'Squares', 'Station', 'Station', 'Stravenue', 'Stravenue', 'Stream', 'Stream', 'Street', 'Street', 'Streets', 'Summit', 'Summit', 'Terrace', 'Throughway', 'Trace', 'Track', 'Trafficway', 'Trail', 'Trail', 'Tunnel', 'Tunnel', 'Turnpike', 'Turnpike', 'Underpass', 'Union', 'Unions', 'Valley', 'Valleys', 'Via', 'Viaduct', 'View', 'Views', 'Village', 'Village', 'Villages', 'Ville', 'Vista', 'Vista', 'Walk', 'Walks', 'Wall', 'Way', 'Ways', 'Well', 'Wells'
    );
    protected static $postcode = array('#####', '#####-####');
    protected static $state = array(
        'Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California', 'Colorado', 'Connecticut', 'Delaware', 'District of Columbia', 'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana', 'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland', 'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi', 'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire', 'New Jersey', 'New Mexico', 'New York', 'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania', 'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee', 'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington', 'West Virginia', 'Wisconsin', 'Wyoming'
    );
    protected static $stateAbbr = array(
       'AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'FL', 'GA', 'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD', 'ME', 'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM', 'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX', 'UT', 'VA', 'VT', 'WA', 'WI', 'WV', 'WY'
    );
    protected static $country = array(
        'Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra', 'Angola', 'Anguilla', 'Antarctica (the territory South of 60 deg S)', 'Antigua and Barbuda', 'Argentina', 'Armenia', 'Aruba', 'Australia', 'Austria', 'Azerbaijan',
        'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Bouvet Island (Bouvetoya)', 'Brazil', 'British Indian Ocean Territory (Chagos Archipelago)', 'British Virgin Islands', 'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
        'Cambodia', 'Cameroon', 'Canada', 'Cape Verde', 'Cayman Islands', 'Central African Republic', 'Chad', 'Chile', 'China', 'Christmas Island', 'Cocos (Keeling) Islands', 'Colombia', 'Comoros', 'Congo', 'Cook Islands', 'Costa Rica', 'Cote d\'Ivoire', 'Croatia', 'Cuba', 'Cyprus', 'Czech Republic',
        'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic',
        'Ecuador', 'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia',
        'Faroe Islands', 'Falkland Islands (Malvinas)', 'Fiji', 'Finland', 'France', 'French Guiana', 'French Polynesia', 'French Southern Territories',
        'Gabon', 'Gambia', 'Georgia', 'Germany', 'Ghana', 'Gibraltar', 'Greece', 'Greenland', 'Grenada', 'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea', 'Guinea-Bissau', 'Guyana',
        'Haiti', 'Heard Island and McDonald Islands', 'Holy See (Vatican City State)', 'Honduras', 'Hong Kong', 'Hungary',
        'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Isle of Man', 'Israel', 'Italy',
        'Jamaica', 'Japan', 'Jersey', 'Jordan',
        'Kazakhstan', 'Kenya', 'Kiribati', 'Korea', 'Korea', 'Kuwait', 'Kyrgyz Republic',
        'Lao People\'s Democratic Republic', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libyan Arab Jamahiriya', 'Liechtenstein', 'Lithuania', 'Luxembourg',
        'Macao', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Martinique', 'Mauritania', 'Mauritius', 'Mayotte', 'Mexico', 'Micronesia', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Montserrat', 'Morocco', 'Mozambique', 'Myanmar',
        'Namibia', 'Nauru', 'Nepal', 'Netherlands Antilles', 'Netherlands', 'New Caledonia', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Niue', 'Norfolk Island', 'Northern Mariana Islands', 'Norway',
        'Oman',
        'Pakistan', 'Palau', 'Palestinian Territories', 'Panama', 'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Pitcairn Islands', 'Poland', 'Portugal', 'Puerto Rico',
        'Qatar',
        'Reunion', 'Romania', 'Russian Federation', 'Rwanda',
        'Saint Barthelemy', 'Saint Helena', 'Saint Kitts and Nevis', 'Saint Lucia', 'Saint Martin', 'Saint Pierre and Miquelon', 'Saint Vincent and the Grenadines', 'Samoa', 'San Marino', 'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia (Slovak Republic)', 'Slovenia', 'Solomon Islands', 'Somalia', 'South Africa', 'South Georgia and the South Sandwich Islands', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Svalbard & Jan Mayen Islands', 'Swaziland', 'Sweden', 'Switzerland', 'Syrian Arab Republic',
        'Taiwan', 'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo', 'Tokelau', 'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan', 'Turks and Caicos Islands', 'Tuvalu',
        'Uganda', 'Ukraine', 'United Arab Emirates', 'United Kingdom', 'United States of America', 'United States Minor Outlying Islands', 'United States Virgin Islands', 'Uruguay', 'Uzbekistan',
        'Vanuatu', 'Venezuela', 'Vietnam',
        'Wallis and Futuna', 'Western Sahara',
        'Yemen',
        'Zambia', 'Zimbabwe'
    );
    protected static $cityFormats = array(
        '{{cityPrefix}} {{firstName}}{{citySuffix}}',
        '{{cityPrefix}} {{firstName}}',
        '{{firstName}}{{citySuffix}}',
        '{{lastName}}{{citySuffix}}',
    );
    protected static $streetNameFormats = array(
        '{{firstName}} {{streetSuffix}}',
        '{{lastName}} {{streetSuffix}}'
    );
    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{streetName}}',
        '{{buildingNumber}} {{streetName}} {{secondaryAddress}}',
    );
    protected static $addressFormats = array(
        "{{streetAddress}}\n{{city}}, {{stateAbbr}} {{postcode}}",
    );
    protected static $secondaryAddressFormats = array('Apt. ###', 'Suite ###');

    /**
     * @example 'East'
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    /**
     * @example 'Appt. 350'
     */
    public static function secondaryAddress()
    {
        return static::numerify(static::randomElement(static::$secondaryAddressFormats));
    }

    /**
     * @example 'California'
     */
    public static function state()
    {
        return static::randomElement(static::$state);
    }

    /**
     * @example 'CA'
     */
    public static function stateAbbr()
    {
        return static::randomElement(static::$stateAbbr);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      <?php

namespace Faker\Provider\en_US;

class Company extends \Faker\Provider\Company
{
    protected static $formats = array(
        '{{lastName}} {{companySuffix}}',
        '{{lastName}}-{{lastName}}',
        '{{lastName}}, {{lastName}} and {{lastName}}',
    );

    protected static $catchPhraseWords = array(
        array(
            'Adaptive', 'Advanced', 'Ameliorated', 'Assimilated', 'Automated', 'Balanced', 'Business-focused', 'Centralized', 'Cloned', 'Compatible', 'Configurable', 'Cross-group', 'Cross-platform', 'Customer-focused', 'Customizable', 'Decentralized', 'De-engineered', 'Devolved', 'Digitized', 'Distributed', 'Diverse', 'Down-sized', 'Enhanced', 'Enterprise-wide', 'Ergonomic', 'Exclusive', 'Expanded', 'Extended', 'Facetoface', 'Focused', 'Front-line', 'Fully-configurable', 'Function-based', 'Fundamental', 'Future-proofed', 'Grass-roots', 'Horizontal', 'Implemented', 'Innovative', 'Integrated', 'Intuitive', 'Inverse', 'Managed', 'Mandatory', 'Monitored', 'Multi-channelled', 'Multi-lateral', 'Multi-layered', 'Multi-tiered', 'Networked', 'Object-based', 'Open-architected', 'Open-source', 'Operative', 'Optimized', 'Optional', 'Organic', 'Organized', 'Persevering', 'Persistent', 'Phased', 'Polarised', 'Pre-emptive', 'Proactive', 'Profit-focused', 'Profound', 'Programmable', 'Progressive', 'Public-key', 'Quality-focused', 'Reactive', 'Realigned', 'Re-contextualized', 'Re-engineered', 'Reduced', 'Reverse-engineered', 'Right-sized', 'Robust', 'Seamless', 'Secured', 'Self-enabling', 'Sharable', 'Stand-alone', 'Streamlined', 'Switchable', 'Synchronised', 'Synergistic', 'Synergized', 'Team-oriented', 'Total', 'Triple-buffered', 'Universal', 'Up-sized', 'Upgradable', 'User-centric', 'User-friendly', 'Versatile', 'Virtual', 'Visionary', 'Vision-oriented',
        ),
        array(
            '24hour', '24/7', '3rdgeneration', '4thgeneration', '5thgeneration', '6thgeneration', 'actuating', 'analyzing', 'assymetric', 'asynchronous', 'attitude-oriented', 'background', 'bandwidth-monitored', 'bi-directional', 'bifurcated', 'bottom-line', 'clear-thinking', 'client-driven', 'client-server', 'coherent', 'cohesive', 'composite', 'context-sensitive', 'contextually-based', 'content-based', 'dedicated', 'demand-driven', 'didactic', 'directional', 'discrete', 'disintermediate', 'dynamic', 'eco-centric', 'empowering', 'encompassing', 'even-keeled', 'executive', 'explicit', 'exuding', 'fault-tolerant', 'foreground', 'fresh-thinking', 'full-range', 'global', 'grid-enabled', 'heuristic', 'high-level', 'holistic', 'homogeneous', 'human-resource', 'hybrid', 'impactful', 'incremental', 'intangible', 'interactive', 'intermediate', 'leadingedge', 'local', 'logistical', 'maximized', 'methodical', 'mission-critical', 'mobile', 'modular', 'motivating', 'multimedia', 'multi-state', 'multi-tasking', 'national', 'needs-based', 'neutral', 'nextgeneration', 'non-volatile', 'object-oriented', 'optimal', 'optimizing', 'radical', 'real-time', 'reciprocal', 'regional', 'responsive', 'scalable', 'secondary', 'solution-oriented', 'stable', 'static', 'systematic', 'systemic', 'system-worthy', 'tangible', 'tertiary', 'transitional', 'uniform', 'upward-trending', 'user-facing', 'value-added', 'web-enabled', 'well-modulated', 'zeroadministration', 'zerodefect', 'zerotolerance',
        ),
        array(
            'ability', 'access', 'adapter', 'algorithm', 'alliance', 'analyzer', 'application', 'approach', 'architecture', 'archive', 'artificialintelligence', 'array', 'attitude', 'benchmark', 'blockchain', 'budgetarymanagement', 'capability', 'capacity', 'challenge', 'circuit', 'collaboration', 'complexity', 'concept', 'conglomeration', 'contingency', 'core', 'customerloyalty', 'database', 'data-warehouse', 'definition', 'emulation', 'encoding', 'encryption', 'extranet', 'firmware', 'flexibility', 'focusgroup', 'forecast', 'frame', 'framework', 'function', 'functionalities', 'GraphicInterface', 'groupware', 'GraphicalUserInterface', 'hardware', 'help-desk', 'hierarchy', 'hub', 'implementation', 'info-mediaries', 'infrastructure', 'initiative', 'installation', 'instructionset', 'interface', 'internetsolution', 'intranet', 'knowledgeuser', 'knowledgebase', 'localareanetwork', 'leverage', 'matrices', 'matrix', 'methodology', 'middleware', 'migration', 'model', 'moderator', 'monitoring', 'moratorium', 'neural-net', 'openarchitecture', 'opensystem', 'orchestration', 'paradigm', 'parallelism', 'policy', 'portal', 'pricingstructure', 'processimprovement', 'product', 'productivity', 'project', 'projection', 'protocol', 'securedline', 'service-desk', 'software', 'solution', 'standardization', 'strategy', 'structure', 'success', 'superstructure', 'support', 'synergy', 'systemengine', 'task-force', 'throughput', 'time-frame', 'toolset', 'utilisation', 'website', 'workforce',
        ),
    );

    protected static $bsWords = array(
        array(
            'implement', 'utilize', 'integrate', 'streamline', 'optimize', 'evolve', 'transform', 'embrace', 'enable', 'orchestrate', 'leverage', 'reinvent', 'aggregate', 'architect', 'enhance', 'incentivize', 'morph', 'empower', 'envisioneer', 'monetize', 'harness', 'facilitate', 'seize', 'disintermediate', 'synergize', 'strategize', 'deploy', 'brand', 'grow', 'target', 'syndicate', 'synthesize', 'deliver', 'mesh', 'incubate', 'engage', 'maximize', 'benchmark', 'expedite', 'reintermediate', 'whiteboard', 'visualize', 'repurpose', 'innovate', 'scale', 'unleash', 'drive', 'extend', 'engineer', 'revolutionize', 'generate', 'exploit', 'transition', 'e-enable', 'iterate', 'cultivate', 'matrix', 'productize', 'redefine', 'recontextualize',
        ),
        array(
            'clicks-and-mortar', 'value-added', 'vertical', 'proactive', 'robust', 'revolutionary', 'scalable', 'leading-edge', 'innovative', 'intuitive', 'strategic', 'e-business', 'mission-critical', 'sticky', 'one-to-one', '24/7', 'end-to-end', 'global', 'B2B', 'B2C', 'granular', 'frictionless', 'virtual', 'viral', 'dynamic', '24/365', 'best-of-breed', 'killer', 'magnetic', 'bleeding-edge', 'web-enabled', 'interactive', 'dot-com', 'sexy', 'back-end', 'real-time', 'efficient', 'front-end', 'distributed', 'seamless', 'extensible', 'turn-key', 'world-class', 'open-source', 'cross-platform', 'cross-media', 'synergistic', 'bricks-and-clicks', 'out-of-the-box', 'enterprise', 'integrated', 'impactful', 'wireless', 'transparent', 'next-generation', 'cutting-edge', 'user-centric', 'visionary', 'customized', 'ubiquitous', 'plug-and-play', 'collaborative', 'compelling', 'holistic', 'rich',
        ),
        array(
            'synergies', 'web-readiness', 'paradigms', 'markets', 'partnerships', 'infrastructures', 'platforms', 'initiatives', 'channels', 'eyeballs', 'communities', 'ROI', 'solutions', 'e-tailers', 'e-services', 'action-items', 'portals', 'niches', 'technologies', 'content', 'vortals', 'supply-chains', 'convergence', 'relationships', 'architectures', 'interfaces', 'e-markets', 'e-commerce', 'systems', 'bandwidth', 'infomediaries', 'models', 'mindshare', 'deliverables', 'users', 'schemas', 'networks', 'applications', 'metrics', 'e-business', 'functionalities', 'experiences', 'webservices', 'methodologies',
        ),
    );

    /**
     * Source - http://www.careerplanner.com/ListOfJobs.cfm
     */
    protected static $jobTitleFormat = array(
        'Able Seamen', 'Account Manager', 'Accountant', 'Actor', 'Actuary', 'Adjustment Clerk', 'Admin', 'Administrative Law Judge', 'Administrative Services Manager', 'Administrative Support Supervisors', 'Advertising Manager OR Promotions Manager', 'Advertising Sales Agent', 'Aerospace Engineer', 'Agricultural Crop Farm Manager', 'Agricultural Crop Worker', 'Agricultural Engineer', 'Agricultural Equipment Operator', 'Agricultural Inspector', 'Agricultural Manager', 'Agricultural Product Grader Sorter', 'Agricultural Sales Representative', 'Agricultural Science Technician', 'Agricultural Sciences Teacher', 'Agricultural Technician', 'Agricultural Worker', 'Air Crew Member', 'Air Crew Officer', 'Air Traffic Controller', 'Aircraft Assembler', 'Aircraft Body Repairer', 'Aircraft Cargo Handling Supervisor', 'Aircraft Engine Specialist', 'Aircraft Launch and Recovery Officer', 'Aircraft Launch Specialist', 'Aircraft Mechanics OR Aircraft Service Technician', 'Aircraft Rigging Assembler', 'Aircraft Structure Assemblers', 'Airfield Operations Specialist', 'Airframe Mechanic', 'Airline Pilot OR Copilot OR Flight Engineer', 'Algorithm Developer', 'Alteration Tailor', 'Ambulance Driver', 'Amusement Attendant', 'Anesthesiologist', 'Animal Breeder', 'Animal Care Workers', 'Animal Control Worker', 'Animal Husbandry Worker', 'Animal Scientist', 'Animal Trainer', 'Annealing Machine Operator', 'Announcer', 'Answering Service', 'Anthropologist', 'Anthropologist OR Archeologist', 'Anthropology Teacher', 'Appliance Repairer', 'Arbitrator', 'Archeologist', 'Architect', 'Architectural Drafter', 'Architectural Drafter OR Civil Drafter', 'Architecture Teacher', 'Archivist', 'Armored Assault Vehicle Crew Member', 'Armored Assault Vehicle Officer', 'Art Director', 'Art Teacher', 'Artillery Officer', 'Artillery Crew Member', 'Artist', 'Assembler', 'Assessor', 'Astronomer', 'Athletes and Sports Competitor', 'Athletic Trainer', 'Atmospheric and Space Scientist', 'Audio and Video Equipment Technician', 'Audiologist', 'Audio-Visual Collections Specialist', 'Auditor', 'Auditor', 'Automatic Teller Machine Servicer', 'Automotive Body Repairer', 'Automotive Glass Installers', 'Automotive Master Mechanic', 'Automotive Mechanic', 'Automotive Specialty Technician', 'Automotive Technician', 'Auxiliary Equipment Operator', 'Aviation Inspector', 'Avionics Technician',
        'Bailiff', 'Baker', 'Barber', 'Bartender', 'Bartender Helper', 'Battery Repairer', 'Bellhop', 'Bench Jeweler', 'Benefits Specialist', 'Bicycle Repairer', 'Bill and Account Collector', 'Bindery Machine Operator', 'Bindery Worker', 'Biochemist', 'Biochemist or Biophysicist', 'Biological Science Teacher', 'Biological Scientist', 'Biological Technician', 'Biologist', 'Biomedical Engineer', 'Biophysicist', 'Board Of Directors', 'Boat Builder and Shipwright', 'Boiler Operator', 'Boilermaker', 'Bookbinder', 'Bookkeeper', 'Brake Machine Setter', 'Brattice Builder', 'Brazer', 'Brazing Machine Operator', 'Brickmason', 'Bridge Tender OR Lock Tender', 'Broadcast News Analyst', 'Broadcast Technician', 'Brokerage Clerk', 'Budget Analyst', 'Buffing and Polishing Operator', 'Building Cleaning Worker', 'Building Inspector', 'Bulldozer Operator', 'Bus Driver', 'Business Development Manager', 'Business Manager', 'Business Operations Specialist', 'Business Teacher', 'Butcher', 'Buyer',
        'Cabinetmaker', 'Cafeteria Cook', 'Calibration Technician OR Instrumentation Technician', 'Camera Operator', 'Camera Repairer', 'Captain', 'Caption Writer', 'Cardiovascular Technologist', 'Career Counselor', 'Carpenter', 'Carpenter Assembler and Repairer', 'Carpet Installer', 'Cartographer', 'Cartoonist', 'Carver', 'Cashier', 'Casting Machine Operator', 'Casting Machine Set-Up Operator', 'ccc', 'Ceiling Tile Installer', 'Cement Mason and Concrete Finisher', 'Central Office', 'Central Office and PBX Installers', 'Central Office Operator', 'CEO', 'CFO', 'Chef', 'Chemical Engineer', 'Chemical Equipment Controller', 'Chemical Equipment Operator', 'Chemical Equipment Tender', 'Chemical Plant Operator', 'Chemical Technician', 'Chemist', 'Chemistry Teacher', 'Child Care', 'Child Care Worker', 'Chiropractor', 'Choreographer', 'City', 'City Planning Aide', 'Civil Drafter', 'Civil Engineer', 'Civil Engineering Technician', 'Claims Adjuster', 'Claims Examiner', 'Claims Taker', 'Cleaners of Vehicles', 'Clergy', 'Clerk', 'Clinical Laboratory Technician', 'Clinical Psychologist', 'Clinical School Psychologist', 'Coaches and Scout', 'Coating Machine Operator', 'Coil Winders', 'Command Control Center Officer', 'Command Control Center Specialist', 'Commercial and Industrial Designer', 'Commercial Diver', 'Commercial Pilot', 'Communication Equipment Repairer', 'Communication Equipment Worker', 'Communications Equipment Operator', 'Communications Teacher', 'Community Service Manager', 'Compacting Machine Operator', 'Compensation and Benefits Manager', 'Compliance Officers', 'Composer', 'Computer', 'Computer Hardware Engineer', 'Computer Operator', 'Computer Programmer', 'Computer Repairer', 'Computer Science Teacher', 'Computer Scientist', 'Computer Security Specialist', 'Computer Software Engineer', 'Computer Specialist', 'Computer Support Specialist', 'Computer Systems Analyst', 'Computer-Controlled Machine Tool Operator', 'Concierge', 'Conservation Scientist', 'Construction', 'Construction Carpenter', 'Construction Driller', 'Construction Equipment Operator', 'Construction Laborer', 'Construction Manager', 'Continuous Mining Machine Operator', 'Control Valve Installer', 'Conveyor Operator', 'Cook', 'Cooling and Freezing Equipment Operator', 'Copy Machine Operator', 'Copy Writer', 'Coremaking Machine Operator', 'Coroner', 'Corporate Trainer', 'Correctional Officer', 'Correspondence Clerk', 'Cost Estimator', 'Costume Attendant', 'Counseling Psychologist', 'Counselor', 'Counsil', 'Courier', 'Court Clerk', 'Court Reporter', 'Craft Artist', 'Crane and Tower Operator', 'Creative Writer', 'Credit Checkers Clerk', 'Credit Analyst', 'Credit Authorizer', 'Credit Checker', 'Criminal Investigator', 'Crossing Guard', 'Crushing Grinding Machine Operator', 'CSI', 'CTO', 'Cultural Studies Teacher', 'Curator', 'Custom Tailor', 'Customer Service Representative', 'Cutting Machine Operator', 'Cutting Machine Operator',
        'Dancer', 'Data Entry Operator', 'Data Processing Equipment Repairer', 'Database Administrator', 'Database Manager', 'Deburring Machine Operator', 'Decorator', 'Dental Assistant', 'Dental Hygienist', 'Dental Laboratory Technician', 'Dentist', 'Designer', 'Desktop Publisher', 'Detective', 'Diagnostic Medical Sonographer', 'Diamond Worker', 'Diesel Engine Specialist', 'Dietetic Technician', 'Director Of Business Development', 'Director Of Marketing', 'Director Of Social Media Marketing', 'Director Of Talent Acquisition', 'Director Religious Activities', 'Directory Assistance Operator', 'Dishwasher', 'Dispatcher', 'Distribution Manager', 'Door To Door Sales', 'Dot Etcher', 'Drafter', 'Dragline Operator', 'Dredge Operator', 'Drilling and Boring Machine Tool Setter', 'Driver-Sales Worker', 'Drycleaning Machine Operator', 'Drywall Ceiling Tile Installer', 'Drywall Installer',
        'Earth Driller', 'Economics Teacher', 'Economist', 'Editor', 'Education Administrator', 'Education Teacher', 'Educational Counselor OR Vocationall Counselor', 'Educational Psychologist', 'Electric Meter Installer', 'Electric Motor Repairer', 'Electrical and Electronic Inspector and Tester', 'Electrical and Electronics Drafter', 'Electrical Drafter', 'Electrical Engineer', 'Electrical Engineering Technician', 'Electrical Parts Reconditioner', 'Electrical Power-Line Installer', 'Electrical Sales Representative', 'Electrician', 'Electrician', 'Electrolytic Plating Machine Operator', 'Electromechanical Equipment Assembler', 'Electro-Mechanical Technician', 'Electronic Drafter', 'Electronic Engineering Technician', 'Electronic Equipment Assembler', 'Electronic Masking System Operator', 'Electronics Engineer', 'Electronics Engineering Technician', 'Electrotyper', 'Elementary and Secondary School Administrators', 'Elementary School Teacher', 'Elevator Installer and Repairer', 'Eligibility Interviewer', 'Embalmer', 'Embossing Machine Operator', 'Emergency Management Specialist', 'Emergency Medical Technician and Paramedic', 'Employment Interviewer', 'Engine Assembler', 'Engineer', 'Engineering', 'Engineering Manager', 'Engineering Teacher', 'Engineering Technician', 'English Language Teacher', 'Engraver', 'Entertainer and Performer', 'Entertainment Attendant', 'Environmental Compliance Inspector', 'Environmental Engineer', 'Environmental Engineering Technician', 'Environmental Science Teacher', 'Environmental Science Technician', 'Environmental Scientist', 'Epidemiologist', 'Equal Opportunity Representative', 'Etcher', 'Etcher and Engraver', 'Event Planner', 'Excavating Machine Operator', 'Executive Secretary', 'Exhibit Designer', 'Explosives Expert', 'Extraction Worker', 'Extruding and Drawing Machine Operator', 'Extruding Machine Operator',
        'Fabric Mender', 'Fabric Pressers', 'Farm and Home Management Advisor', 'Farm Equipment Mechanic', 'Farm Labor Contractor', 'Farmer', 'Farmworker', 'Fashion Designer', 'Fashion Model', 'Fast Food Cook', 'Fence Erector', 'Fiber Product Cutting Machine Operator', 'Fiberglass Laminator and Fabricator', 'File Clerk', 'Film Laboratory Technician', 'Financial Analyst', 'Financial Examiner', 'Financial Manager', 'Financial Services Sales Agent', 'Financial Specialist', 'Fire Fighter', 'Fire Inspector', 'Fire Investigator', 'Fire-Prevention Engineer', 'First-Line Supervisor-Manager of Landscaping, Lawn Service, and Groundskeeping Worker', 'Fish Game Warden', 'Fish Hatchery Manager', 'Fishery Worker', 'Fishing OR Forestry Supervisor', 'Fitness Trainer', 'Fitter', 'Flight Attendant', 'Floor Finisher', 'Floor Layer', 'Floral Designer', 'Food Batchmaker', 'Food Cooking Machine Operators', 'Food Preparation', 'Food Preparation and Serving Worker', 'Food Preparation Worker', 'Food Science Technician', 'Food Scientists and Technologist', 'Food Servers', 'Food Service Manager', 'Food Tobacco Roasting', 'Foreign Language Teacher', 'Forensic Investigator', 'Forensic Science Technician', 'Forest and Conservation Technician', 'Forest and Conservation Worker', 'Forest Fire Fighter', 'Forest Fire Fighting Supervisor', 'Forest Fire Inspector', 'Forester', 'Forestry Conservation Science Teacher', 'Forging Machine Setter', 'Forming Machine Operator', 'Forming Machine Operator', 'Foundry Mold and Coremaker', 'Fraud Investigator', 'Freight Agent', 'Freight and Material Mover', 'Freight Inspector', 'Funeral Attendant', 'Funeral Director', 'Furnace Operator', 'Furniture Finisher',
        'Gaming Cage Worker', 'Gaming Dealer', 'Gaming Manager', 'Gaming Service Worker', 'Gaming Supervisor', 'Gaming Surveillance Officer', 'Garment', 'Gas Appliance Repairer', 'Gas Compressor Operator', 'Gas Distribution Plant Operator', 'Gas Plant Operator', 'Gas Processing Plant Operator', 'Gas Pumping Station Operator', 'Gas Pumping Station Operator', 'Gauger', 'GED Teacher', 'General Farmworker', 'General Manager', 'General Practitioner', 'Geographer', 'Geography Teacher', 'Geological Data Technician', 'Geological Sample Test Technician', 'Geologist', 'Geoscientists', 'Glass Blower', 'Glass Cutting Machine Operator', 'Glazier', 'Gluing Machine Operator', 'Government', 'Government Property Inspector', 'Government Service Executive', 'Graduate Teaching Assistant', 'Graphic Designer', 'Grinder OR Polisher', 'Grinding Machine Operator', 'Grips', 'Grounds Maintenance Worker',
        'Hairdresser OR Cosmetologist', 'Hand Trimmer', 'Hand Presser', 'Hand Sewer', 'Hazardous Materials Removal Worker', 'Head Nurse', 'Health Educator', 'Health Practitioner', 'Health Services Manager', 'Health Specialties Teacher', 'Health Technologist', 'Healthcare', 'Healthcare Practitioner', 'Healthcare Support Worker', 'Heat Treating Equipment Operator', 'Heaters', 'Heating and Air Conditioning Mechanic', 'Heating Equipment Operator', 'Heavy Equipment Mechanic', 'Highway Maintenance Worker', 'Highway Patrol Pilot', 'Historian', 'History Teacher', 'Hoist and Winch Operator', 'Home', 'Home Appliance Installer', 'Home Appliance Repairer', 'Home Economics Teacher', 'Home Entertainment Equipment Installer', 'Home Health Aide', 'Homeland Security', 'Horticultural Worker', 'Host and Hostess', 'Hotel Desk Clerk', 'House Cleaner', 'Housekeeper', 'Housekeeping Supervisor', 'HR Manager', 'HR Specialist', 'Human Resource Director', 'Human Resource Manager', 'Human Resources Assistant', 'Human Resources Manager', 'Human Resources Specialist', 'Hunter and Trapper', 'HVAC Mechanic', 'Hydrologist',
        'Illustrator', 'Immigration Inspector OR Customs Inspector', 'Industrial Engineer', 'Industrial Engineering Technician', 'Industrial Equipment Maintenance', 'Industrial Machinery Mechanic', 'Industrial Production Manager', 'Industrial Safety Engineer', 'Industrial-Organizational Psychologist', 'Infantry', 'Infantry Officer', 'Information Systems Manager', 'Inspector', 'Installation and Repair Technician', 'Instructional Coordinator', 'Instrument Sales Representative', 'Insulation Installer', 'Insulation Worker', 'Insurance Investigator', 'Insurance Appraiser', 'Insurance Claims Clerk', 'Insurance Policy Processing Clerk', 'Insurance Sales Agent', 'Insurance Underwriter', 'Interaction Designer', 'Interior Designer', 'Internist', 'Interpreter OR Translator', 'Interviewer', 'Irradiated-Fuel Handler',
        'Janitor', 'Janitorial Supervisor', 'Jeweler', 'Jewelry Model OR Mold Makers', 'Job Printer', 'Judge',
        'Keyboard Instrument Repairer and Tuner', 'Kindergarten Teacher',
        'Landscape Architect', 'Landscape Artist', 'Landscaper', 'Landscaping', 'Lathe Operator', 'Laundry OR Dry-Cleaning Worker', 'Law Clerk', 'Law Enforcement Teacher', 'Law Teacher', 'Lawn Service Manager', 'Lawyer', 'Lay-Out Worker', 'Legal Secretary', 'Legal Support Worker', 'Legislator', 'Letterpress Setters Operator', 'Librarian', 'Library Assistant', 'Library Science Teacher', 'Library Technician', 'Library Worker', 'License Clerk', 'Licensed Practical Nurse', 'Licensing Examiner and Inspector', 'Life Science Technician', 'Life Scientists', 'Lifeguard', 'Loading Machine Operator', 'Loan Counselor', 'Loan Interviewer', 'Loan Officer', 'Locker Room Attendant', 'Locksmith', 'Locomotive Engineer', 'Locomotive Firer', 'Lodging Manager', 'Log Grader and Scaler', 'Logging Equipment Operator', 'Logging Supervisor', 'Logging Tractor Operator', 'Logging Worker', 'Logistician',
        'Machine Feeder', 'Machine Operator', 'Machine Tool Operator', 'Machinery Maintenance', 'Machinist', 'Maid', 'Mail Clerk', 'Mail Machine Operator', 'Maintenance and Repair Worker', 'Maintenance Equipment Operator', 'Maintenance Supervisor', 'Maintenance Worker', 'Makeup Artists', 'Management Analyst', 'Manager', 'Manager of Air Crew', 'Manager of Food Preparation', 'Manager of Weapons Specialists', 'Manager Tactical Operations', 'Manicurists', 'Manufactured Building Installer', 'Manufacturing Sales Representative', 'Mapping Technician', 'MARCOM Director', 'MARCOM Manager', 'Marine Architect', 'Marine Cargo Inspector', 'Marine Engineer', 'Marine Oiler', 'Market Research Analyst', 'Marketing Manager', 'Marketing VP', 'Marking Clerk', 'Marking Machine Operator', 'Marriage and Family Therapist', 'Massage Therapist', 'Material Movers', 'Material Moving Worker', 'Materials Engineer', 'Materials Inspector', 'Materials Scientist', 'Mathematical Science Teacher', 'Mathematical Scientist', 'Mathematical Technician', 'Mathematician', 'Meat Packer', 'Mechanical Door Repairer', 'Mechanical Drafter', 'Mechanical Engineer', 'Mechanical Engineering Technician', 'Mechanical Equipment Sales Representative', 'Mechanical Inspector', 'Media and Communication Worker', 'Medical Appliance Technician', 'Medical Assistant', 'Medical Equipment Preparer', 'Medical Equipment Repairer', 'Medical Laboratory Technologist', 'Medical Records Technician', 'Medical Sales Representative', 'Medical Scientists', 'Medical Secretary', 'Medical Technician', 'Medical Transcriptionist', 'Mental Health Counselor', 'Merchandise Displayer OR Window Trimmer', 'Metal Fabricator', 'Metal Molding Operator', 'Metal Pourer and Caster', 'Metal Worker', 'Metal-Refining Furnace Operator', 'Meter Mechanic', 'Microbiologist', 'Middle School Teacher', 'Military Officer', 'Milling Machine Operator', 'Millwright', 'Mine Cutting Machine Operator', 'Mining Engineer OR Geological Engineer', 'Mining Machine Operator', 'Mixing and Blending Machine Operator', 'Model Maker', 'Mold Maker', 'Molder', 'Molding and Casting Worker', 'Molding Machine Operator', 'Motion Picture Projectionist', 'Motor Vehicle Inspector', 'Motor Vehicle Operator', 'Motorboat Mechanic', 'Motorboat Operator', 'Motorcycle Mechanic', 'Movers', 'Movie Director oR Theatre Director', 'Multi-Media Artist', 'Multiple Machine Tool Setter', 'Municipal Clerk', 'Municipal Court Clerk', 'Municipal Fire Fighter', 'Municipal Fire Fighting Supervisor', 'Museum Conservator', 'Music Arranger and Orchestrator', 'Music Composer', 'Music Director', 'Musical Instrument Tuner', 'Musician', 'Musician OR Singer',
        'Natural Sciences Manager', 'Naval Architects', 'Network Admin OR Computer Systems Administrator', 'Network Systems Analyst', 'New Accounts Clerk', 'Night Security Guard', 'Night Shift', 'Nonfarm Animal Caretaker', 'Nuclear Engineer', 'Nuclear Equipment Operation Technician', 'Nuclear Medicine Technologist', 'Nuclear Monitoring Technician', 'Nuclear Power Reactor Operator', 'Nuclear Technician', 'Numerical Control Machine Tool Operator', 'Numerical Tool Programmer OR Process Control Programmer', 'Nursery Manager', 'Nursery Worker', 'Nursing Aide', 'Nursing Instructor', 'Nutritionist',
        'Obstetrician', 'Occupational Health Safety Specialist', 'Occupational Health Safety Technician', 'Occupational Therapist', 'Occupational Therapist Aide', 'Occupational Therapist Assistant', 'Office and Administrative Support Worker', 'Office Clerk', 'Office Machine and Cash Register Servicer', 'Office Machine Operator', 'Offset Lithographic Press Operator', 'Oil and gas Operator', 'Oil Service Unit Operator', 'Online Marketing Analyst', 'Operating Engineer', 'Operations Research Analyst', 'Ophthalmic Laboratory Technician', 'Optical Instrument Assembler', 'Opticians', 'Optometrist', 'Oral Surgeon', 'Order Clerk', 'Order Filler', 'Order Filler OR Stock Clerk', 'Organizational Development Manager', 'Orthodontist', 'Orthotist OR Prosthetist', 'Outdoor Power Equipment Mechanic',
        'Packaging Machine Operator', 'Packer and Packager', 'Painter', 'Painter and Illustrator', 'Painting Machine Operator', 'Pantograph Engraver', 'Paper Goods Machine Operator', 'Paperhanger', 'Paralegal', 'Park Naturalist', 'Parking Enforcement Worker', 'Parking Lot Attendant', 'Parts Salesperson', 'Paste-Up Worker', 'Pastry Chef', 'Patrol Officer', 'Patternmaker', 'Paving Equipment Operator', 'Payroll Clerk', 'Pediatricians', 'Percussion Instrument Repairer', 'Personal Care Worker', 'Personal Financial Advisor', 'Personal Home Care Aide', 'Personal Service Worker', 'Personal Trainer', 'Personnel Recruiter', 'Pest Control Worker', 'Pesticide Sprayer', 'Petroleum Engineer', 'Petroleum Pump Operator', 'Petroleum Pump System Operator', 'Petroleum Technician', 'Pewter Caster', 'Pharmaceutical Sales Representative', 'Pharmacist', 'Pharmacy Aide', 'Pharmacy Technician', 'Philosophy and Religion Teacher', 'Photoengraver', 'Photoengraving Machine Operator', 'Photographer', 'Photographic Restorer', 'Photographic Developer', 'Photographic Process Worker', 'Photographic Processing Machine Operator', 'Photographic Reproduction Technician', 'Physical Scientist', 'Physical Therapist', 'Physical Therapist Aide', 'Physical Therapist Assistant', 'Physician', 'Physician Assistant', 'Physicist', 'Physics Teacher', 'Pile-Driver Operator', 'Pipe Fitter', 'Pipefitter', 'Pipelayer', 'Pipelaying Fitter', 'Plant and System Operator', 'Plant Scientist', 'Plasterer OR Stucco Mason', 'Plastic Molding Machine Operator', 'Plate Finisher', 'Platemaker', 'Plating Machine Operator', 'Plating Operator', 'Plating Operator OR Coating Machine Operator', 'Plumber', 'Plumber OR Pipefitter OR Steamfitter', 'Podiatrist', 'Poet OR Lyricist', 'Police and Sheriffs Patrol Officer', 'Police Detective', 'Police Identification OR Records Officer', 'Political Science Teacher', 'Political Scientist', 'Portable Power Tool Repairer', 'Postal Clerk', 'Postal Service Clerk', 'Postal Service Mail Carrier', 'Postal Service Mail Sorter', 'Postmasters', 'Postsecondary Education Administrators', 'Postsecondary Teacher', 'Potter', 'Poultry Cutter', 'Power Distributors OR Dispatcher', 'Power Generating Plant Operator', 'Power Plant Operator', 'PR Manager', 'Precious Stone Worker', 'Precision Aircraft Systems Assemblers', 'Precision Devices Inspector', 'Precision Dyer', 'Precision Etcher and Engraver', 'Precision Instrument Repairer', 'Precision Lens Grinders and Polisher', 'Precision Mold and Pattern Caster', 'Precision Pattern and Die Caster', 'Precision Printing Worker', 'Prepress Technician', 'Preschool Education Administrators', 'Preschool Teacher', 'Press Machine Setter, Operator', 'Pressing Machine Operator', 'Pressure Vessel Inspector', 'Printing Machine Operator', 'Printing Press Machine Operator', 'Private Detective and Investigator', 'Private Household Cook', 'Private Sector Executive', 'Probation Officers and Correctional Treatment Specialist', 'Procurement Clerk', 'Producer', 'Producers and Director', 'Product Management Leader', 'Product Promoter', 'Product Safety Engineer', 'Product Specialist', 'Production Control Manager', 'Production Helper', 'Production Inspector', 'Production Laborer', 'Production Manager', 'Production Planner', 'Production Planning', 'Production Worker', 'Professional Photographer', 'Professor', 'Program Director', 'Project Manager', 'Proofreaders and Copy Marker', 'Prosthodontist', 'Protective Service Worker', 'Protective Service Worker', 'Psychiatric Aide', 'Psychiatric Technician', 'Psychiatrist', 'Psychologist', 'Psychology Teacher', 'Public Health Social Worker', 'Public Relations Manager', 'Public Relations Specialist', 'Public Transportation Inspector', 'Pump Operators', 'Punching Machine Setters', 'Purchasing Agent', 'Purchasing Manager',
        'Radar Technician', 'Radiation Therapist', 'Radio and Television Announcer', 'Radio Mechanic', 'Radio Operator', 'Radiologic Technician', 'Radiologic Technologist', 'Radiologic Technologist and Technician', 'Rail Car Repairer', 'Rail Transportation Worker', 'Rail Yard Engineer', 'Railroad Conductors', 'Railroad Inspector', 'Railroad Switch Operator', 'Railroad Yard Worker', 'Range Manager', 'Real Estate Appraiser', 'Real Estate Association Manager', 'Real Estate Broker', 'Real Estate Sales Agent', 'Receptionist and Information Clerk', 'Record Clerk', 'Recordkeeping Clerk', 'Recreation and Fitness Studies Teacher', 'Recreation Worker', 'Recreational Therapist', 'Recreational Vehicle Service Technician', 'Recruiter', 'Recyclable Material Collector', 'Refinery Operator', 'Refractory Materials Repairer', 'Refrigeration Mechanic', 'Registered Nurse', 'Rehabilitation Counselor', 'Religious Worker', 'Rental Clerk', 'Reporters OR Correspondent', 'Reservation Agent OR Transportation Ticket Agent', 'Residential Advisor', 'Respiratory Therapist', 'Respiratory Therapy Technician', 'Restaurant Cook', 'Retail Sales person', 'Retail Salesperson', 'Rigger', 'RN', 'Rock Splitter', 'Rolling Machine Setter', 'Roof Bolters Mining', 'Roofer', 'Rotary Drill Operator', 'Rough Carpenter', 'Roustabouts',
        'Safety Engineer', 'Sailor', 'Sales and Related Workers', 'Sales Engineer', 'Sales Manager', 'Sales Person', 'Sales Representative', 'Sawing Machine Operator', 'Sawing Machine Setter', 'Sawing Machine Tool Setter', 'Scanner Operator', 'School Bus Driver', 'School Social Worker', 'Scientific Photographer', 'Screen Printing Machine Operator', 'Sculptor', 'Secondary School Teacher', 'Secretary', 'Securities Sales Agent', 'Security Guard', 'Security Systems Installer OR Fire Alarm Systems Installer', 'Segmental Paver', 'Self-Enrichment Education Teacher', 'Semiconductor Processor', 'Separating Machine Operators', 'Septic Tank Servicer', 'Service Station Attendant', 'Set and Exhibit Designer', 'Set Designer', 'Sewing Machine Operator', 'Shampooer', 'Shear Machine Set-Up Operator', 'Sheet Metal Worker', 'Sheriff', 'Ship Captain', 'Ship Carpenter and Joiner', 'Ship Engineer', 'Ship Mates', 'Ship Pilot', 'Shipping and Receiving Clerk', 'Shoe and Leather Repairer', 'Shoe Machine Operators', 'Short Order Cook', 'Shuttle Car Operator', 'Signal Repairer OR Track Switch Repairer', 'Silversmith', 'Singer', 'Sketch Artist', 'Skin Care Specialist', 'Slot Key Person', 'Social and Human Service Assistant', 'Social Media Marketing Manager', 'Social Science Research Assistant', 'Social Sciences Teacher', 'Social Scientists', 'Social Service Specialists', 'Social Work Teacher', 'Social Worker', 'Sociologist', 'Sociology Teacher', 'Software Engineer', 'Soil Conservationist', 'Soil Scientist', 'Soil Scientist OR Plant Scientist', 'Solderer', 'Soldering Machine Setter', 'Sound Engineering Technician', 'Space Sciences Teacher', 'Special Education Teacher', 'Special Force', 'Special Forces Officer', 'Speech-Language Pathologist', 'Sports Book Writer', 'Spotters', 'Spraying Machine Operator', 'Staff Psychologist', 'State', 'Statement Clerk', 'Stationary Engineer', 'Stationary Engineer OR Boiler Operator', 'Statistical Assistant', 'Statistician', 'Steel Worker', 'Stevedore', 'Stock Broker', 'Stock Clerk', 'Stone Cutter', 'Stone Sawyer', 'Stonemason', 'Stonemason', 'Storage Manager OR Distribution Manager', 'Streetcar Operator', 'Stringed Instrument Repairer and Tuner', 'Structural Iron and Steel Worker', 'Structural Metal Fabricator', 'Substance Abuse Counselor', 'Substance Abuse Social Worker', 'Substation Maintenance', 'Supervisor Correctional Officer', 'Supervisor Fire Fighting Worker', 'Supervisor of Customer Service', 'Supervisor of Police', 'Surgeon', 'Surgical Technologist', 'Survey Researcher', 'Surveying and Mapping Technician', 'Surveying Technician', 'Surveyor', 'Sys Admin', 'System Administrator',
        'Tailor', 'Talent Acquisition Manager', 'Talent Director', 'Tank Car', 'Taper', 'Tax Examiner', 'Tax Preparer', 'Taxi Drivers and Chauffeur', 'Teacher', 'Teacher Assistant', 'Team Assembler', 'Technical Director', 'Technical Program Manager', 'Technical Specialist', 'Technical Writer', 'Telecommunications Equipment Installer', 'Telecommunications Facility Examiner', 'Telecommunications Line Installer', 'Telemarketer', 'Telephone Operator', 'Telephone Station Installer and Repairer', 'Teller', 'Terrazzo Workes and Finisher', 'Textile Cutting Machine Operator', 'Textile Dyeing Machine Operator', 'Textile Knitting Machine Operator', 'Textile Machine Operator', 'Textile Worker', 'Therapist', 'Ticket Agent', 'Tile Setter OR Marble Setter', 'Timing Device Assemblers', 'Tire Builder', 'Tire Changer', 'Title Abstractor', 'Title Examiner', 'Title Searcher', 'Tool and Die Maker', 'Tool Set-Up Operator', 'Tool Sharpener', 'Tour Guide', 'Tractor Operator', 'Tractor-Trailer Truck Driver', 'Traffic Technician', 'Train Crew', 'Trainer', 'Training Manager OR Development Manager', 'Transformer Repairer', 'Transit Police OR Railroad Police', 'Transportation and Material-Moving', 'Transportation Attendant', 'Transportation Equipment Maintenance', 'Transportation Equipment Painters', 'Transportation Inspector', 'Transportation Manager', 'Transportation Worker', 'Travel Agent', 'Travel Clerk', 'Travel Guide', 'Tree Trimmer', 'Truck Driver', 'TSA', 'Typesetter', 'Typesetting Machine Operator',
        'Umpire and Referee', 'Underground Mining', 'University', 'Upholsterer', 'Urban Planner', 'User Experience Manager', 'User Experience Researcher', 'Usher', 'Utility Meter Reader',
        'Valve Repairer OR Regulator Repairer', 'Vending Machine Servicer', 'Veterinarian', 'Veterinary Assistant OR Laboratory Animal Caretaker', 'Veterinary Technician', 'Vice President Of Human Resources', 'Vice President Of Marketing', 'Video Editor', 'Visual Designer', 'Vocational Education Teacher',
        'Waiter', 'Waitress', 'Warehouse', 'Washing Equipment Operator', 'Waste Treatment Plant Operator', 'Watch Repairer', 'Weapons Specialists', 'Web Developer', 'Webmaster', 'Welder', 'Welder', 'Welder and Cutter', 'Welder-Fitter', 'Welding Machine Tender', 'Welding Machine Operator', 'Welding Machine Setter', 'Welfare Eligibility Clerk', 'Well and Core Drill Operator', 'Wellhead Pumper', 'Wholesale Buyer', 'Wind Instrument Repairer', 'Woodworker', 'Woodworking Machine Operator', 'Woodworking Machine Setter', 'Word Processors and Typist', 'Writer OR Author',
        'Zoologists OR Wildlife Biologist',
    );

    protected static $companySuffix = array('Inc', 'and Sons', 'LLC', 'Group', 'PLC', 'Ltd');

    /**
     * @link https://www.irs.gov/businesses/small-businesses-self-employed/how-eins-are-assigned-and-valid-ein-prefixes
     */
    protected static $einPrefixes = array(
        01, 02, 03, 04, 05, 06, 10, 11, 12, 13, 14, 15, 16, 20, 21, 22, 23, 24, 25, 26, 27, 30, 31, 32, 33, 34, 35, 36,
        37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65,
        66, 67, 68, 71, 72, 73, 74, 75, 76, 77, 80, 81, 82, 83, 84, 85, 86, 87, 88, 90, 91, 92, 93, 94, 95, 98, 99
    );

    /**
     * @example 'Robust full-range hub'
     */
    public function catchPhrase()
    {
        $result = array();
        foreach (static::$catchPhraseWords as &$word) {
            $result[] = static::randomElement($word);
        }

        return join($result, ' ');
    }

    /**
     * @example 'integrate extensible convergence'
     */
    public function bs()
    {
        $result = array();
        foreach (static::$bsWords as &$word) {
            $result[] = static::randomElement($word);
        }

        return join($result, ' ');
    }

    /**
     * Employer Identification Number (EIN)
     *
     * @link https://en.wikipedia.org/wiki/Employer_Identification_Number
     * @example '12-3456789'
     */
    public static function ein()
    {
        $prefix = static::randomElement(static::$einPrefixes);
        $suffix = static::numberBetween(0, 9999999);

        return sprintf("%02d-%07d", $prefix, $suffix);
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         <?php


namespace Faker\Provider\en_US;


class Payment extends \Faker\Provider\Payment
{
    public function bankAccountNumber()
    {
        // Length between 5 and 17, biased towards center
        $length = self::numberBetween(0, 3) + self::numberBetween(0, 3) + self::numberBetween(0, 3) + self::numberBetween(0, 3) + 5;

        return self::numerify(str_repeat('#', $length));
    }

    public function bankRoutingNumber()
    {
        $district = self::numberBetween(1, 12);
        $type = self::randomElement(array(0, 0, 0, 0, 20, 20, 60));
        $clearingCenter = self::randomDigitNotNull();
        $state = self::randomDigit();
        $institution = self::randomNumber(4, true);

        $result = sprintf('%02d%01d%01d%04d', $district + $type, $clearingCenter, $state, $institution);

        return $result . self::calculateRoutingNumberChecksum($result);
    }

    public static function calculateRoutingNumberChecksum($routing)
    {
        return (
            7 * ($routing[0] + $routing[3] + $routing[6]) +
            3 * ($routing[1] + $routing[4] + $routing[7]) +
            9 * ($routing[2] + $routing[5])
        ) % 10;
    }
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     <?php

namespace Faker\Provider\en_US;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}} {{suffix}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}} {{suffix}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}} {{suffix}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}} {{suffix}}