”
女人……吳媽……這小孤孀……”阿Q想。
“我們的少奶奶是八月裏要生孩子了……”
“女人……”阿Q想。
阿Q放下煙管，站了起來。
“我們的少奶奶……”吳媽還嘮叨說。
“我和你困覺，我和你困覺！”阿Q忽然搶上去，對伊跪下了。
一剎時中很寂然。
“阿呀！”吳媽楞了一息，突然發抖，大叫著往外跑，且跑且嚷，似乎後來帶哭了。
阿Q對了牆壁跪著也發楞，於是兩手扶著空板凳，慢慢的站起來，仿佛覺得有些糟。他這時確也有些忐忑了，慌張的將煙管插在褲帶上，就想去舂米。蓬的一聲，頭上著了很粗的一下，他急忙迴轉身去，那秀才便拿了一支大竹杠站在他面前。
“你反了，……你這……”
大竹杠又向他劈下來了。阿Q兩手去抱頭，拍的正打在指節上，這可很有些痛。他衝出廚房門，仿佛背上又著了一下似的。
“忘八蛋！”秀才在後面用了官話這樣罵。
阿Q奔入舂米場，一個人站著，還覺得指頭痛，還記得“忘八蛋”，因為這話是未莊的鄉下人從來不用，專是見過官府的闊人用的，所以格外怕，而印象也格外深。但這時，他那“女……”的思想卻也沒有了。而且打罵之後，似乎一件事也已經收束，倒反覺得一無掛礙似的，便動手去舂米。舂了一會，他熱起來了，又歇了手脫衣服。
脫下衣服的時候，他聽得外面很熱鬧，阿Q生平本來最愛看熱鬧，便即尋聲走出去了。尋聲漸漸的尋到趙太爺的內院裏，雖然在昏黃中，卻辨得出許多人，趙府一家連兩日不吃飯的太太也在內，還有間壁的鄒七嫂，真正本家的趙白眼，趙司晨。
少奶奶正拖著吳媽走出下房來，一面說：
“你到外面來，……不要躲在自己房裏想……”
“誰不知道你正經，……短見是萬萬尋不得的。”鄒七嫂也從旁說。
吳媽只是哭，夾些話，卻不甚聽得分明。
阿Q想：“哼，有趣，這小孤孀不知道鬧著什麼玩意兒了？”他想打聽，走近趙司晨的身邊。這時他猛然間看見趙大爺向他奔來，而且手裏捏著一支大竹杠。他看見這一支大竹杠，便猛然間悟到自己曾經被打，和這一場熱鬧似乎有點相關。他翻身便走，想逃回舂米場，不圖這支竹杠阻了他的去路，於是他又翻身便走，自然而然的走出後門，不多工夫，已在土穀祠內了。
阿Q坐了一會，皮膚有些起粟，他覺得冷了，因為雖在春季，而夜間頗有餘寒，尚不宜於赤膊。他也記得布衫留在趙家，但倘若去取，又深怕秀才的竹杠。然而地保進來了。
“阿Q，你的媽媽的！你連趙家的用人都調戲起來，簡直是造反。害得我晚上沒有覺睡，你的媽媽的！……”
如是云云的教訓了一通，阿Q自然沒有話。臨末，因為在晚上，應該送地保加倍酒錢四百文，阿Q正沒有現錢，便用一頂氈帽做抵押，並且訂定了五條件：
一　明天用紅燭——要一斤重的——一對，香一封，到趙府上去賠罪。
二　趙府上請道士祓除縊鬼，費用由阿Q負擔。
三　阿Q從此不准踏進趙府的門檻。四　吳媽此後倘有不測，惟阿Q是問。
五　阿Q不准再去索取工錢和布衫。
阿Q自然都答應了，可惜沒有錢。幸而已經春天，棉被可以無用，便質了二千大錢，履行條約。赤膊磕頭之後，居然還剩幾文，他也不再贖氈帽，統統喝了酒了。但趙家也並不燒香點燭，因為太太拜佛的時候可以用，留著了。那破布衫是大半做了少奶奶八月間生下來的孩子的襯尿布，那小半破爛的便都做了吳媽的鞋底。
第五章　生計問題[编辑
阿Q禮畢之後，仍舊回到土穀祠，太陽下去了，漸漸覺得世上有些古怪。他仔細一想，終於省悟過來：其原因蓋在自己的赤膊。他記得破夾襖還在，便披在身上，躺倒了，待張開眼睛，原來太陽又已經照在西牆上頭了。他坐起身，一面說道，“媽媽的……”
他起來之後，也仍舊在街上逛，雖然不比赤膊之有切膚之痛，卻又漸漸的覺得世上有些古怪了。仿佛從這一天起，未莊的女人們忽然都怕了羞，伊們一見阿Q走來，便個個躲進門裏去。甚而至於將近五十歲的鄒七嫂，也跟著別人亂鑽，而且將十一歲的女兒都叫進去了。阿Q很以為奇，而且想：“這些東西忽然都學起小姐模樣來了。這娼婦們……”
，卻是許多日以後的事。其一，酒店不肯賒欠了；其二，管土穀祠的老頭子說些廢話，似乎叫他走；其三，他雖然記不清多少日，但確乎有許多日，沒有一個人來叫他做短工。酒店不賒，熬著也罷了；老頭子催他走，嚕囌一通也就算了；只是沒有人來叫他做短工，卻使阿Q肚子餓：這委實是一件非常“媽媽的”的事情。
阿Q忍不下去了，他只好到老主顧的家裏去探問，——但獨不許踏進趙府的門檻，——然而情形也異樣：一定走出一個男人來，現了十分煩厭的相貌，像回覆乞丐一般的搖手道：
“沒有沒有！你出去！”
阿Q愈覺得稀奇了。他想，這些人家向來少不了要幫忙，不至於現在忽然都無事，這總該有些蹊蹺在裏面了。他留心打聽，纔知道他們有事都去叫小Don。這小D，是一個窮小子，又瘦又乏，在阿Q的眼睛裏，位置是在王胡之下的，誰料這小子竟謀了他的飯碗去。所以阿Q這一氣，更與平常不同，當氣憤憤的走著的時候，忽然將手一揚，唱道：
“我手執鋼鞭將你打！……”
幾天之後，他竟在錢府的照壁前遇見了小D。“仇人相見分外眼明”，阿Q便迎上去，小D也站住了。
“畜生！”阿Q怒目而視的說，嘴角上飛出唾沫來。
“我是蟲豸，好麽？……”小D說。
這謙遜反使阿Q更加憤怒起來，但他手裏沒有鋼鞭，於是只得撲上去，伸手去拔小D的辮子。小D一手護住了自己的辮根，一手也來拔阿Q的辮子，阿Q便也將空著的一隻手護住了自己的辮根。從先前的阿Q看來，，小D本來是不足齒數的，但他近來挨了餓，又瘦又乏已經不下於小D，所以便成了勢均力敵的現象，四隻手拔著兩顆頭，都彎了腰，在錢家粉牆上映出一個藍色的虹形，至於半點鐘之久了。
“好了，好了！”看的人們說，大約是解勸的。
“好，好！”看的人們說，不知道是解勸，是頌揚，還是煽動。
然而他們都不聽。阿Q進三步，小D便退三步，都站著；小D進三步，阿Q便退三步，又都站著。大約半點鐘，——未莊少有自鳴鐘，所以很難說，或者二十分，——他們的頭髮裏便都冒煙，額上便都流汗，阿Q的手放鬆了，在同一瞬間，小D的手也正放鬆了，同時直起，同時退開，都擠出人叢去。
“記著罷，媽媽的……”阿Q回過頭去說。
“媽媽的，記著罷……”小D也回過頭來說。
這一場“龍虎鬥”似乎並無勝敗，也不知道看的人可滿足，都沒有發什麼議論，而阿Q卻仍然沒有人來叫他做短工。
有一日很溫和，微風拂拂的頗有些夏意了，阿Q卻覺得寒冷起來，但這還可擔當，第一倒是肚子餓。棉被，氈帽，布衫，早已沒有了，其次就賣了棉襖；現在有褲子，卻萬不可脫的；有破夾襖，又除了送人做鞋底之外，決定賣不出錢。他早想在路上拾得一註錢，但至今還沒有見；他想在自己的破屋裏忽然尋到一註錢，慌張的四顧，但屋內是空虛而且瞭然。於是他決計出門求食去了。
他在路上走著要“求食”，看見熟識的酒店，看見熟識的饅頭，但他都走過了，不但沒有暫停，而且並不想要。他所求的不是這類東西了；他求的是什麼東西，他自己不知道。
未莊本不是大村鎮，不多時便走盡了。村外多是水田，滿眼是新秧的嫩綠，夾著幾個圓形的活動的黑點，便是耕田的農夫。阿Q並不賞鑒這田家樂，卻只是走，因為他直覺的知道這與他的“求食”之道是很遼遠的。但他終於走到靜修庵的牆外了。
庵周圍也是水田，粉牆突出在新綠裏，後面的低土牆裏是菜園。阿Q遲疑了一會，四面一看，並沒有人。他便爬上這矮牆去，扯著何首烏藤，但泥土仍然簌簌的掉，阿Q的腳也索索的抖；終於攀著桑樹枝，跳到裏面了。裏面真是鬱鬱蔥蔥，但似乎並沒有黃酒饅頭，以及此外可吃的之類。靠西牆是竹叢，下麵許多筍，只可惜都是並未煮熟的，還有油菜早經結子，芥菜已將開花，小白菜也很老了。
阿Q仿佛文童落第似的覺得很冤屈，他慢慢走近園門去，忽而非常驚喜了，這分明是一畦老蘿蔔。他於是蹲下便拔，而門口突然伸出一個很圓的頭來，又即縮回去了，這分明是小尼姑。小尼姑之流是阿Q本來視若草芥的，但世事須“退一步想”，所以他便趕緊拔起四個蘿蔔，擰下青葉，兜在大襟裏。然而老尼姑已經出來了。
“阿彌陀佛，阿Q，你怎麼跳進園裏來偷蘿蔔！……阿呀，罪過呵，阿唷，阿彌陀佛！……”
“我什麼時候跳進你的園裏來偷蘿蔔？”阿Q且看且走的說。
